#ifndef HIDL_GENERATED_ANDROID_HARDWARE_CONTEXTHUB_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_CONTEXTHUB_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace contexthub {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class Result : uint32_t;
enum class NanoAppFlags : uint32_t;
struct NanoAppBinary;
enum class SensorType : uint32_t;
struct PhysicalSensor;
struct ContextHub;
enum class HostEndPoint : uint16_t;
struct ContextHubMsg;
enum class HubMemoryType : uint32_t;
enum class HubMemoryFlag : uint32_t;
struct MemRange;
enum class AsyncEventType : uint32_t;
enum class TransactionResult : int32_t;
struct HubAppInfo;

enum class Result : uint32_t {
    OK = 0u,
    UNKNOWN_FAILURE = 1u /* ::android::hardware::contexthub::V1_0::Result.OK implicitly + 1 */,
    BAD_PARAMS = 2u /* ::android::hardware::contexthub::V1_0::Result.UNKNOWN_FAILURE implicitly + 1 */,
    NOT_INIT = 3u /* ::android::hardware::contexthub::V1_0::Result.BAD_PARAMS implicitly + 1 */,
    TRANSACTION_FAILED = 4u /* ::android::hardware::contexthub::V1_0::Result.NOT_INIT implicitly + 1 */,
    TRANSACTION_PENDING = 5u /* ::android::hardware::contexthub::V1_0::Result.TRANSACTION_FAILED implicitly + 1 */,
};

enum class NanoAppFlags : uint32_t {
    SIGNED = 1u /* 1 << 0 */,
    ENCRYPTED = 2u /* 1 << 1 */,
};

struct NanoAppBinary final {
    uint64_t appId __attribute__ ((aligned(8)));
    uint32_t appVersion __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::contexthub::V1_0::NanoAppFlags> flags __attribute__ ((aligned(4)));
    uint8_t targetChreApiMajorVersion __attribute__ ((aligned(1)));
    uint8_t targetChreApiMinorVersion __attribute__ ((aligned(1)));
    ::android::hardware::hidl_vec<uint8_t> customBinary __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::contexthub::V1_0::NanoAppBinary, appId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::NanoAppBinary, appVersion) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::NanoAppBinary, flags) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::NanoAppBinary, targetChreApiMajorVersion) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::NanoAppBinary, targetChreApiMinorVersion) == 17, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::NanoAppBinary, customBinary) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::contexthub::V1_0::NanoAppBinary) == 40, "wrong size");
static_assert(__alignof(::android::hardware::contexthub::V1_0::NanoAppBinary) == 8, "wrong alignment");

enum class SensorType : uint32_t {
    RESERVED = 0u,
    ACCELEROMETER = 1u /* ::android::hardware::contexthub::V1_0::SensorType.RESERVED implicitly + 1 */,
    GYROSCOPE = 2u /* ::android::hardware::contexthub::V1_0::SensorType.ACCELEROMETER implicitly + 1 */,
    MAGNETOMETER = 3u /* ::android::hardware::contexthub::V1_0::SensorType.GYROSCOPE implicitly + 1 */,
    BAROMETER = 4u /* ::android::hardware::contexthub::V1_0::SensorType.MAGNETOMETER implicitly + 1 */,
    PROXIMITY_SENSOR = 5u /* ::android::hardware::contexthub::V1_0::SensorType.BAROMETER implicitly + 1 */,
    AMBIENT_LIGHT_SENSOR = 6u /* ::android::hardware::contexthub::V1_0::SensorType.PROXIMITY_SENSOR implicitly + 1 */,
    STATIONARY_DETECT = 7u /* ::android::hardware::contexthub::V1_0::SensorType.AMBIENT_LIGHT_SENSOR implicitly + 1 */,
    INSTANT_MOTION_DETECT = 8u /* ::android::hardware::contexthub::V1_0::SensorType.STATIONARY_DETECT implicitly + 1 */,
    GPS = 256u /* 0x100 */,
    WIFI = 512u /* 0x200 */,
    AUDIO = 768u /* 0x300 */,
    CAMERA = 1024u /* 0x400 */,
    BLE = 1280u /* 0x500 */,
    WWAN = 1536u /* 0x600 */,
    PRIVATE_SENSOR_BASE = 65536u /* 0x10000 */,
};

struct PhysicalSensor final {
    ::android::hardware::contexthub::V1_0::SensorType sensorType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string type __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string vendor __attribute__ ((aligned(8)));
    uint32_t version __attribute__ ((aligned(4)));
    uint32_t fifoReservedCount __attribute__ ((aligned(4)));
    uint32_t fifoMaxCount __attribute__ ((aligned(4)));
    uint64_t minDelayMs __attribute__ ((aligned(8)));
    uint64_t maxDelayMs __attribute__ ((aligned(8)));
    float peakPowerMw __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::contexthub::V1_0::PhysicalSensor, sensorType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::PhysicalSensor, type) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::PhysicalSensor, name) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::PhysicalSensor, vendor) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::PhysicalSensor, version) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::PhysicalSensor, fifoReservedCount) == 60, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::PhysicalSensor, fifoMaxCount) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::PhysicalSensor, minDelayMs) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::PhysicalSensor, maxDelayMs) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::PhysicalSensor, peakPowerMw) == 88, "wrong offset");
static_assert(sizeof(::android::hardware::contexthub::V1_0::PhysicalSensor) == 96, "wrong size");
static_assert(__alignof(::android::hardware::contexthub::V1_0::PhysicalSensor) == 8, "wrong alignment");

struct ContextHub final {
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string vendor __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string toolchain __attribute__ ((aligned(8)));
    uint32_t platformVersion __attribute__ ((aligned(4)));
    uint32_t toolchainVersion __attribute__ ((aligned(4)));
    uint32_t hubId __attribute__ ((aligned(4)));
    float peakMips __attribute__ ((aligned(4)));
    float stoppedPowerDrawMw __attribute__ ((aligned(4)));
    float sleepPowerDrawMw __attribute__ ((aligned(4)));
    float peakPowerDrawMw __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::contexthub::V1_0::PhysicalSensor> connectedSensors __attribute__ ((aligned(8)));
    uint32_t maxSupportedMsgLen __attribute__ ((aligned(4)));
    uint64_t chrePlatformId __attribute__ ((aligned(8)));
    uint8_t chreApiMajorVersion __attribute__ ((aligned(1)));
    uint8_t chreApiMinorVersion __attribute__ ((aligned(1)));
    uint16_t chrePatchVersion __attribute__ ((aligned(2)));
};

static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, name) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, vendor) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, toolchain) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, platformVersion) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, toolchainVersion) == 52, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, hubId) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, peakMips) == 60, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, stoppedPowerDrawMw) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, sleepPowerDrawMw) == 68, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, peakPowerDrawMw) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, connectedSensors) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, maxSupportedMsgLen) == 96, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, chrePlatformId) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, chreApiMajorVersion) == 112, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, chreApiMinorVersion) == 113, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHub, chrePatchVersion) == 114, "wrong offset");
static_assert(sizeof(::android::hardware::contexthub::V1_0::ContextHub) == 120, "wrong size");
static_assert(__alignof(::android::hardware::contexthub::V1_0::ContextHub) == 8, "wrong alignment");

enum class HostEndPoint : uint16_t {
    BROADCAST = 65535 /* 0xFFFF */,
    UNSPECIFIED = 65534 /* 0xFFFE */,
};

struct ContextHubMsg final {
    uint64_t appName __attribute__ ((aligned(8)));
    uint16_t hostEndPoint __attribute__ ((aligned(2)));
    uint32_t msgType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> msg __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHubMsg, appName) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHubMsg, hostEndPoint) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHubMsg, msgType) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::ContextHubMsg, msg) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::contexthub::V1_0::ContextHubMsg) == 32, "wrong size");
static_assert(__alignof(::android::hardware::contexthub::V1_0::ContextHubMsg) == 8, "wrong alignment");

enum class HubMemoryType : uint32_t {
    MAIN = 0u,
    SECONDARY = 1u,
    TCM = 2u,
};

enum class HubMemoryFlag : uint32_t {
    READ = 1u /* 1 << 0 */,
    WRITE = 2u /* 1 << 1 */,
    EXEC = 4u /* 1 << 2 */,
};

struct MemRange final {
    uint32_t totalBytes __attribute__ ((aligned(4)));
    uint32_t freeBytes __attribute__ ((aligned(4)));
    ::android::hardware::contexthub::V1_0::HubMemoryType type __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::contexthub::V1_0::HubMemoryFlag> flags __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::contexthub::V1_0::MemRange, totalBytes) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::MemRange, freeBytes) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::MemRange, type) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::MemRange, flags) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::contexthub::V1_0::MemRange) == 16, "wrong size");
static_assert(__alignof(::android::hardware::contexthub::V1_0::MemRange) == 4, "wrong alignment");

enum class AsyncEventType : uint32_t {
    RESTARTED = 1u,
};

enum class TransactionResult : int32_t {
    SUCCESS = 0,
    FAILURE = 1 /* ::android::hardware::contexthub::V1_0::TransactionResult.SUCCESS implicitly + 1 */,
};

struct HubAppInfo final {
    uint64_t appId __attribute__ ((aligned(8)));
    uint32_t version __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::contexthub::V1_0::MemRange> memUsage __attribute__ ((aligned(8)));
    bool enabled __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::contexthub::V1_0::HubAppInfo, appId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::HubAppInfo, version) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::HubAppInfo, memUsage) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::contexthub::V1_0::HubAppInfo, enabled) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::contexthub::V1_0::HubAppInfo) == 40, "wrong size");
static_assert(__alignof(::android::hardware::contexthub::V1_0::HubAppInfo) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint32_t o);
static inline std::string toString(::android::hardware::contexthub::V1_0::Result o);
static inline void PrintTo(::android::hardware::contexthub::V1_0::Result o, ::std::ostream* os);
constexpr uint32_t operator|(const ::android::hardware::contexthub::V1_0::Result lhs, const ::android::hardware::contexthub::V1_0::Result rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const uint32_t lhs, const ::android::hardware::contexthub::V1_0::Result rhs) {
    return static_cast<uint32_t>(lhs | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const ::android::hardware::contexthub::V1_0::Result lhs, const uint32_t rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | rhs);
}
