#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_V4_0_ISTREAMOUT_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_V4_0_ISTREAMOUT_H

#include <android/hardware/audio/common/4.0/types.h>
#include <android/hardware/audio/4.0/IStream.h>
#include <android/hardware/audio/4.0/IStreamOutCallback.h>
#include <android/hardware/audio/4.0/types.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace audio {
namespace V4_0 {

struct IStreamOut : public ::android::hardware::audio::V4_0::IStream {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.audio@4.0::IStreamOut"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class WriteCommand : int32_t;
    struct WriteStatus;

    /**
     * Commands that can be executed on the driver writer thread.
     */
    enum class WriteCommand : int32_t {
        WRITE = 0,
        GET_PRESENTATION_POSITION = 1 /* ::android::hardware::audio::V4_0::IStreamOut::WriteCommand.WRITE implicitly + 1 */,
        GET_LATENCY = 2 /* ::android::hardware::audio::V4_0::IStreamOut::WriteCommand.GET_PRESENTATION_POSITION implicitly + 1 */,
    };

    /**
     * Data structure passed back to the client via status message queue
     * of 'write' operation.
     *
     * Possible values of 'retval' field:
     *  - OK, write operation was successful;
     *  - INVALID_ARGUMENTS, stream was not configured properly;
     *  - INVALID_STATE, stream is in a state that doesn't allow writes;
     *  - INVALID_OPERATION, retrieving presentation position isn't supported.
     */
    struct WriteStatus final {
        // Forward declaration for forward reference support:
        union Reply;

        union Reply final {
            // Forward declaration for forward reference support:
            struct PresentationPosition;

            struct PresentationPosition final {
                uint64_t frames __attribute__ ((aligned(8)));
                ::android::hardware::audio::V4_0::TimeSpec timeStamp __attribute__ ((aligned(8)));
            };

            static_assert(offsetof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus::Reply::PresentationPosition, frames) == 0, "wrong offset");
            static_assert(offsetof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus::Reply::PresentationPosition, timeStamp) == 8, "wrong offset");
            static_assert(sizeof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus::Reply::PresentationPosition) == 24, "wrong size");
            static_assert(__alignof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus::Reply::PresentationPosition) == 8, "wrong alignment");

            uint64_t written __attribute__ ((aligned(8)));
            ::android::hardware::audio::V4_0::IStreamOut::WriteStatus::Reply::PresentationPosition presentationPosition __attribute__ ((aligned(8)));
            uint32_t latencyMs __attribute__ ((aligned(4)));
        };

        static_assert(offsetof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus::Reply, written) == 0, "wrong offset");
        static_assert(offsetof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus::Reply, presentationPosition) == 0, "wrong offset");
        static_assert(offsetof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus::Reply, latencyMs) == 0, "wrong offset");
        static_assert(sizeof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus::Reply) == 24, "wrong size");
        static_assert(__alignof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus::Reply) == 8, "wrong alignment");

        ::android::hardware::audio::V4_0::Result retval __attribute__ ((aligned(4)));
        ::android::hardware::audio::V4_0::IStreamOut::WriteCommand replyTo __attribute__ ((aligned(4)));
        ::android::hardware::audio::V4_0::IStreamOut::WriteStatus::Reply reply __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus, retval) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus, replyTo) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus, reply) == 8, "wrong offset");
    static_assert(sizeof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus) == 32, "wrong size");
    static_assert(__alignof(::android::hardware::audio::V4_0::IStreamOut::WriteStatus) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Return the frame size (number of bytes per sample).
     *
     * @return frameSize frame size in bytes.
     */
    virtual ::android::hardware::Return<uint64_t> getFrameSize() = 0;

    /**
     * Return the frame count of the buffer. Calling this method is equivalent
     * to getting AUDIO_PARAMETER_STREAM_FRAME_COUNT on the legacy HAL.
     *
     * @return count frame count.
     */
    virtual ::android::hardware::Return<uint64_t> getFrameCount() = 0;

    /**
     * Return the size of input/output buffer in bytes for this stream.
     * It must be a multiple of the frame size.
     *
     * @return buffer buffer size in bytes.
     */
