#ifndef HIDL_GENERATED_ANDROID_HARDWARE_BLUETOOTH_AUDIO_V2_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_BLUETOOTH_AUDIO_V2_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace bluetooth {
namespace audio {
namespace V2_0 {

// Forward declaration for forward reference support:
struct TimeSpec;
enum class Status : uint8_t;
enum class SessionType : uint8_t;
enum class CodecType : uint32_t;
enum class SampleRate : uint32_t;
enum class BitsPerSample : uint8_t;
enum class ChannelMode : uint8_t;
enum class SbcChannelMode : uint8_t;
enum class SbcBlockLength : uint8_t;
enum class SbcNumSubbands : uint8_t;
enum class SbcAllocMethod : uint8_t;
enum class AacObjectType : uint8_t;
enum class AacVariableBitRate : uint8_t;
enum class LdacChannelMode : uint8_t;
enum class LdacQualityIndex : uint8_t;
struct PcmParameters;
struct SbcParameters;
struct AacParameters;
struct LdacParameters;
struct AptxParameters;
struct CodecCapabilities;
struct AudioCapabilities;
struct CodecConfiguration;
struct AudioConfiguration;

/**
 * The different audio parameter structs are used to provide a method to list
 * all the Capabilities of a codec as well as to configure the codecs. All
 * fields are bitfields unless specified. If used as a configuration, only one
 * bit may be enabled. If used for Capabilities, enable all bits corresponding to
 * supported features.
 *
 *
 * POSIX timespec.
 */
struct TimeSpec final {
    uint64_t tvSec __attribute__ ((aligned(8)));
    uint64_t tvNSec __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::TimeSpec, tvSec) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::TimeSpec, tvNSec) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::TimeSpec) == 16, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::TimeSpec) == 8, "wrong alignment");

enum class Status : uint8_t {
    SUCCESS = 0 /* 0x00 */,
    /**
     * Codec configuration not supported by the audio platform
     */
    UNSUPPORTED_CODEC_CONFIGURATION = 1 /* ::android::hardware::bluetooth::audio::V2_0::Status.SUCCESS implicitly + 1 */,
    /**
     * Any other failure
     */
    FAILURE = 2 /* ::android::hardware::bluetooth::audio::V2_0::Status.UNSUPPORTED_CODEC_CONFIGURATION implicitly + 1 */,
};

enum class SessionType : uint8_t {
    UNKNOWN = 0,
    /**
     * A2DP legacy that AVDTP media is encoded by Bluetooth Stack
     */
    A2DP_SOFTWARE_ENCODING_DATAPATH = 1 /* ::android::hardware::bluetooth::audio::V2_0::SessionType.UNKNOWN implicitly + 1 */,
    /**
     * The encoding of AVDTP media is done by HW and there is control only
     */
    A2DP_HARDWARE_OFFLOAD_DATAPATH = 2 /* ::android::hardware::bluetooth::audio::V2_0::SessionType.A2DP_SOFTWARE_ENCODING_DATAPATH implicitly + 1 */,
    /**
     * Used when encoded by Bluetooth Stack and streaming to Hearing Aid
     */
    HEARING_AID_SOFTWARE_ENCODING_DATAPATH = 3 /* ::android::hardware::bluetooth::audio::V2_0::SessionType.A2DP_HARDWARE_OFFLOAD_DATAPATH implicitly + 1 */,
};

enum class CodecType : uint32_t {
    UNKNOWN = 0u /* 0x00 */,
    SBC = 1u /* 0x01 */,
    AAC = 2u /* 0x02 */,
    APTX = 4u /* 0x04 */,
    APTX_HD = 8u /* 0x08 */,
    LDAC = 16u /* 0x10 */,
};

enum class SampleRate : uint32_t {
    RATE_UNKNOWN = 0u /* 0x00 */,
    RATE_44100 = 1u /* 0x01 */,
    RATE_48000 = 2u /* 0x02 */,
    RATE_88200 = 4u /* 0x04 */,
    RATE_96000 = 8u /* 0x08 */,
    RATE_176400 = 16u /* 0x10 */,
    RATE_192000 = 32u /* 0x20 */,
    RATE_16000 = 64u /* 0x40 */,
    RATE_24000 = 128u /* 0x80 */,
};

enum class BitsPerSample : uint8_t {
    BITS_UNKNOWN = 0 /* 0x00 */,
    BITS_16 = 1 /* 0x01 */,
    BITS_24 = 2 /* 0x02 */,
    BITS_32 = 4 /* 0x04 */,
};

enum class ChannelMode : uint8_t {
    UNKNOWN = 0 /* 0x00 */,
    MONO = 1 /* 0x01 */,
    STEREO = 2 /* 0x02 */,
};

enum class SbcChannelMode : uint8_t {
    /**
     * Channel Mode: 4 bits
     */
    UNKNOWN = 0 /* 0x00 */,
    JOINT_STEREO = 1 /* 0x01 */,
    STEREO = 2 /* 0x02 */,
    DUAL = 4 /* 0x04 */,
    MONO = 8 /* 0x08 */,
};

enum class SbcBlockLength : uint8_t {
    BLOCKS_4 = 128 /* 0x80 */,
    BLOCKS_8 = 64 /* 0x40 */,
    BLOCKS_12 = 32 /* 0x20 */,
    BLOCKS_16 = 16 /* 0x10 */,
};

enum class SbcNumSubbands : uint8_t {
    SUBBAND_4 = 8 /* 0x08 */,
    SUBBAND_8 = 4 /* 0x04 */,
};

enum class SbcAllocMethod : uint8_t {
    /**
     * SNR
     */
    ALLOC_MD_S = 2 /* 0x02 */,
    /**
     * Loudness
     */
    ALLOC_MD_L = 1 /* 0x01 */,
};

enum class AacObjectType : uint8_t {
    /**
     * MPEG-2 Low Complexity. Support is Mandatory.
     */
    MPEG2_LC = 128 /* 0x80 */,
    /**
     * MPEG-4 Low Complexity. Support is Optional.
     */
    MPEG4_LC = 64 /* 0x40 */,
    /**
     * MPEG-4 Long Term Prediction. Support is Optional.
     */
    MPEG4_LTP = 32 /* 0x20 */,
    /**
     * MPEG-4 Scalable. Support is Optional.
     */
    MPEG4_SCALABLE = 16 /* 0x10 */,
};

enum class AacVariableBitRate : uint8_t {
    ENABLED = 128 /* 0x80 */,
    DISABLED = 0 /* 0x00 */,
};

enum class LdacChannelMode : uint8_t {
    /**
     * Channel Mode: 3 bits
     */
    UNKNOWN = 0 /* 0x00 */,
    STEREO = 1 /* 0x01 */,
    DUAL = 2 /* 0x02 */,
    MONO = 4 /* 0x04 */,
};

enum class LdacQualityIndex : uint8_t {
    QUALITY_HIGH = 0 /* 0x00 */,
    QUALITY_MID = 1 /* 0x01 */,
    QUALITY_LOW = 2 /* 0x02 */,
    QUALITY_ABR = 127 /* 0x7F */,
};

/**
 * Used for Software Encoding audio feed parameters
 */
struct PcmParameters final {
    ::android::hardware::bluetooth::audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::android::hardware::bluetooth::audio::V2_0::ChannelMode channelMode __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::PcmParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::PcmParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::PcmParameters, bitsPerSample) == 5, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::PcmParameters) == 8, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::PcmParameters) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding SBC codec parameters.
 * minBitpool and maxBitpool are not bitfields.
 */
struct SbcParameters final {
    ::android::hardware::bluetooth::audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::android::hardware::bluetooth::audio::V2_0::SbcChannelMode channelMode __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::SbcBlockLength blockLength __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::SbcNumSubbands numSubbands __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::SbcAllocMethod allocMethod __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
    uint8_t minBitpool __attribute__ ((aligned(1)));
    uint8_t maxBitpool __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::SbcParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::SbcParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::SbcParameters, blockLength) == 5, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::SbcParameters, numSubbands) == 6, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::SbcParameters, allocMethod) == 7, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::SbcParameters, bitsPerSample) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::SbcParameters, minBitpool) == 9, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::SbcParameters, maxBitpool) == 10, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::SbcParameters) == 12, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::SbcParameters) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding AAC codec parameters
 */
struct AacParameters final {
    ::android::hardware::bluetooth::audio::V2_0::AacObjectType objectType __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::android::hardware::bluetooth::audio::V2_0::ChannelMode channelMode __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::AacVariableBitRate variableBitRateEnabled __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::AacParameters, objectType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::AacParameters, sampleRate) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::AacParameters, channelMode) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::AacParameters, variableBitRateEnabled) == 9, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::AacParameters, bitsPerSample) == 10, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::AacParameters) == 12, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::AacParameters) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding LDAC codec parameters
 * Only used when configuring the codec. When Capabilities are requested, this
 * field is left empty since all qualities must be supported. Not a bitfield.
 */
struct LdacParameters final {
    ::android::hardware::bluetooth::audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::android::hardware::bluetooth::audio::V2_0::LdacChannelMode channelMode __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::LdacQualityIndex qualityIndex __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::LdacParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::LdacParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::LdacParameters, qualityIndex) == 5, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::LdacParameters, bitsPerSample) == 6, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::LdacParameters) == 8, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::LdacParameters) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding AptX and AptX-HD codec parameters
 */
struct AptxParameters final {
    ::android::hardware::bluetooth::audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::android::hardware::bluetooth::audio::V2_0::ChannelMode channelMode __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::AptxParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::AptxParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::AptxParameters, bitsPerSample) == 5, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::AptxParameters) == 8, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::AptxParameters) == 4, "wrong alignment");

/**
 * Used to specify the capabilities of the codecs supported by Hardware Encoding.
 * AptX and AptX-HD both use the AptxParameters field.
 */
struct CodecCapabilities final {
    // Forward declaration for forward reference support:
    struct Capabilities;

    struct Capabilities final {
        enum class hidl_discriminator : uint8_t {
            sbcCapabilities = 0,  // ::android::hardware::bluetooth::audio::V2_0::SbcParameters
            aacCapabilities = 1,  // ::android::hardware::bluetooth::audio::V2_0::AacParameters
            ldacCapabilities = 2,  // ::android::hardware::bluetooth::audio::V2_0::LdacParameters
            aptxCapabilities = 3,  // ::android::hardware::bluetooth::audio::V2_0::AptxParameters
        };

        Capabilities();
        ~Capabilities();
        Capabilities(Capabilities&&);
        Capabilities(const Capabilities&);
        Capabilities& operator=(Capabilities&&);
        Capabilities& operator=(const Capabilities&);

        void sbcCapabilities(const ::android::hardware::bluetooth::audio::V2_0::SbcParameters&);
        void sbcCapabilities(::android::hardware::bluetooth::audio::V2_0::SbcParameters&&);
        ::android::hardware::bluetooth::audio::V2_0::SbcParameters& sbcCapabilities();
        const ::android::hardware::bluetooth::audio::V2_0::SbcParameters& sbcCapabilities() const;

        void aacCapabilities(const ::android::hardware::bluetooth::audio::V2_0::AacParameters&);
        void aacCapabilities(::android::hardware::bluetooth::audio::V2_0::AacParameters&&);
        ::android::hardware::bluetooth::audio::V2_0::AacParameters& aacCapabilities();
        const ::android::hardware::bluetooth::audio::V2_0::AacParameters& aacCapabilities() const;

        void ldacCapabilities(const ::android::hardware::bluetooth::audio::V2_0::LdacParameters&);
        void ldacCapabilities(::android::hardware::bluetooth::audio::V2_0::LdacParameters&&);
        ::android::hardware::bluetooth::audio::V2_0::LdacParameters& ldacCapabilities();
        const ::android::hardware::bluetooth::audio::V2_0::LdacParameters& ldacCapabilities() const;

        void aptxCapabilities(const ::android::hardware::bluetooth::audio::V2_0::AptxParameters&);
        void aptxCapabilities(::android::hardware::bluetooth::audio::V2_0::AptxParameters&&);
        ::android::hardware::bluetooth::audio::V2_0::AptxParameters& aptxCapabilities();
        const ::android::hardware::bluetooth::audio::V2_0::AptxParameters& aptxCapabilities() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities::Capabilities, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::bluetooth::audio::V2_0::SbcParameters sbcCapabilities __attribute__ ((aligned(4)));
            ::android::hardware::bluetooth::audio::V2_0::AacParameters aacCapabilities __attribute__ ((aligned(4)));
            ::android::hardware::bluetooth::audio::V2_0::LdacParameters ldacCapabilities __attribute__ ((aligned(4)));
            ::android::hardware::bluetooth::audio::V2_0::AptxParameters aptxCapabilities __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities::Capabilities::hidl_union) == 12, "wrong size");
        static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities::Capabilities::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities::Capabilities::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities::Capabilities::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities::Capabilities) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities::Capabilities) == 4, "wrong alignment");

    ::android::hardware::bluetooth::audio::V2_0::CodecType codecType __attribute__ ((aligned(4)));
    ::android::hardware::bluetooth::audio::V2_0::CodecCapabilities::Capabilities capabilities __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities, codecType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities, capabilities) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities) == 20, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities) == 4, "wrong alignment");

/**
 * Used to specify the capabilities of the different session types.
 */
struct AudioCapabilities final {
    enum class hidl_discriminator : uint8_t {
        pcmCapabilities = 0,  // ::android::hardware::bluetooth::audio::V2_0::PcmParameters
        codecCapabilities = 1,  // ::android::hardware::bluetooth::audio::V2_0::CodecCapabilities
    };

    AudioCapabilities();
    ~AudioCapabilities();
    AudioCapabilities(AudioCapabilities&&);
    AudioCapabilities(const AudioCapabilities&);
    AudioCapabilities& operator=(AudioCapabilities&&);
    AudioCapabilities& operator=(const AudioCapabilities&);

    void pcmCapabilities(const ::android::hardware::bluetooth::audio::V2_0::PcmParameters&);
    void pcmCapabilities(::android::hardware::bluetooth::audio::V2_0::PcmParameters&&);
    ::android::hardware::bluetooth::audio::V2_0::PcmParameters& pcmCapabilities();
    const ::android::hardware::bluetooth::audio::V2_0::PcmParameters& pcmCapabilities() const;

    void codecCapabilities(const ::android::hardware::bluetooth::audio::V2_0::CodecCapabilities&);
    void codecCapabilities(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities&&);
    ::android::hardware::bluetooth::audio::V2_0::CodecCapabilities& codecCapabilities();
    const ::android::hardware::bluetooth::audio::V2_0::CodecCapabilities& codecCapabilities() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::bluetooth::audio::V2_0::AudioCapabilities, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hardware::bluetooth::audio::V2_0::PcmParameters pcmCapabilities __attribute__ ((aligned(4)));
        ::android::hardware::bluetooth::audio::V2_0::CodecCapabilities codecCapabilities __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::AudioCapabilities::hidl_union) == 20, "wrong size");
    static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::AudioCapabilities::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::AudioCapabilities::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::AudioCapabilities::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::AudioCapabilities) == 24, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::AudioCapabilities) == 4, "wrong alignment");

/**
 * Used to configure a Hardware Encoding session.
 * AptX and AptX-HD both use the AptxParameters field.
 */
struct CodecConfiguration final {
    // Forward declaration for forward reference support:
    struct CodecSpecific;

    struct CodecSpecific final {
        enum class hidl_discriminator : uint8_t {
            sbcConfig = 0,  // ::android::hardware::bluetooth::audio::V2_0::SbcParameters
            aacConfig = 1,  // ::android::hardware::bluetooth::audio::V2_0::AacParameters
            ldacConfig = 2,  // ::android::hardware::bluetooth::audio::V2_0::LdacParameters
            aptxConfig = 3,  // ::android::hardware::bluetooth::audio::V2_0::AptxParameters
        };

        CodecSpecific();
        ~CodecSpecific();
        CodecSpecific(CodecSpecific&&);
        CodecSpecific(const CodecSpecific&);
        CodecSpecific& operator=(CodecSpecific&&);
        CodecSpecific& operator=(const CodecSpecific&);

        void sbcConfig(const ::android::hardware::bluetooth::audio::V2_0::SbcParameters&);
        void sbcConfig(::android::hardware::bluetooth::audio::V2_0::SbcParameters&&);
        ::android::hardware::bluetooth::audio::V2_0::SbcParameters& sbcConfig();
        const ::android::hardware::bluetooth::audio::V2_0::SbcParameters& sbcConfig() const;

        void aacConfig(const ::android::hardware::bluetooth::audio::V2_0::AacParameters&);
        void aacConfig(::android::hardware::bluetooth::audio::V2_0::AacParameters&&);
        ::android::hardware::bluetooth::audio::V2_0::AacParameters& aacConfig();
        const ::android::hardware::bluetooth::audio::V2_0::AacParameters& aacConfig() const;

        void ldacConfig(const ::android::hardware::bluetooth::audio::V2_0::LdacParameters&);
        void ldacConfig(::android::hardware::bluetooth::audio::V2_0::LdacParameters&&);
        ::android::hardware::bluetooth::audio::V2_0::LdacParameters& ldacConfig();
        const ::android::hardware::bluetooth::audio::V2_0::LdacParameters& ldacConfig() const;

        void aptxConfig(const ::android::hardware::bluetooth::audio::V2_0::AptxParameters&);
        void aptxConfig(::android::hardware::bluetooth::audio::V2_0::AptxParameters&&);
        ::android::hardware::bluetooth::audio::V2_0::AptxParameters& aptxConfig();
        const ::android::hardware::bluetooth::audio::V2_0::AptxParameters& aptxConfig() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration::CodecSpecific, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::bluetooth::audio::V2_0::SbcParameters sbcConfig __attribute__ ((aligned(4)));
            ::android::hardware::bluetooth::audio::V2_0::AacParameters aacConfig __attribute__ ((aligned(4)));
            ::android::hardware::bluetooth::audio::V2_0::LdacParameters ldacConfig __attribute__ ((aligned(4)));
            ::android::hardware::bluetooth::audio::V2_0::AptxParameters aptxConfig __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration::CodecSpecific::hidl_union) == 12, "wrong size");
        static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration::CodecSpecific::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration::CodecSpecific::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration::CodecSpecific::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration::CodecSpecific) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration::CodecSpecific) == 4, "wrong alignment");

    ::android::hardware::bluetooth::audio::V2_0::CodecType codecType __attribute__ ((aligned(4)));
    /**
     * The encoded audio bitrate in bits / second.
     * 0x00000000 - The audio bitrate is not specified / unused
     * 0x00000001 - 0x00FFFFFF - Encoded audio bitrate in bits/second
     * 0x01000000 - 0xFFFFFFFF - Reserved
     *
     * The HAL needs to support all legal bitrates for the selected codec.
     */
    uint32_t encodedAudioBitrate __attribute__ ((aligned(4)));
    /**
     * Peer MTU (in octets)
     */
    uint16_t peerMtu __attribute__ ((aligned(2)));
    /**
     * Content protection by SCMS-T
     */
    bool isScmstEnabled __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::CodecConfiguration::CodecSpecific config __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration, codecType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration, encodedAudioBitrate) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration, peerMtu) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration, isScmstEnabled) == 10, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration, config) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration) == 28, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration) == 4, "wrong alignment");

/**
 * Used to configure either a Hardware or Software Encoding session based on session type
 */
struct AudioConfiguration final {
    enum class hidl_discriminator : uint8_t {
        pcmConfig = 0,  // ::android::hardware::bluetooth::audio::V2_0::PcmParameters
        codecConfig = 1,  // ::android::hardware::bluetooth::audio::V2_0::CodecConfiguration
    };

    AudioConfiguration();
    ~AudioConfiguration();
    AudioConfiguration(AudioConfiguration&&);
    AudioConfiguration(const AudioConfiguration&);
    AudioConfiguration& operator=(AudioConfiguration&&);
    AudioConfiguration& operator=(const AudioConfiguration&);

    void pcmConfig(const ::android::hardware::bluetooth::audio::V2_0::PcmParameters&);
    void pcmConfig(::android::hardware::bluetooth::audio::V2_0::PcmParameters&&);
    ::android::hardware::bluetooth::audio::V2_0::PcmParameters& pcmConfig();
    const ::android::hardware::bluetooth::audio::V2_0::PcmParameters& pcmConfig() const;

    void codecConfig(const ::android::hardware::bluetooth::audio::V2_0::CodecConfiguration&);
    void codecConfig(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration&&);
    ::android::hardware::bluetooth::audio::V2_0::CodecConfiguration& codecConfig();
    const ::android::hardware::bluetooth::audio::V2_0::CodecConfiguration& codecConfig() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::bluetooth::audio::V2_0::AudioConfiguration, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hardware::bluetooth::audio::V2_0::PcmParameters pcmConfig __attribute__ ((aligned(4)));
        ::android::hardware::bluetooth::audio::V2_0::CodecConfiguration codecConfig __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::AudioConfiguration::hidl_union) == 28, "wrong size");
    static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::AudioConfiguration::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::AudioConfiguration::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::AudioConfiguration::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::bluetooth::audio::V2_0::AudioConfiguration) == 32, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_0::AudioConfiguration) == 4, "wrong alignment");

//
// type declarations for package
//

static inline std::string toString(const ::android::hardware::bluetooth::audio::V2_0::TimeSpec& o);
static inline void PrintTo(const ::android::hardware::bluetooth::audio::V2_0::TimeSpec& o, ::std::ostream*);
static inline bool operator==(const ::android::hardware::bluetooth::audio::V2_0::TimeSpec& lhs, const ::android::hardware::bluetooth::audio::V2_0::TimeSpec& rhs);
static inline bool operator!=(const ::android::hardware::bluetooth::audio::V2_0::TimeSpec& lhs, const ::android::hardware::bluetooth::audio::V2_0::TimeSpec& rhs);

template<typename>
static inline std::string toString(uint8_t o);
static inline std::string toString(::android::hardware::bluetooth::audio::V2_0::Status o);
static inline void PrintTo(::android::hardware::bluetooth::audio::V2_0::Status o, ::std::ostream* os);
