{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA56_h",
   "name" : "unsigned char [56]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA56_h",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" :
 [
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 1,
     "name" : "ERR_LIB_NONE"
    },
    {
     "enum_field_value" : 2,
     "name" : "ERR_LIB_SYS"
    },
    {
     "enum_field_value" : 3,
     "name" : "ERR_LIB_BN"
    },
    {
     "enum_field_value" : 4,
     "name" : "ERR_LIB_RSA"
    },
    {
     "enum_field_value" : 5,
     "name" : "ERR_LIB_DH"
    },
    {
     "enum_field_value" : 6,
     "name" : "ERR_LIB_EVP"
    },
    {
     "enum_field_value" : 7,
     "name" : "ERR_LIB_BUF"
    },
    {
     "enum_field_value" : 8,
     "name" : "ERR_LIB_OBJ"
    },
    {
     "enum_field_value" : 9,
     "name" : "ERR_LIB_PEM"
    },
    {
     "enum_field_value" : 10,
     "name" : "ERR_LIB_DSA"
    },
    {
     "enum_field_value" : 11,
     "name" : "ERR_LIB_X509"
    },
    {
     "enum_field_value" : 12,
     "name" : "ERR_LIB_ASN1"
    },
    {
     "enum_field_value" : 13,
     "name" : "ERR_LIB_CONF"
    },
    {
     "enum_field_value" : 14,
     "name" : "ERR_LIB_CRYPTO"
    },
    {
     "enum_field_value" : 15,
     "name" : "ERR_LIB_EC"
    },
    {
     "enum_field_value" : 16,
     "name" : "ERR_LIB_SSL"
    },
    {
     "enum_field_value" : 17,
     "name" : "ERR_LIB_BIO"
    },
    {
     "enum_field_value" : 18,
     "name" : "ERR_LIB_PKCS7"
    },
    {
     "enum_field_value" : 19,
     "name" : "ERR_LIB_PKCS8"
    },
    {
     "enum_field_value" : 20,
     "name" : "ERR_LIB_X509V3"
    },
    {
     "enum_field_value" : 21,
     "name" : "ERR_LIB_RAND"
    },
    {
     "enum_field_value" : 22,
     "name" : "ERR_LIB_ENGINE"
    },
    {
     "enum_field_value" : 23,
     "name" : "ERR_LIB_OCSP"
    },
    {
     "enum_field_value" : 24,
     "name" : "ERR_LIB_UI"
    },
    {
     "enum_field_value" : 25,
     "name" : "ERR_LIB_COMP"
    },
    {
     "enum_field_value" : 26,
     "name" : "ERR_LIB_ECDSA"
    },
    {
     "enum_field_value" : 27,
     "name" : "ERR_LIB_ECDH"
    },
    {
     "enum_field_value" : 28,
     "name" : "ERR_LIB_HMAC"
    },
    {
     "enum_field_value" : 29,
     "name" : "ERR_LIB_DIGEST"
    },
    {
     "enum_field_value" : 30,
     "name" : "ERR_LIB_CIPHER"
    },
    {
     "enum_field_value" : 31,
     "name" : "ERR_LIB_HKDF"
    },
    {
     "enum_field_value" : 32,
     "name" : "ERR_LIB_TRUST_TOKEN"
    },
    {
     "enum_field_value" : 33,
     "name" : "ERR_LIB_USER"
    },
    {
     "enum_field_value" : 34,
     "name" : "ERR_NUM_LIBS"
    }
   ],
   "linker_set_key" : "_ZTI13$ERR_LIB_ASN1",
   "name" : "(anonymous enum at external/boringssl/src/include/openssl/err.h:290:1)",
   "referenced_type" : "_ZTI13$ERR_LIB_ASN1",
   "self_type" : "_ZTI13$ERR_LIB_ASN1",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/err.h",
   "underlying_type" : "_ZTIj"
  }
 ],
 "function_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiP6bio_stE",
   "name" : "int (bio_st *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6bio_st"
    }
   ],
   "referenced_type" : "_ZTIFiP6bio_stE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiP6bio_stE",
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiP6bio_stPKcE",
   "name" : "int (bio_st *, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6bio_st"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIFiP6bio_stPKcE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiP6bio_stPKcE",
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiP6bio_stPKciE",
   "name" : "int (bio_st *, const char *, int)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6bio_st"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIi"
    }
   ],
   "referenced_type" : "_ZTIFiP6bio_stPKciE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiP6bio_stPKciE",
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiP6bio_stPciE",
   "name" : "int (bio_st *, char *, int)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6bio_st"
    },
    {
     "referenced_type" : "_ZTIPc"
    },
    {
     "referenced_type" : "_ZTIi"
    }
   ],
   "referenced_type" : "_ZTIFiP6bio_stPciE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiP6bio_stPciE",
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPPKvS1_E",
   "name" : "int (const void **, const void **)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPPKv"
    },
    {
     "referenced_type" : "_ZTIPPKv"
    }
   ],
   "referenced_type" : "_ZTIFiPPKvS1_E",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPPKvS1_E",
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFlP6bio_stiPFlS0_iPKcillEE",
   "name" : "long (bio_st *, int, long (*)(bio_st *, int, const char *, int, long, long))",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6bio_st"
    },
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTIPFlP6bio_stiPKcillE"
    }
   ],
   "referenced_type" : "_ZTIFlP6bio_stiPFlS0_iPKcillEE",
   "return_type" : "_ZTIl",
   "self_type" : "_ZTIFlP6bio_stiPFlS0_iPKcillEE",
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFlP6bio_stiPKcillE",
   "name" : "long (bio_st *, int, const char *, int, long, long)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6bio_st"
    },
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTIl"
    },
    {
     "referenced_type" : "_ZTIl"
    }
   ],
   "referenced_type" : "_ZTIFlP6bio_stiPKcillE",
   "return_type" : "_ZTIl",
   "self_type" : "_ZTIFlP6bio_stiPKcillE",
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFlP6bio_stilPvE",
   "name" : "long (bio_st *, int, long, void *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6bio_st"
    },
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTIl"
    },
    {
     "referenced_type" : "_ZTIPv"
    }
   ],
   "referenced_type" : "_ZTIFlP6bio_stilPvE",
   "return_type" : "_ZTIl",
   "self_type" : "_ZTIFlP6bio_stilPvE",
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  }
 ],
 "functions" :
 [
  {
   "function_name" : "BIO_printf",
   "linker_set_key" : "BIO_printf",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6bio_st"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  }
 ],
 "global_vars" : [],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP13stack_st_void",
   "name" : "stack_st_void *",
   "referenced_type" : "_ZTI13stack_st_void",
   "self_type" : "_ZTIP13stack_st_void",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP20CRYPTO_dynlock_value",
   "name" : "CRYPTO_dynlock_value *",
   "referenced_type" : "_ZTI20CRYPTO_dynlock_value",
   "self_type" : "_ZTIP20CRYPTO_dynlock_value",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP6bio_st",
   "name" : "bio_st *",
   "referenced_type" : "_ZTI6bio_st",
   "self_type" : "_ZTIP6bio_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiP6bio_stE",
   "name" : "int (*)(bio_st *)",
   "referenced_type" : "_ZTIFiP6bio_stE",
   "self_type" : "_ZTIPFiP6bio_stE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiP6bio_stPKcE",
   "name" : "int (*)(bio_st *, const char *)",
   "referenced_type" : "_ZTIFiP6bio_stPKcE",
   "self_type" : "_ZTIPFiP6bio_stPKcE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiP6bio_stPKciE",
   "name" : "int (*)(bio_st *, const char *, int)",
   "referenced_type" : "_ZTIFiP6bio_stPKciE",
   "self_type" : "_ZTIPFiP6bio_stPKciE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiP6bio_stPciE",
   "name" : "int (*)(bio_st *, char *, int)",
   "referenced_type" : "_ZTIFiP6bio_stPciE",
   "self_type" : "_ZTIPFiP6bio_stPciE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiPPKvS1_E",
   "name" : "int (*)(const void **, const void **)",
   "referenced_type" : "_ZTIFiPPKvS1_E",
   "self_type" : "_ZTIPFiPPKvS1_E",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFlP6bio_stiPFlS0_iPKcillEE",
   "name" : "long (*)(bio_st *, int, long (*)(bio_st *, int, const char *, int, long, long))",
   "referenced_type" : "_ZTIFlP6bio_stiPFlS0_iPKcillEE",
   "self_type" : "_ZTIPFlP6bio_stiPFlS0_iPKcillEE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFlP6bio_stiPKcillE",
   "name" : "long (*)(bio_st *, int, const char *, int, long, long)",
   "referenced_type" : "_ZTIFlP6bio_stiPKcillE",
   "self_type" : "_ZTIPFlP6bio_stiPKcillE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFlP6bio_stilPvE",
   "name" : "long (*)(bio_st *, int, long, void *)",
   "referenced_type" : "_ZTIFlP6bio_stilPvE",
   "self_type" : "_ZTIPFlP6bio_stilPvE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK13bio_method_st",
   "name" : "const bio_method_st *",
   "referenced_type" : "_ZTIK13bio_method_st",
   "self_type" : "_ZTIPK13bio_method_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPKv",
   "name" : "const void **",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIPPKv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/buf.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13bio_method_st",
   "name" : "const bio_method_st",
   "referenced_type" : "_ZTI13bio_method_st",
   "self_type" : "_ZTIK13bio_method_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "length",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "max",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10buf_mem_st",
   "name" : "buf_mem_st",
   "referenced_type" : "_ZTI10buf_mem_st",
   "self_type" : "_ZTI10buf_mem_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/buf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "bwrite",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiP6bio_stPKciE"
    },
    {
     "field_name" : "bread",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP6bio_stPciE"
    },
    {
     "field_name" : "bputs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP6bio_stPKcE"
    },
    {
     "field_name" : "bgets",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiP6bio_stPciE"
    },
    {
     "field_name" : "ctrl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFlP6bio_stilPvE"
    },
    {
     "field_name" : "create",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP6bio_stE"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP6bio_stE"
    },
    {
     "field_name" : "callback_ctrl",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFlP6bio_stiPFlS0_iPKcillEE"
    }
   ],
   "linker_set_key" : "_ZTI13bio_method_st",
   "name" : "bio_method_st",
   "referenced_type" : "_ZTI13bio_method_st",
   "self_type" : "_ZTI13bio_method_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
    }
   ],
   "linker_set_key" : "_ZTI14CRYPTO_dynlock",
   "name" : "CRYPTO_dynlock",
   "referenced_type" : "_ZTI14CRYPTO_dynlock",
   "self_type" : "_ZTI14CRYPTO_dynlock",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTIA56_h"
    }
   ],
   "linker_set_key" : "_ZTI15crypto_mutex_st",
   "name" : "crypto_mutex_st",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15crypto_mutex_st",
   "self_type" : "_ZTI15crypto_mutex_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sk",
     "referenced_type" : "_ZTIP13stack_st_void"
    }
   ],
   "linker_set_key" : "_ZTI17crypto_ex_data_st",
   "name" : "crypto_ex_data_st",
   "referenced_type" : "_ZTI17crypto_ex_data_st",
   "self_type" : "_ZTI17crypto_ex_data_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "method",
     "referenced_type" : "_ZTIPK13bio_method_st"
    },
    {
     "field_name" : "init",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shutdown",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "retry_reason",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "references",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "next_bio",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP6bio_st"
    },
    {
     "field_name" : "num_read",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_write",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6bio_st",
   "name" : "bio_st",
   "referenced_type" : "_ZTI6bio_st",
   "self_type" : "_ZTI6bio_st",
   "size" : 44,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPv"
    },
    {
     "field_name" : "sorted",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_alloc",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "comp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPPKvS1_E"
    }
   ],
   "linker_set_key" : "_ZTI8stack_st",
   "name" : "stack_st",
   "referenced_type" : "_ZTI8stack_st",
   "self_type" : "_ZTI8stack_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "rvalue_reference_types" : []
}
