{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIDn",
   "name" : "nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIx",
   "name" : "long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIx",
   "size" : 8
  }
 ],
 "elf_functions" :
 [
  {
   "binding" : "weak",

   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIjNS_9allocatorIjEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIxNS_9allocatorIxEEEEEE",
   "name" : "const std::optional<std::vector<long long, std::allocator<long long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIxNS_9allocatorIxEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIxNS_9allocatorIxEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long long, std::allocator<unsigned long long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssCallback.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssSetCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssPsdsCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback17downloadRequestCbENS2_8PsdsTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssConfiguration>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration14setSuplVersionEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration11setSuplModeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration13setLppProfileEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration29setGlonassPositioningProtocolEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration19setEmergencySuplPdnEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration17setEsExtensionSecEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration12setBlocklistERKNSt3__16vectorINS2_17BlocklistedSourceENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssPowerIndication>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication11setCallbackERKNSt3__110shared_ptrINS2_28IGnssPowerIndicationCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication21requestGnssPowerStatsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssMeasurementCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback17gnssMeasurementCbERKNS2_8GnssDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssMeasurementInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface11setCallbackERKNSt3__110shared_ptrINS2_24IGnssMeasurementCallbackEEEbb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssPowerIndicationCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback17setCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback16gnssPowerStatsCbERKNS2_14GnssPowerStatsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss5IGnssE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnss>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss5IGnssE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss11setCallbackERKNSt3__110shared_ptrINS2_13IGnssCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16getExtensionPsdsEPNSt3__110shared_ptrINS2_9IGnssPsdsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss29getExtensionGnssConfigurationEPNSt3__110shared_ptrINS2_18IGnssConfigurationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss27getExtensionGnssMeasurementEPNSt3__110shared_ptrINS2_25IGnssMeasurementInterfaceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss31getExtensionGnssPowerIndicationEPNSt3__110shared_ptrINS2_20IGnssPowerIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssPsds>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds14injectPsdsDataENS2_8PsdsTypeERKNSt3__16vectorIhNS5_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds11setCallbackERKNSt3__110shared_ptrINS2_17IGnssPsdsCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssSetCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssPsdsCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback17downloadRequestCbENS2_8PsdsTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssConfiguration>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration14setSuplVersionEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration11setSuplModeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration13setLppProfileEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration29setGlonassPositioningProtocolEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration19setEmergencySuplPdnEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration17setEsExtensionSecEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration12setBlocklistERKNSt3__16vectorINS2_17BlocklistedSourceENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssPowerIndication>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication11setCallbackERKNSt3__110shared_ptrINS2_28IGnssPowerIndicationCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication21requestGnssPowerStatsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssMeasurementCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback17gnssMeasurementCbERKNS2_8GnssDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssMeasurementInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface11setCallbackERKNSt3__110shared_ptrINS2_24IGnssMeasurementCallbackEEEbb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssPowerIndicationCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback17setCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback16gnssPowerStatsCbERKNS2_14GnssPowerStatsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss5IGnssE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnss>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss5IGnssE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss11setCallbackERKNSt3__110shared_ptrINS2_13IGnssCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16getExtensionPsdsEPNSt3__110shared_ptrINS2_9IGnssPsdsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss29getExtensionGnssConfigurationEPNSt3__110shared_ptrINS2_18IGnssConfigurationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss27getExtensionGnssMeasurementEPNSt3__110shared_ptrINS2_25IGnssMeasurementInterfaceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss31getExtensionGnssPowerIndicationEPNSt3__110shared_ptrINS2_20IGnssPowerIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssPsds>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds14injectPsdsDataENS2_8PsdsTypeERKNSt3__16vectorIhNS5_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds11setCallbackERKNSt3__110shared_ptrINS2_17IGnssPsdsCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP13AIBinder_Weak" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP23AIBinder_DeathRecipient" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP7AParcel" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP7AStatus" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss10BnGnssPsdsE",
   "name" : "aidl::android::hardware::gnss::BnGnssPsds",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10BnGnssPsdsE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss10BnGnssPsdsE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BnGnssPsds.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss10BnGnssPsdsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnGnssPsdsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnGnssPsdsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds14injectPsdsDataENS2_8PsdsTypeERKNSt3__16vectorIhNS5_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds11setCallbackERKNSt3__110shared_ptrINS2_17IGnssPsdsCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnGnssPsds19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnGnssPsds16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnGnssPsds12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss10BpGnssPsdsE",
   "name" : "aidl::android::hardware::gnss::BpGnssPsds",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10BpGnssPsdsE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss10BpGnssPsdsE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BpGnssPsds.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss10BpGnssPsdsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsdsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsdsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsds14injectPsdsDataENS2_8PsdsTypeERKNSt3__16vectorIhNS5_9allocatorIhEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsds11setCallbackERKNSt3__110shared_ptrINS2_17IGnssPsdsCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsds19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsds16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss5IGnssE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss12IGnssDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss12IGnssDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss12IGnssDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnss.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss12IGnssDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault11setCallbackERKNSt3__110shared_ptrINS2_13IGnssCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault16getExtensionPsdsEPNSt3__110shared_ptrINS2_9IGnssPsdsEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault29getExtensionGnssConfigurationEPNSt3__110shared_ptrINS2_18IGnssConfigurationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault27getExtensionGnssMeasurementEPNSt3__110shared_ptrINS2_25IGnssMeasurementInterfaceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault31getExtensionGnssPowerIndicationEPNSt3__110shared_ptrINS2_20IGnssPowerIndicationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "satPosEcef",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21SatellitePositionEcefE"
    },
    {
     "field_name" : "satVelEcef",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21SatelliteVelocityEcefE"
    },
    {
     "field_name" : "satClockInfo",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18SatelliteClockInfoE"
    },
    {
     "field_name" : "ionoDelayMeters",
     "field_offset" : 768,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "tropoDelayMeters",
     "field_offset" : 832,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE",
   "name" : "aidl::android::hardware::gnss::SatellitePvt",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/SatellitePvt.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE",
   "name" : "aidl::android::hardware::gnss::IGnssCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssSetCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14BnGnssCallbackE",
   "name" : "aidl::android::hardware::gnss::BnGnssCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14BnGnssCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14BnGnssCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BnGnssCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss14BnGnssCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssSetCapabilitiesCbEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14BpGnssCallbackE",
   "name" : "aidl::android::hardware::gnss::BpGnssCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14BpGnssCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14BpGnssCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BpGnssCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss14BpGnssCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback21gnssSetCapabilitiesCbEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "elapsedRealtime",
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE"
    },
    {
     "field_name" : "totalEnergyMilliJoule",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "singlebandTrackingModeEnergyMilliJoule",
     "field_offset" : 256,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "multibandTrackingModeEnergyMilliJoule",
     "field_offset" : 320,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "singlebandAcquisitionModeEnergyMilliJoule",
     "field_offset" : 384,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "multibandAcquisitionModeEnergyMilliJoule",
     "field_offset" : 448,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "otherModesEnergyMilliJoule",
     "field_offset" : 512,
     "referenced_type" : "_ZTINSt3__16vectorIdNS_9allocatorIdEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14GnssPowerStatsE",
   "name" : "aidl::android::hardware::gnss::GnssPowerStats",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14GnssPowerStatsE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14GnssPowerStatsE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/GnssPowerStats.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "constellation",
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21GnssConstellationTypeE"
    },
    {
     "field_name" : "carrierFrequencyHz",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "codeType",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE",
   "name" : "aidl::android::hardware::gnss::GnssSignalType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/GnssSignalType.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timestampNs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "timeUncertaintyNs",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE",
   "name" : "aidl::android::hardware::gnss::ElapsedRealtime",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/ElapsedRealtime.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "svid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "signalType",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE"
    },
    {
     "field_name" : "timeOffsetNs",
     "field_offset" : 320,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "state",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "receivedSvTimeInNs",
     "field_offset" : 448,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "receivedSvTimeUncertaintyInNs",
     "field_offset" : 512,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "antennaCN0DbHz",
     "field_offset" : 576,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "basebandCN0DbHz",
     "field_offset" : 640,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "pseudorangeRateMps",
     "field_offset" : 704,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "pseudorangeRateUncertaintyMps",
     "field_offset" : 768,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "accumulatedDeltaRangeState",
     "field_offset" : 832,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "accumulatedDeltaRangeM",
     "field_offset" : 896,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "accumulatedDeltaRangeUncertaintyM",
     "field_offset" : 960,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "carrierCycles",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "carrierPhase",
     "field_offset" : 1088,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "carrierPhaseUncertainty",
     "field_offset" : 1152,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "multipathIndicator",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss22GnssMultipathIndicatorE"
    },
    {
     "field_name" : "snrDb",
     "field_offset" : 1280,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "agcLevelDb",
     "field_offset" : 1344,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "fullInterSignalBiasNs",
     "field_offset" : 1408,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "fullInterSignalBiasUncertaintyNs",
     "field_offset" : 1472,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satelliteInterSignalBiasNs",
     "field_offset" : 1536,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satelliteInterSignalBiasUncertaintyNs",
     "field_offset" : 1600,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satellitePvt",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE"
    },
    {
     "field_name" : "correlationVectors",
     "field_offset" : 2560,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware4gnss17CorrelationVectorENS_9allocatorIS5_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss15GnssMeasurementE",
   "name" : "aidl::android::hardware::gnss::GnssMeasurement",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15GnssMeasurementE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss15GnssMeasurementE",
   "size" : 336,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/GnssMeasurement.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss16IGnssPsdsDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssPsdsDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss16IGnssPsdsDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss16IGnssPsdsDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssPsds.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss16IGnssPsdsDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault14injectPsdsDataENS2_8PsdsTypeERKNSt3__16vectorIhNS5_9allocatorIhEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault11setCallbackERKNSt3__110shared_ptrINS2_17IGnssPsdsCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "constellation",
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21GnssConstellationTypeE"
    },
    {
     "field_name" : "svid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss17BlocklistedSourceE",
   "name" : "aidl::android::hardware::gnss::BlocklistedSource",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17BlocklistedSourceE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss17BlocklistedSourceE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BlocklistedSource.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frequencyOffsetMps",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "samplingWidthM",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "samplingStartM",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "magnitude",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss17CorrelationVectorE",
   "name" : "aidl::android::hardware::gnss::CorrelationVector",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17CorrelationVectorE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss17CorrelationVectorE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/CorrelationVector.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE",
   "name" : "aidl::android::hardware::gnss::IGnssPsdsCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssPsdsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback17downloadRequestCbENS2_8PsdsTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss18BnGnssPsdsCallbackE",
   "name" : "aidl::android::hardware::gnss::BnGnssPsdsCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18BnGnssPsdsCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss18BnGnssPsdsCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BnGnssPsdsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss18BnGnssPsdsCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnGnssPsdsCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnGnssPsdsCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback17downloadRequestCbENS2_8PsdsTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnGnssPsdsCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnGnssPsdsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnGnssPsdsCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss18BpGnssPsdsCallbackE",
   "name" : "aidl::android::hardware::gnss::BpGnssPsdsCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18BpGnssPsdsCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss18BpGnssPsdsCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BpGnssPsdsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss18BpGnssPsdsCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpGnssPsdsCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpGnssPsdsCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpGnssPsdsCallback17downloadRequestCbENS2_8PsdsTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpGnssPsdsCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpGnssPsdsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE",
   "name" : "aidl::android::hardware::gnss::IGnssConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssConfiguration.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfigurationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfigurationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration14setSuplVersionEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration11setSuplModeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration13setLppProfileEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration29setGlonassPositioningProtocolEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration19setEmergencySuplPdnEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration17setEsExtensionSecEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration12setBlocklistERKNSt3__16vectorINS2_17BlocklistedSourceENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "satHardwareCodeBiasMeters",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satTimeCorrectionMeters",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satClkDriftMps",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss18SatelliteClockInfoE",
   "name" : "aidl::android::hardware::gnss::SatelliteClockInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18SatelliteClockInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss18SatelliteClockInfoE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/SatelliteClockInfo.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss19BnGnssConfigurationE",
   "name" : "aidl::android::hardware::gnss::BnGnssConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss19BnGnssConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss19BnGnssConfigurationE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BnGnssConfiguration.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss19BnGnssConfigurationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BnGnssConfigurationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BnGnssConfigurationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration14setSuplVersionEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration11setSuplModeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration13setLppProfileEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration29setGlonassPositioningProtocolEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration19setEmergencySuplPdnEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration17setEsExtensionSecEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration12setBlocklistERKNSt3__16vectorINS2_17BlocklistedSourceENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BnGnssConfiguration19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BnGnssConfiguration16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BnGnssConfiguration12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss19BpGnssConfigurationE",
   "name" : "aidl::android::hardware::gnss::BpGnssConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss19BpGnssConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss19BpGnssConfigurationE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BpGnssConfiguration.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss19BpGnssConfigurationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BpGnssConfigurationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BpGnssConfigurationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BpGnssConfiguration14setSuplVersionEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BpGnssConfiguration11setSuplModeEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BpGnssConfiguration13setLppProfileEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BpGnssConfiguration29setGlonassPositioningProtocolEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BpGnssConfiguration19setEmergencySuplPdnEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BpGnssConfiguration17setEsExtensionSecEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BpGnssConfiguration12setBlocklistERKNSt3__16vectorINS2_17BlocklistedSourceENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BpGnssConfiguration19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss19BpGnssConfiguration16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss20IGnssCallbackDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss20IGnssCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss20IGnssCallbackDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss20IGnssCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssCallbackDefault21gnssSetCapabilitiesCbEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE",
   "name" : "aidl::android::hardware::gnss::IGnssPowerIndication",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssPowerIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndicationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndicationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication11setCallbackERKNSt3__110shared_ptrINS2_28IGnssPowerIndicationCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication21requestGnssPowerStatsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss21BnGnssPowerIndicationE",
   "name" : "aidl::android::hardware::gnss::BnGnssPowerIndication",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21BnGnssPowerIndicationE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss21BnGnssPowerIndicationE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BnGnssPowerIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss21BnGnssPowerIndicationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21BnGnssPowerIndicationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21BnGnssPowerIndicationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication11setCallbackERKNSt3__110shared_ptrINS2_28IGnssPowerIndicationCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication21requestGnssPowerStatsEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21BnGnssPowerIndication19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21BnGnssPowerIndication16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21BnGnssPowerIndication12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss21BpGnssPowerIndicationE",
   "name" : "aidl::android::hardware::gnss::BpGnssPowerIndication",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21BpGnssPowerIndicationE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss21BpGnssPowerIndicationE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BpGnssPowerIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss21BpGnssPowerIndicationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21BpGnssPowerIndicationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21BpGnssPowerIndicationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21BpGnssPowerIndication11setCallbackERKNSt3__110shared_ptrINS2_28IGnssPowerIndicationCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21BpGnssPowerIndication21requestGnssPowerStatsEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21BpGnssPowerIndication19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21BpGnssPowerIndication16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "posXMeters",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "posYMeters",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "posZMeters",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "ureMeters",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss21SatellitePositionEcefE",
   "name" : "aidl::android::hardware::gnss::SatellitePositionEcef",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21SatellitePositionEcefE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss21SatellitePositionEcefE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/SatellitePositionEcef.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "velXMps",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "velYMps",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "velZMps",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "ureRateMps",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss21SatelliteVelocityEcefE",
   "name" : "aidl::android::hardware::gnss::SatelliteVelocityEcef",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21SatelliteVelocityEcefE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss21SatelliteVelocityEcefE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/SatelliteVelocityEcef.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE",
   "name" : "aidl::android::hardware::gnss::IGnssMeasurementCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssMeasurementCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback17gnssMeasurementCbERKNS2_8GnssDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss24IGnssPsdsCallbackDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssPsdsCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss24IGnssPsdsCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss24IGnssPsdsCallbackDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssPsdsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss24IGnssPsdsCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssPsdsCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssPsdsCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssPsdsCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssPsdsCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssPsdsCallbackDefault17downloadRequestCbENS2_8PsdsTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssPsdsCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssPsdsCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss25BnGnssMeasurementCallbackE",
   "name" : "aidl::android::hardware::gnss::BnGnssMeasurementCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss25BnGnssMeasurementCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss25BnGnssMeasurementCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BnGnssMeasurementCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss25BnGnssMeasurementCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25BnGnssMeasurementCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25BnGnssMeasurementCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback17gnssMeasurementCbERKNS2_8GnssDataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25BnGnssMeasurementCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25BnGnssMeasurementCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25BnGnssMeasurementCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss25BpGnssMeasurementCallbackE",
   "name" : "aidl::android::hardware::gnss::BpGnssMeasurementCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss25BpGnssMeasurementCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss25BpGnssMeasurementCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BpGnssMeasurementCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss25BpGnssMeasurementCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25BpGnssMeasurementCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25BpGnssMeasurementCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25BpGnssMeasurementCallback17gnssMeasurementCbERKNS2_8GnssDataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25BpGnssMeasurementCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25BpGnssMeasurementCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss25IGnssConfigurationDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssConfigurationDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss25IGnssConfigurationDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss25IGnssConfigurationDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssConfiguration.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss25IGnssConfigurationDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefault14setSuplVersionEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefault11setSuplModeEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefault13setLppProfileEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefault29setGlonassPositioningProtocolEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefault19setEmergencySuplPdnEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefault17setEsExtensionSecEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefault12setBlocklistERKNSt3__16vectorINS2_17BlocklistedSourceENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssConfigurationDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE",
   "name" : "aidl::android::hardware::gnss::IGnssMeasurementInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssMeasurementInterface.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface11setCallbackERKNSt3__110shared_ptrINS2_24IGnssMeasurementCallbackEEEbb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss26BnGnssMeasurementInterfaceE",
   "name" : "aidl::android::hardware::gnss::BnGnssMeasurementInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss26BnGnssMeasurementInterfaceE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss26BnGnssMeasurementInterfaceE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BnGnssMeasurementInterface.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss26BnGnssMeasurementInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss26BnGnssMeasurementInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss26BnGnssMeasurementInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface11setCallbackERKNSt3__110shared_ptrINS2_24IGnssMeasurementCallbackEEEbb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss26BnGnssMeasurementInterface19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss26BnGnssMeasurementInterface16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss26BnGnssMeasurementInterface12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss26BpGnssMeasurementInterfaceE",
   "name" : "aidl::android::hardware::gnss::BpGnssMeasurementInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss26BpGnssMeasurementInterfaceE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss26BpGnssMeasurementInterfaceE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BpGnssMeasurementInterface.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss26BpGnssMeasurementInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss26BpGnssMeasurementInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss26BpGnssMeasurementInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss26BpGnssMeasurementInterface11setCallbackERKNSt3__110shared_ptrINS2_24IGnssMeasurementCallbackEEEbb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss26BpGnssMeasurementInterface5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss26BpGnssMeasurementInterface19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss26BpGnssMeasurementInterface16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss27IGnssPowerIndicationDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssPowerIndicationDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss27IGnssPowerIndicationDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss27IGnssPowerIndicationDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssPowerIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss27IGnssPowerIndicationDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss27IGnssPowerIndicationDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss27IGnssPowerIndicationDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss27IGnssPowerIndicationDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss27IGnssPowerIndicationDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss27IGnssPowerIndicationDefault11setCallbackERKNSt3__110shared_ptrINS2_28IGnssPowerIndicationCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss27IGnssPowerIndicationDefault21requestGnssPowerStatsEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss27IGnssPowerIndicationDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss27IGnssPowerIndicationDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE",
   "name" : "aidl::android::hardware::gnss::IGnssPowerIndicationCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssPowerIndicationCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback17setCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback16gnssPowerStatsCbERKNS2_14GnssPowerStatsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss29BnGnssPowerIndicationCallbackE",
   "name" : "aidl::android::hardware::gnss::BnGnssPowerIndicationCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss29BnGnssPowerIndicationCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss29BnGnssPowerIndicationCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BnGnssPowerIndicationCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss29BnGnssPowerIndicationCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss29BnGnssPowerIndicationCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss29BnGnssPowerIndicationCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback17setCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback16gnssPowerStatsCbERKNS2_14GnssPowerStatsE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss29BnGnssPowerIndicationCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss29BnGnssPowerIndicationCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss29BnGnssPowerIndicationCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss29BpGnssPowerIndicationCallbackE",
   "name" : "aidl::android::hardware::gnss::BpGnssPowerIndicationCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss29BpGnssPowerIndicationCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss29BpGnssPowerIndicationCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BpGnssPowerIndicationCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss29BpGnssPowerIndicationCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss29BpGnssPowerIndicationCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss29BpGnssPowerIndicationCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss29BpGnssPowerIndicationCallback17setCapabilitiesCbEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss29BpGnssPowerIndicationCallback16gnssPowerStatsCbERKNS2_14GnssPowerStatsE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss29BpGnssPowerIndicationCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss29BpGnssPowerIndicationCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss31IGnssMeasurementCallbackDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssMeasurementCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss31IGnssMeasurementCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss31IGnssMeasurementCallbackDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssMeasurementCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss31IGnssMeasurementCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssMeasurementCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssMeasurementCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssMeasurementCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssMeasurementCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssMeasurementCallbackDefault17gnssMeasurementCbERKNS2_8GnssDataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssMeasurementCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssMeasurementCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssMeasurementInterfaceDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssMeasurementInterface.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefault11setCallbackERKNSt3__110shared_ptrINS2_24IGnssMeasurementCallbackEEEbb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefault5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss32IGnssMeasurementInterfaceDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssPowerIndicationCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssPowerIndicationCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefault17setCapabilitiesCbEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefault16gnssPowerStatsCbERKNS2_14GnssPowerStatsE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss35IGnssPowerIndicationCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss5IGnssE",
   "name" : "aidl::android::hardware::gnss::IGnss",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss5IGnssE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss5IGnssE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnss.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss5IGnssE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnssD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnssD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss11setCallbackERKNSt3__110shared_ptrINS2_13IGnssCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16getExtensionPsdsEPNSt3__110shared_ptrINS2_9IGnssPsdsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss29getExtensionGnssConfigurationEPNSt3__110shared_ptrINS2_18IGnssConfigurationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss27getExtensionGnssMeasurementEPNSt3__110shared_ptrINS2_25IGnssMeasurementInterfaceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss31getExtensionGnssPowerIndicationEPNSt3__110shared_ptrINS2_20IGnssPowerIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss6BnGnssE",
   "name" : "aidl::android::hardware::gnss::BnGnss",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss6BnGnssE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss6BnGnssE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BnGnss.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss6BnGnssE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BnGnssD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BnGnssD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss11setCallbackERKNSt3__110shared_ptrINS2_13IGnssCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16getExtensionPsdsEPNSt3__110shared_ptrINS2_9IGnssPsdsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss29getExtensionGnssConfigurationEPNSt3__110shared_ptrINS2_18IGnssConfigurationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss27getExtensionGnssMeasurementEPNSt3__110shared_ptrINS2_25IGnssMeasurementInterfaceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss31getExtensionGnssPowerIndicationEPNSt3__110shared_ptrINS2_20IGnssPowerIndicationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BnGnss19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BnGnss16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BnGnss12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss6BpGnssE",
   "name" : "aidl::android::hardware::gnss::BpGnss",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss6BpGnssE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss6BpGnssE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/BpGnss.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss6BpGnssE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BpGnssD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BpGnssD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BpGnss11setCallbackERKNSt3__110shared_ptrINS2_13IGnssCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BpGnss5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BpGnss16getExtensionPsdsEPNSt3__110shared_ptrINS2_9IGnssPsdsEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BpGnss29getExtensionGnssConfigurationEPNSt3__110shared_ptrINS2_18IGnssConfigurationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BpGnss27getExtensionGnssMeasurementEPNSt3__110shared_ptrINS2_25IGnssMeasurementInterfaceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BpGnss31getExtensionGnssPowerIndicationEPNSt3__110shared_ptrINS2_20IGnssPowerIndicationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BpGnss19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BpGnss16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "measurements",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware4gnss15GnssMeasurementENS_9allocatorIS5_EEEE"
    },
    {
     "field_name" : "clock",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9GnssClockE"
    },
    {
     "field_name" : "elapsedRealtime",
     "field_offset" : 960,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss8GnssDataE",
   "name" : "aidl::android::hardware::gnss::GnssData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss8GnssDataE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss8GnssDataE",
   "size" : 144,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/GnssData.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "gnssClockFlags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "leapSecond",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timeNs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "timeUncertaintyNs",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "fullBiasNs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "biasNs",
     "field_offset" : 256,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "biasUncertaintyNs",
     "field_offset" : 320,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "driftNsps",
     "field_offset" : 384,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "driftUncertaintyNsps",
     "field_offset" : 448,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "hwClockDiscontinuityCount",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "referenceSignalTypeForIsb",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss9GnssClockE",
   "name" : "aidl::android::hardware::gnss::GnssClock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9GnssClockE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss9GnssClockE",
   "size" : 104,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/GnssClock.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE",
   "name" : "aidl::android::hardware::gnss::IGnssPsds",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/IGnssPsds.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsdsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsdsD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds14injectPsdsDataENS2_8PsdsTypeERKNSt3__16vectorIhNS5_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds11setCallbackERKNSt3__110shared_ptrINS2_17IGnssPsdsCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4gnss15GnssMeasurementENS3_9allocatorIS9_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::gnss::GnssMeasurement, std::allocator<aidl::android::hardware::gnss::GnssMeasurement>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4gnss15GnssMeasurementENS3_9allocatorIS9_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4gnss15GnssMeasurementENS3_9allocatorIS9_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware4gnss15GnssMeasurementENS_9allocatorIS5_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4gnss17CorrelationVectorENS3_9allocatorIS9_EEEEEE",
