{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIDn",
   "name" : "nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],

   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIiNS_9allocatorIiEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIjNS_9allocatorIjEEEEEE",
   "name" : "const std::optional<std::vector<unsigned int, std::allocator<unsigned int>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIjNS_9allocatorIjEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIjNS_9allocatorIjEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "name" : "const std::optional<std::vector<long, std::allocator<long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long, std::allocator<unsigned long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/packages/modules/DnsResolver/dnsresolver_aidl_interface-V9-ndk_platform-source/gen/include/aidl/android/net/resolv/aidl/IDnsResolverUnsolicitedEventListener.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEEE",
   "name" : "ndk::BnCInterface<aidl::android::net::resolv::aidl::IDnsResolverUnsolicitedEventListener>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener16onDnsHealthEventERKNS3_20DnsHealthEventParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener18onNat64PrefixEventERKNS3_22Nat64PrefixEventParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener27onPrivateDnsValidationEventERKNS3_31PrivateDnsValidationEventParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEEE",
   "name" : "ndk::BpCInterface<aidl::android::net::resolv::aidl::IDnsResolverUnsolicitedEventListener>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener16onDnsHealthEventERKNS3_20DnsHealthEventParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener18onNat64PrefixEventERKNS3_22Nat64PrefixEventParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener27onPrivateDnsValidationEventERKNS3_31PrivateDnsValidationEventParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP13AIBinder_Weak" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP23AIBinder_DeathRecipient" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP7AParcel" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP7AStatus" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "netId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "healthResult",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "successRttMicros",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android3net6resolv4aidl20DnsHealthEventParcelE",
   "name" : "aidl::android::net::resolv::aidl::DnsHealthEventParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl20DnsHealthEventParcelE",
   "self_type" : "_ZTIN4aidl7android3net6resolv4aidl20DnsHealthEventParcelE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/packages/modules/DnsResolver/dnsresolver_aidl_interface-V9-ndk_platform-source/gen/include/aidl/android/net/resolv/aidl/DnsHealthEventParcel.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "netId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "prefixOperation",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "prefixAddress",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "prefixLength",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android3net6resolv4aidl22Nat64PrefixEventParcelE",
   "name" : "aidl::android::net::resolv::aidl::Nat64PrefixEventParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl22Nat64PrefixEventParcelE",
   "self_type" : "_ZTIN4aidl7android3net6resolv4aidl22Nat64PrefixEventParcelE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/packages/modules/DnsResolver/dnsresolver_aidl_interface-V9-ndk_platform-source/gen/include/aidl/android/net/resolv/aidl/Nat64PrefixEventParcel.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "netId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ipAddress",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "hostname",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "validation",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android3net6resolv4aidl31PrivateDnsValidationEventParcelE",
   "name" : "aidl::android::net::resolv::aidl::PrivateDnsValidationEventParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl31PrivateDnsValidationEventParcelE",
   "self_type" : "_ZTIN4aidl7android3net6resolv4aidl31PrivateDnsValidationEventParcelE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/packages/modules/DnsResolver/dnsresolver_aidl_interface-V9-ndk_platform-source/gen/include/aidl/android/net/resolv/aidl/PrivateDnsValidationEventParcel.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerE",
   "name" : "aidl::android::net::resolv::aidl::IDnsResolverUnsolicitedEventListener",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerE",
   "self_type" : "_ZTIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/packages/modules/DnsResolver/dnsresolver_aidl_interface-V9-ndk_platform-source/gen/include/aidl/android/net/resolv/aidl/IDnsResolverUnsolicitedEventListener.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener16onDnsHealthEventERKNS3_20DnsHealthEventParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener18onNat64PrefixEventERKNS3_22Nat64PrefixEventParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener27onPrivateDnsValidationEventERKNS3_31PrivateDnsValidationEventParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "duration_ms",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "interface_name",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "method_name",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "proxy_address",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "stub_address",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "input_args",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorINS_4pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEES7_EENS5_IS8_EEEE"
    },
    {
     "field_name" : "output_args",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__16vectorINS_4pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEES7_EENS5_IS8_EEEE"
    },
    {
     "field_name" : "result",
     "field_offset" : 960,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "exception_message",
     "field_offset" : 1152,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "exception_code",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "transaction_error",
     "field_offset" : 1376,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "service_specific_error_code",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListener14TransactionLogE",
   "name" : "aidl::android::net::resolv::aidl::BnDnsResolverUnsolicitedEventListener::TransactionLog",
   "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListener14TransactionLogE",
   "self_type" : "_ZTIN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListener14TransactionLogE",
   "size" : 184,
   "source_file" : "out/soong/.intermediates/packages/modules/DnsResolver/dnsresolver_aidl_interface-V9-ndk_platform-source/gen/include/aidl/android/net/resolv/aidl/BnDnsResolverUnsolicitedEventListener.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListenerE",
   "name" : "aidl::android::net::resolv::aidl::BnDnsResolverUnsolicitedEventListener",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListenerE",
   "self_type" : "_ZTIN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListenerE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/packages/modules/DnsResolver/dnsresolver_aidl_interface-V9-ndk_platform-source/gen/include/aidl/android/net/resolv/aidl/BnDnsResolverUnsolicitedEventListener.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener16onDnsHealthEventERKNS3_20DnsHealthEventParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener18onNat64PrefixEventERKNS3_22Nat64PrefixEventParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListener27onPrivateDnsValidationEventERKNS3_31PrivateDnsValidationEventParcelE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListener19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListener16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BnDnsResolverUnsolicitedEventListener12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "duration_ms",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "interface_name",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "method_name",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "proxy_address",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "stub_address",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "input_args",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorINS_4pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEES7_EENS5_IS8_EEEE"
    },
    {
     "field_name" : "output_args",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__16vectorINS_4pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEES7_EENS5_IS8_EEEE"
    },
    {
     "field_name" : "result",
     "field_offset" : 960,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "exception_message",
     "field_offset" : 1152,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "exception_code",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "transaction_error",
     "field_offset" : 1376,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "service_specific_error_code",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListener14TransactionLogE",
   "name" : "aidl::android::net::resolv::aidl::BpDnsResolverUnsolicitedEventListener::TransactionLog",
   "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListener14TransactionLogE",
   "self_type" : "_ZTIN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListener14TransactionLogE",
   "size" : 184,
   "source_file" : "out/soong/.intermediates/packages/modules/DnsResolver/dnsresolver_aidl_interface-V9-ndk_platform-source/gen/include/aidl/android/net/resolv/aidl/BpDnsResolverUnsolicitedEventListener.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListenerE",
   "name" : "aidl::android::net::resolv::aidl::BpDnsResolverUnsolicitedEventListener",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListenerE",
   "self_type" : "_ZTIN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListenerE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/packages/modules/DnsResolver/dnsresolver_aidl_interface-V9-ndk_platform-source/gen/include/aidl/android/net/resolv/aidl/BpDnsResolverUnsolicitedEventListener.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListener16onDnsHealthEventERKNS3_20DnsHealthEventParcelE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListener18onNat64PrefixEventERKNS3_22Nat64PrefixEventParcelE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListener27onPrivateDnsValidationEventERKNS3_31PrivateDnsValidationEventParcelE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListener19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl37BpDnsResolverUnsolicitedEventListener16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl36IDnsResolverUnsolicitedEventListenerE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android3net6resolv4aidl43IDnsResolverUnsolicitedEventListenerDefaultE",
   "name" : "aidl::android::net::resolv::aidl::IDnsResolverUnsolicitedEventListenerDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android3net6resolv4aidl43IDnsResolverUnsolicitedEventListenerDefaultE",
   "self_type" : "_ZTIN4aidl7android3net6resolv4aidl43IDnsResolverUnsolicitedEventListenerDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/packages/modules/DnsResolver/dnsresolver_aidl_interface-V9-ndk_platform-source/gen/include/aidl/android/net/resolv/aidl/IDnsResolverUnsolicitedEventListener.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android3net6resolv4aidl43IDnsResolverUnsolicitedEventListenerDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android3net6resolv4aidl43IDnsResolverUnsolicitedEventListenerDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
