#ifndef HIDL_GENERATED_ANDROID_HARDWARE_SOUNDTRIGGER_V2_0_ISOUNDTRIGGERHWCALLBACK_H
#define HIDL_GENERATED_ANDROID_HARDWARE_SOUNDTRIGGER_V2_0_ISOUNDTRIGGERHWCALLBACK_H

#include <android/hardware/audio/common/2.0/types.h>
#include <android/hardware/soundtrigger/2.0/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace soundtrigger {
namespace V2_0 {

struct ISoundTriggerHwCallback : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.soundtrigger@2.0::ISoundTriggerHwCallback"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class RecognitionStatus : uint32_t;
    enum class SoundModelStatus : uint32_t;
    struct RecognitionEvent;
    struct PhraseRecognitionEvent;
    struct ModelEvent;

    enum class RecognitionStatus : uint32_t {
        SUCCESS = 0u,
        ABORT = 1u,
        FAILURE = 2u,
    };

    enum class SoundModelStatus : uint32_t {
        UPDATED = 0u,
    };

    /**
     * Generic recognition event sent via recognition callback
     */
    struct RecognitionEvent final {
        /**
         * Recognition status e.g. SUCCESS
         */
        ::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionStatus status __attribute__ ((aligned(4)));
        /**
         * Sound model type for this event. e.g SoundModelType.TYPE_KEYPHRASE
         */
        ::android::hardware::soundtrigger::V2_0::SoundModelType type __attribute__ ((aligned(4)));
        /**
         * Handle of loaded sound model which triggered the event
         */
        int32_t model __attribute__ ((aligned(4)));
        /**
         * It is possible to capture audio from this
         *
         *
         * utterance buffered by the implementation
         */
        bool captureAvailable __attribute__ ((aligned(1)));
        /**
         * Audio session ID. framework use
         */
        int32_t captureSession __attribute__ ((aligned(4)));
        /**
         * Delay in ms between end of model detection and start of audio
         * available for capture. A negative value is possible
         * (e.g. if key phrase is also available for capture
         */
        int32_t captureDelayMs __attribute__ ((aligned(4)));
        /**
         * Duration in ms of audio captured before the start of the trigger.
         * 0 if none.
         */
        int32_t capturePreambleMs __attribute__ ((aligned(4)));
        /**
         * The opaque data is the capture of the trigger sound
         */
        bool triggerInData __attribute__ ((aligned(1)));
        /**
         * Audio format of either the trigger in event data or to use for
         * capture of the rest of the utterance
         */
        ::android::hardware::audio::common::V2_0::AudioConfig audioConfig __attribute__ ((aligned(8)));
        /**
         * Opaque event data
         */
        ::android::hardware::hidl_vec<uint8_t> data __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent, status) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent, type) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent, model) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent, captureAvailable) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent, captureSession) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent, captureDelayMs) == 20, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent, capturePreambleMs) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent, triggerInData) == 28, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent, audioConfig) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent, data) == 104, "wrong offset");
    static_assert(sizeof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent) == 120, "wrong size");
    static_assert(__alignof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent) == 8, "wrong alignment");

    /**
     * Specialized recognition event for key phrase recognitions
     */
    struct PhraseRecognitionEvent final {
        /**
         * Common part of the recognition event
         */
        ::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent common __attribute__ ((aligned(8)));
        /**
         * List of descriptors for each recognized key phrase
         */
        ::android::hardware::hidl_vec<::android::hardware::soundtrigger::V2_0::PhraseRecognitionExtra> phraseExtras __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::PhraseRecognitionEvent, common) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::PhraseRecognitionEvent, phraseExtras) == 120, "wrong offset");
    static_assert(sizeof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::PhraseRecognitionEvent) == 136, "wrong size");
    static_assert(__alignof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::PhraseRecognitionEvent) == 8, "wrong alignment");

    /**
     * Event sent via load sound model callback
     */
    struct ModelEvent final {
        /**
         * Sound model status e.g. SoundModelStatus.UPDATED
         */
        ::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::SoundModelStatus status __attribute__ ((aligned(4)));
        /**
         * Loaded sound model that triggered the event
         */
        int32_t model __attribute__ ((aligned(4)));
        /**
         * Opaque event data, passed transparently by the framework
         */
        ::android::hardware::hidl_vec<uint8_t> data __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::ModelEvent, status) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::ModelEvent, model) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::ModelEvent, data) == 8, "wrong offset");
    static_assert(sizeof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::ModelEvent) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::ModelEvent) == 8, "wrong alignment");

    typedef int32_t CallbackCookie;

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Callback method called by the HAL when the sound recognition triggers
     * @param event A RecognitionEvent structure containing detailed results
     *              of the recognition triggered
     * @param cookie The cookie passed by the framework when recognition was
     *               started (see ISoundtriggerHw.startRecognition()
     */
    virtual ::android::hardware::Return<void> recognitionCallback(const ::android::hardware::soundtrigger::V2_0::ISoundTriggerHwCallback::RecognitionEvent& event, int32_t cookie) = 0;

    /**
     * Callback method called by the HAL when the sound recognition triggers
     * for a key phrase sound model.
