{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "system/core/libcutils/include_outside_system/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_h",
   "name" : "unsigned char [128]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA128_h",
   "size" : 128,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE [1]",
   "referenced_type" : "_ZTI35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "self_type" : "_ZTIA1_35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "size" : 264,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_PKc",
   "name" : "const char *[1]",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIA1_PKc",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1_h",
   "name" : "unsigned char [1]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA1_h",
   "size" : 1,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA26_Ds",

   "linker_set_key" : "_ZTIKNSt3__16vectorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS0_IPvNS_9allocatorIS9_EEEEEEENSA_ISF_EEEE",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *>> *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *>> *)>>>",
   "referenced_type" : "_ZTINSt3__16vectorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS0_IPvNS_9allocatorIS9_EEEEEEENSA_ISF_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS0_IPvNS_9allocatorIS9_EEEEEEENSA_ISF_EEEE",
   "size" : 24,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIhNS_9allocatorIhEEEE",
   "name" : "const std::vector<unsigned char, std::allocator<unsigned char>>",
   "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE",
   "self_type" : "_ZTIKNSt3__16vectorIhNS_9allocatorIhEEEE",
   "size" : 24,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7IBinderE",
   "name" : "android::IBinder *const",
   "referenced_type" : "_ZTIPN7android7IBinderE",
   "self_type" : "_ZTIKPN7android7IBinderE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Binder.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hMarkTargetComponent",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12OMX_MARKTYPE",
   "name" : "OMX_MARKTYPE",
   "referenced_type" : "_ZTI12OMX_MARKTYPE",
   "self_type" : "_ZTI12OMX_MARKTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "system/core/libcutils/include_outside_system/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIN15OMX_VERSIONTYPEUt_E"
    },
    {
     "field_name" : "nVersion",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15OMX_VERSIONTYPE",
   "name" : "OMX_VERSIONTYPE",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15OMX_VERSIONTYPE",
   "self_type" : "_ZTI15OMX_VERSIONTYPE",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "EventHandler",
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_13OMX_EVENTTYPEjjS0_E"
    },
    {
     "field_name" : "EmptyBufferDone",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_P20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "FillBufferDone",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_P20OMX_BUFFERHEADERTYPEE"
    }
   ],
   "linker_set_key" : "_ZTI16OMX_CALLBACKTYPE",
   "name" : "OMX_CALLBACKTYPE",
   "referenced_type" : "_ZTI16OMX_CALLBACKTYPE",
   "self_type" : "_ZTI16OMX_CALLBACKTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17OMX_FRAMESIZETYPE",
   "name" : "OMX_FRAMESIZETYPE",
   "referenced_type" : "_ZTI17OMX_FRAMESIZETYPE",
   "self_type" : "_ZTI17OMX_FRAMESIZETYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nLeft",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nTop",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "name" : "OMX_CONFIG_RECTTYPE",
   "referenced_type" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "self_type" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPorts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStartPortNumber",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "name" : "OMX_PORT_PARAM_TYPE",
   "referenced_type" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "self_type" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTunnelFlags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eSupplier",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22OMX_BUFFERSUPPLIERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "name" : "OMX_TUNNELSETUPTYPE",
   "referenced_type" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "self_type" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "size" : 8,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "pBuffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "nAllocLen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFilledLen",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAppPrivate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pPlatformPrivate",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pInputPortPrivate",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pOutputPortPrivate",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "hMarkTargetComponent",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nTickCount",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeStamp",
     "field_offset" : 704,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nFlags",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nOutputPortIndex",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nInputPortIndex",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "name" : "OMX_BUFFERHEADERTYPE",
   "referenced_type" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "self_type" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "size" : 112,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGamma",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "name" : "OMX_CONFIG_GAMMATYPE",
   "referenced_type" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "self_type" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nX",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nY",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "name" : "OMX_CONFIG_POINTTYPE",
   "referenced_type" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "self_type" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nGroupPriority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGroupID",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "name" : "OMX_PRIORITYMGMTTYPE",
   "referenced_type" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "self_type" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eDither",
     "field_offset" : 96,
     "referenced_type" : "_ZTI14OMX_DITHERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "name" : "OMX_CONFIG_DITHERTYPE",
   "referenced_type" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "self_type" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eMirror",
     "field_offset" : 96,
     "referenced_type" : "_ZTI14OMX_MIRRORTYPE"
    }
   ],
   "linker_set_key" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "name" : "OMX_CONFIG_MIRRORTYPE",
   "referenced_type" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "self_type" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 48,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eUnitType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI16OMX_DATAUNITTYPE"
    },
    {
     "field_name" : "eEncapsulationType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI29OMX_DATAUNITENCAPSULATIONTYPE"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "name" : "OMX_PARAM_DATAUNITTYPE",
   "referenced_type" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "self_type" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "_ZTI22OMX_VIDEO_RVFORMATTYPE"
    },
    {
     "field_name" : "nBitsPerPixel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nPaddedWidth",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nPaddedHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitstreamFlags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitstreamVersion",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxEncodeFrameSize",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnablePostFilter",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableTemporalInterpolation",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableLatencyMode",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "name" : "OMX_VIDEO_PARAM_RVTYPE",
   "referenced_type" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "self_type" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "size" : 52,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nARGBColor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nARGBMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "name" : "OMX_CONFIG_COLORKEYTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nContrast",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "name" : "OMX_CONFIG_CONTRASTTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRotation",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "name" : "OMX_CONFIG_ROTATIONTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eNaluFormat",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_NALUFORMATSTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_NALSTREAMFORMATTYPE",
   "name" : "OMX_NALSTREAMFORMATTYPE",
   "referenced_type" : "_ZTI23OMX_NALSTREAMFORMATTYPE",
   "self_type" : "_ZTI23OMX_NALSTREAMFORMATTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI17OMX_EXTRADATATYPE"
    },
    {
     "field_name" : "nDataSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "name" : "OMX_OTHER_EXTRADATATYPE",
   "referenced_type" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "self_type" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bUseHadamard",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nRefFrames",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRefIdx10ActiveMinus1",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRefIdx11ActiveMinus1",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableUEP",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableFMO",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableASO",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableRS",
     "field_offset" : 416,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 448,
     "referenced_type" : "_ZTI24OMX_VIDEO_AVCPROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 480,
     "referenced_type" : "_ZTI22OMX_VIDEO_AVCLEVELTYPE"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFrameMBsOnly",
     "field_offset" : 544,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bMBAFF",
     "field_offset" : 576,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEntropyCodingCABAC",
     "field_offset" : 608,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bWeightedPPrediction",
     "field_offset" : 640,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nWeightedBipredicitonMode",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bconstIpred",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bDirect8x8Inference",
     "field_offset" : 736,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bDirectSpatialTemporal",
     "field_offset" : 768,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nCabacInitIdc",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eLoopFilterMode",
     "field_offset" : 832,
     "referenced_type" : "_ZTI27OMX_VIDEO_AVCLOOPFILTERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "name" : "OMX_VIDEO_PARAM_AVCTYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "size" : 108,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTI24OMX_VIDEO_VP8PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_VIDEO_VP8LEVELTYPE"
    },
    {
     "field_name" : "nDCTPartitions",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_VP8TYPE",
   "name" : "OMX_VIDEO_PARAM_VP8TYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_VP8TYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_VP8TYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTI24OMX_VIDEO_VP9PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_VIDEO_VP9LEVELTYPE"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nTileRows",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTileColumns",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableFrameParallelDecoding",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_VP9TYPE",
   "name" : "OMX_VIDEO_PARAM_VP9TYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_VP9TYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_VP9TYPE",
   "size" : 36,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_VIDEO_WMVFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "name" : "OMX_VIDEO_PARAM_WMVTYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBacklight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeout",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "name" : "OMX_CONFIG_BACKLIGHTTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xEncodeFramerate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "name" : "OMX_CONFIG_FRAMERATETYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "self_type" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bStab",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "name" : "OMX_CONFIG_FRAMESTABTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nLightness",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "name" : "OMX_CONFIG_LIGHTNESSTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDeblocking",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "name" : "OMX_PARAM_DEBLOCKINGTYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "self_type" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nInterleavePortIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "name" : "OMX_PARAM_INTERLEAVETYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "self_type" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bOneShot",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sFrameSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTI17OMX_FRAMESIZETYPE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "name" : "OMX_PARAM_SENSORMODETYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "self_type" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "size" : 40,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNaluBytes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "name" : "OMX_VIDEO_CONFIG_NALSIZE",
   "referenced_type" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "self_type" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "_ZTI25OMX_VIDEO_H263PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "_ZTI23OMX_VIDEO_H263LEVELTYPE"
    },
    {
     "field_name" : "bPLUSPTYPEAllowed",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bForceRoundingTypeToZero",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nPictureHeaderRepetition",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGOBHeaderInterval",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "name" : "OMX_VIDEO_PARAM_H263TYPE",
   "referenced_type" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "self_type" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTI25OMX_VIDEO_HEVCPROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTI23OMX_VIDEO_HEVCLEVELTYPE"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_VIDEO_PARAM_HEVCTYPE",
   "name" : "OMX_VIDEO_PARAM_HEVCTYPE",
   "referenced_type" : "_ZTI24OMX_VIDEO_PARAM_HEVCTYPE",
   "self_type" : "_ZTI24OMX_VIDEO_PARAM_HEVCTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pName",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "pInitialize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "name" : "OMX_COMPONENTREGISTERTYPE",
   "referenced_type" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "self_type" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBrightness",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "name" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRGBAlphaConstant",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eColorBlend",
     "field_offset" : 128,
     "referenced_type" : "_ZTI18OMX_COLORBLENDTYPE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "name" : "OMX_CONFIG_COLORBLENDTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDepth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAlpha",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "name" : "OMX_CONFIG_PLANEBLENDTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSaturation",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "name" : "OMX_CONFIG_SATURATIONTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFocusStatus",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_FOCUSSTATUSTYPE"
    },
    {
     "field_name" : "bCenterStatus",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bLeftStatus",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bRightStatus",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopStatus",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomStatus",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopLeftStatus",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopRightStatus",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomLeftStatus",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomRightStatus",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "name" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "referenced_type" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "self_type" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "size" : 52,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMacroblocks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "name" : "OMX_PARAM_MACROBLOCKSTYPE",
   "referenced_type" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "self_type" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "_ZTI26OMX_VIDEO_MPEG2PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "_ZTI24OMX_VIDEO_MPEG2LEVELTYPE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bSVH",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bGov",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIDCVLCThreshold",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bACPred",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nMaxPacketSize",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeIncRes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 384,
     "referenced_type" : "_ZTI26OMX_VIDEO_MPEG4PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 416,
     "referenced_type" : "_ZTI24OMX_VIDEO_MPEG4LEVELTYPE"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeaderExtension",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bReversibleVLC",
     "field_offset" : 512,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "size" : 68,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "b16x16",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b16x8",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x16",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x8",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x4",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b4x8",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b4x4",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "name" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "size" : 40,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nMediaTimeUs",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nSystemTimeNs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_RENDEREVENTTYPE",
   "name" : "OMX_VIDEO_RENDEREVENTTYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_RENDEREVENTTYPE",
   "self_type" : "_ZTI25OMX_VIDEO_RENDEREVENTTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bContinuous",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bFrameLimited",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nFrameLimit",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "name" : "OMX_CONFIG_CAPTUREMODETYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "self_type" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bCenter",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bLeft",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bRight",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTop",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottom",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopLeft",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopRight",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomLeft",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomRight",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "name" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eImageFilter",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_IMAGEFILTERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "name" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xWidth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xHeight",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "name" : "OMX_CONFIG_SCALEFACTORTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "cRole",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA128_h"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "name" : "OMX_PARAM_COMPONENTROLETYPE",
   "referenced_type" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "self_type" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "size" : 136,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumSliceGroups",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nSliceGroupMapType",
     "field_offset" : 104,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "eSliceMode",
     "field_offset" : 128,
     "referenced_type" : "_ZTI26OMX_VIDEO_AVCSLICEMODETYPE"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "name" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "referenced_type" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "self_type" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eControlRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTI25OMX_VIDEO_CONTROLRATETYPE"
    },
    {
     "field_offset" : 128,
     "referenced_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "referenced_type" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "self_type" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDepedentSegments",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableLoopFilterAcrossSlices",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_VIDEO_SLICESEGMENTSTYPE",
   "name" : "OMX_VIDEO_SLICESEGMENTSTYPE",
   "referenced_type" : "_ZTI27OMX_VIDEO_SLICESEGMENTSTYPE",
   "self_type" : "_ZTI27OMX_VIDEO_SLICESEGMENTSTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eMetering",
     "field_offset" : 96,
     "referenced_type" : "_ZTI16OMX_METERINGTYPE"
    },
    {
     "field_name" : "xEVCompensation",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nApertureFNumber",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoAperture",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nShutterSpeedMsec",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoShutterSpeed",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nSensitivity",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoSensitivity",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "name" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "referenced_type" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "self_type" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "size" : 44,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eBufferSupplier",
     "field_offset" : 96,
     "referenced_type" : "_ZTI22OMX_BUFFERSUPPLIERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "name" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "referenced_type" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "self_type" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nEncodeBitrate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "name" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "referenced_type" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "self_type" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitrate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 352,
     "referenced_type" : "_ZTI20OMX_VIDEO_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 384,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "name" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "size" : 64,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xColorMatrix",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA3_A3_i"
    },
    {
     "field_name" : "xColorOffset",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA4_i"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "name" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "size" : 64,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eExposureControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_EXPOSURECONTROLTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "name" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "IntraRefreshVOP",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "name" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eWhiteBalControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_WHITEBALCONTROLTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "name" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20OMX_VIDEO_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "self_type" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bColorEnhancement",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nCustomizedU",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nCustomizedV",
     "field_offset" : 136,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "name" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "name" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eEffect",
     "field_offset" : 96,
     "referenced_type" : "_ZTI24OMX_TRANSITIONEFFECTTYPE"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "name" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIDRPeriod",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "name" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "referenced_type" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "self_type" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bPreviousFrameRefresh",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bGoldenFrameRefresh",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bAlternateFrameRefresh",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bUsePreviousFrame",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bUseGoldenFrame",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bUseAlternateFrame",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "referenced_type" : "_ZTI31OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "self_type" : "_ZTI31OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "size" : 36,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eRefreshMode",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_VIDEO_INTRAREFRESHTYPE"
    },
    {
     "field_name" : "nAirMBs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAirRef",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nCirMBs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eAccuracy",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_VIDEO_MOTIONVECTORTYPE"
    },
    {
     "field_name" : "bUnrestrictedMVs",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bFourMV",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sXSearchRange",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sYSearchRange",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "name" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nProfileIndex",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "name" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpI",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpP",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpB",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "name" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nErrMapSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ErrMap",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "name" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "referenced_type" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "self_type" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cKey",
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "eValueType",
     "field_offset" : 1024,
     "referenced_type" : "_ZTI28OMX_ANDROID_VENDOR_VALUETYPE"
    },
    {
     "field_name" : "bSet",
     "field_offset" : 1056,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_offset" : 1088,
     "referenced_type" : "_ZTIN35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPEUt_E"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "referenced_type" : "_ZTI35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "self_type" : "_ZTI35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "size" : 264,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableHEC",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableResync",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nResynchMarkerSpacing",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableDataPartitioning",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableRVLC",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "name" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "referenced_type" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "self_type" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableVFU",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nFirstGOB",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFirstMB",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumMBs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "name" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "referenced_type" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "self_type" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bIsIntraFrame",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bIsGoldenOrAlternateFrame",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "referenced_type" : "_ZTI35OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "self_type" : "_ZTI35OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nTileWidth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTileHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGridRows",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGridCols",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI37OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "referenced_type" : "_ZTI37OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "self_type" : "_ZTI37OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eTemporalPattern",
     "field_offset" : 128,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_VPXTEMPORALLAYERPATTERNTYPE"
    },
    {
     "field_name" : "nTemporalLayerCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTemporalLayerBitrateRatio",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA3_j"
    },
    {
     "field_name" : "nMinQuantizer",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxQuantizer",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI38OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "referenced_type" : "_ZTI38OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "self_type" : "_ZTI38OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "size" : 44,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cName",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "eDir",
     "field_offset" : 1120,
     "referenced_type" : "_ZTI11OMX_DIRTYPE"
    },
    {
     "field_name" : "nParamCount",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nParamSizeUsed",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "param",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIA1_35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE"
    }
   ],
   "linker_set_key" : "_ZTI39OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "referenced_type" : "_ZTI39OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "self_type" : "_ZTI39OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "size" : 416,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRefreshPeriod",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI41OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "referenced_type" : "_ZTI41OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "self_type" : "_ZTI41OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eSupportedPatterns",
     "field_offset" : 96,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_TEMPORALLAYERINGPATTERNTYPE"
    },
    {
     "field_name" : "nLayerCountMax",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBLayerCountMax",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 192,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_TEMPORALLAYERINGPATTERNTYPE"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI44OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "_ZTI44OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "self_type" : "_ZTI44OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "size" : 72,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 96,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_TEMPORALLAYERINGPATTERNTYPE"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI45OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "_ZTI45OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "self_type" : "_ZTI45OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "size" : 60,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8OMX_BS32",
   "name" : "OMX_BS32",
   "referenced_type" : "_ZTI8OMX_BS32",
   "self_type" : "_ZTI8OMX_BS32",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8OMX_BU32",
   "name" : "OMX_BU32",
   "referenced_type" : "_ZTI8OMX_BU32",
   "self_type" : "_ZTI8OMX_BU32",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include_vndk/log/log_time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nVersionMajor",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nVersionMinor",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nRevision",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nStep",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "name" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5)",
   "referenced_type" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "self_type" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTargetBitrate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQualityFactor",
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:270:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "self_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nInt32",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nInt64",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "cString",
     "referenced_type" : "_ZTIA128_h"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPEUt_E",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:140:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPEUt_E",
   "self_type" : "_ZTIN35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPEUt_E",
   "size" : 128,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10IInterfaceE",
   "name" : "android::IInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10IInterfaceE",
   "self_type" : "_ZTIN7android10IInterfaceE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android10ParcelableE",
   "name" : "android::Parcelable",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10ParcelableE",
   "self_type" : "_ZTIN7android10ParcelableE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcelable.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10ParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKm"
    }
   ],
   "linker_set_key" : "_ZTIN7android10VectorImplE",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10VectorImplE",
   "self_type" : "_ZTIN7android10VectorImplE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "name" : "android::BnInterface<android::IMemoryHeap>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android11IMemoryHeapE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12IOMXObserverE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE",
   "name" : "android::BnInterface<android::IOMXObserver>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android12IOMXObserverE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IOMXObserver10onMessagesERKNSt3__14listINS_11omx_messageENS1_9allocatorIS3_EEEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7IMemoryE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE",
   "name" : "android::BnInterface<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android7IMemoryE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPlPm"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8IOMXNodeE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE",
   "name" : "android::BnInterface<android::IOMXNode>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android8IOMXNodeE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12IOMXObserverE"
    },
    {
     "referenced_type" : "_ZTIN7android9BpRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BpInterfaceINS_12IOMXObserverEEE",
   "name" : "android::BpInterface<android::IOMXObserver>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BpInterfaceINS_12IOMXObserverEEE",
   "self_type" : "_ZTIN7android11BpInterfaceINS_12IOMXObserverEEE",
   "size" : 56,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android12IOMXObserverE" ],
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_12IOMXObserverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12IOMXObserver22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IOMXObserver10onMessagesERKNSt3__14listINS_11omx_messageENS1_9allocatorIS3_EEEE"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8IOMXNodeE"
    },
    {
     "referenced_type" : "_ZTIN7android9BpRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BpInterfaceINS_8IOMXNodeEEE",
   "name" : "android::BpInterface<android::IOMXNode>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BpInterfaceINS_8IOMXNodeEEE",
   "self_type" : "_ZTIN7android11BpInterfaceINS_8IOMXNodeEEE",
   "size" : 56,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android8IOMXNodeE" ],
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_8IOMXNodeEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8IOMXNodeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mBpBinder",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android7IBinderE"
    },
    {
     "access" : "protected",
     "field_name" : "mBp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android2spINS_9BpOMXNodeEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mBase",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android2spINS_8IOMXNodeEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mHalVariant",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__17variantIJNS_9monostateEN7android2spINS2_8hardware5media3omx4V1_08IOmxNodeEEEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mHasConverter",
     "field_offset" : 384,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEEE",
   "name" : "android::HpInterface<android::BpOMXNode, android::hardware::media::omx::V1_0::utils::LWOmxNode>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEEE",
   "self_type" : "_ZTIN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEEE",
   "size" : 72,
   "source_file" : "system/libhidl/transport/token/1.0/utils/include/hidl/HybridInterface.h",
   "template_args" :
   [
    "_ZTIN7android9BpOMXNodeE",
    "_ZTIN7android8hardware5media3omx4V1_05utils9LWOmxNodeE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 56,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEE13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11IMemoryHeapE",
   "name" : "android::IMemoryHeap",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11IMemoryHeapE",
   "self_type" : "_ZTIN7android11IMemoryHeapE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IMemoryHeapD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11IMemoryHeap22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11IMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11IMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN7android11omx_message18$EMPTY_BUFFER_DONEE"
    },
    {
     "field_name" : "fenceFd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android11omx_messageUt0_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android11omx_messageE",
   "name" : "android::omx_message",
   "referenced_type" : "_ZTIN7android11omx_messageE",
   "self_type" : "_ZTIN7android11omx_messageE",
   "size" : 32,
   "source_file" : "frameworks/av/media/libmedia/include/media/IOMX.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "event_data",
     "referenced_type" : "_ZTIN7android11omx_messageUt0_Ut_E"
    },
    {
     "field_name" : "buffer_data",
     "referenced_type" : "_ZTIN7android11omx_messageUt0_Ut0_E"
    },
    {
     "field_name" : "extended_buffer_data",
     "referenced_type" : "_ZTIN7android11omx_messageUt0_Ut1_E"
    },
    {
     "field_name" : "render_data",
     "referenced_type" : "_ZTIN7android11omx_messageUt0_Ut2_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android11omx_messageUt0_E",
   "name" : "android::omx_message::(anonymous union at frameworks/av/media/libmedia/include/media/IOMX.h:193:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android11omx_messageUt0_E",
   "self_type" : "_ZTIN7android11omx_messageUt0_E",
   "size" : 24,
   "source_file" : "frameworks/av/media/libmedia/include/media/IOMX.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android11omx_messageUt0_Ut0_E",
   "name" : "android::omx_message::(anonymous union at frameworks/av/media/libmedia/include/media/IOMX.h:193:5)::(anonymous struct at frameworks/av/media/libmedia/include/media/IOMX.h:204:9)",
   "referenced_type" : "_ZTIN7android11omx_messageUt0_Ut0_E",
   "self_type" : "_ZTIN7android11omx_messageUt0_Ut0_E",
   "size" : 4,
   "source_file" : "frameworks/av/media/libmedia/include/media/IOMX.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "range_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "range_length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android11omx_messageUt0_Ut1_E",
   "name" : "android::omx_message::(anonymous union at frameworks/av/media/libmedia/include/media/IOMX.h:193:5)::(anonymous struct at frameworks/av/media/libmedia/include/media/IOMX.h:209:9)",
   "referenced_type" : "_ZTIN7android11omx_messageUt0_Ut1_E",
   "self_type" : "_ZTIN7android11omx_messageUt0_Ut1_E",
   "size" : 24,
   "source_file" : "frameworks/av/media/libmedia/include/media/IOMX.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nanoTime",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android11omx_messageUt0_Ut2_E",
   "name" : "android::omx_message::(anonymous union at frameworks/av/media/libmedia/include/media/IOMX.h:193:5)::(anonymous struct at frameworks/av/media/libmedia/include/media/IOMX.h:218:9)",
   "referenced_type" : "_ZTIN7android11omx_messageUt0_Ut2_E",
   "self_type" : "_ZTIN7android11omx_messageUt0_Ut2_E",
   "size" : 16,
   "source_file" : "frameworks/av/media/libmedia/include/media/IOMX.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "event",
     "referenced_type" : "_ZTI13OMX_EVENTTYPE"
    },
    {
     "field_name" : "data1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data3",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data4",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android11omx_messageUt0_Ut_E",
   "name" : "android::omx_message::(anonymous union at frameworks/av/media/libmedia/include/media/IOMX.h:193:5)::(anonymous struct at frameworks/av/media/libmedia/include/media/IOMX.h:195:9)",
   "referenced_type" : "_ZTIN7android11omx_messageUt0_Ut_E",
   "self_type" : "_ZTIN7android11omx_messageUt0_Ut_E",
   "size" : 20,
   "source_file" : "frameworks/av/media/libmedia/include/media/IOMX.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12BnMemoryHeapE",
   "name" : "android::BnMemoryHeap",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12BnMemoryHeapE",
   "self_type" : "_ZTIN7android12BnMemoryHeapE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware20hidl_death_recipientE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "recipient",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2wpINS_7IBinder14DeathRecipientEEE"
    },
    {
     "field_name" : "cookie",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "who",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android2wpINS_7IBinderEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryE",
   "name" : "android::H2BConverter<IOmxNode, BnOMXNode>::Obituary",
   "referenced_type" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryE",
   "self_type" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryE",
   "size" : 72,
   "source_file" : "system/libhidl/transport/token/1.0/utils/include/hidl/HybridInterface.h",
   "vtable_components" :
   [
    {
     "component_value" : 56,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryE"
    },
    {
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8Obituary11serviceDiedEmRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android9BnOMXNodeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mBase",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_08IOmxNodeEEE"
    },
    {
     "access" : "private",
     "field_name" : "mObituariesLock",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mObituaries",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2spINS1_12H2BConverterINS1_8hardware5media3omx4V1_08IOmxNodeENS1_9BnOMXNodeEE8ObituaryEEENS_9allocatorISC_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEEE",
   "name" : "android::H2BConverter<android::hardware::media::omx::V1_0::IOmxNode, android::BnOMXNode>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEEE",
   "self_type" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEEE",
   "size" : 120,
   "source_file" : "system/libhidl/transport/token/1.0/utils/include/hidl/HybridInterface.h",
   "template_args" :
   [
    "_ZTIN7android8hardware5media3omx4V1_08IOmxNodeE",
    "_ZTIN7android9BnOMXNodeE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 104,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE10onTransactEjRKNS_6ParcelEPS8_j"
    },
    {
     "mangled_component_name" : "_ZNK7android9BnOMXNode8isSecureEv"
    },
    {
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPSB_"
    },
    {
     "component_value" : 96,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPSB_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE10onTransactEjRKNS_6ParcelEPS8_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -104,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -104,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12IOMXObserverE",
   "name" : "android::IOMXObserver",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12IOMXObserverE",
   "self_type" : "_ZTIN7android12IOMXObserverE",
   "size" : 24,
   "source_file" : "frameworks/av/media/libmedia/include/media/IOMX.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12IOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12IOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12IOMXObserverD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12IOMXObserver22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IOMXObserver10onMessagesERKNSt3__14listINS_11omx_messageENS1_9allocatorIS3_EEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12IOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12IOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12IOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android12NativeHandleE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android19VirtualLightRefBaseE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12NativeHandleE",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12NativeHandleE",
   "self_type" : "_ZTIN7android12NativeHandleE",
   "size" : 24,
   "source_file" : "system/core/libutils/include/utils/NativeHandle.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android13BnOMXObserverE",
   "name" : "android::BnOMXObserver",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android13BnOMXObserverE",
   "self_type" : "_ZTIN7android13BnOMXObserverE",
   "size" : 48,
   "source_file" : "frameworks/av/media/libmedia/include/media/IOMX.h",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13BnOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13BnOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13BnOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IOMXObserver10onMessagesERKNSt3__14listINS_11omx_messageENS1_9allocatorIS3_EEEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android13BnOMXObserver10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13BnOMXObserverE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android13BnOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android13BnOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android13BnOMXObserver10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13BnOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android13BnOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android13BnOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14ReferenceMoverE",
   "self_type" : "_ZTIN7android14ReferenceMoverE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm26EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm26EEE",
   "name" : "android::StaticString16<26>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm26EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm26EEE",
   "size" : 64,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm30EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm30EEE",
   "name" : "android::StaticString16<30>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm30EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm30EEE",
   "size" : 72,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16FlattenableUtilsE",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16FlattenableUtilsE",
   "self_type" : "_ZTIN7android16FlattenableUtilsE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16ReferenceRenamerE",
   "self_type" : "_ZTIN7android16ReferenceRenamerE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16SortedVectorImplE",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16SortedVectorImplE",
   "self_type" : "_ZTIN7android16SortedVectorImplE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10ParcelableE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFenceFd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android18OMXFenceParcelableE",
   "name" : "android::OMXFenceParcelable",
   "referenced_type" : "_ZTIN7android18OMXFenceParcelableE",
   "self_type" : "_ZTIN7android18OMXFenceParcelableE",
   "size" : 16,
   "source_file" : "frameworks/av/media/libmedia/include/media/OMXFenceParcelable.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android18OMXFenceParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android18OMXFenceParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android18OMXFenceParcelableD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android18OMXFenceParcelable13writeToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android18OMXFenceParcelable14readFromParcelEPKNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String8.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String16.h",
   "template_args" : [ "_ZTIN7android8String16E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "self_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "name" : "android::sp<android::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "self_type" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android10IInterfaceE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android10RpcSessionE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "name" : "android::sp<android::RpcSession>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "self_type" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android10RpcSessionE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryEEE",
   "name" : "android::sp<android::H2BConverter<IOmxNode, BnOMXNode>::Obituary>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryEEE",
   "self_type" : "_ZTIN7android2spINS_12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android12IOMXObserverE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_12IOMXObserverEEE",
   "name" : "android::sp<android::IOMXObserver>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_12IOMXObserverEEE",
   "self_type" : "_ZTIN7android2spINS_12IOMXObserverEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android12IOMXObserverE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android12NativeHandleE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_12NativeHandleEEE",
   "name" : "android::sp<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_12NativeHandleEEE",
   "self_type" : "_ZTIN7android2spINS_12NativeHandleEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android12NativeHandleE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android13BpOMXObserverE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_13BpOMXObserverEEE",
   "name" : "android::sp<android::BpOMXObserver>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_13BpOMXObserverEEE",
   "self_type" : "_ZTIN7android2spINS_13BpOMXObserverEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android13BpOMXObserverE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android13GraphicBufferE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_13GraphicBufferEEE",
   "name" : "android::sp<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_13GraphicBufferEEE",
   "self_type" : "_ZTIN7android2spINS_13GraphicBufferEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android13GraphicBufferE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android16IOMXBufferSourceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_16IOMXBufferSourceEEE",
   "name" : "android::sp<android::IOMXBufferSource>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_16IOMXBufferSourceEEE",
   "self_type" : "_ZTIN7android2spINS_16IOMXBufferSourceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android16IOMXBufferSourceE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl4base4V1_05IBaseE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl7manager4V1_020IServiceNotificationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IBinder14DeathRecipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7IBinder14DeathRecipientEEE",
   "name" : "android::sp<android::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7IBinder14DeathRecipientEEE",
   "self_type" : "_ZTIN7android2spINS_7IBinder14DeathRecipientEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7IBinder14DeathRecipientE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7IBinderEEE",
   "name" : "android::sp<android::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7IBinderEEE",
   "self_type" : "_ZTIN7android2spINS_7IBinderEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7IBinderE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IMemoryE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7IMemoryEEE",
   "name" : "android::sp<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7IMemoryEEE",
   "self_type" : "_ZTIN7android2spINS_7IMemoryEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7IMemoryE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8IOMXNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8IOMXNodeEEE",
   "name" : "android::sp<android::IOMXNode>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8IOMXNodeEEE",
   "self_type" : "_ZTIN7android2spINS_8IOMXNodeEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8IOMXNodeE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware20hidl_death_recipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware20hidl_death_recipientE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media3omx4V1_012IOmxObserverE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media3omx4V1_012IOmxObserverEEE",
   "name" : "android::sp<android::hardware::media::omx::V1_0::IOmxObserver>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_012IOmxObserverEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_012IOmxObserverEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media3omx4V1_012IOmxObserverE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media3omx4V1_016IOmxBufferSourceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media3omx4V1_016IOmxBufferSourceEEE",
   "name" : "android::sp<android::hardware::media::omx::V1_0::IOmxBufferSource>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_016IOmxBufferSourceEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_016IOmxBufferSourceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media3omx4V1_016IOmxBufferSourceE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media3omx4V1_05utils9LWOmxNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media3omx4V1_05utils9LWOmxNodeEEE",
   "name" : "android::sp<android::hardware::media::omx::V1_0::utils::LWOmxNode>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_05utils9LWOmxNodeEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_05utils9LWOmxNodeEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media3omx4V1_05utils9LWOmxNodeE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media3omx4V1_08IOmxNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media3omx4V1_08IOmxNodeEEE",
   "name" : "android::sp<android::hardware::media::omx::V1_0::IOmxNode>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_08IOmxNodeEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_08IOmxNodeEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media3omx4V1_08IOmxNodeE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android9BpOMXNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_9BpOMXNodeEEE",
   "name" : "android::sp<android::BpOMXNode>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_9BpOMXNodeEEE",
   "self_type" : "_ZTIN7android2spINS_9BpOMXNodeEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android9BpOMXNodeE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IBinder14DeathRecipientE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_7IBinder14DeathRecipientEEE",
   "name" : "android::wp<android::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_7IBinder14DeathRecipientEEE",
   "self_type" : "_ZTIN7android2wpINS_7IBinder14DeathRecipientEEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android7IBinder14DeathRecipientE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IBinderE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_7IBinderEEE",
   "name" : "android::wp<android::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_7IBinderEEE",
   "self_type" : "_ZTIN7android2wpINS_7IBinderEEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android7IBinderE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mName",
     "referenced_type" : "_ZTIN7android7String8E"
    },
    {
     "field_name" : "mRoles",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android4ListINS_7String8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4IOMX13ComponentInfoE",
   "name" : "android::IOMX::ComponentInfo",
   "referenced_type" : "_ZTIN7android4IOMX13ComponentInfoE",
   "self_type" : "_ZTIN7android4IOMX13ComponentInfoE",
   "size" : 24,
   "source_file" : "frameworks/av/media/libmedia/include/media/IOMX.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4IOMXE",
   "name" : "android::IOMX",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4IOMXE",
   "self_type" : "_ZTIN7android4IOMXE",
   "size" : 16,
   "source_file" : "frameworks/av/media/libmedia/include/media/IOMX.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4IOMXE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4IOMXD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4IOMXD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IOMX9listNodesEPNS_4ListINS0_13ComponentInfoEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IOMX12allocateNodeEPKcRKNS_2spINS_12IOMXObserverEEEPNS3_INS_8IOMXNodeEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IOMX18createInputSurfaceEPNS_2spINS_22IGraphicBufferProducerEEEPNS1_INS_8hardware5media3omx4V1_020IGraphicBufferSourceEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android4ListINS_7String8EE5_NodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4ListINS_7String8EEE",
   "name" : "android::List<android::String8>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4ListINS_7String8EEE",
   "self_type" : "_ZTIN7android4ListINS_7String8EEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/List.h",
   "template_args" : [ "_ZTIN7android7String8E" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_7String8EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7String8EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7String8EED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base11borrowed_fdE",
   "name" : "android::base::borrowed_fd",
   "referenced_type" : "_ZTIN7android4base11borrowed_fdE",
   "self_type" : "_ZTIN7android4base11borrowed_fdE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base13DefaultCloserE",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "_ZTIN7android4base13DefaultCloserE",
   "self_type" : "_ZTIN7android4base13DefaultCloserE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h",
   "template_args" : [ "_ZTIN7android4base13DefaultCloserE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "name" : "android::hidl::base::V1_0::IBase",
   "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "self_type" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android4hidl4base4V1_09DebugInfo12ArchitectureE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "referenced_type" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "self_type" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "self_type" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6ADebugE",
   "name" : "android::ADebug",
   "referenced_type" : "_ZTIN7android6ADebugE",
   "self_type" : "_ZTIN7android6ADebugE",
   "size" : 1,
   "source_file" : "frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ADebug.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android6Parcel4BlobE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel12ReadableBlobE",
   "name" : "android::Parcel::ReadableBlob",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel12ReadableBlobE",
   "self_type" : "_ZTIN7android6Parcel12ReadableBlobE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android6Parcel4BlobE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel12WritableBlobE",
   "name" : "android::Parcel::WritableBlob",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel12WritableBlobE",
   "self_type" : "_ZTIN7android6Parcel12WritableBlobE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNS_2spEEE",
   "name" : "android::Parcel::is_specialization<int, android::sp>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNS_2spEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNS_2spEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110shared_ptrEEE",
   "name" : "android::Parcel::is_specialization<int, std::shared_ptr>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110shared_ptrEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110shared_ptrEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110unique_ptrEEE",
   "name" : "android::Parcel::is_specialization<int, std::unique_ptr>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110unique_ptrEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110unique_ptrEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__16vectorEEE",
   "name" : "android::Parcel::is_specialization<int, std::vector>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__16vectorEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__16vectorEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__18optionalEEE",
   "name" : "android::Parcel::is_specialization<int, std::optional>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__18optionalEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__18optionalEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE",
   "name" : "android::Parcel::FlattenableHelperInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE",
   "self_type" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface16getFlattenedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface10getFdCountEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface7flattenEPvmPim"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Parcel26FlattenableHelperInterface9unflattenEPKvmPKim"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFd",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "mMutable",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel4BlobE",
   "name" : "android::Parcel::Blob",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel4BlobE",
   "self_type" : "_ZTIN7android6Parcel4BlobE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mError",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPy"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSorted",
     "field_offset" : 576,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mRequestHeaderPresent",
     "field_offset" : 584,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mWorkSourceRequestHeaderPosition",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 704,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 712,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 720,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mDeallocZero",
     "field_offset" : 728,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvPN7android6ParcelEPKhmPKymE"
    },
    {
     "access" : "private",
     "field_name" : "mSession",
     "field_offset" : 832,
     "referenced_type" : "_ZTIN7android2spINS_10RpcSessionEEE"
    },
    {
     "access" : "private",
     "field_name" : "mOpenAshmemSize",
     "field_offset" : 896,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android6ParcelE",
   "name" : "android::Parcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6ParcelE",
   "self_type" : "_ZTIN7android6ParcelE",
   "size" : 120,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android7String8E"
    }
   ],
   "linker_set_key" : "_ZTIN7android6binder6StatusE",
   "name" : "android::binder::Status",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6binder6StatusE",
   "self_type" : "_ZTIN7android6binder6StatusE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/include/binder/Status.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mAllocSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android7AStringE",
   "name" : "android::AString",
   "referenced_type" : "_ZTIN7android7AStringE",
   "self_type" : "_ZTIN7android7AStringE",
   "size" : 24,
   "source_file" : "frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AString.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7IBinderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16atomicIPN7android7BBinder6ExtrasEEE"
    },
    {
     "access" : "private",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android7BBinderUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android7BBinderE",
   "name" : "android::BBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7BBinderE",
   "self_type" : "_ZTIN7android7BBinderE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/include/binder/Binder.h",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mStability",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mReserved0",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7BBinderUt_E",
   "name" : "android::BBinder::(anonymous union at frameworks/native/libs/binder/include/binder/Binder.h:117:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android7BBinderUt_E",
   "self_type" : "_ZTIN7android7BBinderUt_E",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Binder.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7IBinder14DeathRecipientE",
   "name" : "android::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7IBinder14DeathRecipientE",
   "self_type" : "_ZTIN7android7IBinder14DeathRecipientE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IBinder.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipient10binderDiedERKNS_2wpIS0_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7IBinderE",
   "name" : "android::IBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7IBinderE",
   "self_type" : "_ZTIN7android7IBinderE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IBinder.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder13isBinderAliveEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder10pingBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder11linkToDeathERKNS_2spINS0_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder13unlinkToDeathERKNS_2wpINS0_14DeathRecipientEEEPvjPS3_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7IMemoryE",
   "name" : "android::IMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7IMemoryE",
   "self_type" : "_ZTIN7android7IMemoryE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IMemoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7IMemory22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPlPm"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIN7android7RefBaseE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN7android7String8E",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7String8E",
   "self_type" : "_ZTIN7android7String8E",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/String8.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8BnMemoryE",
   "name" : "android::BnMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8BnMemoryE",
   "self_type" : "_ZTIN7android8BnMemoryE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPlPm"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8IOMXNodeE",
   "name" : "android::IOMXNode",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8IOMXNodeE",
   "self_type" : "_ZTIN7android8IOMXNodeE",
   "size" : 24,
   "source_file" : "frameworks/av/media/libmedia/include/media/IOMX.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8IOMXNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8IOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8IOMXNodeD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8IOMXNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8IOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8IOMXNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA26_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm26EEE",
   "name" : "android::String16::StaticData<26>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm26EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm26EEE",
   "size" : 56,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA30_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm30EEE",
   "name" : "android::String16::StaticData<30>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm30EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm30EEE",
   "size" : 64,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKDs"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String16E",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8String16E",
   "self_type" : "_ZTIN7android8String16E",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10HidlMemoryE",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware10HidlMemoryE",
   "self_type" : "_ZTIN7android8hardware10HidlMemoryE",
   "size" : 64,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 72,
     "referenced_type" : "_ZTIA7_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_handleE",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "_ZTIN7android8hardware11hidl_handleE",
   "self_type" : "_ZTIN7android8hardware11hidl_handleE",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "_ZTIN7android8hardware11hidl_handleE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_memoryE",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE",
   "self_type" : "_ZTIN7android8hardware11hidl_memoryE",
   "size" : 40,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_stringE",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "_ZTIN7android8hardware11hidl_stringE",
   "self_type" : "_ZTIN7android8hardware11hidl_stringE",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12hidl_versionE",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "_ZTIN7android8hardware12hidl_versionE",
   "self_type" : "_ZTIN7android8hardware12hidl_versionE",
   "size" : 4,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "self_type" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "size" : 24,
   "source_file" : "system/libfmq/base/fmq/MQDescriptorBase.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "self_type" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "size" : 24,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEmRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "preset",
     "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_011CodecBuffer16PresetAttributesE"
    },
    {
     "field_name" : "anwBuffer",
     "referenced_type" : "_ZTIN7android8hardware5media4V1_019AnwBufferAttributesE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media3omx4V1_011CodecBuffer10AttributesE",
   "name" : "android::hardware::media::omx::V1_0::CodecBuffer::Attributes",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_011CodecBuffer10AttributesE",
   "self_type" : "_ZTIN7android8hardware5media3omx4V1_011CodecBuffer10AttributesE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rangeOffset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rangeLength",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media3omx4V1_011CodecBuffer16PresetAttributesE",
   "name" : "android::hardware::media::omx::V1_0::CodecBuffer::PresetAttributes",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_011CodecBuffer16PresetAttributesE",
   "self_type" : "_ZTIN7android8hardware5media3omx4V1_011CodecBuffer16PresetAttributesE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_011CodecBuffer4TypeE"
    },
    {
     "field_name" : "attr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_011CodecBuffer10AttributesE"
    },
    {
     "field_name" : "nativeHandle",
     "field_offset" : 384,
     "referenced_type" : "_ZTIN7android8hardware11hidl_handleE"
    },
    {
     "field_name" : "sharedMemory",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media3omx4V1_011CodecBufferE",
   "name" : "android::hardware::media::omx::V1_0::CodecBuffer",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_011CodecBufferE",
   "self_type" : "_ZTIN7android8hardware5media3omx4V1_011CodecBufferE",
   "size" : 104,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "range",
     "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_012ColorAspects5RangeE"
    },
    {
     "field_name" : "primaries",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_012ColorAspects9PrimariesE"
    },
    {
     "field_name" : "transfer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_012ColorAspects8TransferE"
    },
    {
     "field_name" : "matrixCoeffs",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_012ColorAspects12MatrixCoeffsE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media3omx4V1_012ColorAspectsE",
   "name" : "android::hardware::media::omx::V1_0::ColorAspects",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_012ColorAspectsE",
   "self_type" : "_ZTIN7android8hardware5media3omx4V1_012ColorAspectsE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media3omx4V1_012IOmxObserverE",
   "name" : "android::hardware::media::omx::V1_0::IOmxObserver",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_012IOmxObserverE",
   "self_type" : "_ZTIN7android8hardware5media3omx4V1_012IOmxObserverE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/IOmxObserver.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_012IOmxObserverE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media3omx4V1_012IOmxObserver8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserver14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserver5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserver19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserver12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserver21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserver11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserver4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserver12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserver21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserver13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserverD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_012IOmxObserver10onMessagesERKNS0_8hidl_vecINS3_7MessageEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_012IOmxObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware5media3omx4V1_012IOmxObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware5media3omx4V1_012IOmxObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media3omx4V1_016IOmxBufferSourceE",
   "name" : "android::hardware::media::omx::V1_0::IOmxBufferSource",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_016IOmxBufferSourceE",
   "self_type" : "_ZTIN7android8hardware5media3omx4V1_016IOmxBufferSourceE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/IOmxBufferSource.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_016IOmxBufferSourceE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media3omx4V1_016IOmxBufferSource8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSourceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource14onOmxExecutingEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource9onOmxIdleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource11onOmxLoadedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource18onInputBufferAddedEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource20onInputBufferEmptiedEjRKNS0_11hidl_handleE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_016IOmxBufferSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware5media3omx4V1_016IOmxBufferSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware5media3omx4V1_016IOmxBufferSourceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media3omx4V1_05utils9LWOmxNodeE",
   "name" : "android::hardware::media::omx::V1_0::utils::LWOmxNode",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_05utils9LWOmxNodeE",
   "self_type" : "_ZTIN7android8hardware5media3omx4V1_05utils9LWOmxNodeE",
   "size" : 120,
   "source_file" : "frameworks/av/media/libmedia/include/media/omx/1.0/WOmxNode.h",
   "vtable_components" :
   [
    {
     "component_value" : 104,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_05utils9LWOmxNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode8freeNodeEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode21getGraphicBufferUsageEjPj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode10freeBufferEjj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9LWOmxNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE10onTransactEjRKNS_6ParcelEPS8_j"
    },
    {
     "mangled_component_name" : "_ZNK7android9BnOMXNode8isSecureEv"
    },
    {
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPSB_"
    },
    {
     "component_value" : 96,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_05utils9LWOmxNodeE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPSB_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware5media3omx4V1_05utils9LWOmxNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware5media3omx4V1_05utils9LWOmxNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE10onTransactEjRKNS_6ParcelEPS8_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -104,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -104,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_05utils9LWOmxNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware5media3omx4V1_05utils9LWOmxNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware5media3omx4V1_05utils9LWOmxNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_08IOmxNodeE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mBase",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2spINS_8IOMXNodeEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media3omx4V1_05utils9TWOmxNodeE",
   "name" : "android::hardware::media::omx::V1_0::utils::TWOmxNode",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_05utils9TWOmxNodeE",
   "self_type" : "_ZTIN7android8hardware5media3omx4V1_05utils9TWOmxNodeE",
   "size" : 32,
   "source_file" : "frameworks/av/media/libmedia/include/media/omx/1.0/WOmxNode.h",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_05utils9TWOmxNodeE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media3omx4V1_08IOmxNode8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_08IOmxNode14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_08IOmxNode5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_08IOmxNode19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_08IOmxNode12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_08IOmxNode21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_08IOmxNode11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_08IOmxNode4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_08IOmxNode12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_08IOmxNode21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_08IOmxNode13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9TWOmxNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9TWOmxNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9TWOmxNode8freeNodeEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9TWOmxNode11sendCommandEji"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_05utils9TWOmxNode12getParameterEjRKNS0_8hidl_vecIhEENSt3__18functionIFvNS3_6StatusES9_EEE"
    },
    {
