#ifndef HIDL_GENERATED_ANDROID_HARDWARE_WIFI_OFFLOAD_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_WIFI_OFFLOAD_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace wifi {
namespace offload {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class SecurityMode : uint8_t;
struct NetworkInfo;
enum class Capability : uint16_t;
struct ScanResult;
struct ScanParam;
struct ScanFilter;
struct ScanRecord;
enum class RecordName : uint32_t;
struct LogRecord;
struct ScanStats;
enum class OffloadStatusCode : uint32_t;
struct OffloadStatus;

/**
 * Defines a bitmap of security modes
 */
enum class SecurityMode : uint8_t {
    OPEN = 2 /* 0x1 << 1 */,
    WEP = 4 /* 0x1 << 2 */,
    PSK = 8 /* 0x1 << 3 */,
    EAP = 16 /* 0x1 << 4 */,
};

/**
 * SSID of the Access Point, maximum 32 characters
 */
typedef ::android::hardware::hidl_vec<uint8_t> Ssid;

/**
 * Preferred network information
 * SSID and associated security mode(s)
 */
struct NetworkInfo final {
    ::android::hardware::hidl_vec<uint8_t> ssid __attribute__ ((aligned(8)));
    /*
     * SecurityMode flags that are associated with this SSID
     * More than one security mode can be supported, see SecurityMode
     */
    ::android::hardware::hidl_bitfield<::android::hardware::wifi::offload::V1_0::SecurityMode> flags __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::wifi::offload::V1_0::NetworkInfo, ssid) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::NetworkInfo, flags) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::offload::V1_0::NetworkInfo) == 24, "wrong size");
static_assert(__alignof(::android::hardware::wifi::offload::V1_0::NetworkInfo) == 8, "wrong alignment");

/**
 * This is a bit mask describing the capabilities of a BSS.
 * See IEEE Std 802.11: 8.4.1.4
 */
enum class Capability : uint16_t {
    ESS = 1 /* 1 << 0 */,
    IBSS = 2 /* 1 << 1 */,
    CF_POLLABLE = 4 /* 1 << 2 */,
    CF_PLL_REQ = 8 /* 1 << 3 */,
    PRIVACY = 16 /* 1 << 4 */,
    SHORT_PREAMBLE = 32 /* 1 << 5 */,
    PBCC = 64 /* 1 << 6 */,
    CHANNEL_AGILITY = 128 /* 1 << 7 */,
    SPECTURM_MGMT = 256 /* 1 << 8 */,
    QOS = 512 /* 1 << 9 */,
    SHORT_SLOT_TIME = 1024 /* 1 << 10 */,
    APSD = 2048 /* 1 << 11 */,
    RADIO_MEASUREMENT = 4096 /* 1 << 12 */,
    DSSS_OFDM = 8192 /* 1 << 13 */,
    DELAYED_BLOCK_ACK = 16384 /* 1 << 14 */,
    IMMEDIATE_BLOCK_ACK = 32768 /* 1 << 15 */,
};

/**
 * Scan Results returned by the offload Hal
 */
struct ScanResult final {
    /*
     * Information about this BSS
     * SSID and security modes supported
     */
    ::android::hardware::wifi::offload::V1_0::NetworkInfo networkInfo __attribute__ ((aligned(8)));
    /*
     * BSSID of the BSS
     */
    ::android::hardware::hidl_array<uint8_t, 6> bssid __attribute__ ((aligned(1)));
    /*
     * Can have multiple bits set, see Capability
     */
    ::android::hardware::hidl_bitfield<::android::hardware::wifi::offload::V1_0::Capability> capability __attribute__ ((aligned(2)));
    /*
     * Frequency scanned, in mHz
     */
    uint32_t frequency __attribute__ ((aligned(4)));
    /*
     * Signal strength in dBm
     */
    int8_t rssi __attribute__ ((aligned(1)));
    /*
     * TSF found in beacon/probe response
     */
    uint64_t tsf __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanResult, networkInfo) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanResult, bssid) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanResult, capability) == 30, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanResult, frequency) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanResult, rssi) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanResult, tsf) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::offload::V1_0::ScanResult) == 48, "wrong size");
static_assert(__alignof(::android::hardware::wifi::offload::V1_0::ScanResult) == 8, "wrong alignment");

/**
 * Parameters for performing offload scans
 */
struct ScanParam final {
    /*
     * Specify a list of SSIDs to scan, an empty list implies no preferred
     * networks to scan
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_vec<uint8_t>> ssidList __attribute__ ((aligned(8)));
    /*
     * Frequencies to scan, in mHz, an empty frequency list implies a full scan
     */
    ::android::hardware::hidl_vec<uint32_t> frequencyList __attribute__ ((aligned(8)));
    /*
     * Periodicity of the scans to be performed by the offload module
     * A value of zero indicates disable periodic scans. For this revision,
     * where offload module is performing scans in disconnected mode, this value
     * should not be zero. In future versions, periodic scans can be eliminated
     */
    uint32_t disconnectedModeScanIntervalMs __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanParam, ssidList) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanParam, frequencyList) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanParam, disconnectedModeScanIntervalMs) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::offload::V1_0::ScanParam) == 40, "wrong size");
static_assert(__alignof(::android::hardware::wifi::offload::V1_0::ScanParam) == 8, "wrong alignment");

/**
 * Instruction on how to filter the scan result before performing network
 * selection and waking up the AP to connect
 */
struct ScanFilter final {
    /*
     * Preferred network List of SSIDs and their security mode of interest
     * The filter will drop the remaining scan results in the scan event.
     * An empty list implies no filtering of scan result based on SSID and
     * security mode.
     */
    ::android::hardware::hidl_vec<::android::hardware::wifi::offload::V1_0::NetworkInfo> preferredNetworkInfoList __attribute__ ((aligned(8)));
    /*
     * Minimum qualifying RSSI to be considered for network selection (dBm)
     */
    int8_t rssiThreshold __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanFilter, preferredNetworkInfoList) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanFilter, rssiThreshold) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::offload::V1_0::ScanFilter) == 24, "wrong size");
static_assert(__alignof(::android::hardware::wifi::offload::V1_0::ScanFilter) == 8, "wrong alignment");

struct ScanRecord final {
    /*
     * Amount of time spent scanning
     */
    uint64_t durationMs __attribute__ ((aligned(8)));
    /*
     * Number of channels scanned
     */
    uint32_t numChannelsScanned __attribute__ ((aligned(4)));
    /*
     * Number of entries aggregated into this record
     */
    uint32_t numEntriesAggregated __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanRecord, durationMs) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanRecord, numChannelsScanned) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanRecord, numEntriesAggregated) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::offload::V1_0::ScanRecord) == 16, "wrong size");
static_assert(__alignof(::android::hardware::wifi::offload::V1_0::ScanRecord) == 8, "wrong alignment");

/**
 * Enumerates the type of log that is recorded
 */
enum class RecordName : uint32_t {
    CMD_BASE = 4096u /* 0x00001000 */,
    /*
     * Record name corresponding to initialization
     */
    CMD_INT = 4096u /* CMD_BASE + 0 */,
    /*
     * Record name corresponding to configureScans() API
     */
    CMD_CONFIG_SCANS = 4097u /* CMD_BASE + 1 */,
    /*
     * Record name corresponding to subscribeScanResults() API
     */
    CMD_SUBSCRIBE_SCAN_RESULTS = 4098u /* CMD_BASE + 2 */,
    /*
     * Record name corresponding to unsubscribeScanResults() API
     */
    CMD_UNSUBSCRIBE_SCAN_RESULTS = 4099u /* CMD_BASE + 3 */,
    /*
     * Record name corresponding to getScanStats() API
     */
    CMD_GET_SCAN_STATS = 4100u /* CMD_BASE + 4 */,
    /*
     * Record name corresponding to a reset
     */
    CMD_RESET = 4101u /* CMD_BASE + 5 */,
    /*
     * Add new commands here
     */
    EVENT_RECVD_BASE = 8192u /* 0x00002000 */,
    /*
     * Record name corresponding to scan monitor event
     */
    EVENT_RECVD_SCAN_RESULT_ASYNC = 8192u /* EVENT_RECVD_BASE + 0 */,
    /*
     * Record name corresponding to scan response event
     */
    EVENT_RECVD_SCAN_RESULT = 8193u /* EVENT_RECVD_BASE + 1 */,
    /*
     * Add new events received here
     */
    EVENT_SENT_BASE = 12288u /* 0x00003000 */,
    /*
     * Record name corresponding to scan event sent
     */
    EVENT_SENT_SCAN_RESULT = 12288u /* EVENT_SENT_BASE + 0 */,
    /*
     * Record name corresponding to abort event sent
     */
    EVENT_SENT_ABORT = 12289u /* EVENT_SENT_BASE + 1 */,
    /*
     * Record name corresponding to error event sent
     */
    EVENT_SENT_ERROR = 12290u /* EVENT_SENT_BASE + 2 */,
    /*
     * Add new events sent here
     */
    REQ_BASE = 16384u /* 0x00004000 */,
    /*
     * Record name corresponding to scan request sent
     */
    REQ_SCAN = 16384u /* REQ_BASE + 0 */,
};

/**
 * Defines the structure of each log record
 */
struct LogRecord final {
    /*
     * Indicates the log recorded
     */
    ::android::hardware::wifi::offload::V1_0::RecordName recordName __attribute__ ((aligned(4)));
    /*
     * Platform reference time in milliseconds when the log is recorded
     */
    uint64_t logTimeMs __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::offload::V1_0::LogRecord, recordName) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::LogRecord, logTimeMs) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::offload::V1_0::LogRecord) == 16, "wrong size");
static_assert(__alignof(::android::hardware::wifi::offload::V1_0::LogRecord) == 8, "wrong alignment");

/**
 * Defines the scan statistics to be returned to the framework
 */
struct ScanStats final {
    /*
     * Incremented everytime a new scan is requested
     */
    uint32_t numScansRequestedByWifi __attribute__ ((aligned(4)));
    /*
     * Incremented everytime the scan is serviced by performing a scan
     */
    uint32_t numScansServicedByWifi __attribute__ ((aligned(4)));
    /*
     * Incremented everytime the scan is serviced by the scan cache
     */
    uint32_t numScansServicedbyCache __attribute__ ((aligned(4)));
    /*
     * The last (CHRE reference) time this data structure is updated
     */
    uint64_t lastUpdated __attribute__ ((aligned(8)));
    /*
     * The last (CHRE reference) time this data structure is read
     */
    uint64_t lastRead __attribute__ ((aligned(8)));
    /*
     * The total time when the Offload module could be performing scans (T2 - T1)
     * T1 - time when the framework subscribes for scan result (includes delayMs)
     * T2 - min (time when the framework unsubscribes for scan result,
     * currentTime)
     */
    uint64_t subscriptionDurationMs __attribute__ ((aligned(8)));
    /*
     * Histograms of the channels scanned, 802.11 and with an 8 bit
     * representation, only 256 channels are available
     */
    ::android::hardware::hidl_array<uint8_t, 256> histogramChannelsScanned __attribute__ ((aligned(1)));
    /*
     * Scan Record for this subscribe duration
     */
    ::android::hardware::hidl_vec<::android::hardware::wifi::offload::V1_0::ScanRecord> scanRecord __attribute__ ((aligned(8)));
    /*
     * Vector of the logRecord entries
     */
    ::android::hardware::hidl_vec<::android::hardware::wifi::offload::V1_0::LogRecord> logRecord __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanStats, numScansRequestedByWifi) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanStats, numScansServicedByWifi) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanStats, numScansServicedbyCache) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanStats, lastUpdated) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanStats, lastRead) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanStats, subscriptionDurationMs) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanStats, histogramChannelsScanned) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanStats, scanRecord) == 296, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::ScanStats, logRecord) == 312, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::offload::V1_0::ScanStats) == 328, "wrong size");
static_assert(__alignof(::android::hardware::wifi::offload::V1_0::ScanStats) == 8, "wrong alignment");

/**
 * Defines a list of return codes to indicate status of Offload HAL
 */
enum class OffloadStatusCode : uint32_t {
    /*
     * No error
     */
    OK = 0u,
    /*
     * No Connection to underlying implementation
     */
    NO_CONNECTION = 1u /* ::android::hardware::wifi::offload::V1_0::OffloadStatusCode.OK implicitly + 1 */,
    /*
     * Operation timeout
     */
    TIMEOUT = 2u /* ::android::hardware::wifi::offload::V1_0::OffloadStatusCode.NO_CONNECTION implicitly + 1 */,
    /*
     * Other errors
     */
    ERROR = 3u /* ::android::hardware::wifi::offload::V1_0::OffloadStatusCode.TIMEOUT implicitly + 1 */,
};

/**
 * Generic structures to return the status of an operation
 */
struct OffloadStatus final {
    ::android::hardware::wifi::offload::V1_0::OffloadStatusCode code __attribute__ ((aligned(4)));
    /*
     * Error message
     */
    ::android::hardware::hidl_string description __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::offload::V1_0::OffloadStatus, code) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::offload::V1_0::OffloadStatus, description) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::offload::V1_0::OffloadStatus) == 24, "wrong size");
static_assert(__alignof(::android::hardware::wifi::offload::V1_0::OffloadStatus) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint8_t o);
static inline std::string toString(::android::hardware::wifi::offload::V1_0::SecurityMode o);
static inline void PrintTo(::android::hardware::wifi::offload::V1_0::SecurityMode o, ::std::ostream* os);
constexpr uint8_t operator|(const ::android::hardware::wifi::offload::V1_0::SecurityMode lhs, const ::android::hardware::wifi::offload::V1_0::SecurityMode rhs) {
    return static_cast<uint8_t>(static_cast<uint8_t>(lhs) | static_cast<uint8_t>(rhs));
}
constexpr uint8_t operator|(const uint8_t lhs, const ::android::hardware::wifi::offload::V1_0::SecurityMode rhs) {
    return static_cast<uint8_t>(lhs | static_cast<uint8_t>(rhs));
}
constexpr uint8_t operator|(const ::android::hardware::wifi::offload::V1_0::SecurityMode lhs, const uint8_t rhs) {
