{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_h",
   "name" : "unsigned char [128]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA128_h",
   "size" : 128,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA16_21OMX_AUDIO_CHANNELTYPE",
   "name" : "OMX_AUDIO_CHANNELTYPE [16]",
   "referenced_type" : "_ZTI21OMX_AUDIO_CHANNELTYPE",
   "self_type" : "_ZTIA16_21OMX_AUDIO_CHANNELTYPE",
   "size" : 64,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_c",
   "name" : "char [16]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA16_c",
   "size" : 16,
   "source_file" : "frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/OMXStore.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",
   "name" : "unsigned char [16]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA16_h",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1_h",
   "name" : "unsigned char [1]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA1_h",
   "size" : 1,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA256_h",

   "linker_set_key" : "_ZTIKN7android7RefBaseE",
   "name" : "const android::RefBase",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIKN7android7RefBaseE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android7String8E",
   "name" : "const android::String8",
   "referenced_type" : "_ZTIN7android7String8E",
   "self_type" : "_ZTIKN7android7String8E",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android8OMXStore6PluginE",
   "name" : "const android::OMXStore::Plugin",
   "referenced_type" : "_ZTIN7android8OMXStore6PluginE",
   "self_type" : "_ZTIKN7android8OMXStore6PluginE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/List.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP17OMX_COMPONENTTYPE",
   "name" : "OMX_COMPONENTTYPE *const",
   "referenced_type" : "_ZTIP17OMX_COMPONENTTYPE",
   "self_type" : "_ZTIKP17OMX_COMPONENTTYPE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 4,
   "source_file" : "frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AString.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android13OMXPluginBaseE",
   "name" : "android::OMXPluginBase *const",
   "referenced_type" : "_ZTIPN7android13OMXPluginBaseE",
   "self_type" : "_ZTIKPN7android13OMXPluginBaseE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVb",
   "name" : "volatile bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIVb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Thread.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hMarkTargetComponent",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12OMX_MARKTYPE",
   "name" : "OMX_MARKTYPE",
   "referenced_type" : "_ZTI12OMX_MARKTYPE",
   "self_type" : "_ZTI12OMX_MARKTYPE",
   "size" : 8,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "_ZTI13android_ycbcr",
   "self_type" : "_ZTI13android_ycbcr",
   "size" : 56,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIN15OMX_VERSIONTYPEUt_E"
    },
    {
     "field_name" : "nVersion",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15OMX_VERSIONTYPE",
   "name" : "OMX_VERSIONTYPE",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15OMX_VERSIONTYPE",
   "self_type" : "_ZTI15OMX_VERSIONTYPE",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "EventHandler",
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_13OMX_EVENTTYPEjjS0_E"
    },
    {
     "field_name" : "EmptyBufferDone",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_P20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "FillBufferDone",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_P20OMX_BUFFERHEADERTYPEE"
    }
   ],
   "linker_set_key" : "_ZTI16OMX_CALLBACKTYPE",
   "name" : "OMX_CALLBACKTYPE",
   "referenced_type" : "_ZTI16OMX_CALLBACKTYPE",
   "self_type" : "_ZTI16OMX_CALLBACKTYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "_ZTI16android_xy_color",
   "self_type" : "_ZTI16android_xy_color",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "pComponentPrivate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pApplicationPrivate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "GetComponentVersion",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPcP15OMX_VERSIONTYPES3_PA128_hE"
    },
    {
     "field_name" : "SendCommand",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPv15OMX_COMMANDTYPEjS0_E"
    },
    {
     "field_name" : "GetParameter",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPv13OMX_INDEXTYPES0_E"
    },
    {
     "field_name" : "SetParameter",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPv13OMX_INDEXTYPES0_E"
    },
    {
     "field_name" : "GetConfig",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPv13OMX_INDEXTYPES0_E"
    },
    {
     "field_name" : "SetConfig",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPv13OMX_INDEXTYPES0_E"
    },
    {
     "field_name" : "GetExtensionIndex",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPcP13OMX_INDEXTYPEE"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvP13OMX_STATETYPEE"
    },
    {
     "field_name" : "ComponentTunnelRequest",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvjS0_jP19OMX_TUNNELSETUPTYPEE"
    },
    {
     "field_name" : "UseBuffer",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPP20OMX_BUFFERHEADERTYPEjS0_jPhE"
    },
    {
     "field_name" : "AllocateBuffer",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPP20OMX_BUFFERHEADERTYPEjS0_jE"
    },
    {
     "field_name" : "FreeBuffer",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvjP20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "EmptyThisBuffer",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvP20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "FillThisBuffer",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvP20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "SetCallbacks",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvP16OMX_CALLBACKTYPES0_E"
    },
    {
     "field_name" : "ComponentDeInit",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvE"
    },
    {
     "field_name" : "UseEGLImage",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPP20OMX_BUFFERHEADERTYPEjS0_S0_E"
    },
    {
     "field_name" : "ComponentRoleEnum",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPhjE"
    }
   ],
   "linker_set_key" : "_ZTI17OMX_COMPONENTTYPE",
   "name" : "OMX_COMPONENTTYPE",
   "referenced_type" : "_ZTI17OMX_COMPONENTTYPE",
   "self_type" : "_ZTI17OMX_COMPONENTTYPE",
   "size" : 88,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17OMX_FRAMESIZETYPE",
   "name" : "OMX_FRAMESIZETYPE",
   "referenced_type" : "_ZTI17OMX_FRAMESIZETYPE",
   "self_type" : "_ZTI17OMX_FRAMESIZETYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nU32",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17OMX_PARAM_U32TYPE",
   "name" : "OMX_PARAM_U32TYPE",
   "referenced_type" : "_ZTI17OMX_PARAM_U32TYPE",
   "self_type" : "_ZTI17OMX_PARAM_U32TYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22android_flex_component"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "_ZTI18android_flex_plane",
   "self_type" : "_ZTI18android_flex_plane",
   "size" : 32,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nLeft",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nTop",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "name" : "OMX_CONFIG_RECTTYPE",
   "referenced_type" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "self_type" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPorts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStartPortNumber",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "name" : "OMX_PORT_PARAM_TYPE",
   "referenced_type" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "self_type" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTunnelFlags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eSupplier",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22OMX_BUFFERSUPPLIERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "name" : "OMX_TUNNELSETUPTYPE",
   "referenced_type" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "self_type" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "size" : 8,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19android_flex_format"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP18android_flex_plane"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "_ZTI19android_flex_layout",
   "self_type" : "_ZTI19android_flex_layout",
   "size" : 12,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "pBuffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "nAllocLen",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFilledLen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAppPrivate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pPlatformPrivate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pInputPortPrivate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pOutputPortPrivate",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "hMarkTargetComponent",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nTickCount",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeStamp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nFlags",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nOutputPortIndex",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nInputPortIndex",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "name" : "OMX_BUFFERHEADERTYPE",
   "referenced_type" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "self_type" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "size" : 80,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGamma",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "name" : "OMX_CONFIG_GAMMATYPE",
   "referenced_type" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "self_type" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nX",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nY",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "name" : "OMX_CONFIG_POINTTYPE",
   "referenced_type" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "self_type" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nGroupPriority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGroupID",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "name" : "OMX_PRIORITYMGMTTYPE",
   "referenced_type" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "self_type" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "_ZTI20android_depth_points",
   "self_type" : "_ZTI20android_depth_points",
   "size" : 36,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eDither",
     "field_offset" : 96,
     "referenced_type" : "_ZTI14OMX_DITHERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "name" : "OMX_CONFIG_DITHERTYPE",
   "referenced_type" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "self_type" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eMirror",
     "field_offset" : 96,
     "referenced_type" : "_ZTI14OMX_MIRRORTYPE"
    }
   ],
   "linker_set_key" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "name" : "OMX_CONFIG_MIRRORTYPE",
   "referenced_type" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "self_type" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitsPerFrame",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSamplePerFrame",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nCouplingQuantBits",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nCouplingStartRegion",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumRegions",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 320,
     "referenced_type" : "_ZTI22OMX_AUDIO_RAFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_AUDIO_PARAM_RATYPE",
   "name" : "OMX_AUDIO_PARAM_RATYPE",
   "referenced_type" : "_ZTI22OMX_AUDIO_PARAM_RATYPE",
   "self_type" : "_ZTI22OMX_AUDIO_PARAM_RATYPE",
   "size" : 44,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_CONFIG_BOOLEANTYPE",
   "name" : "OMX_CONFIG_BOOLEANTYPE",
   "referenced_type" : "_ZTI22OMX_CONFIG_BOOLEANTYPE",
   "self_type" : "_ZTI22OMX_CONFIG_BOOLEANTYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eUnitType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI16OMX_DATAUNITTYPE"
    },
    {
     "field_name" : "eEncapsulationType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI29OMX_DATAUNITENCAPSULATIONTYPE"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "name" : "OMX_PARAM_DATAUNITTYPE",
   "referenced_type" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "self_type" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nClientPrivate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eUpdateType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_TIME_UPDATETYPE"
    },
    {
     "field_name" : "nMediaTimestamp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nWallTimeAtMediaTime",
     "field_offset" : 256,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "xScale",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "eState",
     "field_offset" : 352,
     "referenced_type" : "_ZTI19OMX_TIME_CLOCKSTATE"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_TIME_MEDIATIMETYPE",
   "name" : "OMX_TIME_MEDIATIMETYPE",
   "referenced_type" : "_ZTI22OMX_TIME_MEDIATIMETYPE",
   "self_type" : "_ZTI22OMX_TIME_MEDIATIMETYPE",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "_ZTI22OMX_VIDEO_RVFORMATTYPE"
    },
    {
     "field_name" : "nBitsPerPixel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nPaddedWidth",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nPaddedHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitstreamFlags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitstreamVersion",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxEncodeFrameSize",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnablePostFilter",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableTemporalInterpolation",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableLatencyMode",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "name" : "OMX_VIDEO_PARAM_RVTYPE",
   "referenced_type" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "self_type" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "size" : 52,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eAMRBandMode",
     "field_offset" : 160,
     "referenced_type" : "_ZTI25OMX_AUDIO_AMRBANDMODETYPE"
    },
    {
     "field_name" : "eAMRDTXMode",
     "field_offset" : 192,
     "referenced_type" : "_ZTI24OMX_AUDIO_AMRDTXMODETYPE"
    },
    {
     "field_name" : "eAMRFrameFormat",
     "field_offset" : 224,
     "referenced_type" : "_ZTI28OMX_AUDIO_AMRFRAMEFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_AUDIO_PARAM_AMRTYPE",
   "name" : "OMX_AUDIO_PARAM_AMRTYPE",
   "referenced_type" : "_ZTI23OMX_AUDIO_PARAM_AMRTYPE",
   "self_type" : "_ZTI23OMX_AUDIO_PARAM_AMRTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 224,
     "referenced_type" : "_ZTI25OMX_AUDIO_CHANNELMODETYPE"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 256,
     "referenced_type" : "_ZTI29OMX_AUDIO_MP3STREAMFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_AUDIO_PARAM_MP3TYPE",
   "name" : "OMX_AUDIO_PARAM_MP3TYPE",
   "referenced_type" : "_ZTI23OMX_AUDIO_PARAM_MP3TYPE",
   "self_type" : "_ZTI23OMX_AUDIO_PARAM_MP3TYPE",
   "size" : 36,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBlocks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSubbands",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitPool",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableBitrate",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 320,
     "referenced_type" : "_ZTI25OMX_AUDIO_CHANNELMODETYPE"
    },
    {
     "field_name" : "eSBCAllocType",
     "field_offset" : 352,
     "referenced_type" : "_ZTI28OMX_AUDIO_SBCALLOCMETHODTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_AUDIO_PARAM_SBCTYPE",
   "name" : "OMX_AUDIO_PARAM_SBCTYPE",
   "referenced_type" : "_ZTI23OMX_AUDIO_PARAM_SBCTYPE",
   "self_type" : "_ZTI23OMX_AUDIO_PARAM_SBCTYPE",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_AUDIO_CDMARATETYPE"
    },
    {
     "field_name" : "bRATE_REDUCon",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bNoiseSuppressor",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_AUDIO_PARAM_SMVTYPE",
   "name" : "OMX_AUDIO_PARAM_SMVTYPE",
   "referenced_type" : "_ZTI23OMX_AUDIO_PARAM_SMVTYPE",
   "self_type" : "_ZTI23OMX_AUDIO_PARAM_SMVTYPE",
   "size" : 44,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 160,
     "referenced_type" : "_ZTI23OMX_AUDIO_WMAFORMATTYPE"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 192,
     "referenced_type" : "_ZTI24OMX_AUDIO_WMAPROFILETYPE"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBlockAlign",
     "field_offset" : 256,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nEncodeOptions",
     "field_offset" : 272,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nSuperBlockAlign",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_AUDIO_PARAM_WMATYPE",
   "name" : "OMX_AUDIO_PARAM_WMATYPE",
   "referenced_type" : "_ZTI23OMX_AUDIO_PARAM_WMATYPE",
   "self_type" : "_ZTI23OMX_AUDIO_PARAM_WMATYPE",
   "size" : 40,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nARGBColor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nARGBMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "name" : "OMX_CONFIG_COLORKEYTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nContrast",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "name" : "OMX_CONFIG_CONTRASTTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRotation",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "name" : "OMX_CONFIG_ROTATIONTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI17OMX_EXTRADATATYPE"
    },
    {
     "field_name" : "nDataSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "name" : "OMX_OTHER_EXTRADATATYPE",
   "referenced_type" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "self_type" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bUseHadamard",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nRefFrames",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRefIdx10ActiveMinus1",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRefIdx11ActiveMinus1",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableUEP",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableFMO",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableASO",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableRS",
     "field_offset" : 416,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 448,
     "referenced_type" : "_ZTI24OMX_VIDEO_AVCPROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 480,
     "referenced_type" : "_ZTI22OMX_VIDEO_AVCLEVELTYPE"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFrameMBsOnly",
     "field_offset" : 544,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bMBAFF",
     "field_offset" : 576,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEntropyCodingCABAC",
     "field_offset" : 608,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bWeightedPPrediction",
     "field_offset" : 640,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nWeightedBipredicitonMode",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bconstIpred",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bDirect8x8Inference",
     "field_offset" : 736,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bDirectSpatialTemporal",
     "field_offset" : 768,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nCabacInitIdc",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eLoopFilterMode",
     "field_offset" : 832,
     "referenced_type" : "_ZTI27OMX_VIDEO_AVCLOOPFILTERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "name" : "OMX_VIDEO_PARAM_AVCTYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "size" : 108,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_VIDEO_WMVFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "name" : "OMX_VIDEO_PARAM_WMVTYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_AUDIO_CDMARATETYPE"
    },
    {
     "field_name" : "bRATE_REDUCon",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bNoiseSuppressor",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_EVRCTYPE",
   "name" : "OMX_AUDIO_PARAM_EVRCTYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_EVRCTYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_EVRCTYPE",
   "size" : 44,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nCompressionLevel",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_FLACTYPE",
   "name" : "OMX_AUDIO_PARAM_FLACTYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_FLACTYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_FLACTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eBitRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTI18OMX_AUDIO_G723RATE"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_G723TYPE",
   "name" : "OMX_AUDIO_PARAM_G723TYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_G723TYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_G723TYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eG726Mode",
     "field_offset" : 128,
     "referenced_type" : "_ZTI18OMX_AUDIO_G726MODE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_G726TYPE",
   "name" : "OMX_AUDIO_PARAM_G726TYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_G726TYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_G726TYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eBitType",
     "field_offset" : 160,
     "referenced_type" : "_ZTI18OMX_AUDIO_G729TYPE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_G729TYPE",
   "name" : "OMX_AUDIO_PARAM_G729TYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_G729TYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_G729TYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFileSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sMaxPolyphony",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "bLoadDefaultSound",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eMidiFormat",
     "field_offset" : 256,
     "referenced_type" : "_ZTI24OMX_AUDIO_MIDIFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_MIDITYPE",
   "name" : "OMX_AUDIO_PARAM_MIDITYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_MIDITYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_MIDITYPE",
   "size" : 36,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBacklight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeout",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "name" : "OMX_CONFIG_BACKLIGHTTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xEncodeFramerate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "name" : "OMX_CONFIG_FRAMERATETYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "self_type" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bStab",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "name" : "OMX_CONFIG_FRAMESTABTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nLightness",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "name" : "OMX_CONFIG_LIGHTNESSTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "contentURI",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_CONTENTURITYPE",
   "name" : "OMX_PARAM_CONTENTURITYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_CONTENTURITYPE",
   "self_type" : "_ZTI24OMX_PARAM_CONTENTURITYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDeblocking",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "name" : "OMX_PARAM_DEBLOCKINGTYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "self_type" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nInterleavePortIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "name" : "OMX_PARAM_INTERLEAVETYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "self_type" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bOneShot",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sFrameSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTI17OMX_FRAMESIZETYPE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "name" : "OMX_PARAM_SENSORMODETYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "self_type" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "size" : 40,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI18OMX_SUSPENSIONTYPE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_SUSPENSIONTYPE",
   "name" : "OMX_PARAM_SUSPENSIONTYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_SUSPENSIONTYPE",
   "self_type" : "_ZTI24OMX_PARAM_SUSPENSIONTYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNaluBytes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "name" : "OMX_VIDEO_CONFIG_NALSIZE",
   "referenced_type" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "self_type" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "_ZTI25OMX_VIDEO_H263PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "_ZTI23OMX_VIDEO_H263LEVELTYPE"
    },
    {
     "field_name" : "bPLUSPTYPEAllowed",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bForceRoundingTypeToZero",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nPictureHeaderRepetition",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGOBHeaderInterval",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "name" : "OMX_VIDEO_PARAM_H263TYPE",
   "referenced_type" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "self_type" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBass",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_CONFIG_BASSTYPE",
   "name" : "OMX_AUDIO_CONFIG_BASSTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_CONFIG_BASSTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_CONFIG_BASSTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bMute",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_CONFIG_MUTETYPE",
   "name" : "OMX_AUDIO_CONFIG_MUTETYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_CONFIG_MUTETYPE",
   "self_type" : "_ZTI25OMX_AUDIO_CONFIG_MUTETYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitsPerSample",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_PARAM_ADPCMTYPE",
   "name" : "OMX_AUDIO_PARAM_ADPCMTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_PARAM_ADPCMTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_PARAM_ADPCMTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_PARAM_GSMFRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMFRTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_PARAM_GSMFRTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_PARAM_GSMFRTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_PARAM_GSMHRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMHRTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_PARAM_GSMHRTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_PARAM_GSMHRTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_PARAM_PDCFRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCFRTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_PARAM_PDCFRTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_PARAM_PDCFRTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_PARAM_PDCHRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCHRTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_PARAM_PDCHRTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_PARAM_PDCHRTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pName",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "pInitialize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "name" : "OMX_COMPONENTREGISTERTYPE",
   "referenced_type" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "self_type" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "size" : 8,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBrightness",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "name" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRGBAlphaConstant",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eColorBlend",
     "field_offset" : 128,
     "referenced_type" : "_ZTI18OMX_COLORBLENDTYPE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "name" : "OMX_CONFIG_COLORBLENDTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDepth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAlpha",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "name" : "OMX_CONFIG_PLANEBLENDTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSaturation",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "name" : "OMX_CONFIG_SATURATIONTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "hPipe",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_PARAM_CONTENTPIPETYPE",
   "name" : "OMX_PARAM_CONTENTPIPETYPE",
   "referenced_type" : "_ZTI25OMX_PARAM_CONTENTPIPETYPE",
   "self_type" : "_ZTI25OMX_PARAM_CONTENTPIPETYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFocusStatus",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_FOCUSSTATUSTYPE"
    },
    {
     "field_name" : "bCenterStatus",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bLeftStatus",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bRightStatus",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopStatus",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomStatus",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopLeftStatus",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopRightStatus",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomLeftStatus",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomRightStatus",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "name" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "referenced_type" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "self_type" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "size" : 52,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMacroblocks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "name" : "OMX_PARAM_MACROBLOCKSTYPE",
   "referenced_type" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "self_type" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "xScale",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_TIME_CONFIG_SCALETYPE",
   "name" : "OMX_TIME_CONFIG_SCALETYPE",
   "referenced_type" : "_ZTI25OMX_TIME_CONFIG_SCALETYPE",
   "self_type" : "_ZTI25OMX_TIME_CONFIG_SCALETYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "_ZTI26OMX_VIDEO_MPEG2PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "_ZTI24OMX_VIDEO_MPEG2LEVELTYPE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bSVH",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bGov",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIDCVLCThreshold",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bACPred",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nMaxPacketSize",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeIncRes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 384,
     "referenced_type" : "_ZTI26OMX_VIDEO_MPEG4PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 416,
     "referenced_type" : "_ZTI24OMX_VIDEO_MPEG4LEVELTYPE"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeaderExtension",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bReversibleVLC",
     "field_offset" : 512,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "size" : 68,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "b16x16",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b16x8",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x16",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x8",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x4",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b4x8",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b4x4",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "name" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "size" : 40,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "_ZTI25android_cta861_3_metadata",
   "self_type" : "_ZTI25android_cta861_3_metadata",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_AUDIO_PARAM_GSMEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMEFRTYPE",
   "referenced_type" : "_ZTI26OMX_AUDIO_PARAM_GSMEFRTYPE",
   "self_type" : "_ZTI26OMX_AUDIO_PARAM_GSMEFRTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_AUDIO_PARAM_PDCEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCEFRTYPE",
   "referenced_type" : "_ZTI26OMX_AUDIO_PARAM_PDCEFRTYPE",
   "self_type" : "_ZTI26OMX_AUDIO_PARAM_PDCEFRTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 160,
     "referenced_type" : "_ZTI22OMX_AUDIO_CDMARATETYPE"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_AUDIO_PARAM_QCELP8TYPE",
   "name" : "OMX_AUDIO_PARAM_QCELP8TYPE",
   "referenced_type" : "_ZTI26OMX_AUDIO_PARAM_QCELP8TYPE",
   "self_type" : "_ZTI26OMX_AUDIO_PARAM_QCELP8TYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_AUDIO_PARAM_TDMAFRTYPE",
   "name" : "OMX_AUDIO_PARAM_TDMAFRTYPE",
   "referenced_type" : "_ZTI26OMX_AUDIO_PARAM_TDMAFRTYPE",
   "self_type" : "_ZTI26OMX_AUDIO_PARAM_TDMAFRTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQuality",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bManaged",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bDownmix",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_AUDIO_PARAM_VORBISTYPE",
   "name" : "OMX_AUDIO_PARAM_VORBISTYPE",
   "referenced_type" : "_ZTI26OMX_AUDIO_PARAM_VORBISTYPE",
   "self_type" : "_ZTI26OMX_AUDIO_PARAM_VORBISTYPE",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bContinuous",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bFrameLimited",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nFrameLimit",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "name" : "OMX_CONFIG_CAPTUREMODETYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "self_type" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bCenter",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bLeft",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bRight",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTop",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottom",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopLeft",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopRight",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomLeft",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomRight",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "name" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eImageFilter",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_IMAGEFILTERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "name" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xWidth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xHeight",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "name" : "OMX_CONFIG_SCALEFACTORTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bEnablePM",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_OTHER_CONFIG_POWERTYPE",
   "name" : "OMX_OTHER_CONFIG_POWERTYPE",
   "referenced_type" : "_ZTI26OMX_OTHER_CONFIG_POWERTYPE",
   "self_type" : "_ZTI26OMX_OTHER_CONFIG_POWERTYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_OTHER_CONFIG_STATSTYPE",
   "name" : "OMX_OTHER_CONFIG_STATSTYPE",
   "referenced_type" : "_ZTI26OMX_OTHER_CONFIG_STATSTYPE",
   "self_type" : "_ZTI26OMX_OTHER_CONFIG_STATSTYPE",
   "size" : 8,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "_ZTI26android_smpte2086_metadata",
   "self_type" : "_ZTI26android_smpte2086_metadata",
   "size" : 40,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sDelay",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sModulationRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "nModulationDepth",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFeedback",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BU32"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_CONFIG_CHORUSTYPE",
   "name" : "OMX_AUDIO_CONFIG_CHORUSTYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_CONFIG_CHORUSTYPE",
   "self_type" : "_ZTI27OMX_AUDIO_CONFIG_CHORUSTYPE",
   "size" : 56,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nTreble",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_CONFIG_TREBLETYPE",
   "name" : "OMX_AUDIO_CONFIG_TREBLETYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_CONFIG_TREBLETYPE",
   "self_type" : "_ZTI27OMX_AUDIO_CONFIG_TREBLETYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bLinear",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sVolume",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BS32"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_CONFIG_VOLUMETYPE",
   "name" : "OMX_AUDIO_CONFIG_VOLUMETYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_CONFIG_VOLUMETYPE",
   "self_type" : "_ZTI27OMX_AUDIO_CONFIG_VOLUMETYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eNumData",
     "field_offset" : 128,
     "referenced_type" : "_ZTI21OMX_NUMERICALDATATYPE"
    },
    {
     "field_name" : "eEndian",
     "field_offset" : 160,
     "referenced_type" : "_ZTI14OMX_ENDIANTYPE"
    },
    {
     "field_name" : "bInterleaved",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBitPerSample",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ePCMMode",
     "field_offset" : 288,
     "referenced_type" : "_ZTI21OMX_AUDIO_PCMMODETYPE"
    },
    {
     "field_name" : "eChannelMapping",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_21OMX_AUDIO_CHANNELTYPE"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_PARAM_PCMMODETYPE",
   "name" : "OMX_AUDIO_PARAM_PCMMODETYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_PARAM_PCMMODETYPE",
   "self_type" : "_ZTI27OMX_AUDIO_PARAM_PCMMODETYPE",
   "size" : 104,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_AUDIO_CDMARATETYPE"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_PARAM_QCELP13TYPE",
   "name" : "OMX_AUDIO_PARAM_QCELP13TYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_PARAM_QCELP13TYPE",
   "self_type" : "_ZTI27OMX_AUDIO_PARAM_QCELP13TYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "self_type" : "_ZTI27OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eScopeMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21OMX_METADATASCOPETYPE"
    },
    {
     "field_name" : "nScopeSpecifier",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMetadataItemIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eSearchMode",
     "field_offset" : 160,
     "referenced_type" : "_ZTI26OMX_METADATASEARCHMODETYPE"
    },
    {
     "field_name" : "eKeyCharset",
     "field_offset" : 192,
     "referenced_type" : "_ZTI23OMX_METADATACHARSETTYPE"
    },
    {
     "field_name" : "nKeySizeUsed",
     "field_offset" : 224,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nKey",
     "field_offset" : 232,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "eValueCharset",
     "field_offset" : 1280,
     "referenced_type" : "_ZTI23OMX_METADATACHARSETTYPE"
    },
    {
     "field_name" : "sLanguageCountry",
     "field_offset" : 1312,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "nValueMaxSize",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nValueSizeUsed",
     "field_offset" : 1376,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nValue",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_CONFIG_METADATAITEMTYPE",
   "name" : "OMX_CONFIG_METADATAITEMTYPE",
   "referenced_type" : "_ZTI27OMX_CONFIG_METADATAITEMTYPE",
   "self_type" : "_ZTI27OMX_CONFIG_METADATAITEMTYPE",
   "size" : 180,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQFactor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_IMAGE_PARAM_QFACTORTYPE",
   "name" : "OMX_IMAGE_PARAM_QFACTORTYPE",
   "referenced_type" : "_ZTI27OMX_IMAGE_PARAM_QFACTORTYPE",
   "self_type" : "_ZTI27OMX_IMAGE_PARAM_QFACTORTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "cRole",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA128_h"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "name" : "OMX_PARAM_COMPONENTROLETYPE",
   "referenced_type" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "self_type" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "size" : 136,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bResourceConcealmentForbidden",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_RESOURCECONCEALMENTTYPE",
   "name" : "OMX_RESOURCECONCEALMENTTYPE",
   "referenced_type" : "_ZTI27OMX_RESOURCECONCEALMENTTYPE",
   "self_type" : "_ZTI27OMX_RESOURCECONCEALMENTTYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumSliceGroups",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nSliceGroupMapType",
     "field_offset" : 104,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "eSliceMode",
     "field_offset" : 128,
     "referenced_type" : "_ZTI26OMX_VIDEO_AVCSLICEMODETYPE"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "name" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "referenced_type" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "self_type" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eControlRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTI25OMX_VIDEO_CONTROLRATETYPE"
    },
    {
     "field_offset" : 128,
     "referenced_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "referenced_type" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "self_type" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBalance",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_AUDIO_CONFIG_BALANCETYPE",
   "name" : "OMX_AUDIO_CONFIG_BALANCETYPE",
   "referenced_type" : "_ZTI28OMX_AUDIO_CONFIG_BALANCETYPE",
   "self_type" : "_ZTI28OMX_AUDIO_CONFIG_BALANCETYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eEncoding",
     "field_offset" : 96,
     "referenced_type" : "_ZTI20OMX_AUDIO_CODINGTYPE"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE",
   "name" : "OMX_AUDIO_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eMetering",
     "field_offset" : 96,
     "referenced_type" : "_ZTI16OMX_METERINGTYPE"
    },
    {
     "field_name" : "xEVCompensation",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nApertureFNumber",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoAperture",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nShutterSpeedMsec",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoShutterSpeed",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nSensitivity",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoSensitivity",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "name" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "referenced_type" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "self_type" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "size" : 44,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 224,
     "referenced_type" : "_ZTI20OMX_IMAGE_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 256,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE",
   "name" : "OMX_IMAGE_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE",
   "size" : 40,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "eFormat",
     "referenced_type" : "_ZTI20OMX_OTHER_FORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_OTHER_PORTDEFINITIONTYPE",
   "name" : "OMX_OTHER_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_OTHER_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_OTHER_PORTDEFINITIONTYPE",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eBufferSupplier",
     "field_offset" : 96,
     "referenced_type" : "_ZTI22OMX_BUFFERSUPPLIERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "name" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "referenced_type" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "self_type" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eKeyCharset",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_METADATACHARSETTYPE"
    },
    {
     "field_name" : "nKeySizeUsed",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nKey",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "nLanguageCountrySizeUsed",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nLanguageCountry",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 2240,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_PARAM_METADATAFILTERTYPE",
   "name" : "OMX_PARAM_METADATAFILTERTYPE",
   "referenced_type" : "_ZTI28OMX_PARAM_METADATAFILTERTYPE",
   "self_type" : "_ZTI28OMX_PARAM_METADATAFILTERTYPE",
   "size" : 284,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eDir",
     "field_offset" : 96,
     "referenced_type" : "_ZTI11OMX_DIRTYPE"
    },
    {
     "field_name" : "nBufferCountActual",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBufferCountMin",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBufferSize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bPopulated",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eDomain",
     "field_offset" : 288,
     "referenced_type" : "_ZTI18OMX_PORTDOMAINTYPE"
    },
    {
     "field_name" : "format",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E"
    },
    {
     "field_name" : "bBuffersContiguous",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBufferAlignment",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_PARAM_PORTDEFINITIONTYPE",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_PARAM_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_PARAM_PORTDEFINITIONTYPE",
   "size" : 96,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21OMX_TIME_SEEKMODETYPE"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_TIME_CONFIG_SEEKMODETYPE",
   "name" : "OMX_TIME_CONFIG_SEEKMODETYPE",
   "referenced_type" : "_ZTI28OMX_TIME_CONFIG_SEEKMODETYPE",
   "self_type" : "_ZTI28OMX_TIME_CONFIG_SEEKMODETYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nEncodeBitrate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "name" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "referenced_type" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "self_type" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitrate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 288,
     "referenced_type" : "_ZTI20OMX_VIDEO_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 320,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "name" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bLoudness",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI29OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "name" : "OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "referenced_type" : "_ZTI29OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "self_type" : "_ZTI29OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimestamp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI29OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "name" : "OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "referenced_type" : "_ZTI29OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "self_type" : "_ZTI29OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sBandIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sCenterFreq",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sBandLevel",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BS32"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "name" : "OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "referenced_type" : "_ZTI30OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "self_type" : "_ZTI30OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "size" : 52,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameLength",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAACtools",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAACERtools",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eAACProfile",
     "field_offset" : 320,
     "referenced_type" : "_ZTI24OMX_AUDIO_AACPROFILETYPE"
    },
    {
     "field_name" : "eAACStreamFormat",
     "field_offset" : 352,
     "referenced_type" : "_ZTI29OMX_AUDIO_AACSTREAMFORMATTYPE"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 384,
     "referenced_type" : "_ZTI25OMX_AUDIO_CHANNELMODETYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_AUDIO_PARAM_AACPROFILETYPE",
   "name" : "OMX_AUDIO_PARAM_AACPROFILETYPE",
   "referenced_type" : "_ZTI30OMX_AUDIO_PARAM_AACPROFILETYPE",
   "self_type" : "_ZTI30OMX_AUDIO_PARAM_AACPROFILETYPE",
   "size" : 52,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eEncoding",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20OMX_AUDIO_CODINGTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "_ZTI30OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "self_type" : "_ZTI30OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xColorMatrix",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA3_A3_i"
    },
    {
     "field_name" : "xColorOffset",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA4_i"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "name" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "size" : 64,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nParentNodeID",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNodeIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNodeID",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cNodeName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "bIsLeafType",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_CONTAINERNODEIDTYPE",
   "name" : "OMX_CONFIG_CONTAINERNODEIDTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_CONTAINERNODEIDTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_CONTAINERNODEIDTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eExposureControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_EXPOSURECONTROLTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "name" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "IntraRefreshVOP",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "name" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eWhiteBalControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_WHITEBALCONTROLTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "name" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20OMX_IMAGE_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "name" : "OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "referenced_type" : "_ZTI30OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "self_type" : "_ZTI30OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20OMX_OTHER_FORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_OTHER_PARAM_PORTFORMATTYPE",
   "name" : "OMX_OTHER_PARAM_PORTFORMATTYPE",
   "referenced_type" : "_ZTI30OMX_OTHER_PARAM_PORTFORMATTYPE",
   "self_type" : "_ZTI30OMX_OTHER_PARAM_PORTFORMATTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "ePolicy",
     "field_offset" : 64,
     "referenced_type" : "_ZTI24OMX_SUSPENSIONPOLICYTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "name" : "OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "referenced_type" : "_ZTI30OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "self_type" : "_ZTI30OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eState",
     "field_offset" : 64,
     "referenced_type" : "_ZTI19OMX_TIME_CLOCKSTATE"
    },
    {
     "field_name" : "nStartTime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nWaitMask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "name" : "OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "referenced_type" : "_ZTI30OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "self_type" : "_ZTI30OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "size" : 40,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20OMX_VIDEO_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "self_type" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumTracks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nDuration",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPosition",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bVibra",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nNumMetaEvents",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumActiveVoices",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eMIDIPlayBackState",
     "field_offset" : 288,
     "referenced_type" : "_ZTI31OMX_AUDIO_MIDIPLAYBACKSTATETYPE"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "referenced_type" : "_ZTI31OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "self_type" : "_ZTI31OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "size" : 40,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bColorEnhancement",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nCustomizedU",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nCustomizedV",
     "field_offset" : 136,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "name" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "name" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eEffect",
     "field_offset" : 96,
     "referenced_type" : "_ZTI24OMX_TRANSITIONEFFECTTYPE"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "name" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIDRPeriod",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "name" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "referenced_type" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "self_type" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bMute",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bIsMIDI",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "name" : "OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "referenced_type" : "_ZTI32OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "self_type" : "_ZTI32OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sPitchTransposition",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "sPlayBackRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sTempo",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "nMaxPolyphony",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumRepeat",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStopTime",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannelMuteMask",
     "field_offset" : 480,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nChannelSoloMask",
     "field_offset" : 496,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nTrack0031MuteMask",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTrack3263MuteMask",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTrack0031SoloMask",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTrack3263SoloMask",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "referenced_type" : "_ZTI32OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "self_type" : "_ZTI32OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "size" : 80,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eScopeMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21OMX_METADATASCOPETYPE"
    },
    {
     "field_name" : "nScopeSpecifier",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMetadataItemCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "name" : "OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "referenced_type" : "_ZTI32OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "self_type" : "_ZTI32OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFlashControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_IMAGE_FLASHCONTROLTYPE"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "name" : "OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "referenced_type" : "_ZTI32OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "self_type" : "_ZTI32OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eRefreshMode",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_VIDEO_INTRAREFRESHTYPE"
    },
    {
     "field_name" : "nAirMBs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAirRef",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nCirMBs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eAccuracy",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_VIDEO_MOTIONVECTORTYPE"
    },
    {
     "field_name" : "bUnrestrictedMVs",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bFourMV",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sXSearchRange",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sYSearchRange",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "name" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nProfileIndex",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "name" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpI",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpP",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpB",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "name" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nParentNodeID",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumNodes",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "name" : "OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "referenced_type" : "_ZTI33OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "self_type" : "_ZTI33OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nErrMapSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ErrMap",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "name" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "referenced_type" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "self_type" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFocusControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_IMAGE_FOCUSCONTROLTYPE"
    },
    {
     "field_name" : "nFocusSteps",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFocusStepIndex",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "name" : "OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "referenced_type" : "_ZTI33OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "self_type" : "_ZTI33OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eHuffmanTable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_IMAGE_HUFFMANTABLETYPE"
    },
    {
     "field_name" : "nNumberOfHuffmanCodeOfLength",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "nHuffmanTable",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA256_h"
    }
   ],
   "linker_set_key" : "_ZTI33OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "name" : "OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "referenced_type" : "_ZTI33OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "self_type" : "_ZTI33OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "size" : 288,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bLinear",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sVolume",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "bIsMIDI",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI34OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "name" : "OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "referenced_type" : "_ZTI34OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "self_type" : "_ZTI34OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "size" : 36,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMetaEventType",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nMetaEventSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTrack",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPosition",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI34OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "referenced_type" : "_ZTI34OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "self_type" : "_ZTI34OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sRoomLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "sRoomHighFreqLevel",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "sReflectionsLevel",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "sReflectionsDelay",
     "field_offset" : 416,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sReverbLevel",
     "field_offset" : 512,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "sReverbDelay",
     "field_offset" : 608,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sDecayTime",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "nDecayHighFreqRatio",
     "field_offset" : 800,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "nDensity",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDiffusion",
     "field_offset" : 928,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sReferenceHighFreq",
     "field_offset" : 960,
     "referenced_type" : "_ZTI8OMX_BU32"
    }
   ],
   "linker_set_key" : "_ZTI34OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "referenced_type" : "_ZTI34OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "self_type" : "_ZTI34OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "size" : 132,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eClock",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21OMX_TIME_REFCLOCKTYPE"
    }
   ],
   "linker_set_key" : "_ZTI34OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "name" : "OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "referenced_type" : "_ZTI34OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "self_type" : "_ZTI34OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bNoiseReduction",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "referenced_type" : "_ZTI35OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "self_type" : "_ZTI35OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eWideningType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI28OMX_AUDIO_STEREOWIDENINGTYPE"
    },
    {
     "field_name" : "nStereoWidening",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "name" : "OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "referenced_type" : "_ZTI35OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "self_type" : "_ZTI35OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableHEC",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableResync",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nResynchMarkerSpacing",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableDataPartitioning",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableRVLC",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "name" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "referenced_type" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "self_type" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableVFU",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nFirstGOB",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFirstMB",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumMBs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "name" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "referenced_type" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "self_type" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eEchoCancelation",
     "field_offset" : 96,
     "referenced_type" : "_ZTI21OMX_AUDIO_ECHOCANTYPE"
    }
   ],
   "linker_set_key" : "_ZTI36OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "referenced_type" : "_ZTI36OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "self_type" : "_ZTI36OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pClientPrivate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nMediaTimestamp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI36OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "name" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "referenced_type" : "_ZTI36OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "self_type" : "_ZTI36OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDLSIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDLSSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDLSData",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "eMidiSoundBank",
     "field_offset" : 192,
     "referenced_type" : "_ZTI27OMX_AUDIO_MIDISOUNDBANKTYPE"
    },
    {
     "field_name" : "eMidiSoundBankLayout",
     "field_offset" : 224,
     "referenced_type" : "_ZTI33OMX_AUDIO_MIDISOUNDBANKLAYOUTTYPE"
    }
   ],
   "linker_set_key" : "_ZTI37OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "name" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "referenced_type" : "_ZTI37OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "self_type" : "_ZTI37OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eQuantizationTable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI31OMX_IMAGE_QUANTIZATIONTABLETYPE"
    },
    {
     "field_name" : "nQuantizationMatrix",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA64_h"
    }
   ],
   "linker_set_key" : "_ZTI37OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "name" : "OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "referenced_type" : "_ZTI37OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "self_type" : "_ZTI37OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "size" : 80,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMetaEventSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nData",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI38OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "referenced_type" : "_ZTI38OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "self_type" : "_ZTI38OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMidiEventSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMidiEvents",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI39OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "referenced_type" : "_ZTI39OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "self_type" : "_ZTI39OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIDProgram",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nIDSoundBank",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nUserSoundBankIndex",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI41OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "referenced_type" : "_ZTI41OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "self_type" : "_ZTI41OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8OMX_BS32",
   "name" : "OMX_BS32",
   "referenced_type" : "_ZTI8OMX_BS32",
   "self_type" : "_ZTI8OMX_BS32",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8OMX_BU32",
   "name" : "OMX_BU32",
   "referenced_type" : "_ZTI8OMX_BU32",
   "self_type" : "_ZTI8OMX_BU32",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include_vndk/log/log_time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nVersionMajor",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nVersionMinor",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nRevision",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nStep",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "name" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5)",
   "referenced_type" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "self_type" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTargetBitrate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQualityFactor",
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:270:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "self_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "audio",
     "referenced_type" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE"
    },
    {
     "field_name" : "video",
     "referenced_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE"
    },
    {
     "field_name" : "image",
     "referenced_type" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE"
    },
    {
     "field_name" : "other",
     "referenced_type" : "_ZTI28OMX_OTHER_PORTDEFINITIONTYPE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E",
   "self_type" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10VectorImplE",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10VectorImplE",
   "self_type" : "_ZTIN7android10VectorImplE",
   "size" : 20,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorINS_7String8EPNS_13OMXPluginBaseEEE",
   "name" : "android::KeyedVector<android::String8, android::OMXPluginBase *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorINS_7String8EPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android11KeyedVectorINS_7String8EPNS_13OMXPluginBaseEEE",
   "size" : 20,
   "source_file" : "system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIN7android7String8E", "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "name" : "android::KeyedVector<OMX_COMPONENTTYPE *, android::OMXPluginBase *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android11KeyedVectorIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "size" : 20,
   "source_file" : "system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIP17OMX_COMPONENTTYPE", "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android19VirtualLightRefBaseE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String8, android::OMXPluginBase *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "size" : 20,
   "source_file" : "system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE10do_compareEPKvS8_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<OMX_COMPONENTTYPE *, android::OMXPluginBase *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "size" : 20,
   "source_file" : "system/core/libutils/include/utils/SortedVector.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE10do_compareEPKvS9_"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android13OMXPluginBaseE",
   "name" : "android::OMXPluginBase",
   "referenced_type" : "_ZTIN7android13OMXPluginBaseE",
   "self_type" : "_ZTIN7android13OMXPluginBaseE",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/hardware/OMXPluginBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13OMXPluginBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13OMXPluginBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13OMXPluginBaseD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase21makeComponentInstanceEPKcPK16OMX_CALLBACKTYPEPvPP17OMX_COMPONENTTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase24destroyComponentInstanceEP17OMX_COMPONENTTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase19enumerateComponentsEPcjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase19getRolesOfComponentEPKcPNS_6VectorINS_7String8EEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android13OMXPluginBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android13SoftOMXPluginE",
   "name" : "android::SoftOMXPlugin",
   "referenced_type" : "_ZTIN7android13SoftOMXPluginE",
   "self_type" : "_ZTIN7android13SoftOMXPluginE",
   "size" : 4,
   "source_file" : "frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SoftOMXPlugin.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13SoftOMXPluginE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13SoftOMXPluginD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13SoftOMXPluginD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin21makeComponentInstanceEPKcPK16OMX_CALLBACKTYPEPvPP17OMX_COMPONENTTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin24destroyComponentInstanceEP17OMX_COMPONENTTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin19enumerateComponentsEPcjj"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin19getRolesOfComponentEPKcPNS_6VectorINS_7String8EEE"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::String8, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<OMX_COMPONENTTYPE *, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_7String8EEE",
   "name" : "android::trait_pointer<android::String8>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_7String8EEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIP17OMX_COMPONENTTYPEEE",
   "name" : "android::trait_pointer<OMX_COMPONENTTYPE *>",
   "referenced_type" : "_ZTIN7android13trait_pointerIP17OMX_COMPONENTTYPEEE",
   "self_type" : "_ZTIN7android13trait_pointerIP17OMX_COMPONENTTYPEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIP17OMX_COMPONENTTYPE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIPNS_13OMXPluginBaseEEE",
   "name" : "android::trait_pointer<android::OMXPluginBase *>",
   "referenced_type" : "_ZTIN7android13trait_pointerIPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android13trait_pointerIPNS_13OMXPluginBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14ReferenceMoverE",
   "self_type" : "_ZTIN7android14ReferenceMoverE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16ReferenceRenamerE",
   "self_type" : "_ZTIN7android16ReferenceRenamerE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16SortedVectorImplE",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16SortedVectorImplE",
   "self_type" : "_ZTIN7android16SortedVectorImplE",
   "size" : 20,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16aggregate_traitsINS_7String8EPNS_13OMXPluginBaseEEE",
   "name" : "android::aggregate_traits<android::String8, android::OMXPluginBase *>",
   "referenced_type" : "_ZTIN7android16aggregate_traitsINS_7String8EPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android16aggregate_traitsINS_7String8EPNS_13OMXPluginBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E", "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16aggregate_traitsIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "name" : "android::aggregate_traits<OMX_COMPONENTTYPE *, android::OMXPluginBase *>",
   "referenced_type" : "_ZTIN7android16aggregate_traitsIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android16aggregate_traitsIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIP17OMX_COMPONENTTYPE", "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIN7android7String8E"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android13OMXPluginBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE",
   "name" : "android::key_value_pair_t<android::String8, android::OMXPluginBase *>",
   "referenced_type" : "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E", "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIP17OMX_COMPONENTTYPE"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android13OMXPluginBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "name" : "android::key_value_pair_t<OMX_COMPONENTTYPE *, android::OMXPluginBase *>",
   "referenced_type" : "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIP17OMX_COMPONENTTYPE", "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "name" : "android::use_trivial_move<android::key_value_pair_t<android::String8, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "name" : "android::use_trivial_move<android::key_value_pair_t<OMX_COMPONENTTYPE *, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<android::String8, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<OMX_COMPONENTTYPE *, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_7String8EEE",
   "name" : "android::trait_trivial_copy<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIP17OMX_COMPONENTTYPEEE",
   "name" : "android::trait_trivial_copy<OMX_COMPONENTTYPE *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIP17OMX_COMPONENTTYPEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIP17OMX_COMPONENTTYPEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIP17OMX_COMPONENTTYPE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIPNS_13OMXPluginBaseEEE",
   "name" : "android::trait_trivial_copy<android::OMXPluginBase *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIPNS_13OMXPluginBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<android::String8, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<OMX_COMPONENTTYPE *, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_7String8EEE",
   "name" : "android::trait_trivial_ctor<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIP17OMX_COMPONENTTYPEEE",
   "name" : "android::trait_trivial_ctor<OMX_COMPONENTTYPE *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIP17OMX_COMPONENTTYPEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIP17OMX_COMPONENTTYPEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIP17OMX_COMPONENTTYPE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIPNS_13OMXPluginBaseEEE",
   "name" : "android::trait_trivial_ctor<android::OMXPluginBase *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIPNS_13OMXPluginBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<android::String8, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<OMX_COMPONENTTYPE *, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_7String8EEE",
   "name" : "android::trait_trivial_dtor<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIP17OMX_COMPONENTTYPEEE",
   "name" : "android::trait_trivial_dtor<OMX_COMPONENTTYPE *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIP17OMX_COMPONENTTYPEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIP17OMX_COMPONENTTYPEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIP17OMX_COMPONENTTYPE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIPNS_13OMXPluginBaseEEE",
   "name" : "android::trait_trivial_dtor<android::OMXPluginBase *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIPNS_13OMXPluginBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<android::String8, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<OMX_COMPONENTTYPE *, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String8.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIP17OMX_COMPONENTTYPEEE",
   "name" : "android::trait_trivial_move<OMX_COMPONENTTYPE *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIP17OMX_COMPONENTTYPEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIP17OMX_COMPONENTTYPEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIP17OMX_COMPONENTTYPE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIPNS_13OMXPluginBaseEEE",
   "name" : "android::trait_trivial_move<android::OMXPluginBase *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIPNS_13OMXPluginBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "self_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android6ThreadE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_6ThreadEEE",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_6ThreadEEE",
   "self_type" : "_ZTIN7android2spINS_6ThreadEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android6ThreadE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "_ZTIPN7android4ListINS_8OMXStore6PluginEE5_NodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4ListINS_8OMXStore6PluginEE13_ListIteratorIS2_NS3_18NON_CONST_ITERATOREEE",
   "name" : "android::List<Plugin>::_ListIterator<android::OMXStore::Plugin, android::List<Plugin>::NON_CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4ListINS_8OMXStore6PluginEE13_ListIteratorIS2_NS3_18NON_CONST_ITERATOREEE",
   "self_type" : "_ZTIN7android4ListINS_8OMXStore6PluginEE13_ListIteratorIS2_NS3_18NON_CONST_ITERATOREEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/List.h",
   "template_args" : [ "_ZTIN7android8OMXStore6PluginE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4ListINS_8OMXStore6PluginEE18NON_CONST_ITERATORIS2_EE",
   "name" : "android::List<Plugin>::NON_CONST_ITERATOR<android::OMXStore::Plugin>",
   "referenced_type" : "_ZTIN7android4ListINS_8OMXStore6PluginEE18NON_CONST_ITERATORIS2_EE",
   "self_type" : "_ZTIN7android4ListINS_8OMXStore6PluginEE18NON_CONST_ITERATORIS2_EE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/List.h",
   "template_args" : [ "_ZTIN7android8OMXStore6PluginE" ]
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "referenced_type" : "_ZTIN7android8OMXStore6PluginE"
    },
    {
     "access" : "private",
     "field_name" : "mpPrev",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android4ListINS_8OMXStore6PluginEE5_NodeE"
    },
    {
     "access" : "private",
     "field_name" : "mpNext",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPN7android4ListINS_8OMXStore6PluginEE5_NodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4ListINS_8OMXStore6PluginEE5_NodeE",
   "name" : "android::List<Plugin>::_Node",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4ListINS_8OMXStore6PluginEE5_NodeE",
   "self_type" : "_ZTIN7android4ListINS_8OMXStore6PluginEE5_NodeE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/List.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android4ListINS_8OMXStore6PluginEE5_NodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4ListINS_8OMXStore6PluginEEE",
   "name" : "android::List<android::OMXStore::Plugin>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4ListINS_8OMXStore6PluginEEE",
   "self_type" : "_ZTIN7android4ListINS_8OMXStore6PluginEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/List.h",
   "template_args" : [ "_ZTIN7android8OMXStore6PluginE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_8OMXStore6PluginEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_8OMXStore6PluginEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_8OMXStore6PluginEED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android5MutexE"
    }
   ],
   "linker_set_key" : "_ZTIN7android5Mutex8AutolockE",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5Mutex8AutolockE",
   "self_type" : "_ZTIN7android5Mutex8AutolockE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTI15pthread_mutex_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android5MutexE",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5MutexE",
   "self_type" : "_ZTIN7android5MutexE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6ADebugE",
   "name" : "android::ADebug",
   "referenced_type" : "_ZTIN7android6ADebugE",
   "self_type" : "_ZTIN7android6ADebugE",
   "size" : 1,
   "source_file" : "frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ADebug.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android6RWLockE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLock9AutoRLockE",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLock9AutoRLockE",
   "self_type" : "_ZTIN7android6RWLock9AutoRLockE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android6RWLockE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLock9AutoWLockE",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLock9AutoWLockE",
   "self_type" : "_ZTIN7android6RWLock9AutoWLockE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "_ZTI16pthread_rwlock_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLockE",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLockE",
   "self_type" : "_ZTIN7android6RWLockE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android5MutexE"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android9ConditionE"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "_ZTIVb"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "_ZTIVb"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN7android2spINS_6ThreadEEE"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android6ThreadE",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6ThreadE",
   "self_type" : "_ZTIN7android6ThreadE",
   "size" : 44,
   "source_file" : "system/core/libutils/include/utils/Thread.h",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorINS_7String8EEE",
   "name" : "android::Vector<android::String8>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorINS_7String8EEE",
   "self_type" : "_ZTIN7android6VectorINS_7String8EEE",
   "size" : 20,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIN7android7String8E" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_7String8EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "name" : "android::traits<android::key_value_pair_t<android::String8, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android6traitsINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android6traitsINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "name" : "android::traits<android::key_value_pair_t<OMX_COMPONENTTYPE *, android::OMXPluginBase *>>",
   "referenced_type" : "_ZTIN7android6traitsINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android6traitsINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_7String8EEE",
   "name" : "android::traits<android::String8>",
   "referenced_type" : "_ZTIN7android6traitsINS_7String8EEE",
   "self_type" : "_ZTIN7android6traitsINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsIP17OMX_COMPONENTTYPEEE",
   "name" : "android::traits<OMX_COMPONENTTYPE *>",
   "referenced_type" : "_ZTIN7android6traitsIP17OMX_COMPONENTTYPEEE",
   "self_type" : "_ZTIN7android6traitsIP17OMX_COMPONENTTYPEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIP17OMX_COMPONENTTYPE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsIPNS_13OMXPluginBaseEEE",
   "name" : "android::traits<android::OMXPluginBase *>",
   "referenced_type" : "_ZTIN7android6traitsIPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android6traitsIPNS_13OMXPluginBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mAllocSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android7AStringE",
   "name" : "android::AString",
   "referenced_type" : "_ZTIN7android7AStringE",
   "self_type" : "_ZTIN7android7AStringE",
   "size" : 12,
   "source_file" : "frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AString.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIN7android7RefBaseE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN7android7String8E",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7String8E",
   "self_type" : "_ZTIN7android7String8E",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/String8.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mOmx",
     "referenced_type" : "_ZTIPN7android13OMXPluginBaseE"
    },
    {
     "field_name" : "mLibHandle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN7android8OMXStore6PluginE",
   "name" : "android::OMXStore::Plugin",
   "referenced_type" : "_ZTIN7android8OMXStore6PluginE",
   "self_type" : "_ZTIN7android8OMXStore6PluginE",
   "size" : 8,
   "source_file" : "frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/OMXStore.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android13OMXPluginBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mProcessName",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN7android5MutexE"
    },
    {
     "access" : "private",
     "field_name" : "mPlugins",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android4ListINS_8OMXStore6PluginEEE"
    },
    {
     "access" : "private",
     "field_name" : "mPluginByComponentName",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN7android11KeyedVectorINS_7String8EPNS_13OMXPluginBaseEEE"
    },
    {
     "access" : "private",
     "field_name" : "mPluginByInstance",
     "field_offset" : 416,
     "referenced_type" : "_ZTIN7android11KeyedVectorIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8OMXStoreE",
   "name" : "android::OMXStore",
   "referenced_type" : "_ZTIN7android8OMXStoreE",
   "self_type" : "_ZTIN7android8OMXStoreE",
   "size" : 72,
   "source_file" : "frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/OMXStore.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8OMXStoreE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8OMXStoreD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8OMXStoreD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8OMXStore21makeComponentInstanceEPKcPK16OMX_CALLBACKTYPEPvPP17OMX_COMPONENTTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android8OMXStore24destroyComponentInstanceEP17OMX_COMPONENTTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android8OMXStore19enumerateComponentsEPcjj"
    },
    {
     "mangled_component_name" : "_ZN7android8OMXStore19getRolesOfComponentEPKcPNS_6VectorINS_7String8EEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "_ZTI14pthread_cond_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android9ConditionE",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android9ConditionE",
   "self_type" : "_ZTIN7android9ConditionE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/Condition.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIA5121_h"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "_ZTI12logger_entry"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7log_msgUt_E",
   "name" : "log_msg::(anonymous union at system/logging/liblog/include_vndk/log/log_read.h:58:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7log_msgUt_E",
   "self_type" : "_ZTIN7log_msgUt_E",
   "size" : 5124,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  }
 ],
 "rvalue_reference_types" : []
}
