#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_EFFECT_V2_0_IENVIRONMENTALREVERBEFFECT_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_EFFECT_V2_0_IENVIRONMENTALREVERBEFFECT_H

#include <android/hardware/audio/effect/2.0/IEffect.h>
#include <android/hardware/audio/effect/2.0/types.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace audio {
namespace effect {
namespace V2_0 {

struct IEnvironmentalReverbEffect : public ::android::hardware::audio::effect::V2_0::IEffect {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.audio.effect@2.0::IEnvironmentalReverbEffect"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class ParamRange : int16_t;
    struct AllProperties;

    enum class ParamRange : int16_t {
        ROOM_LEVEL_MIN = -6000 /* -6000 */,
        ROOM_LEVEL_MAX = 0,
        ROOM_HF_LEVEL_MIN = -4000 /* -4000 */,
        ROOM_HF_LEVEL_MAX = 0,
        DECAY_TIME_MIN = 100,
        DECAY_TIME_MAX = 20000,
        DECAY_HF_RATIO_MIN = 100,
        DECAY_HF_RATIO_MAX = 1000,
        REFLECTIONS_LEVEL_MIN = -6000 /* -6000 */,
        REFLECTIONS_LEVEL_MAX = 0,
        REFLECTIONS_DELAY_MIN = 0,
        REFLECTIONS_DELAY_MAX = 65,
        REVERB_LEVEL_MIN = -6000 /* -6000 */,
        REVERB_LEVEL_MAX = 0,
        REVERB_DELAY_MIN = 0,
        REVERB_DELAY_MAX = 65,
        DIFFUSION_MIN = 0,
        DIFFUSION_MAX = 1000,
        DENSITY_MIN = 0,
        DENSITY_MAX = 1000,
    };

    struct AllProperties final {
        int16_t roomLevel __attribute__ ((aligned(2)));
        int16_t roomHfLevel __attribute__ ((aligned(2)));
        uint32_t decayTime __attribute__ ((aligned(4)));
        int16_t decayHfRatio __attribute__ ((aligned(2)));
        int16_t reflectionsLevel __attribute__ ((aligned(2)));
        uint32_t reflectionsDelay __attribute__ ((aligned(4)));
        int16_t reverbLevel __attribute__ ((aligned(2)));
        uint32_t reverbDelay __attribute__ ((aligned(4)));
        int16_t diffusion __attribute__ ((aligned(2)));
        int16_t density __attribute__ ((aligned(2)));
    };

    static_assert(offsetof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties, roomLevel) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties, roomHfLevel) == 2, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties, decayTime) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties, decayHfRatio) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties, reflectionsLevel) == 10, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties, reflectionsDelay) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties, reverbLevel) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties, reverbDelay) == 20, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties, diffusion) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties, density) == 26, "wrong offset");
    static_assert(sizeof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties) == 28, "wrong size");
    static_assert(__alignof(::android::hardware::audio::effect::V2_0::IEnvironmentalReverbEffect::AllProperties) == 4, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Initialize effect engine--all configurations return to default.
     *
     * @return retval operation completion status.
     */
    virtual ::android::hardware::Return<::android::hardware::audio::effect::V2_0::Result> init() = 0;

    /**
     * Apply new audio parameters configurations for input and output buffers.
     * The provider callbacks may be empty, but in this case the buffer
     * must be provided in the EffectConfig structure.
     *
     * @param config configuration descriptor.
     * @param inputBufferProvider optional buffer provider reference.
     * @param outputBufferProvider optional buffer provider reference.
