{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA20_h",
   "name" : "unsigned char [20]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA20_h",
   "size" : 20,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA258_t",
   "name" : "unsigned short [258]",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIA258_t",
   "size" : 516,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA3_7CSzBond",
   "name" : "CSzBond [3]",
   "referenced_type" : "_ZTI7CSzBond",
   "self_type" : "_ZTIA3_7CSzBond",
   "size" : 24,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4_12CSzCoderInfo",
   "name" : "CSzCoderInfo [4]",
   "referenced_type" : "_ZTI12CSzCoderInfo",
   "self_type" : "_ZTIA4_12CSzCoderInfo",
   "size" : 48,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4_PKh",
   "name" : "const unsigned char *[4]",
   "referenced_type" : "_ZTIPKh",
   "self_type" : "_ZTIA4_PKh",
   "size" : 16,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4_Ph",
   "name" : "unsigned char *[4]",
   "referenced_type" : "_ZTIPh",
   "self_type" : "_ZTIA4_Ph",
   "size" : 16,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA4_h",
   "name" : "unsigned char [4]",

   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK7IByteIn",
   "name" : "const IByteIn *",
   "referenced_type" : "_ZTIK7IByteIn",
   "self_type" : "_ZTIPK7IByteIn",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK8IByteOut",
   "name" : "const IByteOut *",
   "referenced_type" : "_ZTIK8IByteOut",
   "self_type" : "_ZTIPK8IByteOut",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK8ISzAlloc",
   "name" : "const ISzAlloc *",
   "referenced_type" : "_ZTIK8ISzAlloc",
   "self_type" : "_ZTIPK8ISzAlloc",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 4,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPKv",
   "name" : "const void **",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIPPKv",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPt",
   "name" : "unsigned short *",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIPt",
   "size" : 4,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPx",
   "name" : "long long *",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIPx",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPy",
   "name" : "unsigned long long *",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIPy",
   "size" : 4,
   "source_file" : "external/lzma/C/7z.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIA6_Kh",
   "name" : "unsigned char const[6]",
   "referenced_type" : "_ZTIA6_h",
   "self_type" : "_ZTIA6_Kh",
   "size" : 6,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12ISeqInStream",
   "name" : "const ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTIK12ISeqInStream",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ILookInStream",
   "name" : "const ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTIK13ILookInStream",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeekInStream",
   "name" : "const ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTIK13ISeekInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeqOutStream",
   "name" : "const ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTIK13ISeqOutStream",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK17ICompressProgress",
   "name" : "const ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTIK17ICompressProgress",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK5CSzAr",
   "name" : "const CSzAr",
   "referenced_type" : "_ZTI5CSzAr",
   "self_type" : "_ZTIK5CSzAr",
   "size" : 44,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7IByteIn",
   "name" : "const IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTIK7IByteIn",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8IByteOut",
   "name" : "const IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTIK8IByteOut",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8ISzAlloc",
   "name" : "const ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTIK8ISzAlloc",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/lzma/C/7zTypes.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToLook",
   "name" : "CSecToLook",
   "referenced_type" : "_ZTI10CSecToLook",
   "self_type" : "_ZTI10CSecToLook",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToRead",
   "name" : "CSecToRead",
   "referenced_type" : "_ZTI10CSecToRead",
   "self_type" : "_ZTI10CSecToRead",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Defs",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "Vals",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPj"
    }
   ],
   "linker_set_key" : "_ZTI11CSzBitUi32s",
   "name" : "CSzBitUi32s",
   "referenced_type" : "_ZTI11CSzBitUi32s",
   "self_type" : "_ZTI11CSzBitUi32s",
   "size" : 8,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Defs",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "Vals",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13CNtfsFileTime"
    }
   ],
   "linker_set_key" : "_ZTI11CSzBitUi64s",
   "name" : "CSzBitUi64s",
   "referenced_type" : "_ZTI11CSzBitUi64s",
   "self_type" : "_ZTI11CSzBitUi64s",
   "size" : 8,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lc",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "lp",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pb",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "_pad_",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "dicSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11_CLzmaProps",
   "name" : "_CLzmaProps",
   "referenced_type" : "_ZTI11_CLzmaProps",
   "self_type" : "_ZTI11_CLzmaProps",
   "size" : 8,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI13ILookInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK13ISeekInStream"
    },
    {
     "field_name" : "pos",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buf",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "bufSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12CLookToRead2",
   "name" : "CLookToRead2",
   "referenced_type" : "_ZTI12CLookToRead2",
   "self_type" : "_ZTI12CLookToRead2",
   "size" : 36,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "PropsOffset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "MethodID",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "NumStreams",
     "field_offset" : 64,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "PropsSize",
     "field_offset" : 72,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI12CSzCoderInfo",
   "name" : "CSzCoderInfo",
   "referenced_type" : "_ZTI12CSzCoderInfo",
   "self_type" : "_ZTI12CSzCoderInfo",
   "size" : 12,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK12ISeqInStreamPvPjE"
    }
   ],
   "linker_set_key" : "_ZTI12ISeqInStream",
   "name" : "ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTI12ISeqInStream",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Low",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "High",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13CNtfsFileTime",
   "name" : "CNtfsFileTime",
   "referenced_type" : "_ZTI13CNtfsFileTime",
   "self_type" : "_ZTI13CNtfsFileTime",
   "size" : 8,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Look",
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPPKvPjE"
    },
    {
     "field_name" : "Skip",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamjE"
    },
    {
     "field_name" : "Read",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPvPjE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ILookInStream",
   "name" : "ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTI13ILookInStream",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPvPjE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeekInStream",
   "name" : "ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTI13ISeekInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFjPK13ISeqOutStreamPKvjE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeqOutStream",
   "name" : "ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTI13ISeqOutStream",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Progress",
     "referenced_type" : "_ZTIPFiPK17ICompressProgressyyE"
    }
   ],
   "linker_set_key" : "_ZTI17ICompressProgress",
   "name" : "ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTI17ICompressProgress",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "NumPackStreams",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "NumFolders",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "PackPositions",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPy"
    },
    {
     "field_name" : "FolderCRCs",
     "field_offset" : 96,
     "referenced_type" : "_ZTI11CSzBitUi32s"
    },
    {
     "field_name" : "FoCodersOffsets",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "FoStartPackStreamIndex",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "FoToCoderUnpackSizes",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "FoToMainUnpackSizeIndex",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "CoderUnpackSizes",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPy"
    },
    {
     "field_name" : "CodersData",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPh"
    }
   ],
   "linker_set_key" : "_ZTI5CSzAr",
   "name" : "CSzAr",
   "referenced_type" : "_ZTI5CSzAr",
   "self_type" : "_ZTI5CSzAr",
   "size" : 44,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "db",
     "referenced_type" : "_ZTI5CSzAr"
    },
    {
     "field_name" : "startPosAfterHeader",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dataPos",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "NumFiles",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "UnpackPositions",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPy"
    },
    {
     "field_name" : "IsDirs",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "CRCs",
     "field_offset" : 608,
     "referenced_type" : "_ZTI11CSzBitUi32s"
    },
    {
     "field_name" : "Attribs",
     "field_offset" : 672,
     "referenced_type" : "_ZTI11CSzBitUi32s"
    },
    {
     "field_name" : "MTime",
     "field_offset" : 736,
     "referenced_type" : "_ZTI11CSzBitUi64s"
    },
    {
     "field_name" : "CTime",
     "field_offset" : 800,
     "referenced_type" : "_ZTI11CSzBitUi64s"
    },
    {
     "field_name" : "FolderToFile",
     "field_offset" : 864,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "FileToFolder",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "FileNameOffsets",
     "field_offset" : 928,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "FileNames",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPh"
    }
   ],
   "linker_set_key" : "_ZTI7CSzArEx",
   "name" : "CSzArEx",
   "referenced_type" : "_ZTI7CSzArEx",
   "self_type" : "_ZTI7CSzArEx",
   "size" : 128,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "InIndex",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "OutIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7CSzBond",
   "name" : "CSzBond",
   "referenced_type" : "_ZTI7CSzBond",
   "self_type" : "_ZTI7CSzBond",
   "size" : 8,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "Size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7CSzData",
   "name" : "CSzData",
   "referenced_type" : "_ZTI7CSzData",
   "self_type" : "_ZTI7CSzData",
   "size" : 8,
   "source_file" : "external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFhPK7IByteInE"
    }
   ],
   "linker_set_key" : "_ZTI7IByteIn",
   "name" : "IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTI7IByteIn",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bufs",
     "referenced_type" : "_ZTIA4_PKh"
    },
    {
     "field_name" : "lims",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA4_PKh"
    },
    {
     "field_name" : "dest",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "destLim",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "state",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ip",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "temp",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "range",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "code",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "probs",
     "field_offset" : 480,
     "referenced_type" : "_ZTIA258_t"
    }
   ],
   "linker_set_key" : "_ZTI8CBcj2Dec",
   "name" : "CBcj2Dec",
   "referenced_type" : "_ZTI8CBcj2Dec",
   "self_type" : "_ZTI8CBcj2Dec",
   "size" : 576,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bufs",
     "referenced_type" : "_ZTIA4_Ph"
    },
    {
     "field_name" : "lims",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA4_PKh"
    },
    {
     "field_name" : "src",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "srcLim",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "state",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "finishMode",
     "field_offset" : 352,
     "referenced_type" : "_ZTI19EBcj2Enc_FinishMode"
    },
    {
     "field_name" : "prevByte",
     "field_offset" : 384,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "cache",
     "field_offset" : 392,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "range",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "low",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cacheSize",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ip",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fileIp",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fileSize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "relatLimit",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempTarget",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempPos",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "temp",
     "field_offset" : 768,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "flushPos",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "probs",
     "field_offset" : 864,
     "referenced_type" : "_ZTIA258_t"
    }
   ],
   "linker_set_key" : "_ZTI8CBcj2Enc",
   "name" : "CBcj2Enc",
   "referenced_type" : "_ZTI8CBcj2Enc",
   "self_type" : "_ZTI8CBcj2Enc",
   "size" : 624,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "prop",
     "referenced_type" : "_ZTI11_CLzmaProps"
    },
    {
     "field_name" : "probs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPt"
    },
    {
     "field_name" : "probs_1664",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPt"
    },
    {
     "field_name" : "dic",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "dicBufSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dicPos",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buf",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "range",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "code",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "processedPos",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "checkDicSize",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reps",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA4_j"
    },
    {
     "field_name" : "state",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "remainLen",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numProbs",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempBufSize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempBuf",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA20_h"
    }
   ],
   "linker_set_key" : "_ZTI8CLzmaDec",
   "name" : "CLzmaDec",
   "referenced_type" : "_ZTI8CLzmaDec",
   "self_type" : "_ZTI8CLzmaDec",
   "size" : 100,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFvPK8IByteOuthE"
    }
   ],
   "linker_set_key" : "_ZTI8IByteOut",
   "name" : "IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTI8IByteOut",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Alloc",
     "referenced_type" : "_ZTIPFPvPK8ISzAllocjE"
    },
    {
     "field_name" : "Free",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPK8ISzAllocPvE"
    }
   ],
   "linker_set_key" : "_ZTI8ISzAlloc",
   "name" : "ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTI8ISzAlloc",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "control",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "needInitLevel",
     "field_offset" : 40,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "isExtraMode",
     "field_offset" : 48,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "_pad_",
     "field_offset" : 56,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "packSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unpackSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "decoder",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8CLzmaDec"
    }
   ],
   "linker_set_key" : "_ZTI9CLzma2Dec",
   "name" : "CLzma2Dec",
   "referenced_type" : "_ZTI9CLzma2Dec",
   "self_type" : "_ZTI9CLzma2Dec",
   "size" : 116,
   "source_file" : "external/lzma/C/Lzma2Dec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "NumCoders",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "NumBonds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "NumPackStreams",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "UnpackStream",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "PackStreams",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA4_j"
    },
    {
     "field_name" : "Bonds",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA3_7CSzBond"
    },
    {
     "field_name" : "Coders",
     "field_offset" : 448,
     "referenced_type" : "_ZTIA4_12CSzCoderInfo"
    }
   ],
   "linker_set_key" : "_ZTI9CSzFolder",
   "name" : "CSzFolder",
   "referenced_type" : "_ZTI9CSzFolder",
   "self_type" : "_ZTI9CSzFolder",
   "size" : 104,
   "source_file" : "external/lzma/C/7z.h"
  }
 ],
 "rvalue_reference_types" : []
}
