{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1024_h",
   "name" : "unsigned char [1024]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA1024_h",
   "size" : 1024,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA20_h",
   "name" : "unsigned char [20]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA20_h",
   "size" : 20,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA32_h",
   "name" : "unsigned char [32]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA32_h",
   "size" : 32,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA3_i",
   "name" : "int [3]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA3_i",
   "size" : 12,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA3_j",
   "name" : "unsigned int [3]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA3_j",
   "size" : 12,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4_12_IStateCoder",
   "name" : "_IStateCoder [4]",
   "referenced_type" : "_ZTI12_IStateCoder",
   "self_type" : "_ZTIA4_12_IStateCoder",
   "size" : 96,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA4_9CXzFilter",
   "name" : "CXzFilter [4]",
   "referenced_type" : "_ZTI9CXzFilter",

   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKy",
   "name" : "const unsigned long long *",
   "referenced_type" : "_ZTIKy",
   "self_type" : "_ZTIPKy",
   "size" : 4,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPKv",
   "name" : "const void **",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIPPKv",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 4,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPt",
   "name" : "unsigned short *",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIPt",
   "size" : 4,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPx",
   "name" : "long long *",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIPx",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPy",
   "name" : "unsigned long long *",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIPy",
   "size" : 4,
   "source_file" : "external/lzma/C/Xz.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIA6_Kh",
   "name" : "unsigned char const[6]",
   "referenced_type" : "_ZTIA6_h",
   "self_type" : "_ZTIA6_Kh",
   "size" : 6,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK11CXzUnpacker",
   "name" : "const CXzUnpacker",
   "referenced_type" : "_ZTI11CXzUnpacker",
   "self_type" : "_ZTIK11CXzUnpacker",
   "size" : 1784,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12ISeqInStream",
   "name" : "const ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTIK12ISeqInStream",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13CXzDecMtProps",
   "name" : "const CXzDecMtProps",
   "referenced_type" : "_ZTI13CXzDecMtProps",
   "self_type" : "_ZTIK13CXzDecMtProps",
   "size" : 12,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ILookInStream",
   "name" : "const ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTIK13ILookInStream",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeekInStream",
   "name" : "const ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTIK13ISeekInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeqOutStream",
   "name" : "const ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTIK13ISeqOutStream",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK17ICompressProgress",
   "name" : "const ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTIK17ICompressProgress",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7IByteIn",
   "name" : "const IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTIK7IByteIn",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8IByteOut",
   "name" : "const IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTIK8IByteOut",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8ISzAlloc",
   "name" : "const ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTIK8ISzAlloc",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/lzma/C/Xz.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToLook",
   "name" : "CSecToLook",
   "referenced_type" : "_ZTI10CSecToLook",
   "self_type" : "_ZTI10CSecToLook",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToRead",
   "name" : "CSecToRead",
   "referenced_type" : "_ZTI10CSecToRead",
   "self_type" : "_ZTI10CSecToRead",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "UnpackSize_Defined",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "NumStreams_Defined",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "NumBlocks_Defined",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "DataAfterEnd",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "DecodingTruncated",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "InSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "OutSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "NumStreams",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "NumBlocks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "DecodeRes",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ReadRes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ProgressRes",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "CombinedRes",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "CombinedRes_Type",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11CXzStatInfo",
   "name" : "CXzStatInfo",
   "referenced_type" : "_ZTI11CXzStatInfo",
   "self_type" : "_ZTI11CXzStatInfo",
   "size" : 64,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "_ZTI8EXzState"
    },
    {
     "field_name" : "pos",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alignPos",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "indexPreSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "streamFlags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "blockHeaderSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "packSize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "unpackSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "numBlocks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "indexSize",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "indexPos",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "padSize",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "numStartedStreams",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "numFinishedStreams",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "numTotalBlocks",
     "field_offset" : 704,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "crc",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "decoder",
     "field_offset" : 832,
     "referenced_type" : "_ZTI9CMixCoder"
    },
    {
     "field_name" : "block",
     "field_offset" : 2560,
     "referenced_type" : "_ZTI8CXzBlock"
    },
    {
     "field_name" : "check",
     "field_offset" : 3776,
     "referenced_type" : "_ZTI8CXzCheck"
    },
    {
     "field_name" : "sha",
     "field_offset" : 4736,
     "referenced_type" : "_ZTI7CSha256"
    },
    {
     "field_name" : "parseMode",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "headerParsedOk",
     "field_offset" : 5600,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "decodeToStreamSignature",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "decodeOnlyOneBlock",
     "field_offset" : 5664,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "outBuf",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "outBufSize",
     "field_offset" : 5728,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "outDataWritten",
     "field_offset" : 5760,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaDigest",
     "field_offset" : 5792,
     "referenced_type" : "_ZTIA32_h"
    },
    {
     "field_name" : "buf",
     "field_offset" : 6048,
     "referenced_type" : "_ZTIA1024_h"
    }
   ],
   "linker_set_key" : "_ZTI11CXzUnpacker",
   "name" : "CXzUnpacker",
   "referenced_type" : "_ZTI11CXzUnpacker",
   "self_type" : "_ZTI11CXzUnpacker",
   "size" : 1784,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lc",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "lp",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pb",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "_pad_",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "dicSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11_CLzmaProps",
   "name" : "_CLzmaProps",
   "referenced_type" : "_ZTI11_CLzmaProps",
   "self_type" : "_ZTI11_CLzmaProps",
   "size" : 8,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI13ILookInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK13ISeekInStream"
    },
    {
     "field_name" : "pos",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buf",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "bufSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12CLookToRead2",
   "name" : "CLookToRead2",
   "referenced_type" : "_ZTI12CLookToRead2",
   "self_type" : "_ZTI12CLookToRead2",
   "size" : 36,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK12ISeqInStreamPvPjE"
    }
   ],
   "linker_set_key" : "_ZTI12ISeqInStream",
   "name" : "ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTI12ISeqInStream",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "Free",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvPK8ISzAllocE"
    },
    {
     "field_name" : "SetProps",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPvPKhjPK8ISzAllocE"
    },
    {
     "field_name" : "Init",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "Code2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPvPhPjPKhS1_i16ECoderFinishModeP12ECoderStatusE"
    },
    {
     "field_name" : "Filter",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPvPhjE"
    }
   ],
   "linker_set_key" : "_ZTI12_IStateCoder",
   "name" : "_IStateCoder",
   "referenced_type" : "_ZTI12_IStateCoder",
   "self_type" : "_ZTI12_IStateCoder",
   "size" : 24,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "unpackSize",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "totalSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI13CXzBlockSizes",
   "name" : "CXzBlockSizes",
   "referenced_type" : "_ZTI13CXzBlockSizes",
   "self_type" : "_ZTI13CXzBlockSizes",
   "size" : 16,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "inBufSize_ST",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "outStep_ST",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ignoreErrors",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI13CXzDecMtProps",
   "name" : "CXzDecMtProps",
   "referenced_type" : "_ZTI13CXzDecMtProps",
   "self_type" : "_ZTI13CXzDecMtProps",
   "size" : 12,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Look",
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPPKvPjE"
    },
    {
     "field_name" : "Skip",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamjE"
    },
    {
     "field_name" : "Read",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPvPjE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ILookInStream",
   "name" : "ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTI13ILookInStream",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPvPjE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeekInStream",
   "name" : "ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTI13ISeekInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFjPK13ISeqOutStreamPKvjE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeqOutStream",
   "name" : "ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTI13ISeqOutStream",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI8ISzAlloc"
    },
    {
     "field_name" : "baseAlloc",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK8ISzAlloc"
    },
    {
     "field_name" : "numAlignBits",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17CAlignOffsetAlloc",
   "name" : "CAlignOffsetAlloc",
   "referenced_type" : "_ZTI17CAlignOffsetAlloc",
   "self_type" : "_ZTI17CAlignOffsetAlloc",
   "size" : 20,
   "source_file" : "external/lzma/C/Alloc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Progress",
     "referenced_type" : "_ZTIPFiPK17ICompressProgressyyE"
    }
   ],
   "linker_set_key" : "_ZTI17ICompressProgress",
   "name" : "ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTI17ICompressProgress",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numAllocated",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "streams",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9CXzStream"
    }
   ],
   "linker_set_key" : "_ZTI4CXzs",
   "name" : "CXzs",
   "referenced_type" : "_ZTI4CXzs",
   "self_type" : "_ZTI4CXzs",
   "size" : 12,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "count",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA64_h"
    }
   ],
   "linker_set_key" : "_ZTI7CSha256",
   "name" : "CSha256",
   "referenced_type" : "_ZTI7CSha256",
   "self_type" : "_ZTI7CSha256",
   "size" : 104,
   "source_file" : "external/lzma/C/Sha256.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFhPK7IByteInE"
    }
   ],
   "linker_set_key" : "_ZTI7IByteIn",
   "name" : "IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTI7IByteIn",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "prop",
     "referenced_type" : "_ZTI11_CLzmaProps"
    },
    {
     "field_name" : "probs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPt"
    },
    {
     "field_name" : "probs_1664",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPt"
    },
    {
     "field_name" : "dic",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "dicBufSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dicPos",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buf",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "range",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "code",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "processedPos",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "checkDicSize",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reps",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA4_j"
    },
    {
     "field_name" : "state",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "remainLen",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numProbs",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempBufSize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempBuf",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA20_h"
    }
   ],
   "linker_set_key" : "_ZTI8CLzmaDec",
   "name" : "CLzmaDec",
   "referenced_type" : "_ZTI8CLzmaDec",
   "self_type" : "_ZTI8CLzmaDec",
   "size" : 100,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "packSize",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "unpackSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "filters",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA4_9CXzFilter"
    }
   ],
   "linker_set_key" : "_ZTI8CXzBlock",
   "name" : "CXzBlock",
   "referenced_type" : "_ZTI8CXzBlock",
   "self_type" : "_ZTI8CXzBlock",
   "size" : 152,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "crc",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "crc64",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sha",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7CSha256"
    }
   ],
   "linker_set_key" : "_ZTI8CXzCheck",
   "name" : "CXzCheck",
   "referenced_type" : "_ZTI8CXzCheck",
   "self_type" : "_ZTI8CXzCheck",
   "size" : 120,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFvPK8IByteOuthE"
    }
   ],
   "linker_set_key" : "_ZTI8IByteOut",
   "name" : "IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTI8IByteOut",
   "size" : 4,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Alloc",
     "referenced_type" : "_ZTIPFPvPK8ISzAllocjE"
    },
    {
     "field_name" : "Free",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPK8ISzAllocPvE"
    }
   ],
   "linker_set_key" : "_ZTI8ISzAlloc",
   "name" : "ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTI8ISzAlloc",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "control",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "needInitLevel",
     "field_offset" : 40,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "isExtraMode",
     "field_offset" : 48,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "_pad_",
     "field_offset" : 56,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "packSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unpackSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "decoder",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8CLzmaDec"
    }
   ],
   "linker_set_key" : "_ZTI9CLzma2Dec",
   "name" : "CLzma2Dec",
   "referenced_type" : "_ZTI9CLzma2Dec",
   "self_type" : "_ZTI9CLzma2Dec",
   "size" : 116,
   "source_file" : "external/lzma/C/Lzma2Dec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "alloc",
     "referenced_type" : "_ZTIPK8ISzAlloc"
    },
    {
     "field_name" : "buf",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "numCoders",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "outBuf",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "outBufSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "outWritten",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "wasFinished",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "res",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "status",
     "field_offset" : 256,
     "referenced_type" : "_ZTI12ECoderStatus"
    },
    {
     "field_name" : "finished",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA3_i"
    },
    {
     "field_name" : "pos",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA3_j"
    },
    {
     "field_name" : "size",
     "field_offset" : 480,
     "referenced_type" : "_ZTIA3_j"
    },
    {
     "field_name" : "ids",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA4_y"
    },
    {
     "field_name" : "results",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "coders",
     "field_offset" : 960,
     "referenced_type" : "_ZTIA4_12_IStateCoder"
    }
   ],
   "linker_set_key" : "_ZTI9CMixCoder",
   "name" : "CMixCoder",
   "referenced_type" : "_ZTI9CMixCoder",
   "self_type" : "_ZTI9CMixCoder",
   "size" : 216,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "propsSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "props",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA20_h"
    }
   ],
   "linker_set_key" : "_ZTI9CXzFilter",
   "name" : "CXzFilter",
   "referenced_type" : "_ZTI9CXzFilter",
   "self_type" : "_ZTI9CXzFilter",
   "size" : 32,
   "source_file" : "external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "numBlocks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "blocks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP13CXzBlockSizes"
    },
    {
     "field_name" : "startOffset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI9CXzStream",
   "name" : "CXzStream",
   "referenced_type" : "_ZTI9CXzStream",
   "self_type" : "_ZTI9CXzStream",
   "size" : 24,
   "source_file" : "external/lzma/C/Xz.h"
  }
 ],
 "rvalue_reference_types" : []
}
