#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GNSS_V1_0_IGNSSCALLBACK_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GNSS_V1_0_IGNSSCALLBACK_H

#include <android/hardware/gnss/1.0/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace gnss {
namespace V1_0 {

/**
 * The interface is required for the HAL to communicate certain information
 * like status and location info back to the platform, the platform implements
 * the interfaces and passes a handle to the HAL.
 */
struct IGnssCallback : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.gnss@1.0::IGnssCallback"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class Capabilities : uint32_t;
    enum class GnssStatusValue : uint8_t;
    enum class GnssSvFlags : uint8_t;
    struct GnssSvInfo;
    struct GnssSvStatus;
    struct GnssSystemInfo;

    /**
     * Flags for the gnssSetCapabilities callback.
     */
    enum class Capabilities : uint32_t {
        /**
         * GNSS HAL schedules fixes for RECURRENCE_PERIODIC mode.
         * If this is not set, then the framework will use 1000ms for
         * minInterval and will call start() and stop() to schedule the GNSS.
         */
        SCHEDULING = 1u /* 1 << 0 */,
        /**
         * GNSS supports MS-Based AGNSS mode
         */
        MSB = 2u /* 1 << 1 */,
        /**
         * GNSS supports MS-Assisted AGNSS mode
         */
        MSA = 4u /* 1 << 2 */,
        /**
         * GNSS supports single-shot fixes
         */
        SINGLE_SHOT = 8u /* 1 << 3 */,
        /**
         * GNSS supports on demand time injection
         */
        ON_DEMAND_TIME = 16u /* 1 << 4 */,
        /**
         * GNSS supports Geofencing
         */
        GEOFENCING = 32u /* 1 << 5 */,
        /**
         * GNSS supports Measurements for at least GPS.
         */
        MEASUREMENTS = 64u /* 1 << 6 */,
        /**
         * GNSS supports Navigation Messages
         */
        NAV_MESSAGES = 128u /* 1 << 7 */,
    };

    /**
     * GNSS status event values.
     */
    enum class GnssStatusValue : uint8_t {
        /**
         * GNSS status unknown.
         */
        NONE = 0,
        /**
         * GNSS has begun navigating.
         */
        SESSION_BEGIN = 1,
        /**
         * GNSS has stopped navigating.
         */
        SESSION_END = 2,
        /**
         * GNSS has powered on but is not navigating.
         */
        ENGINE_ON = 3,
        /**
         * GNSS is powered off.
         */
        ENGINE_OFF = 4,
    };

    /**
     * Flags that indicate information about the satellite
     */
    enum class GnssSvFlags : uint8_t {
        NONE = 0,
        HAS_EPHEMERIS_DATA = 1 /* 1 << 0 */,
        HAS_ALMANAC_DATA = 2 /* 1 << 1 */,
        USED_IN_FIX = 4 /* 1 << 2 */,
        HAS_CARRIER_FREQUENCY = 8 /* 1 << 3 */,
    };

    struct GnssSvInfo final {
        /**
         * Pseudo-random or satellite ID number for the satellite, a.k.a. Space Vehicle (SV), or
         * FCN/OSN number for Glonass. The distinction is made by looking at constellation field.
         * Values must be in the range of:
         *
         * - GNSS:    1-32
         * - SBAS:    120-151, 183-192
         * - GLONASS: 1-24, the orbital slot number (OSN), if known.  Or, if not:
         *            93-106, the frequency channel number (FCN) (-7 to +6) offset by
         *            + 100
         *            i.e. report an FCN of -7 as 93, FCN of 0 as 100, and FCN of +6
         *            as 106.
         * - QZSS:    193-200
         * - Galileo: 1-36
         * - Beidou:  1-37
         * - IRNSS:   1-14
         */
        int16_t svid __attribute__ ((aligned(2)));
        /**
         * Defines the constellation of the given SV.
         */
        ::android::hardware::gnss::V1_0::GnssConstellationType constellation __attribute__ ((aligned(1)));
        /**
         * Carrier-to-noise density in dB-Hz, typically in the range [0, 63].
         * It contains the measured C/N0 value for the signal at the antenna port.
         *
         * This is a mandatory value.
         */
        float cN0Dbhz __attribute__ ((aligned(4)));
        /**
         * Elevation of SV in degrees.
         */
        float elevationDegrees __attribute__ ((aligned(4)));
        /**
         * Azimuth of SV in degrees.
         */
        float azimuthDegrees __attribute__ ((aligned(4)));
        /**
         * Carrier frequency of the signal tracked, for example it can be the
         * GPS central frequency for L1 = 1575.45 MHz, or L2 = 1227.60 MHz, L5 =
         * 1176.45 MHz, varying GLO channels, etc. If the field is zero, it is
         * the primary common use central frequency, e.g. L1 = 1575.45 MHz for
         * GPS.
         *
         * For an L1, L5 receiver tracking a satellite on L1 and L5 at the same
         * time, two GnssSvInfo structs must be reported for this same
         * satellite, in one of the structs, all the values related
         * to L1 must be filled, and in the other all of the values related to
         * L5 must be filled.
         *
         * If the data is available, svFlag must contain HAS_CARRIER_FREQUENCY.
         */
        float carrierFrequencyHz __attribute__ ((aligned(4)));
        /**
         * Contains additional data about the given SV.
         */
        ::android::hardware::hidl_bitfield<::android::hardware::gnss::V1_0::IGnssCallback::GnssSvFlags> svFlag __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvInfo, svid) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvInfo, constellation) == 2, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvInfo, cN0Dbhz) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvInfo, elevationDegrees) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvInfo, azimuthDegrees) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvInfo, carrierFrequencyHz) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvInfo, svFlag) == 20, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvInfo) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvInfo) == 4, "wrong alignment");

    /**
     * Represents SV status.
     */
    struct GnssSvStatus final {
        /**
         * Number of GNSS SVs currently visible, refers to the SVs stored in sv_list
         */
        uint32_t numSvs __attribute__ ((aligned(4)));
        /**
         * Pointer to an array of SVs information for all GNSS constellations,
         * except GNSS, which is reported using svList
         */
        ::android::hardware::hidl_array<::android::hardware::gnss::V1_0::IGnssCallback::GnssSvInfo, 64 /* GnssMax:SVS_COUNT */> gnssSvList __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvStatus, numSvs) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvStatus, gnssSvList) == 4, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvStatus) == 1540, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSvStatus) == 4, "wrong alignment");

    /**
     * Provides information about how new the underlying GPS/GNSS hardware and
     * software is.
     *
     * This information will be available for Android Test Applications. If a GNSS
     * HAL does not provide this information, it will be considered "2015 or
     * earlier".
     *
     * If a GNSS HAL does provide this information, then newer years will need to
     * meet newer CTS standards. E.g. if the date are 2016 or above, then N+ level
     * GnssMeasurement support will be verified.
     */
    struct GnssSystemInfo final {
        /**
         * year in which the last update was made to the underlying hardware/firmware
         * used to capture GNSS signals, e.g. 2016
         */
        uint16_t yearOfHw __attribute__ ((aligned(2)));
    };

    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSystemInfo, yearOfHw) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSystemInfo) == 2, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V1_0::IGnssCallback::GnssSystemInfo) == 2, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Called when a GNSS location is available.
     *
     * @param location Location information from HAL.
     */
    virtual ::android::hardware::Return<void> gnssLocationCb(const ::android::hardware::gnss::V1_0::GnssLocation& location) = 0;

    /**
     * Called to communicate the status of the GNSS engine.
     *
     * @param status Status information from HAL.
     */
    virtual ::android::hardware::Return<void> gnssStatusCb(::android::hardware::gnss::V1_0::IGnssCallback::GnssStatusValue status) = 0;

    /**
     * @param svInfo SV status information from HAL.
     */
