{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_c",
   "name" : "char [16]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA16_c",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_N4llvm21AlignedCharArrayUnionIPKvcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<const void *, char, char, char, char, char, char, char, char, char> [1]",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPKvcccccccccEE",
   "self_type" : "_ZTIA1_N4llvm21AlignedCharArrayUnionIPKvcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1_c",
   "name" : "char [1]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA1_c",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA256_h",
   "name" : "unsigned char [256]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA256_h",
   "size" : 256,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA3_N4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<void *, char, char, char, char, char, char, char, char, char> [3]",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",

   "self_type" : "_ZTIKNSt3__16vectorIPKN4llvm8PassInfoENS_9allocatorIS4_EEEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/PassInfo.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/PassInfo.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKv",
   "name" : "const void *const",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIKPKv",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm4PassE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm10ModulePassE",
   "name" : "llvm::ModulePass",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm10ModulePassE",
   "self_type" : "_ZTIN4llvm10ModulePassE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Pass.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm10ModulePassE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm10ModulePassD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm10ModulePassD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass11getPassNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass16doInitializationERNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass14doFinalizationERNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass5printERNS_11raw_ostreamEPKNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm10ModulePass17createPrinterPassERNS_11raw_ostreamERKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm10ModulePass17assignPassManagerERNS_7PMStackENS_15PassManagerTypeE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18preparePassManagerERNS_7PMStackE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm10ModulePass27getPotentialPassManagerTypeEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass16getAnalysisUsageERNS_13AnalysisUsageE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass13releaseMemoryEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass26getAdjustedAnalysisPointerEPKv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18getAsImmutablePassEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18getAsPMDataManagerEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass14verifyAnalysisEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass17dumpPassStructureEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm10ModulePass11runOnModuleERNS_6ModuleE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "name" : "llvm::SmallVector<std::pair<void *, unsigned long>, 0>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPKvEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPKvLj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIPKvLj0EEE",
   "name" : "llvm::SmallVector<const void *, 0>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIPKvLj0EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIPKvLj0EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPKvEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPKvLj2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIPKvLj2EEE",
   "name" : "llvm::SmallVector<const void *, 2>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIPKvLj2EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIPKvLj2EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPKvEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPKvLj8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIPKvLj8EEE",
   "name" : "llvm::SmallVector<const void *, 8>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIPKvLj8EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIPKvLj8EEE",
   "size" : 88,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPvEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "name" : "llvm::SmallVector<void *, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm14DebugEpochBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm12DenseMapBaseINS_8DenseMapIPKvPKNS_8PassInfoENS_12DenseMapInfoIS3_EENS_6detail12DenseMapPairIS3_S6_EEEES3_S6_S8_SB_EE",
   "name" : "llvm::DenseMapBase<llvm::DenseMap<const void *, const llvm::PassInfo *, llvm::DenseMapInfo<const void *>, llvm::detail::DenseMapPair<const void *, const llvm::PassInfo *>>, const void *, const llvm::PassInfo *, llvm::DenseMapInfo<const void *>, llvm::detail::DenseMapPair<const void *, const llvm::PassInfo *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm12DenseMapBaseINS_8DenseMapIPKvPKNS_8PassInfoENS_12DenseMapInfoIS3_EENS_6detail12DenseMapPairIS3_S6_EEEES3_S6_S8_SB_EE",
   "self_type" : "_ZTIN4llvm12DenseMapBaseINS_8DenseMapIPKvPKNS_8PassInfoENS_12DenseMapInfoIS3_EENS_6detail12DenseMapPairIS3_S6_EEEES3_S6_S8_SB_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMap.h",
   "template_args" :
   [
    "_ZTIN4llvm8DenseMapIPKvPKNS_8PassInfoENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EEEE",
    "_ZTIPKv",
    "_ZTIPKN4llvm8PassInfoE",
    "_ZTIN4llvm12DenseMapInfoIPKvEE",
    "_ZTIN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoINS_9StringRefEEE",
   "name" : "llvm::DenseMapInfo<llvm::StringRef>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoINS_9StringRefEEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoINS_9StringRefEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIPKvEE",
   "name" : "llvm::DenseMapInfo<const void *>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIPKvEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIPKvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIcEE",
   "name" : "llvm::DenseMapInfo<char>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIcEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIcEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIiEE",
   "name" : "llvm::DenseMapInfo<int>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIiEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIiEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIjEE",
   "name" : "llvm::DenseMapInfo<unsigned int>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIjEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIjEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIlEE",
   "name" : "llvm::DenseMapInfo<long>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIlEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIlEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoImEE",
   "name" : "llvm::DenseMapInfo<unsigned long>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoImEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoImEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIxEE",
   "name" : "llvm::DenseMapInfo<long long>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIxEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIxEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIyEE",
   "name" : "llvm::DenseMapInfo<unsigned long long>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIyEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIyEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm4PassE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm12FunctionPassE",
   "name" : "llvm::FunctionPass",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm12FunctionPassE",
   "self_type" : "_ZTIN4llvm12FunctionPassE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Pass.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm12FunctionPassE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm12FunctionPassD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm12FunctionPassD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass11getPassNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass16doInitializationERNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass14doFinalizationERNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass5printERNS_11raw_ostreamEPKNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm12FunctionPass17createPrinterPassERNS_11raw_ostreamERKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm12FunctionPass17assignPassManagerERNS_7PMStackENS_15PassManagerTypeE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18preparePassManagerERNS_7PMStackE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm12FunctionPass27getPotentialPassManagerTypeEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass16getAnalysisUsageERNS_13AnalysisUsageE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass13releaseMemoryEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass26getAdjustedAnalysisPointerEPKv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18getAsImmutablePassEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18getAsPMDataManagerEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass14verifyAnalysisEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass17dumpPassStructureEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm12FunctionPass13runOnFunctionERNS_8FunctionE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Lock",
     "referenced_type" : "_ZTIN4llvm3sys12SmartRWMutexILb1EEE"
    },
    {
     "access" : "private",
     "field_name" : "PassInfoMap",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm8DenseMapIPKvPKNS_8PassInfoENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "PassInfoStringMap",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4llvm9StringMapIPKNS_8PassInfoENS_15MallocAllocatorEEE"
    },
    {
     "access" : "private",
     "field_name" : "ToFree",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorINS_10unique_ptrIKN4llvm8PassInfoENS_14default_deleteIS4_EEEENS_9allocatorIS7_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "Listeners",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__16vectorIPN4llvm24PassRegistrationListenerENS_9allocatorIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm12PassRegistryE",
   "name" : "llvm::PassRegistry",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm12PassRegistryE",
   "self_type" : "_ZTIN4llvm12PassRegistryE",
   "size" : 120,
   "source_file" : "external/llvm/include/llvm/PassRegistry.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "name" : "llvm::AllocatorBase<llvm::MallocAllocator>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "self_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" : [ "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "name" : "llvm::AllocatorBase<llvm::BumpPtrAllocatorImpl<llvm::MallocAllocator, 4096, 4096>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "self_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" :
   [
    "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Required",
     "referenced_type" : "_ZTIN4llvm11SmallVectorIPKvLj8EEE"
    },
    {
     "access" : "private",
     "field_name" : "RequiredTransitive",
     "field_offset" : 704,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIPKvLj2EEE"
    },
    {
     "access" : "private",
     "field_name" : "Preserved",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIPKvLj2EEE"
    },
    {
     "access" : "private",
     "field_name" : "Used",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIPKvLj0EEE"
    },
    {
     "access" : "private",
     "field_name" : "PreservesAll",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm13AnalysisUsageE",
   "name" : "llvm::AnalysisUsage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13AnalysisUsageE",
   "self_type" : "_ZTIN4llvm13AnalysisUsageE",
   "size" : 216,
   "source_file" : "external/llvm/include/llvm/PassAnalysisSupport.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm10ModulePassE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm13ImmutablePassE",
   "name" : "llvm::ImmutablePass",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13ImmutablePassE",
   "self_type" : "_ZTIN4llvm13ImmutablePassE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Pass.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm13ImmutablePassE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm13ImmutablePassD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm13ImmutablePassD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass11getPassNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass16doInitializationERNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass14doFinalizationERNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass5printERNS_11raw_ostreamEPKNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm10ModulePass17createPrinterPassERNS_11raw_ostreamERKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm10ModulePass17assignPassManagerERNS_7PMStackENS_15PassManagerTypeE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18preparePassManagerERNS_7PMStackE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm10ModulePass27getPotentialPassManagerTypeEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass16getAnalysisUsageERNS_13AnalysisUsageE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass13releaseMemoryEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass26getAdjustedAnalysisPointerEPKv"
    },
    {
     "mangled_component_name" : "_ZN4llvm13ImmutablePass18getAsImmutablePassEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18getAsPMDataManagerEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass14verifyAnalysisEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass17dumpPassStructureEj"
    },
    {
     "mangled_component_name" : "_ZN4llvm13ImmutablePass11runOnModuleERNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZN4llvm13ImmutablePass14initializePassEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm17ManagedStaticBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm13ManagedStaticINS_12PassRegistryEEE",
   "name" : "llvm::ManagedStatic<llvm::PassRegistry>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13ManagedStaticINS_12PassRegistryEEE",
   "self_type" : "_ZTIN4llvm13ManagedStaticINS_12PassRegistryEEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/ManagedStatic.h",
   "template_args" : [ "_ZTIN4llvm12PassRegistryE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "TheTable",
     "referenced_type" : "_ZTIPPN4llvm18StringMapEntryBaseE"
    },
    {
     "access" : "protected",
     "field_name" : "NumBuckets",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumItems",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumTombstones",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "ItemSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm13StringMapImplE",
   "name" : "llvm::StringMapImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13StringMapImplE",
   "self_type" : "_ZTIN4llvm13StringMapImplE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm4PassE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14BasicBlockPassE",
   "name" : "llvm::BasicBlockPass",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14BasicBlockPassE",
   "self_type" : "_ZTIN4llvm14BasicBlockPassE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Pass.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm14BasicBlockPassE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm14BasicBlockPassD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm14BasicBlockPassD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass11getPassNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass16doInitializationERNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass14doFinalizationERNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass5printERNS_11raw_ostreamEPKNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm14BasicBlockPass17createPrinterPassERNS_11raw_ostreamERKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm14BasicBlockPass17assignPassManagerERNS_7PMStackENS_15PassManagerTypeE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18preparePassManagerERNS_7PMStackE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm14BasicBlockPass27getPotentialPassManagerTypeEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass16getAnalysisUsageERNS_13AnalysisUsageE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass13releaseMemoryEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass26getAdjustedAnalysisPointerEPKv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18getAsImmutablePassEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18getAsPMDataManagerEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass14verifyAnalysisEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass17dumpPassStructureEj"
    },
    {
     "mangled_component_name" : "_ZN4llvm14BasicBlockPass16doInitializationERNS_8FunctionE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm14BasicBlockPass15runOnBasicBlockERNS_10BasicBlockE"
    },
    {
     "mangled_component_name" : "_ZN4llvm14BasicBlockPass14doFinalizationERNS_8FunctionE"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm14DebugEpochBase10HandleBaseE",
   "name" : "llvm::DebugEpochBase::HandleBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14DebugEpochBase10HandleBaseE",
   "self_type" : "_ZTIN4llvm14DebugEpochBase10HandleBaseE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/EpochTracker.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm14DebugEpochBaseE",
   "name" : "llvm::DebugEpochBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14DebugEpochBaseE",
   "self_type" : "_ZTIN4llvm14DebugEpochBaseE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/EpochTracker.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm8PassInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14RegisterAGBaseE",
   "name" : "llvm::RegisterAGBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14RegisterAGBaseE",
   "self_type" : "_ZTIN4llvm14RegisterAGBaseE",
   "size" : 72,
   "source_file" : "external/llvm/include/llvm/PassSupport.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm18StringMapEntryBaseE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "second",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKN4llvm8PassInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14StringMapEntryIPKNS_8PassInfoEEE",
   "name" : "llvm::StringMapEntry<const llvm::PassInfo *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14StringMapEntryIPKNS_8PassInfoEEE",
   "self_type" : "_ZTIN4llvm14StringMapEntryIPKNS_8PassInfoEEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h",
   "template_args" : [ "_ZTIPKN4llvm8PassInfoE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "name" : "llvm::iterator_range<const unsigned char *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIPKh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm14object_deleterINS_12PassRegistryEEE",
   "name" : "llvm::object_deleter<llvm::PassRegistry>",
   "referenced_type" : "_ZTIN4llvm14object_deleterINS_12PassRegistryEEE",
   "self_type" : "_ZTIN4llvm14object_deleterINS_12PassRegistryEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/ManagedStatic.h",
   "template_args" : [ "_ZTIN4llvm12PassRegistryE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15MallocAllocatorE",
   "name" : "llvm::MallocAllocator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15MallocAllocatorE",
   "self_type" : "_ZTIN4llvm15MallocAllocatorE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "BeginX",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "EndX",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "CapacityX",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorBaseE",
   "name" : "llvm::SmallVectorBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE",
   "self_type" : "_ZTIN4llvm15SmallVectorBaseE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "name" : "llvm::SmallVectorImpl<std::pair<void *, unsigned long>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPKvLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplIPKvEE",
   "name" : "llvm::SmallVectorImpl<const void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPKvEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplIPKvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "name" : "llvm::SmallVectorImpl<void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "name" : "llvm::AlignedCharArray<8, 16>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA8_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "name" : "llvm::AlignedCharArray<8, 8>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "AnalysisImpls",
     "referenced_type" : "_ZTINSt3__16vectorINS_4pairIPKvPN4llvm4PassEEENS_9allocatorIS7_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "PM",
     "field_offset" : 192,
     "referenced_type" : "_ZTIRN4llvm13PMDataManagerE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AnalysisResolverE",
   "name" : "llvm::AnalysisResolver",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm16AnalysisResolverE",
   "self_type" : "_ZTIN4llvm16AnalysisResolverE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/PassAnalysisSupport.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN4llvm14DebugEpochBase10HandleBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Ptr",
     "referenced_type" : "_ZTIPN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE"
    },
    {
     "access" : "private",
     "field_name" : "End",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16DenseMapIteratorIPKvPKNS_8PassInfoENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EELb0EEE",
   "name" : "llvm::DenseMapIterator<const void *, const llvm::PassInfo *, llvm::DenseMapInfo<const void *>, llvm::detail::DenseMapPair<const void *, const llvm::PassInfo *>, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm16DenseMapIteratorIPKvPKNS_8PassInfoENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EELb0EEE",
   "self_type" : "_ZTIN4llvm16DenseMapIteratorIPKvPKNS_8PassInfoENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EELb0EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMap.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIPKN4llvm8PassInfoE",
    "_ZTIN4llvm12DenseMapInfoIPKvEE",
    "_ZTIN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN4llvm14DebugEpochBase10HandleBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Ptr",
     "referenced_type" : "_ZTIPKN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE"
    },
    {
     "access" : "private",
     "field_name" : "End",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16DenseMapIteratorIPKvPKNS_8PassInfoENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EELb1EEE",
   "name" : "llvm::DenseMapIterator<const void *, const llvm::PassInfo *, llvm::DenseMapInfo<const void *>, llvm::detail::DenseMapPair<const void *, const llvm::PassInfo *>, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm16DenseMapIteratorIPKvPKNS_8PassInfoENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EELb1EEE",
   "self_type" : "_ZTIN4llvm16DenseMapIteratorIPKvPKNS_8PassInfoENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EELb1EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMap.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIPKN4llvm8PassInfoE",
    "_ZTIN4llvm12DenseMapInfoIPKvEE",
    "_ZTIN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "Ptr",
     "referenced_type" : "_ZTINSt3__16atomicIPvEE"
    },
    {
     "access" : "protected",
     "field_name" : "DeleterFn",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "access" : "protected",
     "field_name" : "Next",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKN4llvm17ManagedStaticBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm17ManagedStaticBaseE",
   "name" : "llvm::ManagedStaticBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm17ManagedStaticBaseE",
   "self_type" : "_ZTIN4llvm17ManagedStaticBaseE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/ManagedStatic.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm22StringMapConstIteratorIPKNS_8PassInfoEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm17StringMapIteratorIPKNS_8PassInfoEEE",
   "name" : "llvm::StringMapIterator<const llvm::PassInfo *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm17StringMapIteratorIPKNS_8PassInfoEEE",
   "self_type" : "_ZTIN4llvm17StringMapIteratorIPKNS_8PassInfoEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h",
   "template_args" : [ "_ZTIPKN4llvm8PassInfoE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm17llvm_shutdown_objE",
   "name" : "llvm::llvm_shutdown_obj",
   "referenced_type" : "_ZTIN4llvm17llvm_shutdown_objE",
   "self_type" : "_ZTIN4llvm17llvm_shutdown_objE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/ManagedStatic.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "name" : "llvm::SmallVectorStorage<std::pair<void *, unsigned long>, 0>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIPKvLj0EEE",
   "name" : "llvm::SmallVectorStorage<const void *, 0>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPKvLj0EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIPKvLj0EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA1_N4llvm21AlignedCharArrayUnionIPKvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIPKvLj2EEE",
   "name" : "llvm::SmallVectorStorage<const void *, 2>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPKvLj2EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIPKvLj2EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA7_N4llvm21AlignedCharArrayUnionIPKvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIPKvLj8EEE",
   "name" : "llvm::SmallVectorStorage<const void *, 8>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPKvLj8EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIPKvLj8EEE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "name" : "llvm::SmallVectorStorage<void *, 4>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "StrLen",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18StringMapEntryBaseE",
   "name" : "llvm::StringMapEntryBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm18StringMapEntryBaseE",
   "self_type" : "_ZTIN4llvm18StringMapEntryBaseE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "SmallArray",
     "referenced_type" : "_ZTIPPKv"
    },
    {
     "access" : "protected",
     "field_name" : "CurArray",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPPKv"
    },
    {
     "access" : "protected",
     "field_name" : "CurArraySize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumNonEmpty",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumTombstones",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm19SmallPtrSetImplBaseE",
   "name" : "llvm::SmallPtrSetImplBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm19SmallPtrSetImplBaseE",
   "self_type" : "_ZTIN4llvm19SmallPtrSetImplBaseE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm19is_integral_or_enumINS_9StringRefEEE",
   "name" : "llvm::is_integral_or_enum<llvm::StringRef>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm19is_integral_or_enumINS_9StringRefEEE",
   "self_type" : "_ZTIN4llvm19is_integral_or_enumINS_9StringRefEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "CurPtr",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "End",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "Slabs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE"
    },
    {
     "access" : "private",
     "field_name" : "CustomSizedSlabs",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE"
    },
    {
     "access" : "private",
     "field_name" : "BytesAllocated",
     "field_offset" : 960,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "Allocator",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIN4llvm15MallocAllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "name" : "llvm::BumpPtrAllocatorImpl<llvm::MallocAllocator, 4096, 4096>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "self_type" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "size" : 136,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" : [ "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionIPKvcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<const void *, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPKvcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPKvcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<void *, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPKvEE",
   "name" : "llvm::PointerLikeTypeTraits<const void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPKvEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPKvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "name" : "llvm::PointerLikeTypeTraits<llvm::StringMapEntryBase *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIPN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "name" : "llvm::PointerLikeTypeTraits<void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "name" : "llvm::PointerLikeTypeTraits<uintptr_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "Ptr",
     "referenced_type" : "_ZTIPPN4llvm18StringMapEntryBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm22StringMapConstIteratorIPKNS_8PassInfoEEE",
   "name" : "llvm::StringMapConstIterator<const llvm::PassInfo *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm22StringMapConstIteratorIPKNS_8PassInfoEEE",
   "self_type" : "_ZTIN4llvm22StringMapConstIteratorIPKNS_8PassInfoEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h",
   "template_args" : [ "_ZTIPKN4llvm8PassInfoE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "Bucket",
     "referenced_type" : "_ZTIPKPKv"
    },
    {
     "access" : "protected",
     "field_name" : "End",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKPKv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallPtrSetIteratorImplE",
   "name" : "llvm::SmallPtrSetIteratorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallPtrSetIteratorImplE",
   "self_type" : "_ZTIN4llvm23SmallPtrSetIteratorImplE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<std::pair<void *, unsigned long>, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPKvvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseIPKvLb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<const void *, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPKvLb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPKvLb1EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<void *, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN4llvm24PassRegistrationListenerE",
   "name" : "llvm::PassRegistrationListener",
   "referenced_type" : "_ZTIN4llvm24PassRegistrationListenerE",
   "self_type" : "_ZTIN4llvm24PassRegistrationListenerE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/PassSupport.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm24PassRegistrationListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm24PassRegistrationListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm24PassRegistrationListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm24PassRegistrationListener14passRegisteredEPKNS_8PassInfoE"
    },
    {
     "mangled_component_name" : "_ZN4llvm24PassRegistrationListener13passEnumerateEPKNS_8PassInfoE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<std::pair<void *, unsigned long>, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPKvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonIPKvvEE",
   "name" : "llvm::SmallVectorTemplateCommon<const void *, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPKvvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPKvvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPKv", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "name" : "llvm::SmallVectorTemplateCommon<void *, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Address",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "Size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys11MemoryBlockE",
   "name" : "llvm::sys::MemoryBlock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys11MemoryBlockE",
   "self_type" : "_ZTIN4llvm3sys11MemoryBlockE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys11RWMutexImplE",
   "name" : "llvm::sys::RWMutexImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys11RWMutexImplE",
   "self_type" : "_ZTIN4llvm3sys11RWMutexImplE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/RWMutex.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "impl",
     "referenced_type" : "_ZTIN4llvm3sys11RWMutexImplE"
    },
    {
     "access" : "private",
     "field_name" : "readers",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "writers",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys12SmartRWMutexILb1EEE",
   "name" : "llvm::sys::SmartRWMutex<true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys12SmartRWMutexILb1EEE",
   "self_type" : "_ZTIN4llvm3sys12SmartRWMutexILb1EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/RWMutex.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "M",
     "referenced_type" : "_ZTIN4llvm3sys11MemoryBlockE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "name" : "llvm::sys::OwningMemoryBlock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "self_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mutex",
     "referenced_type" : "_ZTIRN4llvm3sys12SmartRWMutexILb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys17SmartScopedReaderILb1EEE",
   "name" : "llvm::sys::SmartScopedReader<true>",
   "referenced_type" : "_ZTIN4llvm3sys17SmartScopedReaderILb1EEE",
   "self_type" : "_ZTIN4llvm3sys17SmartScopedReaderILb1EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/RWMutex.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mutex",
     "referenced_type" : "_ZTIRN4llvm3sys12SmartRWMutexILb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys17SmartScopedWriterILb1EEE",
   "name" : "llvm::sys::SmartScopedWriter<true>",
   "referenced_type" : "_ZTIN4llvm3sys17SmartScopedWriterILb1EEE",
   "self_type" : "_ZTIN4llvm3sys17SmartScopedWriterILb1EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/RWMutex.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm3sys6MemoryE",
   "name" : "llvm::sys::Memory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys6MemoryE",
   "self_type" : "_ZTIN4llvm3sys6MemoryE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Resolver",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN4llvm16AnalysisResolverE"
    },
    {
     "access" : "private",
     "field_name" : "PassID",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "access" : "private",
     "field_name" : "Kind",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm8PassKindE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm4PassE",
   "name" : "llvm::Pass",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm4PassE",
   "self_type" : "_ZTIN4llvm4PassE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Pass.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm4PassE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm4PassD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm4PassD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass11getPassNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass16doInitializationERNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass14doFinalizationERNS_6ModuleE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass5printERNS_11raw_ostreamEPKNS_6ModuleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm4Pass17createPrinterPassERNS_11raw_ostreamERKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass17assignPassManagerERNS_7PMStackENS_15PassManagerTypeE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18preparePassManagerERNS_7PMStackE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass27getPotentialPassManagerTypeEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass16getAnalysisUsageERNS_13AnalysisUsageE"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass13releaseMemoryEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass26getAdjustedAnalysisPointerEPKv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18getAsImmutablePassEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass18getAsPMDataManagerEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm4Pass14verifyAnalysisEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm4Pass17dumpPassStructureEj"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTINSt3__14pairIPvmEE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 136,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 144,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 152,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 160,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 168,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 176,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 184,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 80,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 88,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 120,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplIPKvcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<const void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPKvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplIPKvcccccccccEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 80,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 88,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 120,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "name" : "llvm::detail::ConstantLog2<1>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILm2EEE",
   "name" : "llvm::detail::ConstantLog2<2>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILm2EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILm2EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILm4EEE",
   "name" : "llvm::detail::ConstantLog2<4>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILm4EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILm4EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__14pairIPKvPKN4llvm8PassInfoEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE",
   "name" : "llvm::detail::DenseMapPair<const void *, const llvm::PassInfo *>",
   "referenced_type" : "_ZTIN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE",
   "self_type" : "_ZTIN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMap.h",
   "template_args" : [ "_ZTIPKv", "_ZTIPKN4llvm8PassInfoE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPKvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPKvcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<const void *, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPKvcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPKvcccccccccEELb0EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPKvcccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm14StringMapEntryIPKNS_8PassInfoEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_14StringMapEntryIPKNS_8PassInfoEEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::StringMapEntry<const llvm::PassInfo *>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_14StringMapEntryIPKNS_8PassInfoEEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_14StringMapEntryIPKNS_8PassInfoEEELb0EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm14StringMapEntryIPKNS_8PassInfoEEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm18StringMapEntryBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::StringMapEntryBase, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "name" : "llvm::detail::LeadingZerosCounter<unsigned int, 4>",
   "referenced_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "self_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "name" : "llvm::detail::LeadingZerosCounter<unsigned long, 8>",
   "referenced_type" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "self_type" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "name" : "llvm::detail::AlignmentCalcImplBase",
   "referenced_type" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "self_type" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE"
    },
    {
     "is_pure" : true,
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm6detail21AlignmentCalcImplBaseD1Ev"
    },
    {
     "is_pure" : true,
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm6detail21AlignmentCalcImplBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplIPKvcccccccccEE",
   "name" : "llvm::detail::SizerImpl<const void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplIPKvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplIPKvcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "name" : "llvm::detail::SizerImpl<void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_14StringMapEntryIPKNS_8PassInfoEEEEE",
   "name" : "llvm::AlignOf<llvm::StringMapEntry<const llvm::PassInfo *>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_14StringMapEntryIPKNS_8PassInfoEEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_14StringMapEntryIPKNS_8PassInfoEEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm14StringMapEntryIPKNS_8PassInfoEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "name" : "llvm::AlignOf<llvm::StringMapEntryBase>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPKvcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<const void *, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPKvcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPKvcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPKvcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "h0",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h4",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h5",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h6",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "name" : "llvm::hashing::detail::hash_state",
   "referenced_type" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "self_type" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA64_c"
    },
    {
     "field_name" : "state",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN4llvm7hashing6detail10hash_stateE"
    },
    {
     "field_name" : "seed",
     "field_offset" : 960,
     "referenced_type" : "_ZTIKm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "name" : "llvm::hashing::detail::hash_combine_recursive_helper",
   "referenced_type" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "self_type" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "size" : 128,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm12DenseMapBaseINS_8DenseMapIPKvPKNS_8PassInfoENS_12DenseMapInfoIS3_EENS_6detail12DenseMapPairIS3_S6_EEEES3_S6_S8_SB_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Buckets",
     "referenced_type" : "_ZTIPN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE"
    },
    {
     "access" : "private",
     "field_name" : "NumEntries",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "NumTombstones",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "NumBuckets",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm8DenseMapIPKvPKNS_8PassInfoENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EEEE",
   "name" : "llvm::DenseMap<const void *, const llvm::PassInfo *, llvm::DenseMapInfo<const void *>, llvm::detail::DenseMapPair<const void *, const llvm::PassInfo *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm8DenseMapIPKvPKNS_8PassInfoENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EEEE",
   "self_type" : "_ZTIN4llvm8DenseMapIPKvPKNS_8PassInfoENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EEEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMap.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIPKN4llvm8PassInfoE",
    "_ZTIN4llvm12DenseMapInfoIPKvEE",
    "_ZTIN4llvm6detail12DenseMapPairIPKvPKNS_8PassInfoEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "PassName",
     "referenced_type" : "_ZTIKPKc"
    },
    {
     "access" : "private",
     "field_name" : "PassArgument",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPKc"
    },
    {
     "access" : "private",
     "field_name" : "PassID",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "access" : "private",
     "field_name" : "IsCFGOnlyPass",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "private",
     "field_name" : "IsAnalysis",
     "field_offset" : 200,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "private",
     "field_name" : "IsAnalysisGroup",
     "field_offset" : 208,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "private",
     "field_name" : "ItfImpl",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorIPKN4llvm8PassInfoENS_9allocatorIS4_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "NormalCtor",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFPN4llvm4PassEvE"
    },
    {
     "access" : "private",
     "field_name" : "TargetMachineCtor",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFPN4llvm4PassEPNS_13TargetMachineEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm8PassInfoE",
   "name" : "llvm::PassInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm8PassInfoE",
   "self_type" : "_ZTIN4llvm8PassInfoE",
   "size" : 72,
   "source_file" : "external/llvm/include/llvm/PassInfo.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13StringMapImplE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Allocator",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm15MallocAllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9StringMapIPKNS_8PassInfoENS_15MallocAllocatorEEE",
   "name" : "llvm::StringMap<const llvm::PassInfo *, llvm::MallocAllocator>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9StringMapIPKNS_8PassInfoENS_15MallocAllocatorEEE",
   "self_type" : "_ZTIN4llvm9StringMapIPKNS_8PassInfoENS_15MallocAllocatorEEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h",
   "template_args" : [ "_ZTIPKN4llvm8PassInfoE", "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9StringRefE",
   "name" : "llvm::StringRef",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9StringRefE",
   "self_type" : "_ZTIN4llvm9StringRefE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9hash_codeE",
   "name" : "llvm::hash_code",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9hash_codeE",
   "self_type" : "_ZTIN4llvm9hash_codeE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "name" : "llvm::isPodLike<llvm::StringRef>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "name" : "llvm::isPodLike<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIPKvEE",
   "name" : "llvm::isPodLike<const void *>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIPKvEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIPKvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIPvEE",
   "name" : "llvm::isPodLike<void *>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIPvEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIPvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeImEE",
   "name" : "llvm::isPodLike<unsigned long>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeImEE",
   "self_type" : "_ZTIN4llvm9isPodLikeImEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIm" ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION4llvm13StringMapImplE",
   "name" : "llvm::StringMapImpl &&",
   "referenced_type" : "_ZTIN4llvm13StringMapImplE",
   "self_type" : "_ZTION4llvm13StringMapImplE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION4llvm3sys17OwningMemoryBlockE",
   "name" : "llvm::sys::OwningMemoryBlock &&",
   "referenced_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "self_type" : "_ZTION4llvm3sys17OwningMemoryBlockE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIONSt3__14pairIPKvPKN4llvm8PassInfoEEE",
   "name" : "std::pair<const void *, const llvm::PassInfo *> &&",
   "referenced_type" : "_ZTINSt3__14pairIPKvPKN4llvm8PassInfoEEE",
   "self_type" : "_ZTIONSt3__14pairIPKvPKN4llvm8PassInfoEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMap.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIOPKN4llvm8PassInfoE",
   "name" : "const llvm::PassInfo *&&",
   "referenced_type" : "_ZTIPKN4llvm8PassInfoE",
   "self_type" : "_ZTIOPKN4llvm8PassInfoE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMap.h"
  },
  {
   "alignment" : 8,
