{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_c",
   "name" : "char [16]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA16_c",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1_c",
   "name" : "char [1]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA1_c",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA24_c",
   "name" : "char [24]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA24_c",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA256_h",
   "name" : "unsigned char [256]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA256_h",
   "size" : 256,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA3_N4llvm21AlignedCharArrayUnionINSt3__14pairIPKcNS2_IiS4_EEEEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<std::__1::pair<const char *, std::__1::pair<int, const char *>>, char, char, char, char, char, char, char, char, char> [3]",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPKcNS2_IiS4_EEEEcccccccccEE",
   "self_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionINSt3__14pairIPKcNS2_IiS4_EEEEcccccccccEE",
   "size" : 72,

   "referenced_type" : "_ZTIN4llvm9StringRefE",
   "self_type" : "_ZTIKN4llvm9StringRefE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4llvm9hash_codeE",
   "name" : "const llvm::hash_code",
   "referenced_type" : "_ZTIN4llvm9hash_codeE",
   "self_type" : "_ZTIKN4llvm9hash_codeE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/ErrorHandling.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKN4llvm4TypeE",
   "name" : "const llvm::Type *const",
   "referenced_type" : "_ZTIPKN4llvm4TypeE",
   "self_type" : "_ZTIKPKN4llvm4TypeE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/StringExtras.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKv",
   "name" : "const void *const",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIKPKv",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN4llvm15LLVMContextImplE",
   "name" : "llvm::LLVMContextImpl *const",
   "referenced_type" : "_ZTIPN4llvm15LLVMContextImplE",
   "self_type" : "_ZTIKPN4llvm15LLVMContextImplE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/IR/LLVMContext.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN4llvm2cl10SubCommandE",
   "name" : "llvm::cl::SubCommand *const",
   "referenced_type" : "_ZTIPN4llvm2cl10SubCommandE",
   "self_type" : "_ZTIKPN4llvm2cl10SubCommandE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN4llvm4TypeE",
   "name" : "llvm::Type *const",
   "referenced_type" : "_ZTIPN4llvm4TypeE",
   "self_type" : "_ZTIKPN4llvm4TypeE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/ArrayRef.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPv",
   "name" : "void *const",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIKPv",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMap.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/APInt.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13CompositeTypeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "SymbolTableEntry",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm10StructTypeE",
   "name" : "llvm::StructType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm10StructTypeE",
   "self_type" : "_ZTIN4llvm10StructTypeE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm14SequentialTypeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "NumElements",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm10VectorTypeE",
   "name" : "llvm::VectorType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm10VectorTypeE",
   "self_type" : "_ZTIN4llvm10VectorTypeE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEKPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::StructType, const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10StructTypeE", "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::StructType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10StructTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEKPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::VectorType, const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEKPNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::VectorType, llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEKPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEKPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIKPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::VectorType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEPNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::VectorType, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEKPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::IntegerType, const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEKPNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::IntegerType, llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEKPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEKPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIKPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::IntegerType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEPNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::IntegerType, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEKPNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::PointerType, llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEKPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEKPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIKPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::PointerType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::PointerType, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEKPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::FunctionType, const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm12FunctionTypeE", "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::FunctionType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm12FunctionTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEKPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::ArrayType, const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::ArrayType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11GraphTraitsIPKNS_4TypeEEE",
   "name" : "llvm::GraphTraits<const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm11GraphTraitsIPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm11GraphTraitsIPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Type.h",
   "template_args" : [ "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11GraphTraitsIPNS_4TypeEEE",
   "name" : "llvm::GraphTraits<llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm11GraphTraitsIPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm11GraphTraitsIPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Type.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11IntegerTypeE",
   "name" : "llvm::IntegerType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11IntegerTypeE",
   "self_type" : "_ZTIN4llvm11IntegerTypeE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pImpl",
     "referenced_type" : "_ZTIKPN4llvm15LLVMContextImplE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11LLVMContextE",
   "name" : "llvm::LLVMContext",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11LLVMContextE",
   "self_type" : "_ZTIN4llvm11LLVMContextE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/IR/LLVMContext.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm14SequentialTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11PointerTypeE",
   "name" : "llvm::PointerType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11PointerTypeE",
   "self_type" : "_ZTIN4llvm11PointerTypeE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallPtrSetImplIPNS_2cl10SubCommandEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "SmallStorage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA4_PKv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallPtrSetIPNS_2cl10SubCommandELj4EEE",
   "name" : "llvm::SmallPtrSet<llvm::cl::SubCommand *, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallPtrSetIPNS_2cl10SubCommandELj4EEE",
   "self_type" : "_ZTIN4llvm11SmallPtrSetIPNS_2cl10SubCommandELj4EEE",
   "size" : 64,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h",
   "template_args" : [ "_ZTIPN4llvm2cl10SubCommandE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPKcNS2_IiS4_EEEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 384,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPKcNS2_IiS4_EEEELj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPKcNS2_IiS4_EEEELj4EEE",
   "name" : "llvm::SmallVector<std::pair<const char *, std::pair<int, const char *>>, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPKcNS2_IiS4_EEEELj4EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPKcNS2_IiS4_EEEELj4EEE",
   "size" : 120,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPKcNS0_IiS2_EEEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "name" : "llvm::SmallVector<std::pair<void *, unsigned long>, 0>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPNS_2cl6OptionEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPNS_2cl6OptionELj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIPNS_2cl6OptionELj4EEE",
   "name" : "llvm::SmallVector<llvm::cl::Option *, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIPNS_2cl6OptionELj4EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIPNS_2cl6OptionELj4EEE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPN4llvm2cl6OptionE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPvEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "name" : "llvm::SmallVector<void *, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11isa_impl_clINS_10VectorTypeEPKNS_4TypeEEE",
   "name" : "llvm::isa_impl_cl<llvm::VectorType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm11isa_impl_clINS_10VectorTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm11isa_impl_clINS_10VectorTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11isa_impl_clINS_11IntegerTypeEPKNS_4TypeEEE",
   "name" : "llvm::isa_impl_cl<llvm::IntegerType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm11isa_impl_clINS_11IntegerTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm11isa_impl_clINS_11IntegerTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm14DebugEpochBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm12DenseMapBaseINS_8DenseMapIPvPNS_2cl6OptionENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EEEES2_S5_S7_SA_EE",
   "name" : "llvm::DenseMapBase<llvm::DenseMap<void *, llvm::cl::Option *, llvm::DenseMapInfo<void *>, llvm::detail::DenseMapPair<void *, llvm::cl::Option *>>, void *, llvm::cl::Option *, llvm::DenseMapInfo<void *>, llvm::detail::DenseMapPair<void *, llvm::cl::Option *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm12DenseMapBaseINS_8DenseMapIPvPNS_2cl6OptionENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EEEES2_S5_S7_SA_EE",
   "self_type" : "_ZTIN4llvm12DenseMapBaseINS_8DenseMapIPvPNS_2cl6OptionENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EEEES2_S5_S7_SA_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMap.h",
   "template_args" :
   [
    "_ZTIN4llvm8DenseMapIPvPNS_2cl6OptionENS_12DenseMapInfoIS1_EENS_6detail12DenseMapPairIS1_S4_EEEE",
    "_ZTIPv",
    "_ZTIPN4llvm2cl6OptionE",
    "_ZTIN4llvm12DenseMapInfoIPvEE",
    "_ZTIN4llvm6detail12DenseMapPairIPvPNS_2cl6OptionEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoINS_9StringRefEEE",
   "name" : "llvm::DenseMapInfo<llvm::StringRef>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoINS_9StringRefEEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoINS_9StringRefEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIPvEE",
   "name" : "llvm::DenseMapInfo<void *>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIPvEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIPvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIcEE",
   "name" : "llvm::DenseMapInfo<char>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIcEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIcEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIiEE",
   "name" : "llvm::DenseMapInfo<int>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIiEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIiEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIjEE",
   "name" : "llvm::DenseMapInfo<unsigned int>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIjEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIjEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIlEE",
   "name" : "llvm::DenseMapInfo<long>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIlEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIlEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoImEE",
   "name" : "llvm::DenseMapInfo<unsigned long>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoImEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoImEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIxEE",
   "name" : "llvm::DenseMapInfo<long long>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIxEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIxEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm12DenseMapInfoIyEE",
   "name" : "llvm::DenseMapInfo<unsigned long long>",
   "referenced_type" : "_ZTIN4llvm12DenseMapInfoIyEE",
   "self_type" : "_ZTIN4llvm12DenseMapInfoIyEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMapInfo.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm12FunctionTypeE",
   "name" : "llvm::FunctionType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm12FunctionTypeE",
   "self_type" : "_ZTIN4llvm12FunctionTypeE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "name" : "llvm::AllocatorBase<llvm::MallocAllocator>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "self_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" : [ "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "name" : "llvm::AllocatorBase<llvm::BumpPtrAllocatorImpl<llvm::MallocAllocator, 4096, 4096>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "self_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" :
   [
    "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm13CompositeTypeE",
   "name" : "llvm::CompositeType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13CompositeTypeE",
   "self_type" : "_ZTIN4llvm13CompositeTypeE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm17ManagedStaticBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm13ManagedStaticINS_2cl10SubCommandEEE",
   "name" : "llvm::ManagedStatic<llvm::cl::SubCommand>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13ManagedStaticINS_2cl10SubCommandEEE",
   "self_type" : "_ZTIN4llvm13ManagedStaticINS_2cl10SubCommandEEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/ManagedStatic.h",
   "template_args" : [ "_ZTIN4llvm2cl10SubCommandE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "TheTable",
     "referenced_type" : "_ZTIPPN4llvm18StringMapEntryBaseE"
    },
    {
     "access" : "protected",
     "field_name" : "NumBuckets",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumItems",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumTombstones",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "ItemSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm13StringMapImplE",
   "name" : "llvm::StringMapImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13StringMapImplE",
   "self_type" : "_ZTIN4llvm13StringMapImplE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_10VectorTypeEKPNS_4TypeEPKS2_EE",
   "name" : "llvm::isa_impl_wrap<llvm::VectorType, llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_10VectorTypeEKPNS_4TypeEPKS2_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_10VectorTypeEKPNS_4TypeEPKS2_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIKPN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_10VectorTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::isa_impl_wrap<llvm::VectorType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_10VectorTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_10VectorTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_11IntegerTypeEKPNS_4TypeEPKS2_EE",
   "name" : "llvm::isa_impl_wrap<llvm::IntegerType, llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_11IntegerTypeEKPNS_4TypeEPKS2_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_11IntegerTypeEKPNS_4TypeEPKS2_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11IntegerTypeE",
    "_ZTIKPN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::isa_impl_wrap<llvm::IntegerType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11IntegerTypeE",
    "_ZTIPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIKPKNS_4TypeEEE",
   "name" : "llvm::simplify_type<const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIKPNS_4TypeEEE",
   "name" : "llvm::simplify_type<llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIKPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIKPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIKPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIPKNS_4TypeEEE",
   "name" : "llvm::simplify_type<const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIPNS_4TypeEEE",
   "name" : "llvm::simplify_type<llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm14DebugEpochBase10HandleBaseE",
   "name" : "llvm::DebugEpochBase::HandleBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14DebugEpochBase10HandleBaseE",
   "self_type" : "_ZTIN4llvm14DebugEpochBase10HandleBaseE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/EpochTracker.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm14DebugEpochBaseE",
   "name" : "llvm::DebugEpochBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14DebugEpochBaseE",
   "self_type" : "_ZTIN4llvm14DebugEpochBaseE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/EpochTracker.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Options",
     "referenced_type" : "_ZTIN4llvm8DenseMapIPvPNS_2cl6OptionENS_12DenseMapInfoIS1_EENS_6detail12DenseMapPairIS1_S4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14OptionRegistryE",
   "name" : "llvm::OptionRegistry",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14OptionRegistryE",
   "self_type" : "_ZTIN4llvm14OptionRegistryE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/Options.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13CompositeTypeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ContainedType",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14SequentialTypeE",
   "name" : "llvm::SequentialType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14SequentialTypeE",
   "self_type" : "_ZTIN4llvm14SequentialTypeE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm18StringMapEntryBaseE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "second",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN4llvm2cl6OptionE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14StringMapEntryIPNS_2cl6OptionEEE",
   "name" : "llvm::StringMapEntry<llvm::cl::Option *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14StringMapEntryIPNS_2cl6OptionEEE",
   "self_type" : "_ZTIN4llvm14StringMapEntryIPNS_2cl6OptionEEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h",
   "template_args" : [ "_ZTIPN4llvm2cl6OptionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm14is_simple_typeIPKNS_4TypeEEE",
   "name" : "llvm::is_simple_type<const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm14is_simple_typeIPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm14is_simple_typeIPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm14is_simple_typeIPNS_4TypeEEE",
   "name" : "llvm::is_simple_type<llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm14is_simple_typeIPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm14is_simple_typeIPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIN4llvm3MVT12mvt_iteratorE"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN4llvm3MVT12mvt_iteratorE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeINS_3MVT12mvt_iteratorEEE",
   "name" : "llvm::iterator_range<llvm::MVT::mvt_iterator>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeINS_3MVT12mvt_iteratorEEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeINS_3MVT12mvt_iteratorEEE",
   "size" : 2,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIN4llvm3MVT12mvt_iteratorE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "name" : "llvm::iterator_range<const unsigned char *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIPKh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm14object_deleterINS_2cl10SubCommandEEE",
   "name" : "llvm::object_deleter<llvm::cl::SubCommand>",
   "referenced_type" : "_ZTIN4llvm14object_deleterINS_2cl10SubCommandEEE",
   "self_type" : "_ZTIN4llvm14object_deleterINS_2cl10SubCommandEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/ManagedStatic.h",
   "template_args" : [ "_ZTIN4llvm2cl10SubCommandE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15MallocAllocatorE",
   "name" : "llvm::MallocAllocator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15MallocAllocatorE",
   "self_type" : "_ZTIN4llvm15MallocAllocatorE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm19SmallPtrSetImplBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallPtrSetImplIPNS_2cl10SubCommandEEE",
   "name" : "llvm::SmallPtrSetImpl<llvm::cl::SubCommand *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallPtrSetImplIPNS_2cl10SubCommandEEE",
   "self_type" : "_ZTIN4llvm15SmallPtrSetImplIPNS_2cl10SubCommandEEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h",
   "template_args" : [ "_ZTIPN4llvm2cl10SubCommandE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "BeginX",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "EndX",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "CapacityX",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorBaseE",
   "name" : "llvm::SmallVectorBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE",
   "self_type" : "_ZTIN4llvm15SmallVectorBaseE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_9StringRefELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplINS_9StringRefEEE",
   "name" : "llvm::SmallVectorImpl<llvm::StringRef>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplINS_9StringRefEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplINS_9StringRefEEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPKcNS2_IiS4_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPKcNS2_IiS4_EEEEEE",
   "name" : "llvm::SmallVectorImpl<std::pair<const char *, std::pair<int, const char *>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPKcNS2_IiS4_EEEEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPKcNS2_IiS4_EEEEEE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPKcNS0_IiS2_EEEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "name" : "llvm::SmallVectorImpl<std::pair<void *, unsigned long>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPNS_2cl6OptionELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplIPNS_2cl6OptionEEE",
   "name" : "llvm::SmallVectorImpl<llvm::cl::Option *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPNS_2cl6OptionEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplIPNS_2cl6OptionEEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPN4llvm2cl6OptionE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "name" : "llvm::SmallVectorImpl<void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplIcEE",
   "name" : "llvm::SmallVectorImpl<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplIcEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplIcEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_10StructTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::StructType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_10StructTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_10StructTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10StructTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_10VectorTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::VectorType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_10VectorTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_10VectorTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_10VectorTypeEPNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::VectorType, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_10VectorTypeEPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_10VectorTypeEPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_11IntegerTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::IntegerType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_11IntegerTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_11IntegerTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_11IntegerTypeEPNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::IntegerType, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_11IntegerTypeEPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_11IntegerTypeEPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::PointerType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::PointerType, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_12FunctionTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::FunctionType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_12FunctionTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_12FunctionTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm12FunctionTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_9ArrayTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::ArrayType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_9ArrayTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_9ArrayTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEKPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::StructType, const llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEKPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEKPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm10StructTypeE",
    "_ZTIKPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::StructType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10StructTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEKPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::VectorType, const llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEKPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEKPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm10VectorTypeE",
    "_ZTIKPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEKPNS_4TypeEPKS2_EE",
   "name" : "llvm::cast_retty_wrap<llvm::VectorType, llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEKPNS_4TypeEPKS2_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEKPNS_4TypeEPKS2_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIKPN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::VectorType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEPNS_4TypeES3_EE",
   "name" : "llvm::cast_retty_wrap<llvm::VectorType, llvm::Type *, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEPNS_4TypeES3_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEPNS_4TypeES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPN4llvm4TypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEKPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::IntegerType, const llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEKPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEKPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11IntegerTypeE",
    "_ZTIKPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEKPNS_4TypeEPKS2_EE",
   "name" : "llvm::cast_retty_wrap<llvm::IntegerType, llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEKPNS_4TypeEPKS2_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEKPNS_4TypeEPKS2_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11IntegerTypeE",
    "_ZTIKPN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::IntegerType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11IntegerTypeE",
    "_ZTIPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEPNS_4TypeES3_EE",
   "name" : "llvm::cast_retty_wrap<llvm::IntegerType, llvm::Type *, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEPNS_4TypeES3_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEPNS_4TypeES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIPN4llvm4TypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEKPNS_4TypeEPKS2_EE",
   "name" : "llvm::cast_retty_wrap<llvm::PointerType, llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEKPNS_4TypeEPKS2_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEKPNS_4TypeEPKS2_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11PointerTypeE",
    "_ZTIKPN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::PointerType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11PointerTypeE",
    "_ZTIPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPNS_4TypeES3_EE",
   "name" : "llvm::cast_retty_wrap<llvm::PointerType, llvm::Type *, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPNS_4TypeES3_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPNS_4TypeES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPN4llvm4TypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEKPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::FunctionType, const llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEKPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEKPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm12FunctionTypeE",
    "_ZTIKPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::FunctionType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm12FunctionTypeE",
    "_ZTIPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEKPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::ArrayType, const llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEKPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEKPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIKPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::ArrayType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm1ELm1EEE",
   "name" : "llvm::AlignedCharArray<1, 1>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm1ELm1EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm1ELm1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "name" : "llvm::AlignedCharArray<8, 16>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA24_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm8ELm24EEE",
   "name" : "llvm::AlignedCharArray<8, 24>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm24EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm24EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA8_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "name" : "llvm::AlignedCharArray<8, 8>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_10StructTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_convert_val<llvm::StructType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_10StructTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_10StructTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10StructTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_10VectorTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_convert_val<llvm::VectorType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_10VectorTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_10VectorTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_10VectorTypeEPNS_4TypeES3_EE",
   "name" : "llvm::cast_convert_val<llvm::VectorType, llvm::Type *, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_10VectorTypeEPNS_4TypeES3_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_10VectorTypeEPNS_4TypeES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPN4llvm4TypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_convert_val<llvm::IntegerType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11IntegerTypeE",
    "_ZTIPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_11IntegerTypeEPNS_4TypeES3_EE",
   "name" : "llvm::cast_convert_val<llvm::IntegerType, llvm::Type *, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_11IntegerTypeEPNS_4TypeES3_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_11IntegerTypeEPNS_4TypeES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIPN4llvm4TypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_11PointerTypeEPNS_4TypeES3_EE",
   "name" : "llvm::cast_convert_val<llvm::PointerType, llvm::Type *, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_11PointerTypeEPNS_4TypeES3_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_11PointerTypeEPNS_4TypeES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPN4llvm4TypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_convert_val<llvm::FunctionType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm12FunctionTypeE",
    "_ZTIPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_convert_val<llvm::ArrayType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "Ptr",
     "referenced_type" : "_ZTINSt3__16atomicIPvEE"
    },
    {
     "access" : "protected",
     "field_name" : "DeleterFn",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "access" : "protected",
     "field_name" : "Next",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKN4llvm17ManagedStaticBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm17ManagedStaticBaseE",
   "name" : "llvm::ManagedStaticBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm17ManagedStaticBaseE",
   "self_type" : "_ZTIN4llvm17ManagedStaticBaseE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/ManagedStatic.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm17llvm_shutdown_objE",
   "name" : "llvm::llvm_shutdown_obj",
   "referenced_type" : "_ZTIN4llvm17llvm_shutdown_objE",
   "self_type" : "_ZTIN4llvm17llvm_shutdown_objE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/ManagedStatic.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionINSt3__14pairIPKcNS2_IiS4_EEEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPKcNS2_IiS4_EEEELj4EEE",
   "name" : "llvm::SmallVectorStorage<std::pair<const char *, std::pair<int, const char *>>, 4>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPKcNS2_IiS4_EEEELj4EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPKcNS2_IiS4_EEEELj4EEE",
   "size" : 72,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPKcNS0_IiS2_EEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "name" : "llvm::SmallVectorStorage<std::pair<void *, unsigned long>, 0>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionIPNS_2cl6OptionEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIPNS_2cl6OptionELj4EEE",
   "name" : "llvm::SmallVectorStorage<llvm::cl::Option *, 4>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPNS_2cl6OptionELj4EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIPNS_2cl6OptionELj4EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPN4llvm2cl6OptionE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "name" : "llvm::SmallVectorStorage<void *, 4>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "StrLen",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18StringMapEntryBaseE",
   "name" : "llvm::StringMapEntryBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm18StringMapEntryBaseE",
   "self_type" : "_ZTIN4llvm18StringMapEntryBaseE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm19RoundUpToPowerOfTwoILj4EEE",
   "name" : "llvm::RoundUpToPowerOfTwo<4>",
   "referenced_type" : "_ZTIN4llvm19RoundUpToPowerOfTwoILj4EEE",
   "self_type" : "_ZTIN4llvm19RoundUpToPowerOfTwoILj4EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "SmallArray",
     "referenced_type" : "_ZTIPPKv"
    },
    {
     "access" : "protected",
     "field_name" : "CurArray",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPPKv"
    },
    {
     "access" : "protected",
     "field_name" : "CurArraySize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumNonEmpty",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumTombstones",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm19SmallPtrSetImplBaseE",
   "name" : "llvm::SmallPtrSetImplBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm19SmallPtrSetImplBaseE",
   "self_type" : "_ZTIN4llvm19SmallPtrSetImplBaseE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallPtrSetIteratorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm19SmallPtrSetIteratorIPNS_2cl10SubCommandEEE",
   "name" : "llvm::SmallPtrSetIterator<llvm::cl::SubCommand *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm19SmallPtrSetIteratorIPNS_2cl10SubCommandEEE",
   "self_type" : "_ZTIN4llvm19SmallPtrSetIteratorIPNS_2cl10SubCommandEEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h",
   "template_args" : [ "_ZTIPN4llvm2cl10SubCommandE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm19is_integral_or_enumINS_9StringRefEEE",
   "name" : "llvm::is_integral_or_enum<llvm::StringRef>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm19is_integral_or_enumINS_9StringRefEEE",
   "self_type" : "_ZTIN4llvm19is_integral_or_enumINS_9StringRefEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "CurPtr",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "End",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "Slabs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE"
    },
    {
     "access" : "private",
     "field_name" : "CustomSizedSlabs",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE"
    },
    {
     "access" : "private",
     "field_name" : "BytesAllocated",
     "field_offset" : 960,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "Allocator",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIN4llvm15MallocAllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "name" : "llvm::BumpPtrAllocatorImpl<llvm::MallocAllocator, 4096, 4096>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "self_type" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "size" : 136,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" : [ "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm20RoundUpToPowerOfTwoHILj4ELb1EEE",
   "name" : "llvm::RoundUpToPowerOfTwoH<4, true>",
   "referenced_type" : "_ZTIN4llvm20RoundUpToPowerOfTwoHILj4ELb1EEE",
   "self_type" : "_ZTIN4llvm20RoundUpToPowerOfTwoHILj4ELb1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINS_9StringRefEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<llvm::StringRef, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_9StringRefEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_9StringRefEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm9StringRefE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm24EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPKcNS2_IiS4_EEEEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<std::pair<const char *, std::pair<int, const char *>>, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPKcNS2_IiS4_EEEEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPKcNS2_IiS4_EEEEcccccccccEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPKcNS0_IiS2_EEEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionIPNS_2cl6OptionEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<llvm::cl::Option *, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPNS_2cl6OptionEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPNS_2cl6OptionEcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPN4llvm2cl6OptionE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<void *, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm1ELm1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<char, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "name" : "llvm::PointerLikeTypeTraits<llvm::StringMapEntryBase *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIPN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_2cl10SubCommandEEE",
   "name" : "llvm::PointerLikeTypeTraits<llvm::cl::SubCommand *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_2cl10SubCommandEEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_2cl10SubCommandEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIPN4llvm2cl10SubCommandE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "name" : "llvm::PointerLikeTypeTraits<void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "name" : "llvm::PointerLikeTypeTraits<uintptr_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm22add_const_past_pointerIPKNS_4TypeEvEE",
   "name" : "llvm::add_const_past_pointer<const llvm::Type *, void>",
   "referenced_type" : "_ZTIN4llvm22add_const_past_pointerIPKNS_4TypeEvEE",
   "self_type" : "_ZTIN4llvm22add_const_past_pointerIPKNS_4TypeEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPKN4llvm4TypeE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm22add_const_past_pointerIPNS_4TypeEvEE",
   "name" : "llvm::add_const_past_pointer<llvm::Type *, void>",
   "referenced_type" : "_ZTIN4llvm22add_const_past_pointerIPNS_4TypeEvEE",
   "self_type" : "_ZTIN4llvm22add_const_past_pointerIPNS_4TypeEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "name" : "llvm::ScopedFatalErrorHandler",
   "referenced_type" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "self_type" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/ErrorHandling.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "Bucket",
     "referenced_type" : "_ZTIPKPKv"
    },
    {
     "access" : "protected",
     "field_name" : "End",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKPKv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallPtrSetIteratorImplE",
   "name" : "llvm::SmallPtrSetIteratorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallPtrSetIteratorImplE",
   "self_type" : "_ZTIN4llvm23SmallPtrSetIteratorImplE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_9StringRefEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_9StringRefELb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<llvm::StringRef, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_9StringRefELb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_9StringRefELb1EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPKcNS2_IiS4_EEEEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPKcNS2_IiS4_EEEELb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<std::pair<const char *, std::pair<int, const char *>>, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPKcNS2_IiS4_EEEELb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPKcNS2_IiS4_EEEELb1EEE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPKcNS0_IiS2_EEEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<std::pair<void *, unsigned long>, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPNS_2cl6OptionEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseIPNS_2cl6OptionELb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<llvm::cl::Option *, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPNS_2cl6OptionELb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPNS_2cl6OptionELb1EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPN4llvm2cl6OptionE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<void *, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<char, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_9StringRefEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_9StringRefEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<llvm::StringRef, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_9StringRefEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_9StringRefEvEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm9StringRefE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPKcNS2_IiS4_EEEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPKcNS2_IiS4_EEEEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<std::pair<const char *, std::pair<int, const char *>>, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPKcNS2_IiS4_EEEEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPKcNS2_IiS4_EEEEvEE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPKcNS0_IiS2_EEEE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<std::pair<void *, unsigned long>, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPNS_2cl6OptionEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonIPNS_2cl6OptionEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<llvm::cl::Option *, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPNS_2cl6OptionEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPNS_2cl6OptionEvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPN4llvm2cl6OptionE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "name" : "llvm::SmallVectorTemplateCommon<void *, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE",
   "name" : "llvm::SmallVectorTemplateCommon<char, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Name",
     "referenced_type" : "_ZTIKPKc"
    },
    {
     "access" : "private",
     "field_name" : "Description",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPKc"
    },
    {
     "field_name" : "PositionalOpts",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIPNS_2cl6OptionELj4EEE"
    },
    {
     "field_name" : "SinkOpts",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIPNS_2cl6OptionELj4EEE"
    },
    {
     "field_name" : "OptionsMap",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIN4llvm9StringMapIPNS_2cl6OptionENS_15MallocAllocatorEEE"
    },
    {
     "field_name" : "ConsumeAfterOpt",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPN4llvm2cl6OptionE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl10SubCommandE",
   "name" : "llvm::cl::SubCommand",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl10SubCommandE",
   "self_type" : "_ZTIN4llvm2cl10SubCommandE",
   "size" : 168,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm2cl10applicatorINS0_12OptionHiddenEEE",
   "name" : "llvm::cl::applicator<llvm::cl::OptionHidden>",
   "referenced_type" : "_ZTIN4llvm2cl10applicatorINS0_12OptionHiddenEEE",
   "self_type" : "_ZTIN4llvm2cl10applicatorINS0_12OptionHiddenEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIN4llvm2cl12OptionHiddenE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm2cl10applicatorINS0_13ValueExpectedEEE",
   "name" : "llvm::cl::applicator<llvm::cl::ValueExpected>",
   "referenced_type" : "_ZTIN4llvm2cl10applicatorINS0_13ValueExpectedEEE",
   "self_type" : "_ZTIN4llvm2cl10applicatorINS0_13ValueExpectedEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIN4llvm2cl13ValueExpectedE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm2cl10applicatorINS0_15FormattingFlagsEEE",
   "name" : "llvm::cl::applicator<llvm::cl::FormattingFlags>",
   "referenced_type" : "_ZTIN4llvm2cl10applicatorINS0_15FormattingFlagsEEE",
   "self_type" : "_ZTIN4llvm2cl10applicatorINS0_15FormattingFlagsEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIN4llvm2cl15FormattingFlagsE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm2cl10applicatorINS0_18NumOccurrencesFlagEEE",
   "name" : "llvm::cl::applicator<llvm::cl::NumOccurrencesFlag>",
   "referenced_type" : "_ZTIN4llvm2cl10applicatorINS0_18NumOccurrencesFlagEEE",
   "self_type" : "_ZTIN4llvm2cl10applicatorINS0_18NumOccurrencesFlagEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIN4llvm2cl18NumOccurrencesFlagE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm2cl10applicatorINS0_9MiscFlagsEEE",
   "name" : "llvm::cl::applicator<llvm::cl::MiscFlags>",
   "referenced_type" : "_ZTIN4llvm2cl10applicatorINS0_9MiscFlagsEEE",
   "self_type" : "_ZTIN4llvm2cl10applicatorINS0_9MiscFlagsEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIN4llvm2cl9MiscFlagsE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm2cl10applicatorIPKcEE",
   "name" : "llvm::cl::applicator<const char *>",
   "referenced_type" : "_ZTIN4llvm2cl10applicatorIPKcEE",
   "self_type" : "_ZTIN4llvm2cl10applicatorIPKcEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Desc",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl10value_descE",
   "name" : "llvm::cl::value_desc",
   "referenced_type" : "_ZTIN4llvm2cl10value_descE",
   "self_type" : "_ZTIN4llvm2cl10value_descE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyINS0_13boolOrDefaultEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl11OptionValueINS0_13boolOrDefaultEEE",
   "name" : "llvm::cl::OptionValue<llvm::cl::boolOrDefault>",
   "referenced_type" : "_ZTIN4llvm2cl11OptionValueINS0_13boolOrDefaultEEE",
   "self_type" : "_ZTIN4llvm2cl11OptionValueINS0_13boolOrDefaultEEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIN4llvm2cl13boolOrDefaultE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl11OptionValueINS0_13boolOrDefaultEEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyINS0_13boolOrDefaultEE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl11OptionValueINS0_13boolOrDefaultEE6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl11OptionValueINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "llvm::cl::OptionValue<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN4llvm2cl11OptionValueINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN4llvm2cl11OptionValueINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl11OptionValueINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl11OptionValueINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEE6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl15OptionValueBaseIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl11OptionValueIbEE",
   "name" : "llvm::cl::OptionValue<bool>",
   "referenced_type" : "_ZTIN4llvm2cl11OptionValueIbEE",
   "self_type" : "_ZTIN4llvm2cl11OptionValueIbEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIb" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl11OptionValueIbEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIbE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl15OptionValueBaseIcLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl11OptionValueIcEE",
   "name" : "llvm::cl::OptionValue<char>",
   "referenced_type" : "_ZTIN4llvm2cl11OptionValueIcEE",
   "self_type" : "_ZTIN4llvm2cl11OptionValueIcEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIc" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl11OptionValueIcEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIcE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl15OptionValueBaseIiLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl11OptionValueIiEE",
   "name" : "llvm::cl::OptionValue<int>",
   "referenced_type" : "_ZTIN4llvm2cl11OptionValueIiEE",
   "self_type" : "_ZTIN4llvm2cl11OptionValueIiEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIi" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl11OptionValueIiEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIiE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl15OptionValueBaseIjLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl11OptionValueIjEE",
   "name" : "llvm::cl::OptionValue<unsigned int>",
   "referenced_type" : "_ZTIN4llvm2cl11OptionValueIjEE",
   "self_type" : "_ZTIN4llvm2cl11OptionValueIjEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIj" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl11OptionValueIjEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIjE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "Default",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm2cl11OptionValueINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl11opt_storageINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ELb1EEE",
   "name" : "llvm::cl::opt_storage<std::basic_string<char, std::char_traits<char>, std::allocator<char>>, false, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl11opt_storageINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ELb1EEE",
   "self_type" : "_ZTIN4llvm2cl11opt_storageINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ELb1EEE",
   "size" : 64,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Value",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "Default",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm2cl11OptionValueIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl11opt_storageIbLb0ELb0EEE",
   "name" : "llvm::cl::opt_storage<bool, false, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl11opt_storageIbLb0ELb0EEE",
   "self_type" : "_ZTIN4llvm2cl11opt_storageIbLb0ELb0EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Value",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "Default",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm2cl11OptionValueIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl11opt_storageIcLb0ELb0EEE",
   "name" : "llvm::cl::opt_storage<char, false, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl11opt_storageIcLb0ELb0EEE",
   "self_type" : "_ZTIN4llvm2cl11opt_storageIcLb0ELb0EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Value",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "Default",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm2cl11OptionValueIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl11opt_storageIiLb0ELb0EEE",
   "name" : "llvm::cl::opt_storage<int, false, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl11opt_storageIiLb0ELb0EEE",
   "self_type" : "_ZTIN4llvm2cl11opt_storageIiLb0ELb0EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Value",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Default",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm2cl11OptionValueIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl11opt_storageIjLb0ELb0EEE",
   "name" : "llvm::cl::opt_storage<unsigned int, false, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl11opt_storageIjLb0ELb0EEE",
   "self_type" : "_ZTIN4llvm2cl11opt_storageIjLb0ELb0EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl17basic_parser_implE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl12basic_parserINS0_13boolOrDefaultEEE",
   "name" : "llvm::cl::basic_parser<llvm::cl::boolOrDefault>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl12basic_parserINS0_13boolOrDefaultEEE",
   "self_type" : "_ZTIN4llvm2cl12basic_parserINS0_13boolOrDefaultEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIN4llvm2cl13boolOrDefaultE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl12basic_parserINS0_13boolOrDefaultEEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl17basic_parser_impl12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl17basic_parser_impl6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl17basic_parser_implE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl12basic_parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "llvm::cl::basic_parser<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl12basic_parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN4llvm2cl12basic_parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl12basic_parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl17basic_parser_impl12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl17basic_parser_impl6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl17basic_parser_implE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl12basic_parserIbEE",
   "name" : "llvm::cl::basic_parser<bool>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl12basic_parserIbEE",
   "self_type" : "_ZTIN4llvm2cl12basic_parserIbEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIb" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl12basic_parserIbEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl17basic_parser_impl12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl17basic_parser_impl6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl17basic_parser_implE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl12basic_parserIcEE",
   "name" : "llvm::cl::basic_parser<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl12basic_parserIcEE",
   "self_type" : "_ZTIN4llvm2cl12basic_parserIcEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIc" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl12basic_parserIcEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl17basic_parser_impl12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl17basic_parser_impl6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl17basic_parser_implE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl12basic_parserIdEE",
   "name" : "llvm::cl::basic_parser<double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl12basic_parserIdEE",
   "self_type" : "_ZTIN4llvm2cl12basic_parserIdEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTId" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl12basic_parserIdEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl17basic_parser_impl12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl17basic_parser_impl6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl17basic_parser_implE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl12basic_parserIfEE",
   "name" : "llvm::cl::basic_parser<float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl12basic_parserIfEE",
   "self_type" : "_ZTIN4llvm2cl12basic_parserIfEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIf" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl12basic_parserIfEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl17basic_parser_impl12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl17basic_parser_impl6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl17basic_parser_implE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl12basic_parserIiEE",
   "name" : "llvm::cl::basic_parser<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl12basic_parserIiEE",
   "self_type" : "_ZTIN4llvm2cl12basic_parserIiEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIi" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl12basic_parserIiEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl17basic_parser_impl12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl17basic_parser_impl6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl17basic_parser_implE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl12basic_parserIjEE",
   "name" : "llvm::cl::basic_parser<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl12basic_parserIjEE",
   "self_type" : "_ZTIN4llvm2cl12basic_parserIjEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIj" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl12basic_parserIjEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl17basic_parser_impl12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl17basic_parser_impl6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl17basic_parser_implE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl12basic_parserIyEE",
   "name" : "llvm::cl::basic_parser<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl12basic_parserIyEE",
   "self_type" : "_ZTIN4llvm2cl12basic_parserIyEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIy" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl12basic_parserIyEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl17basic_parser_impl12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl17basic_parser_impl6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Name",
     "referenced_type" : "_ZTIKPKc"
    },
    {
     "access" : "private",
     "field_name" : "Description",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl14OptionCategoryE",
   "name" : "llvm::cl::OptionCategory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl14OptionCategoryE",
   "self_type" : "_ZTIN4llvm2cl14OptionCategoryE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl15OptionValueBaseIbLb0EEE",
   "name" : "llvm::cl::OptionValueBase<bool, false>",
   "referenced_type" : "_ZTIN4llvm2cl15OptionValueBaseIbLb0EEE",
   "self_type" : "_ZTIN4llvm2cl15OptionValueBaseIbLb0EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIb" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl15OptionValueBaseIbLb0EEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIbE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl15OptionValueBaseIcLb0EEE",
   "name" : "llvm::cl::OptionValueBase<char, false>",
   "referenced_type" : "_ZTIN4llvm2cl15OptionValueBaseIcLb0EEE",
   "self_type" : "_ZTIN4llvm2cl15OptionValueBaseIcLb0EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIc" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl15OptionValueBaseIcLb0EEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIcE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl15OptionValueBaseIiLb0EEE",
   "name" : "llvm::cl::OptionValueBase<int, false>",
   "referenced_type" : "_ZTIN4llvm2cl15OptionValueBaseIiLb0EEE",
   "self_type" : "_ZTIN4llvm2cl15OptionValueBaseIiLb0EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIi" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl15OptionValueBaseIiLb0EEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIiE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl15OptionValueBaseIjLb0EEE",
   "name" : "llvm::cl::OptionValueBase<unsigned int, false>",
   "referenced_type" : "_ZTIN4llvm2cl15OptionValueBaseIjLb0EEE",
   "self_type" : "_ZTIN4llvm2cl15OptionValueBaseIjLb0EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIj" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl15OptionValueBaseIjLb0EEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIjE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl18GenericOptionValueE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm2cl13boolOrDefaultE"
    },
    {
     "access" : "private",
     "field_name" : "Valid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl15OptionValueCopyINS0_13boolOrDefaultEEE",
   "name" : "llvm::cl::OptionValueCopy<llvm::cl::boolOrDefault>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyINS0_13boolOrDefaultEEE",
   "self_type" : "_ZTIN4llvm2cl15OptionValueCopyINS0_13boolOrDefaultEEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIN4llvm2cl13boolOrDefaultE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl15OptionValueCopyINS0_13boolOrDefaultEEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyINS0_13boolOrDefaultEE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl18GenericOptionValueE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "Valid",
     "field_offset" : 256,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl15OptionValueCopyINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "llvm::cl::OptionValueCopy<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN4llvm2cl15OptionValueCopyINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl15OptionValueCopyINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl18GenericOptionValueE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "Valid",
     "field_offset" : 72,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl15OptionValueCopyIbEE",
   "name" : "llvm::cl::OptionValueCopy<bool>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyIbEE",
   "self_type" : "_ZTIN4llvm2cl15OptionValueCopyIbEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIb" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl15OptionValueCopyIbEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIbE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl18GenericOptionValueE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "Valid",
     "field_offset" : 72,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl15OptionValueCopyIcEE",
   "name" : "llvm::cl::OptionValueCopy<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyIcEE",
   "self_type" : "_ZTIN4llvm2cl15OptionValueCopyIcEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIc" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl15OptionValueCopyIcEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIcE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl18GenericOptionValueE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "Valid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl15OptionValueCopyIiEE",
   "name" : "llvm::cl::OptionValueCopy<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyIiEE",
   "self_type" : "_ZTIN4llvm2cl15OptionValueCopyIiEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIi" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl15OptionValueCopyIiEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIiE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl18GenericOptionValueE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "Valid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl15OptionValueCopyIjEE",
   "name" : "llvm::cl::OptionValueCopy<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl15OptionValueCopyIjEE",
   "self_type" : "_ZTIN4llvm2cl15OptionValueCopyIjEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIj" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl15OptionValueCopyIjEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl15OptionValueCopyIjE7compareERKNS0_18GenericOptionValueE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN4llvm2cl17basic_parser_implE",
   "name" : "llvm::cl::basic_parser_impl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl17basic_parser_implE",
   "self_type" : "_ZTIN4llvm2cl17basic_parser_implE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl17basic_parser_implE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl17basic_parser_impl12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl17basic_parser_impl6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN4llvm2cl18GenericOptionValueE",
   "name" : "llvm::cl::GenericOptionValue",
   "referenced_type" : "_ZTIN4llvm2cl18GenericOptionValueE",
   "self_type" : "_ZTIN4llvm2cl18GenericOptionValueE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl18GenericOptionValueE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm2cl18GenericOptionValue7compareERKS1_"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl18GenericOptionValue6anchorEv"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "HelpStr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl19generic_parser_base17GenericOptionInfoE",
   "name" : "llvm::cl::generic_parser_base::GenericOptionInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl19generic_parser_base17GenericOptionInfoE",
   "self_type" : "_ZTIN4llvm2cl19generic_parser_base17GenericOptionInfoE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "Owner",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRN4llvm2cl6OptionE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl19generic_parser_baseE",
   "name" : "llvm::cl::generic_parser_base",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl19generic_parser_baseE",
   "self_type" : "_ZTIN4llvm2cl19generic_parser_baseE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl19generic_parser_baseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl19generic_parser_baseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl19generic_parser_baseD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm2cl19generic_parser_base13getNumOptionsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm2cl19generic_parser_base9getOptionEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm2cl19generic_parser_base14getDescriptionEj"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl19generic_parser_base14getOptionWidthERKNS0_6OptionE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm2cl19generic_parser_base14getOptionValueEj"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl19generic_parser_base15printOptionInfoERKNS0_6OptionEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Category",
     "referenced_type" : "_ZTIRN4llvm2cl14OptionCategoryE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl3catE",
   "name" : "llvm::cl::cat",
   "referenced_type" : "_ZTIN4llvm2cl3catE",
   "self_type" : "_ZTIN4llvm2cl3catE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl6OptionE"
    },
    {
     "referenced_type" : "_ZTIN4llvm2cl11opt_storageINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ELb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Parser",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIN4llvm2cl6parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEEE",
   "name" : "llvm::cl::opt<std::basic_string<char, std::char_traits<char>, std::allocator<char>>, false, llvm::cl::parser<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEEE",
   "self_type" : "_ZTIN4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEEE",
   "size" : 224,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
    "_ZTIN4llvm2cl6parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEE16handleOccurrenceEjNS_9StringRefESC_"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEE27getValueExpectedFlagDefaultEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option6anchorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEE14getOptionWidthEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEE15printOptionInfoEm"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEE16printOptionValueEmb"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEE19getExtraOptionNamesERNS_15SmallVectorImplINS_9StringRefEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option13addOccurrenceEjNS_9StringRefES2_b"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl3optINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEELb0ENS0_6parserIS8_EEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl6OptionE"
    },
    {
     "referenced_type" : "_ZTIN4llvm2cl11opt_storageIbLb0ELb0EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Parser",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIN4llvm2cl6parserIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl3optIbLb0ENS0_6parserIbEEEE",
   "name" : "llvm::cl::opt<bool, false, llvm::cl::parser<bool>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl3optIbLb0ENS0_6parserIbEEEE",
   "self_type" : "_ZTIN4llvm2cl3optIbLb0ENS0_6parserIbEEEE",
   "size" : 184,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIb", "_ZTIN4llvm2cl6parserIbEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl3optIbLb0ENS0_6parserIbEEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl3optIbLb0ENS0_6parserIbEEE16handleOccurrenceEjNS_9StringRefES5_"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIbLb0ENS0_6parserIbEEE27getValueExpectedFlagDefaultEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option6anchorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIbLb0ENS0_6parserIbEEE14getOptionWidthEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIbLb0ENS0_6parserIbEEE15printOptionInfoEm"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIbLb0ENS0_6parserIbEEE16printOptionValueEmb"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl3optIbLb0ENS0_6parserIbEEE19getExtraOptionNamesERNS_15SmallVectorImplINS_9StringRefEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option13addOccurrenceEjNS_9StringRefES2_b"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl3optIbLb0ENS0_6parserIbEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl3optIbLb0ENS0_6parserIbEEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl6OptionE"
    },
    {
     "referenced_type" : "_ZTIN4llvm2cl11opt_storageIcLb0ELb0EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Parser",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIN4llvm2cl6parserIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl3optIcLb0ENS0_6parserIcEEEE",
   "name" : "llvm::cl::opt<char, false, llvm::cl::parser<char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl3optIcLb0ENS0_6parserIcEEEE",
   "self_type" : "_ZTIN4llvm2cl3optIcLb0ENS0_6parserIcEEEE",
   "size" : 184,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIc", "_ZTIN4llvm2cl6parserIcEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl3optIcLb0ENS0_6parserIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl3optIcLb0ENS0_6parserIcEEE16handleOccurrenceEjNS_9StringRefES5_"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIcLb0ENS0_6parserIcEEE27getValueExpectedFlagDefaultEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option6anchorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIcLb0ENS0_6parserIcEEE14getOptionWidthEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIcLb0ENS0_6parserIcEEE15printOptionInfoEm"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIcLb0ENS0_6parserIcEEE16printOptionValueEmb"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl3optIcLb0ENS0_6parserIcEEE19getExtraOptionNamesERNS_15SmallVectorImplINS_9StringRefEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option13addOccurrenceEjNS_9StringRefES2_b"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl3optIcLb0ENS0_6parserIcEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl3optIcLb0ENS0_6parserIcEEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl6OptionE"
    },
    {
     "referenced_type" : "_ZTIN4llvm2cl11opt_storageIiLb0ELb0EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Parser",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIN4llvm2cl6parserIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl3optIiLb0ENS0_6parserIiEEEE",
   "name" : "llvm::cl::opt<int, false, llvm::cl::parser<int>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl3optIiLb0ENS0_6parserIiEEEE",
   "self_type" : "_ZTIN4llvm2cl3optIiLb0ENS0_6parserIiEEEE",
   "size" : 184,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIi", "_ZTIN4llvm2cl6parserIiEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl3optIiLb0ENS0_6parserIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl3optIiLb0ENS0_6parserIiEEE16handleOccurrenceEjNS_9StringRefES5_"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIiLb0ENS0_6parserIiEEE27getValueExpectedFlagDefaultEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option6anchorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIiLb0ENS0_6parserIiEEE14getOptionWidthEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIiLb0ENS0_6parserIiEEE15printOptionInfoEm"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIiLb0ENS0_6parserIiEEE16printOptionValueEmb"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl3optIiLb0ENS0_6parserIiEEE19getExtraOptionNamesERNS_15SmallVectorImplINS_9StringRefEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option13addOccurrenceEjNS_9StringRefES2_b"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl3optIiLb0ENS0_6parserIiEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl3optIiLb0ENS0_6parserIiEEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl6OptionE"
    },
    {
     "referenced_type" : "_ZTIN4llvm2cl11opt_storageIjLb0ELb0EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Parser",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIN4llvm2cl6parserIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl3optIjLb0ENS0_6parserIjEEEE",
   "name" : "llvm::cl::opt<unsigned int, false, llvm::cl::parser<unsigned int>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl3optIjLb0ENS0_6parserIjEEEE",
   "self_type" : "_ZTIN4llvm2cl3optIjLb0ENS0_6parserIjEEEE",
   "size" : 184,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIj", "_ZTIN4llvm2cl6parserIjEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl3optIjLb0ENS0_6parserIjEEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl3optIjLb0ENS0_6parserIjEEE16handleOccurrenceEjNS_9StringRefES5_"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIjLb0ENS0_6parserIjEEE27getValueExpectedFlagDefaultEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option6anchorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIjLb0ENS0_6parserIjEEE14getOptionWidthEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIjLb0ENS0_6parserIjEEE15printOptionInfoEm"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl3optIjLb0ENS0_6parserIjEEE16printOptionValueEmb"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl3optIjLb0ENS0_6parserIjEEE19getExtraOptionNamesERNS_15SmallVectorImplINS_9StringRefEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option13addOccurrenceEjNS_9StringRefES2_b"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl3optIjLb0ENS0_6parserIjEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl3optIjLb0ENS0_6parserIjEEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Sub",
     "referenced_type" : "_ZTIRN4llvm2cl10SubCommandE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl3subE",
   "name" : "llvm::cl::sub",
   "referenced_type" : "_ZTIN4llvm2cl3subE",
   "self_type" : "_ZTIN4llvm2cl3subE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Desc",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl4descE",
   "name" : "llvm::cl::desc",
   "referenced_type" : "_ZTIN4llvm2cl4descE",
   "self_type" : "_ZTIN4llvm2cl4descE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl6OptionE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "AliasFor",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPN4llvm2cl6OptionE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl5aliasE",
   "name" : "llvm::cl::alias",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl5aliasE",
   "self_type" : "_ZTIN4llvm2cl5aliasE",
   "size" : 160,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl5aliasE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl5alias16handleOccurrenceEjNS_9StringRefES2_"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl5alias27getValueExpectedFlagDefaultEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option6anchorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl5alias14getOptionWidthEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl5alias15printOptionInfoEm"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl5alias16printOptionValueEmb"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option19getExtraOptionNamesERNS_15SmallVectorImplINS_9StringRefEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl5alias13addOccurrenceEjNS_9StringRefES2_b"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl5aliasD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl5aliasD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "NumOccurrences",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "Occurrences",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "Value",
     "field_offset" : 99,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "HiddenFlag",
     "field_offset" : 101,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "Formatting",
     "field_offset" : 103,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "Misc",
     "field_offset" : 105,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "Position",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "AdditionalVals",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ArgStr",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm9StringRefE"
    },
    {
     "field_name" : "HelpStr",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4llvm9StringRefE"
    },
    {
     "field_name" : "ValueStr",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN4llvm9StringRefE"
    },
    {
     "field_name" : "Category",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPN4llvm2cl14OptionCategoryE"
    },
    {
     "field_name" : "Subs",
     "field_offset" : 640,
     "referenced_type" : "_ZTIN4llvm11SmallPtrSetIPNS_2cl10SubCommandELj4EEE"
    },
    {
     "field_name" : "FullyInitialized",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl6OptionE",
   "name" : "llvm::cl::Option",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl6OptionE",
   "self_type" : "_ZTIN4llvm2cl6OptionE",
   "size" : 152,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl6OptionE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm2cl6Option16handleOccurrenceEjNS_9StringRefES2_"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl6Option27getValueExpectedFlagDefaultEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option6anchorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm2cl6Option14getOptionWidthEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm2cl6Option15printOptionInfoEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm2cl6Option16printOptionValueEmb"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option19getExtraOptionNamesERNS_15SmallVectorImplINS_9StringRefEEE"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6Option13addOccurrenceEjNS_9StringRefES2_b"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl6OptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm2cl6OptionD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl12basic_parserINS0_13boolOrDefaultEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl6parserINS0_13boolOrDefaultEEE",
   "name" : "llvm::cl::parser<llvm::cl::boolOrDefault>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl6parserINS0_13boolOrDefaultEEE",
   "self_type" : "_ZTIN4llvm2cl6parserINS0_13boolOrDefaultEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIN4llvm2cl13boolOrDefaultE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl6parserINS0_13boolOrDefaultEEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl6parserINS0_13boolOrDefaultEE12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6parserINS0_13boolOrDefaultEE6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl12basic_parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl6parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "llvm::cl::parser<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl6parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN4llvm2cl6parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl6parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl6parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEE12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6parserINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEE6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl12basic_parserIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl6parserIbEE",
   "name" : "llvm::cl::parser<bool>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl6parserIbEE",
   "self_type" : "_ZTIN4llvm2cl6parserIbEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIb" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl6parserIbEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl6parserIbE12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6parserIbE6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl12basic_parserIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl6parserIcEE",
   "name" : "llvm::cl::parser<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl6parserIcEE",
   "self_type" : "_ZTIN4llvm2cl6parserIcEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIc" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl6parserIcEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl6parserIcE12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6parserIcE6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl12basic_parserIdEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl6parserIdEE",
   "name" : "llvm::cl::parser<double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl6parserIdEE",
   "self_type" : "_ZTIN4llvm2cl6parserIdEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTId" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl6parserIdEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl6parserIdE12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6parserIdE6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl12basic_parserIfEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl6parserIfEE",
   "name" : "llvm::cl::parser<float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl6parserIfEE",
   "self_type" : "_ZTIN4llvm2cl6parserIfEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIf" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl6parserIfEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl6parserIfE12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6parserIfE6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl12basic_parserIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl6parserIiEE",
   "name" : "llvm::cl::parser<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl6parserIiEE",
   "self_type" : "_ZTIN4llvm2cl6parserIiEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIi" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl6parserIiEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl6parserIiE12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6parserIiE6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl12basic_parserIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl6parserIjEE",
   "name" : "llvm::cl::parser<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl6parserIjEE",
   "self_type" : "_ZTIN4llvm2cl6parserIjEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIj" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl6parserIjEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl6parserIjE12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6parserIjE6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm2cl12basic_parserIyEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl6parserIyEE",
   "name" : "llvm::cl::parser<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm2cl6parserIyEE",
   "self_type" : "_ZTIN4llvm2cl6parserIyEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h",
   "template_args" : [ "_ZTIy" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm2cl6parserIyEE"
    },
    {
     "mangled_component_name" : "_ZNK4llvm2cl6parserIyE12getValueNameEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm2cl6parserIyE6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Opt",
     "referenced_type" : "_ZTIRN4llvm2cl6OptionE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl8aliasoptE",
   "name" : "llvm::cl::aliasopt",
   "referenced_type" : "_ZTIN4llvm2cl8aliasoptE",
   "self_type" : "_ZTIN4llvm2cl8aliasoptE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "morehelp",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl9extrahelpE",
   "name" : "llvm::cl::extrahelp",
   "referenced_type" : "_ZTIN4llvm2cl9extrahelpE",
   "self_type" : "_ZTIN4llvm2cl9extrahelpE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "AdditionalVals",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm2cl9multi_valE",
   "name" : "llvm::cl::multi_val",
   "referenced_type" : "_ZTIN4llvm2cl9multi_valE",
   "self_type" : "_ZTIN4llvm2cl9multi_valE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/CommandLine.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIPKNS_4TypeEvEE",
   "name" : "llvm::add_lvalue_reference_if_not_pointer<const llvm::Type *, void>",
   "referenced_type" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIPKNS_4TypeEvEE",
   "self_type" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIPKNS_4TypeEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPKN4llvm4TypeE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm3EVT14compareRawBitsE",
   "name" : "llvm::EVT::compareRawBits",
   "referenced_type" : "_ZTIN4llvm3EVT14compareRawBitsE",
   "self_type" : "_ZTIN4llvm3EVT14compareRawBitsE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/CodeGen/ValueTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "V",
     "referenced_type" : "_ZTIN4llvm3MVTE"
    },
    {
     "access" : "private",
     "field_name" : "LLVMTy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3EVTE",
   "name" : "llvm::EVT",
   "referenced_type" : "_ZTIN4llvm3EVTE",
   "self_type" : "_ZTIN4llvm3EVTE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/CodeGen/ValueTypes.h"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "VT",
     "referenced_type" : "_ZTIN4llvm3MVT15SimpleValueTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3MVT12mvt_iteratorE",
   "name" : "llvm::MVT::mvt_iterator",
   "referenced_type" : "_ZTIN4llvm3MVT12mvt_iteratorE",
   "self_type" : "_ZTIN4llvm3MVT12mvt_iteratorE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/CodeGen/MachineValueType.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "SimpleTy",
     "referenced_type" : "_ZTIN4llvm3MVT15SimpleValueTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3MVTE",
   "name" : "llvm::MVT",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3MVTE",
   "self_type" : "_ZTIN4llvm3MVTE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/CodeGen/MachineValueType.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Address",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "Size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys11MemoryBlockE",
   "name" : "llvm::sys::MemoryBlock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys11MemoryBlockE",
   "self_type" : "_ZTIN4llvm3sys11MemoryBlockE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "M",
     "referenced_type" : "_ZTIN4llvm3sys11MemoryBlockE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "name" : "llvm::sys::OwningMemoryBlock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "self_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm3sys6MemoryE",
   "name" : "llvm::sys::Memory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys6MemoryE",
   "self_type" : "_ZTIN4llvm3sys6MemoryE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Context",
     "referenced_type" : "_ZTIRN4llvm11LLVMContextE"
    },
    {
     "access" : "private",
     "field_name" : "ID",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm4Type6TypeIDE"
    },
    {
     "access" : "private",
     "field_name" : "SubclassData",
     "field_offset" : 72,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumContainedTys",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "ContainedTys",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKPN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm4TypeE",
   "name" : "llvm::Type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm4TypeE",
   "self_type" : "_ZTIN4llvm4TypeE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/IR/Type.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "_ZTIN4llvm5APIntE"
    },
    {
     "field_name" : "s",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5APInt2msE",
   "name" : "llvm::APInt::ms",
   "referenced_type" : "_ZTIN4llvm5APInt2msE",
   "self_type" : "_ZTIN4llvm5APInt2msE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/APInt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "_ZTIN4llvm5APIntE"
    },
    {
     "field_name" : "a",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "s",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5APInt2muE",
   "name" : "llvm::APInt::mu",
   "referenced_type" : "_ZTIN4llvm5APInt2muE",
   "self_type" : "_ZTIN4llvm5APInt2muE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/APInt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "BitWidth",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm5APIntUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5APIntE",
   "name" : "llvm::APInt",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm5APIntE",
   "self_type" : "_ZTIN4llvm5APIntE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/APInt.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "VAL",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pVal",
     "referenced_type" : "_ZTIPm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN4llvm5APIntUt_E",
   "name" : "llvm::APInt::(anonymous union at external/llvm/include/llvm/ADT/APInt.h:78:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm5APIntUt_E",
   "self_type" : "_ZTIN4llvm5APIntUt_E",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/APInt.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "twine",
     "referenced_type" : "_ZTIPKN4llvm5TwineE"
    },
    {
     "field_name" : "cString",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "stdString",
     "referenced_type" : "_ZTIPKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "stringRef",
     "referenced_type" : "_ZTIPKN4llvm9StringRefE"
    },
    {
     "field_name" : "smallString",
     "referenced_type" : "_ZTIPKN4llvm15SmallVectorImplIcEE"
    },
    {
     "field_name" : "character",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "decUI",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "decI",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "decUL",
     "referenced_type" : "_ZTIPKm"
    },
    {
     "field_name" : "decL",
     "referenced_type" : "_ZTIPKl"
    },
    {
     "field_name" : "decULL",
     "referenced_type" : "_ZTIPKy"
    },
    {
     "field_name" : "decLL",
     "referenced_type" : "_ZTIPKx"
    },
    {
     "field_name" : "uHex",
     "referenced_type" : "_ZTIPKm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5Twine5ChildE",
   "name" : "llvm::Twine::Child",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm5Twine5ChildE",
   "self_type" : "_ZTIN4llvm5Twine5ChildE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/Twine.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "LHS",
     "referenced_type" : "_ZTIN4llvm5Twine5ChildE"
    },
    {
     "access" : "private",
     "field_name" : "RHS",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm5Twine5ChildE"
    },
    {
     "access" : "private",
     "field_name" : "LHSKind",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm5Twine8NodeKindE"
    },
    {
     "access" : "private",
     "field_name" : "RHSKind",
     "field_offset" : 136,
     "referenced_type" : "_ZTIN4llvm5Twine8NodeKindE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5TwineE",
   "name" : "llvm::Twine",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm5TwineE",
   "self_type" : "_ZTIN4llvm5TwineE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/Twine.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIN4llvm9StringRefE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 136,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 144,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 152,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 160,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 168,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 176,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 184,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINS_9StringRefEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<llvm::StringRef, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINS_9StringRefEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINS_9StringRefEcccccccccEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm9StringRefE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTINSt3__14pairIPKcNS0_IiS2_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 200,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 208,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 216,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 224,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 232,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 240,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 248,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 256,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPKcNS3_IiS5_EEEEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<std::pair<const char *, std::pair<int, const char *>>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPKcNS3_IiS5_EEEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPKcNS3_IiS5_EEEEcccccccccEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPKcNS0_IiS2_EEEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTINSt3__14pairIPvmEE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 136,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 144,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 152,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 160,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 168,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 176,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 184,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIPN4llvm2cl6OptionE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 80,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 88,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 120,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplIPNS_2cl6OptionEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<llvm::cl::Option *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPNS_2cl6OptionEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplIPNS_2cl6OptionEcccccccccEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPN4llvm2cl6OptionE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 80,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 88,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 120,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 8,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 16,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 24,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 32,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 40,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 48,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 56,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE",
   "name" : "llvm::detail::AlignerImpl<char, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE",
   "size" : 10,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "name" : "llvm::detail::ConstantLog2<1>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILm2EEE",
   "name" : "llvm::detail::ConstantLog2<2>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILm2EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILm2EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILm4EEE",
   "name" : "llvm::detail::ConstantLog2<4>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILm4EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILm4EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm3EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILm8EEE",
   "name" : "llvm::detail::ConstantLog2<8>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILm8EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILm8EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__14pairIPvPN4llvm2cl6OptionEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12DenseMapPairIPvPNS_2cl6OptionEEE",
   "name" : "llvm::detail::DenseMapPair<void *, llvm::cl::Option *>",
   "referenced_type" : "_ZTIN4llvm6detail12DenseMapPairIPvPNS_2cl6OptionEEE",
   "self_type" : "_ZTIN4llvm6detail12DenseMapPairIPvPNS_2cl6OptionEEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMap.h",
   "template_args" : [ "_ZTIPv", "_ZTIPN4llvm2cl6OptionE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINS_9StringRefEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_9StringRefEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<llvm::StringRef, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_9StringRefEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_9StringRefEcccccccccEELb0EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINS_9StringRefEcccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPKcNS3_IiS5_EEEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPKcNS4_IiS6_EEEEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<std::pair<const char *, std::pair<int, const char *>>, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPKcNS4_IiS6_EEEEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPKcNS4_IiS6_EEEEcccccccccEELb0EEE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPKcNS3_IiS5_EEEEcccccccccEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPNS_2cl6OptionEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPNS_2cl6OptionEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<llvm::cl::Option *, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPNS_2cl6OptionEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPNS_2cl6OptionEcccccccccEELb0EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPNS_2cl6OptionEcccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIccccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<char, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIccccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIccccccccccEELb0EEE",
   "size" : 11,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIccccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm12FunctionTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_12FunctionTypeELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::FunctionType, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_12FunctionTypeELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_12FunctionTypeELb0EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm12FunctionTypeE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm18StringMapEntryBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::StringMapEntryBase, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm2cl10SubCommandE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_2cl10SubCommandELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::cl::SubCommand, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_2cl10SubCommandELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_2cl10SubCommandELb0EEE",
   "size" : 176,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm2cl10SubCommandE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplIPNS_4TypeELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::Type *, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplIPNS_4TypeELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplIPNS_4TypeELb0EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail17PopulationCounterImLm8EEE",
   "name" : "llvm::detail::PopulationCounter<unsigned long, 8>",
   "referenced_type" : "_ZTIN4llvm6detail17PopulationCounterImLm8EEE",
   "self_type" : "_ZTIN4llvm6detail17PopulationCounterImLm8EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "name" : "llvm::detail::LeadingZerosCounter<unsigned int, 4>",
   "referenced_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "self_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "name" : "llvm::detail::LeadingZerosCounter<unsigned long, 8>",
   "referenced_type" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "self_type" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail20TrailingZerosCounterImLm8EEE",
   "name" : "llvm::detail::TrailingZerosCounter<unsigned long, 8>",
   "referenced_type" : "_ZTIN4llvm6detail20TrailingZerosCounterImLm8EEE",
   "self_type" : "_ZTIN4llvm6detail20TrailingZerosCounterImLm8EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "name" : "llvm::detail::AlignmentCalcImplBase",
   "referenced_type" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "self_type" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE"
    },
    {
     "is_pure" : true,
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm6detail21AlignmentCalcImplBaseD1Ev"
    },
    {
     "is_pure" : true,
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm6detail21AlignmentCalcImplBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINS_9StringRefEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<llvm::StringRef, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINS_9StringRefEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINS_9StringRefEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm9StringRefE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA24_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPKcNS3_IiS5_EEEEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<std::pair<const char *, std::pair<int, const char *>>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPKcNS3_IiS5_EEEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPKcNS3_IiS5_EEEEcccccccccEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPKcNS0_IiS2_EEEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplIPNS_2cl6OptionEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<llvm::cl::Option *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplIPNS_2cl6OptionEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplIPNS_2cl6OptionEcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPN4llvm2cl6OptionE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "name" : "llvm::detail::SizerImpl<void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplIccccccccccEE",
   "name" : "llvm::detail::SizerImpl<char, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplIccccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplIccccccccccEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "part",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "parts",
     "referenced_type" : "_ZTIPm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7APFloat11SignificandE",
   "name" : "llvm::APFloat::Significand",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm7APFloat11SignificandE",
   "self_type" : "_ZTIN4llvm7APFloat11SignificandE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/APFloat.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "semantics",
     "referenced_type" : "_ZTIPKN4llvm12fltSemanticsE"
    },
    {
     "access" : "private",
     "field_name" : "significand",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm7APFloat11SignificandE"
    },
    {
     "access" : "private",
     "field_name" : "exponent",
     "field_offset" : 128,
     "referenced_type" : "_ZTIs"
    },
    {
     "access" : "private",
     "field_name" : "category",
     "field_offset" : 144,
     "referenced_type" : "_ZTIN4llvm7APFloat11fltCategoryE"
    },
    {
     "access" : "private",
     "field_name" : "sign",
     "field_offset" : 147,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7APFloatE",
   "name" : "llvm::APFloat",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm7APFloatE",
   "self_type" : "_ZTIN4llvm7APFloatE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/APFloat.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_12FunctionTypeEEE",
   "name" : "llvm::AlignOf<llvm::FunctionType>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_12FunctionTypeEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_12FunctionTypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm12FunctionTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "name" : "llvm::AlignOf<llvm::StringMapEntryBase>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_2cl10SubCommandEEE",
   "name" : "llvm::AlignOf<llvm::cl::SubCommand>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_2cl10SubCommandEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_2cl10SubCommandEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm2cl10SubCommandE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_9StringRefEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<llvm::StringRef, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_9StringRefEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_9StringRefEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINS_9StringRefEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPKcNS4_IiS6_EEEEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<std::pair<const char *, std::pair<int, const char *>>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPKcNS4_IiS6_EEEEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPKcNS4_IiS6_EEEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPKcNS3_IiS5_EEEEcccccccccEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPNS_2cl6OptionEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<llvm::cl::Option *, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPNS_2cl6OptionEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPNS_2cl6OptionEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPNS_2cl6OptionEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIccccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<char, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIccccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIccccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIccccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfIPNS_4TypeEEE",
   "name" : "llvm::AlignOf<llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm7AlignOfIPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm7AlignOfIPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "h0",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h4",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h5",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h6",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "name" : "llvm::hashing::detail::hash_state",
   "referenced_type" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "self_type" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA64_c"
    },
    {
     "field_name" : "state",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN4llvm7hashing6detail10hash_stateE"
    },
    {
     "field_name" : "seed",
     "field_offset" : 960,
     "referenced_type" : "_ZTIKm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "name" : "llvm::hashing::detail::hash_combine_recursive_helper",
   "referenced_type" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "self_type" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "size" : 128,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKPN4llvm4TypeE"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm8ArrayRefIPNS_4TypeEEE",
   "name" : "llvm::ArrayRef<llvm::Type *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm8ArrayRefIPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm8ArrayRefIPNS_4TypeEEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/ArrayRef.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm12DenseMapBaseINS_8DenseMapIPvPNS_2cl6OptionENS_12DenseMapInfoIS2_EENS_6detail12DenseMapPairIS2_S5_EEEES2_S5_S7_SA_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Buckets",
     "referenced_type" : "_ZTIPN4llvm6detail12DenseMapPairIPvPNS_2cl6OptionEEE"
    },
    {
     "access" : "private",
     "field_name" : "NumEntries",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "NumTombstones",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "NumBuckets",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm8DenseMapIPvPNS_2cl6OptionENS_12DenseMapInfoIS1_EENS_6detail12DenseMapPairIS1_S4_EEEE",
   "name" : "llvm::DenseMap<void *, llvm::cl::Option *, llvm::DenseMapInfo<void *>, llvm::detail::DenseMapPair<void *, llvm::cl::Option *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm8DenseMapIPvPNS_2cl6OptionENS_12DenseMapInfoIS1_EENS_6detail12DenseMapPairIS1_S4_EEEE",
   "self_type" : "_ZTIN4llvm8DenseMapIPvPNS_2cl6OptionENS_12DenseMapInfoIS1_EENS_6detail12DenseMapPairIS1_S4_EEEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/DenseMap.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIPN4llvm2cl6OptionE",
    "_ZTIN4llvm12DenseMapInfoIPvEE",
    "_ZTIN4llvm6detail12DenseMapPairIPvPNS_2cl6OptionEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_10VectorTypeENS_4TypeEvEE",
   "name" : "llvm::isa_impl<llvm::VectorType, llvm::Type, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_10VectorTypeENS_4TypeEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_10VectorTypeENS_4TypeEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIN4llvm4TypeE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_11IntegerTypeENS_4TypeEvEE",
   "name" : "llvm::isa_impl<llvm::IntegerType, llvm::Type, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_11IntegerTypeENS_4TypeEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_11IntegerTypeENS_4TypeEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIN4llvm4TypeE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_11PointerTypeENS_4TypeEvEE",
   "name" : "llvm::isa_impl<llvm::PointerType, llvm::Type, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_11PointerTypeENS_4TypeEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_11PointerTypeENS_4TypeEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Type.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIN4llvm4TypeE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm14SequentialTypeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "NumElements",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9ArrayTypeE",
   "name" : "llvm::ArrayType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9ArrayTypeE",
   "self_type" : "_ZTIN4llvm9ArrayTypeE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13StringMapImplE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Allocator",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm15MallocAllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9StringMapIPNS_2cl6OptionENS_15MallocAllocatorEEE",
   "name" : "llvm::StringMap<llvm::cl::Option *, llvm::MallocAllocator>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9StringMapIPNS_2cl6OptionENS_15MallocAllocatorEEE",
   "self_type" : "_ZTIN4llvm9StringMapIPNS_2cl6OptionENS_15MallocAllocatorEEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h",
   "template_args" : [ "_ZTIPN4llvm2cl6OptionE", "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9StringRefE",
   "name" : "llvm::StringRef",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9StringRefE",
   "self_type" : "_ZTIN4llvm9StringRefE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9hash_codeE",
   "name" : "llvm::hash_code",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9hash_codeE",
   "self_type" : "_ZTIN4llvm9hash_codeE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "name" : "llvm::isPodLike<llvm::StringRef>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPKcNS2_IiS4_EEEEEE",
   "name" : "llvm::isPodLike<std::pair<const char *, std::pair<int, const char *>>>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPKcNS2_IiS4_EEEEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPKcNS2_IiS4_EEEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTINSt3__14pairIPKcNS0_IiS2_EEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "name" : "llvm::isPodLike<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINSt3__14pairIiPKcEEEE",
   "name" : "llvm::isPodLike<std::pair<int, const char *>>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIiPKcEEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIiPKcEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTINSt3__14pairIiPKcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIPKcEE",
   "name" : "llvm::isPodLike<const char *>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIPKcEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIPKcEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIPNS_2cl6OptionEEE",
   "name" : "llvm::isPodLike<llvm::cl::Option *>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIPNS_2cl6OptionEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIPNS_2cl6OptionEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPN4llvm2cl6OptionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIPvEE",
   "name" : "llvm::isPodLike<void *>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIPvEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIPvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIcEE",
   "name" : "llvm::isPodLike<char>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIcEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIcEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
