{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_i",
   "name" : "int [1]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA1_i",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA2048_m",
   "name" : "unsigned long [2048]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA2048_m",
   "size" : 8192,
   "source_file" : "external/scudo/standalone/release.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA2_i",
   "name" : "int [2]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA2_i",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA32_m",
   "name" : "unsigned long [32]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA32_m",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA8_i",
   "name" : "int [8]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA8_i",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,

   "referenced_type" : "_ZTIN5scudo15MapPlatformDataE",
   "self_type" : "_ZTIPN5scudo15MapPlatformDataE",
   "size" : 4,
   "source_file" : "external/scudo/standalone/release.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN5scudo15ReleaseRecorderE",
   "name" : "scudo::ReleaseRecorder *",
   "referenced_type" : "_ZTIN5scudo15ReleaseRecorderE",
   "self_type" : "_ZTIPN5scudo15ReleaseRecorderE",
   "size" : 4,
   "source_file" : "external/scudo/standalone/release.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN5scudo18PackedCounterArrayE",
   "name" : "scudo::PackedCounterArray *",
   "referenced_type" : "_ZTIN5scudo18PackedCounterArrayE",
   "self_type" : "_ZTIPN5scudo18PackedCounterArrayE",
   "size" : 4,
   "source_file" : "external/scudo/standalone/release.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "external/scudo/standalone/common.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 4,
   "source_file" : "external/scudo/standalone/release.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN5scudo15ReleaseRecorderE",
   "name" : "const scudo::ReleaseRecorder",
   "referenced_type" : "_ZTIN5scudo15ReleaseRecorderE",
   "self_type" : "_ZTIKN5scudo15ReleaseRecorderE",
   "size" : 16,
   "source_file" : "external/scudo/standalone/release.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN5scudo18PackedCounterArrayE",
   "name" : "const scudo::PackedCounterArray",
   "referenced_type" : "_ZTIN5scudo18PackedCounterArrayE",
   "self_type" : "_ZTIKN5scudo18PackedCounterArrayE",
   "size" : 36,
   "source_file" : "external/scudo/standalone/release.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 4,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKv",
   "name" : "const void *const",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIKPKv",
   "size" : 4,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPc",
   "name" : "char *const",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIKPc",
   "size" : 4,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPv",
   "name" : "void *const",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIKPv",
   "size" : 4,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/scudo/standalone/common.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 4,
   "source_file" : "external/scudo/standalone/common.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVh",
   "name" : "volatile unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIVh",
   "size" : 1,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVi",
   "name" : "volatile int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIVi",
   "size" : 4,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVj",
   "name" : "volatile unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIVj",
   "size" : 4,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVm",
   "name" : "volatile unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIVm",
   "size" : 4,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  },
  {
   "alignment" : 2,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVt",
   "name" : "volatile unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIVt",
   "size" : 2,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVy",
   "name" : "volatile unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIVy",
   "size" : 8,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 24,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA8_i"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Mutex",
     "referenced_type" : "_ZTIRN5scudo11HybridMutexE"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo10ScopedLockE",
   "name" : "scudo::ScopedLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN5scudo10ScopedLockE",
   "self_type" : "_ZTIN5scudo10ScopedLockE",
   "size" : 4,
   "source_file" : "external/scudo/standalone/mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ValDoNotUse",
     "referenced_type" : "_ZTIVi"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo10atomic_s32E",
   "name" : "scudo::atomic_s32",
   "referenced_type" : "_ZTIN5scudo10atomic_s32E",
   "self_type" : "_ZTIN5scudo10atomic_s32E",
   "size" : 4,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "ValDoNotUse",
     "referenced_type" : "_ZTIVt"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo10atomic_u16E",
   "name" : "scudo::atomic_u16",
   "referenced_type" : "_ZTIN5scudo10atomic_u16E",
   "self_type" : "_ZTIN5scudo10atomic_u16E",
   "size" : 2,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ValDoNotUse",
     "referenced_type" : "_ZTIVj"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo10atomic_u32E",
   "name" : "scudo::atomic_u32",
   "referenced_type" : "_ZTIN5scudo10atomic_u32E",
   "self_type" : "_ZTIN5scudo10atomic_u32E",
   "size" : 4,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ValDoNotUse",
     "referenced_type" : "_ZTIVy"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo10atomic_u64E",
   "name" : "scudo::atomic_u64",
   "referenced_type" : "_ZTIN5scudo10atomic_u64E",
   "self_type" : "_ZTIN5scudo10atomic_u64E",
   "size" : 8,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "M",
     "referenced_type" : "_ZTIN5scudo10atomic_u32E"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo11HybridMutexE",
   "name" : "scudo::HybridMutex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN5scudo11HybridMutexE",
   "self_type" : "_ZTIN5scudo11HybridMutexE",
   "size" : 4,
   "source_file" : "external/scudo/standalone/mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ValDoNotUse",
     "referenced_type" : "_ZTIVm"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo11atomic_uptrE",
   "name" : "scudo::atomic_uptr",
   "referenced_type" : "_ZTIN5scudo11atomic_uptrE",
   "self_type" : "_ZTIN5scudo11atomic_uptrE",
   "size" : 4,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5scudo15MapPlatformDataE",
   "name" : "scudo::MapPlatformData",
   "referenced_type" : "_ZTIN5scudo15MapPlatformDataE",
   "self_type" : "_ZTIN5scudo15MapPlatformDataE",
   "size" : 1,
   "source_file" : "external/scudo/standalone/linux.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ReleasedRangesCount",
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "ReleasedBytes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "Base",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "Data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPN5scudo15MapPlatformDataE"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo15ReleaseRecorderE",
   "name" : "scudo::ReleaseRecorder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN5scudo15ReleaseRecorderE",
   "self_type" : "_ZTIN5scudo15ReleaseRecorderE",
   "size" : 16,
   "source_file" : "external/scudo/standalone/release.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Regions",
     "referenced_type" : "_ZTIKm"
    },
    {
     "access" : "private",
     "field_name" : "NumCounters",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKm"
    },
    {
     "access" : "private",
     "field_name" : "CounterSizeBitsLog",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "CounterMask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "PackingRatioLog",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "BitOffsetMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "SizePerRegion",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "BufferSize",
     "field_offset" : 224,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "Buffer",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPm"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo18PackedCounterArrayE",
   "name" : "scudo::PackedCounterArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN5scudo18PackedCounterArrayE",
   "self_type" : "_ZTIN5scudo18PackedCounterArrayE",
   "size" : 36,
   "source_file" : "external/scudo/standalone/release.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "BlockBegin",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "BlockSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "RegionBegin",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "RegionEnd",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo9BlockInfoE",
   "name" : "scudo::BlockInfo",
   "referenced_type" : "_ZTIN5scudo9BlockInfoE",
   "self_type" : "_ZTIN5scudo9BlockInfoE",
   "size" : 16,
   "source_file" : "external/scudo/standalone/common.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "ValDoNotUse",
     "referenced_type" : "_ZTIVh"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo9atomic_u8E",
   "name" : "scudo::atomic_u8",
   "referenced_type" : "_ZTIN5scudo9atomic_u8E",
   "self_type" : "_ZTIN5scudo9atomic_u8E",
   "size" : 1,
   "source_file" : "external/scudo/standalone/atomic_helpers.h"
  }
 ],
 "rvalue_reference_types" : []
}
