#ifndef HIDL_GENERATED_ANDROID_HARDWARE_BIOMETRICS_FINGERPRINT_V2_1_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_BIOMETRICS_FINGERPRINT_V2_1_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace biometrics {
namespace fingerprint {
namespace V2_1 {

// Forward declaration for forward reference support:
enum class RequestStatus : int32_t;
enum class FingerprintError : int32_t;
enum class FingerprintAcquiredInfo : int32_t;
struct FingerprintFingerId;
struct FingerprintEnroll;
struct FingerprintIterator;
struct FingerprintAcquired;
struct FingerprintAuthenticated;
enum class FingerprintMsgType : int32_t;

/**
 * Request status indicates whether the request is accepted by the vendor
 * implementation or not. These values are taken from the errno set,
 * except for the SYS_UNKNOWN
 */
enum class RequestStatus : int32_t {
    SYS_UNKNOWN = 1,
    SYS_OK = 0,
    SYS_ENOENT = -2 /* -2 */,
    SYS_EINTR = -4 /* -4 */,
    SYS_EIO = -5 /* -5 */,
    SYS_EAGAIN = -11 /* -11 */,
    SYS_ENOMEM = -12 /* -12 */,
    SYS_EACCES = -13 /* -13 */,
    SYS_EFAULT = -14 /* -14 */,
    SYS_EBUSY = -16 /* -16 */,
    SYS_EINVAL = -22 /* -22 */,
    SYS_ENOSPC = -28 /* -28 */,
    SYS_ETIMEDOUT = -110 /* -110 */,
};

/**
 * Fingerprint errors are meant to tell the framework to terminate the current
 * operation and ask for the user to correct the situation. These will almost
 * always result in messaging and user interaction to correct the problem.
 *
 * For example, ERROR_CANCELED should follow any acquisition message that
 * results in a situation where the current operation can't continue without
 * user interaction. For example, if the sensor is dirty during enrollment and
 * no further enrollment progress can be made, send ACQUIRED_IMAGER_DIRTY
 * followed by ERROR_CANCELED.
 */
enum class FingerprintError : int32_t {
    /**
     * Used for testing, no error returned
     */
    ERROR_NO_ERROR = 0,
    /**
     * The hardware has an error that can't be resolved.
     */
    ERROR_HW_UNAVAILABLE = 1,
    /**
     * Bad data; operation can't continue
     */
    ERROR_UNABLE_TO_PROCESS = 2,
    /**
     * The operation has timed out waiting for user input.
     */
    ERROR_TIMEOUT = 3,
    /**
     * No space available to store a template
     */
    ERROR_NO_SPACE = 4,
    /**
     * The current operation has been canceled
     */
    ERROR_CANCELED = 5,
    /**
     * Unable to remove a template
     */
    ERROR_UNABLE_TO_REMOVE = 6,
    /**
     * The hardware is in lockout due to too many attempts
     */
    ERROR_LOCKOUT = 7,
    /**
     * Vendor-specific error message
     */
    ERROR_VENDOR = 8,
};

/**
 * Fingerprint acquisition info is meant as feedback for the current operation.
 * Anything but ACQUIRED_GOOD must be shown to the user as feedback on how to
 * take action on the current operation. For example, ACQUIRED_IMAGER_DIRTY may
 * be used to tell the user to clean the sensor if it is detected to be dirty.
 * If this causes the current operation to fail, an additional ERROR_CANCELED
 * must be sent to stop the operation in progress (e.g. enrollment).
 * In general, these messages will result in a "Try again" message.
 */
enum class FingerprintAcquiredInfo : int32_t {
    ACQUIRED_GOOD = 0,
    /**
     * sensor needs more data, i.e. longer swipe.
     */
    ACQUIRED_PARTIAL = 1,
    /**
     * image doesn't contain enough detail for recognition
     */
    ACQUIRED_INSUFFICIENT = 2,
    /**
     * sensor needs to be cleaned
     */
    ACQUIRED_IMAGER_DIRTY = 3,
    /**
     * mostly swipe-type sensors; not enough data collected
     */
    ACQUIRED_TOO_SLOW = 4,
    /**
     * vendor-specific acquisition messages start here
     */
    ACQUIRED_TOO_FAST = 5,
    /**
     * vendor-specific acquisition messages
     */
    ACQUIRED_VENDOR = 6,
};

struct FingerprintFingerId final {
    /**
     * Group ID
     */
    uint32_t gid __attribute__ ((aligned(4)));
    /**
     * Fingerprint template ID
     */
    uint32_t fid __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId, gid) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId, fid) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId) == 8, "wrong size");
static_assert(__alignof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId) == 4, "wrong alignment");

struct FingerprintEnroll final {
    /**
     * Template ID
     */
    ::android::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId finger __attribute__ ((aligned(4)));
    /**
     * samplesRemaining goes from N (no data collected, but N scans needed)
     * to 0 (no more data is needed to build a template).
     */
    uint32_t samplesRemaining __attribute__ ((aligned(4)));
    /**
     * Vendor specific message. Used for user guidance
     */
    uint64_t msg __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintEnroll, finger) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintEnroll, samplesRemaining) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintEnroll, msg) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintEnroll) == 24, "wrong size");
static_assert(__alignof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintEnroll) == 8, "wrong alignment");

struct FingerprintIterator final {
    /**
     * Template ID
     */
    ::android::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId finger __attribute__ ((aligned(4)));
    /**
     * How many templates remain to iterate through
     */
    uint32_t remainingTemplates __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintIterator, finger) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintIterator, remainingTemplates) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintIterator) == 12, "wrong size");
static_assert(__alignof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintIterator) == 4, "wrong alignment");

typedef ::android::hardware::biometrics::fingerprint::V2_1::FingerprintIterator FingerprintEnumerated;

typedef ::android::hardware::biometrics::fingerprint::V2_1::FingerprintIterator FingerprintRemoved;

struct FingerprintAcquired final {
    /**
     * information about the image
     */
    ::android::hardware::biometrics::fingerprint::V2_1::FingerprintAcquiredInfo acquiredInfo __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintAcquired, acquiredInfo) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintAcquired) == 4, "wrong size");
static_assert(__alignof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintAcquired) == 4, "wrong alignment");

struct FingerprintAuthenticated final {
    /**
     * Matched template ID
     */
    ::android::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId finger __attribute__ ((aligned(4)));
    /**
     * Authentication result from the keymaster
     */
    ::android::hardware::hidl_array<uint8_t, 69> hat __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintAuthenticated, finger) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintAuthenticated, hat) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintAuthenticated) == 80, "wrong size");
static_assert(__alignof(::android::hardware::biometrics::fingerprint::V2_1::FingerprintAuthenticated) == 4, "wrong alignment");

/**
 * Run time type identification for the notify() call payload.
 */
enum class FingerprintMsgType : int32_t {
    ERROR = -1 /* -1 */,
    ACQUIRED = 1,
    TEMPLATE_ENROLLING = 3,
    TEMPLATE_REMOVED = 4,
    AUTHENTICATED = 5,
    TEMPLATE_ENUMERATING = 6,
};

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::biometrics::fingerprint::V2_1::RequestStatus o);
static inline void PrintTo(::android::hardware::biometrics::fingerprint::V2_1::RequestStatus o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::biometrics::fingerprint::V2_1::RequestStatus lhs, const ::android::hardware::biometrics::fingerprint::V2_1::RequestStatus rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
