<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libharfbuzz.so.0'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libfreetype.so.6'/>
    <dependency name='libpng16.so.16'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libbz2.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- _fini -->
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _init -->
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_create -->
    <elf-symbol name='hb_blob_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_create_sub_blob -->
    <elf-symbol name='hb_blob_create_sub_blob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_destroy -->
    <elf-symbol name='hb_blob_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_get_data -->
    <elf-symbol name='hb_blob_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_get_data_writable -->

    <elf-symbol name='hb_unicode_funcs_get_default' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_get_empty -->
    <elf-symbol name='hb_unicode_funcs_get_empty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_get_parent -->
    <elf-symbol name='hb_unicode_funcs_get_parent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_get_user_data -->
    <elf-symbol name='hb_unicode_funcs_get_user_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_is_immutable -->
    <elf-symbol name='hb_unicode_funcs_is_immutable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_make_immutable -->
    <elf-symbol name='hb_unicode_funcs_make_immutable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_reference -->
    <elf-symbol name='hb_unicode_funcs_reference' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_combining_class_func -->
    <elf-symbol name='hb_unicode_funcs_set_combining_class_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_compose_func -->
    <elf-symbol name='hb_unicode_funcs_set_compose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_decompose_compatibility_func -->
    <elf-symbol name='hb_unicode_funcs_set_decompose_compatibility_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_decompose_func -->
    <elf-symbol name='hb_unicode_funcs_set_decompose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_eastasian_width_func -->
    <elf-symbol name='hb_unicode_funcs_set_eastasian_width_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_general_category_func -->
    <elf-symbol name='hb_unicode_funcs_set_general_category_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_mirroring_func -->
    <elf-symbol name='hb_unicode_funcs_set_mirroring_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_script_func -->
    <elf-symbol name='hb_unicode_funcs_set_script_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_user_data -->
    <elf-symbol name='hb_unicode_funcs_set_user_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_general_category -->
    <elf-symbol name='hb_unicode_general_category' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_mirroring -->
    <elf-symbol name='hb_unicode_mirroring' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_script -->
    <elf-symbol name='hb_unicode_script' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_version -->
    <elf-symbol name='hb_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_version_atleast -->
    <elf-symbol name='hb_version_atleast' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_version_string -->
    <elf-symbol name='hb_version_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='hb-blob.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- bool -->
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <!-- char[40] -->
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='320' id='type-id-3'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <!-- hb_user_data_item_t[2] -->
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='384' id='type-id-7'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-9'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='type-id-10'/>
    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-11'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-12'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-4'/>
    <!-- void -->
    <type-decl name='void' id='type-id-13'/>
    <!-- typedef int hb_atomic_int_t -->
    <typedef-decl name='hb_atomic_int_t' type-id='type-id-9' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-atomic-private.hh' line='94' column='1' id='type-id-14'/>
    <!-- struct hb_object_header_t -->
    <class-decl name='hb_object_header_t' size-in-bits='896' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='101' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_reference_count_t hb_object_header_t::ref_count -->
        <var-decl name='ref_count' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_user_data_array_t hb_object_header_t::user_data -->
        <var-decl name='user_data' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='103' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_user_data_key_t hb_user_data_key_t -->
    <typedef-decl name='hb_user_data_key_t' type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='337' column='1' id='type-id-19'/>
    <!-- typedef void (void*)* hb_destroy_func_t -->
    <typedef-decl name='hb_destroy_func_t' type-id='type-id-20' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='339' column='1' id='type-id-21'/>
    <!-- typedef pthread_mutex_t hb_mutex_impl_t -->
    <typedef-decl name='hb_mutex_impl_t' type-id='type-id-22' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='59' column='1' id='type-id-23'/>
    <!-- union pthread_mutex_t -->
    <union-decl name='pthread_mutex_t' size-in-bits='320' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1' id='type-id-22'>
      <member-type access='public'>
        <!-- struct pthread_mutex_t::__pthread_mutex_s -->
        <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1' id='type-id-24'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__lock -->
            <var-decl name='__lock' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <!-- unsigned int pthread_mutex_t::__pthread_mutex_s::__count -->
            <var-decl name='__count' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='81' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__owner -->
            <var-decl name='__owner' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='82' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <!-- unsigned int pthread_mutex_t::__pthread_mutex_s::__nusers -->
            <var-decl name='__nusers' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='84' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__kind -->
            <var-decl name='__kind' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='88' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__spins -->
            <var-decl name='__spins' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='90' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- __pthread_list_t pthread_mutex_t::__pthread_mutex_s::__list -->
            <var-decl name='__list' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='91' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <!-- pthread_mutex_t::__pthread_mutex_s pthread_mutex_t::__data -->
        <var-decl name='__data' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='101' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- char pthread_mutex_t::__size[40] -->
        <var-decl name='__size' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='102' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- long int pthread_mutex_t::__align -->
        <var-decl name='__align' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='103' column='1'/>
      </data-member>
    </union-decl>
    <!-- typedef __pthread_internal_list __pthread_list_t -->
    <typedef-decl name='__pthread_list_t' type-id='type-id-26' filepath='/usr/include/bits/pthreadtypes.h' line='65' column='1' id='type-id-25'/>
    <!-- struct __pthread_internal_list -->
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='62' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __pthread_internal_list* __pthread_internal_list::__prev -->
        <var-decl name='__prev' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __pthread_internal_list* __pthread_internal_list::__next -->
        <var-decl name='__next' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef int hb_bool_t -->
    <typedef-decl name='hb_bool_t' type-id='type-id-9' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='73' column='1' id='type-id-28'/>
    <!-- typedef hb_blob_t hb_blob_t -->
    <typedef-decl name='hb_blob_t' type-id='type-id-29' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='65' column='1' id='type-id-30'/>
    <!-- struct hb_blob_t -->
    <class-decl name='hb_blob_t' size-in-bits='1216' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='53' column='1' id='type-id-29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_blob_t::header -->
        <var-decl name='header' type-id='type-id-15' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- bool hb_blob_t::immutable -->
        <var-decl name='immutable' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- const char* hb_blob_t::data -->
        <var-decl name='data' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- unsigned int hb_blob_t::length -->
        <var-decl name='length' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <!-- hb_memory_mode_t hb_blob_t::mode -->
        <var-decl name='mode' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- void* hb_blob_t::user_data -->
        <var-decl name='user_data' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- hb_destroy_func_t hb_blob_t::destroy -->
        <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='64' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum hb_memory_mode_t -->
    <enum-decl name='hb_memory_mode_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='58' column='1' id='type-id-32'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_MEMORY_MODE_DUPLICATE' value='0'/>
      <enumerator name='HB_MEMORY_MODE_READONLY' value='1'/>
      <enumerator name='HB_MEMORY_MODE_WRITABLE' value='2'/>
      <enumerator name='HB_MEMORY_MODE_READONLY_MAY_MAKE_WRITABLE' value='3'/>
    </enum-decl>
    <!-- struct hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u> -->
    <class-decl name='hb_prealloced_array_t&lt;hb_user_data_array_t::hb_user_data_item_t, 2u&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='329' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::len -->
        <var-decl name='len' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::allocated -->
        <var-decl name='allocated' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_user_data_array_t::hb_user_data_item_t* hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::array -->
        <var-decl name='array' type-id='type-id-35' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- hb_user_data_array_t::hb_user_data_item_t hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::static_array[2] -->
        <var-decl name='static_array' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='333' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- hb_user_data_array_t::hb_user_data_item_t* hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::find<hb_user_data_key_t*>(hb_user_data_key_t*) -->
        <function-decl name='find&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>*' -->
          <parameter type-id='type-id-36' is-artificial='yes'/>
          <!-- parameter of type 'hb_user_data_key_t*' -->
          <parameter type-id='type-id-37'/>
          <!-- hb_user_data_array_t::hb_user_data_item_t* -->
          <return type-id='type-id-35'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_user_data_array_t::hb_user_data_item_t* hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::find<hb_user_data_array_t::hb_user_data_item_t>(hb_user_data_array_t::hb_user_data_item_t) -->
        <function-decl name='find&lt;hb_user_data_array_t::hb_user_data_item_t&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>*' -->
          <parameter type-id='type-id-36' is-artificial='yes'/>
          <!-- parameter of type 'struct hb_user_data_array_t::hb_user_data_item_t' -->
          <parameter type-id='type-id-6'/>
          <!-- hb_user_data_array_t::hb_user_data_item_t* -->
          <return type-id='type-id-35'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct hb_reference_count_t -->
    <class-decl name='hb_reference_count_t' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='53' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_atomic_int_t hb_reference_count_t::ref_count -->
        <var-decl name='ref_count' type-id='type-id-14' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_user_data_key_t -->
    <class-decl name='hb_user_data_key_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='334' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char hb_user_data_key_t::unused -->
        <var-decl name='unused' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_mutex_t -->
    <class-decl name='hb_mutex_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='117' column='1' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_mutex_impl_t hb_mutex_t::m -->
        <var-decl name='m' type-id='type-id-23' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='120' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t> -->
    <class-decl name='hb_lockable_set_t&lt;hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='449' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u> hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>::items -->
        <var-decl name='items' type-id='type-id-34' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='450' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- bool hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>::find<hb_user_data_key_t*>(hb_user_data_key_t*, hb_user_data_array_t::hb_user_data_item_t*, hb_mutex_t&) -->
        <function-decl name='find&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='496' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>*' -->
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <!-- parameter of type 'hb_user_data_key_t*' -->
          <parameter type-id='type-id-37'/>
          <!-- parameter of type 'hb_user_data_array_t::hb_user_data_item_t*' -->
          <parameter type-id='type-id-35'/>
          <!-- parameter of type 'hb_mutex_t&' -->
          <parameter type-id='type-id-41'/>
          <!-- bool -->
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>::remove<hb_user_data_key_t*>(hb_user_data_key_t*, hb_mutex_t&) -->
        <function-decl name='remove&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='480' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>*' -->
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <!-- parameter of type 'hb_user_data_key_t*' -->
          <parameter type-id='type-id-37'/>
          <!-- parameter of type 'hb_mutex_t&' -->
          <parameter type-id='type-id-41'/>
          <!-- void -->
          <return type-id='type-id-13'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_user_data_array_t::hb_user_data_item_t* hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>::replace_or_insert<hb_user_data_array_t::hb_user_data_item_t>(hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t&, bool) -->
        <function-decl name='replace_or_insert&lt;hb_user_data_array_t::hb_user_data_item_t&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='455' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>*' -->
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <!-- parameter of type 'struct hb_user_data_array_t::hb_user_data_item_t' -->
          <parameter type-id='type-id-6'/>
          <!-- parameter of type 'hb_mutex_t&' -->
          <parameter type-id='type-id-41'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-1'/>
          <!-- hb_user_data_array_t::hb_user_data_item_t* -->
          <return type-id='type-id-35'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct hb_user_data_array_t -->
    <class-decl name='hb_user_data_array_t' size-in-bits='832' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='70' column='1' id='type-id-17'>
      <member-type access='public'>
        <!-- struct hb_user_data_array_t::hb_user_data_item_t -->
        <class-decl name='hb_user_data_item_t' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='71' column='1' id='type-id-6'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_user_data_key_t* hb_user_data_array_t::hb_user_data_item_t::key -->
            <var-decl name='key' type-id='type-id-37' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='72' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* hb_user_data_array_t::hb_user_data_item_t::data -->
            <var-decl name='data' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='73' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_destroy_func_t hb_user_data_array_t::hb_user_data_item_t::destroy -->
            <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='74' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_mutex_t hb_user_data_array_t::lock -->
        <var-decl name='lock' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t> hb_user_data_array_t::items -->
        <var-decl name='items' type-id='type-id-39' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='83' column='1'/>
      </data-member>
    </class-decl>
    <!-- __pthread_internal_list* -->
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <!-- char* -->
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-42'/>
    <!-- const char -->
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-43'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-31'/>
    <!-- const hb_blob_t -->
    <qualified-type-def type-id='type-id-29' const='yes' id='type-id-44'/>
    <!-- const hb_blob_t* -->
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <!-- const hb_object_header_t -->
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-46'/>
    <!-- const hb_object_header_t* -->
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <!-- const hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u> -->
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-48'/>
    <!-- const hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>* -->
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-49'/>
    <!-- const hb_reference_count_t -->
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-50'/>
    <!-- const hb_reference_count_t* -->
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <!-- const hb_reference_count_t* const -->
    <qualified-type-def type-id='type-id-51' const='yes' id='type-id-52'/>
    <!-- const hb_user_data_array_t::hb_user_data_item_t -->
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-53'/>
    <!-- const hb_user_data_array_t::hb_user_data_item_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-53' size-in-bits='64' id='type-id-54'/>
    <!-- const hb_user_data_array_t::hb_user_data_item_t* -->
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-55'/>
    <!-- hb_blob_t* -->
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-56'/>
    <!-- hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>* -->
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-40'/>
    <!-- hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>* const -->
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-57'/>
    <!-- hb_mutex_t& -->
    <qualified-type-def type-id='type-id-41' id='type-id-58'/>
    <!-- hb_mutex_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-38' size-in-bits='64' id='type-id-41'/>
    <!-- hb_mutex_t* -->
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-59'/>
    <!-- hb_mutex_t* const -->
    <qualified-type-def type-id='type-id-59' const='yes' id='type-id-60'/>
    <!-- hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>* -->
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-36'/>
    <!-- hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>* const -->
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-61'/>
    <!-- hb_reference_count_t* -->
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-62'/>
    <!-- hb_reference_count_t* const -->
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-63'/>
    <!-- hb_user_data_array_t* -->
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-64'/>
    <!-- hb_user_data_array_t* const -->
    <qualified-type-def type-id='type-id-64' const='yes' id='type-id-65'/>
    <!-- hb_user_data_array_t::hb_user_data_item_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-6' size-in-bits='64' id='type-id-66'/>
    <!-- hb_user_data_array_t::hb_user_data_item_t* -->
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-35'/>
    <!-- hb_user_data_array_t::hb_user_data_item_t* const -->
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-67'/>
    <!-- hb_user_data_key_t* -->
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-37'/>
    <!-- unsigned int* -->
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-68'/>
    <!-- void (void*)* -->
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-20'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-33'/>
    <!-- hb_blob_t* hb_blob_get_empty() -->
    <function-decl name='hb_blob_get_empty' mangled-name='hb_blob_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_empty'>
      <!-- hb_blob_t* -->
      <return type-id='type-id-56'/>
    </function-decl>
    <!-- hb_bool_t hb_blob_is_immutable(hb_blob_t*) -->
    <function-decl name='hb_blob_is_immutable' mangled-name='hb_blob_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_is_immutable'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- unsigned int hb_blob_get_length(hb_blob_t*) -->
    <function-decl name='hb_blob_get_length' mangled-name='hb_blob_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_length'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1'/>
      <!-- unsigned int -->
      <return type-id='type-id-12'/>
    </function-decl>
    <!-- const char* hb_blob_get_data(hb_blob_t*, unsigned int*) -->
    <function-decl name='hb_blob_get_data' mangled-name='hb_blob_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-68' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- void hb_blob_make_immutable(hb_blob_t*) -->
    <function-decl name='hb_blob_make_immutable' mangled-name='hb_blob_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_make_immutable'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- char* hb_blob_get_data_writable(hb_blob_t*, unsigned int*) -->
    <function-decl name='hb_blob_get_data_writable' mangled-name='hb_blob_get_data_writable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data_writable'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-68' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <!-- char* -->
      <return type-id='type-id-42'/>
    </function-decl>
    <!-- void* hb_blob_get_user_data(hb_blob_t*, hb_user_data_key_t*) -->
    <function-decl name='hb_blob_get_user_data' mangled-name='hb_blob_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_user_data'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-37' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='275' column='1'/>
      <!-- void* -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- hb_bool_t hb_blob_set_user_data(hb_blob_t*, hb_user_data_key_t*, void*, hb_destroy_func_t, hb_bool_t) -->
    <function-decl name='hb_blob_set_user_data' mangled-name='hb_blob_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_set_user_data'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-37' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='254' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='255' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='type-id-21' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='256' column='1'/>
      <!-- parameter of type 'typedef hb_bool_t' -->
      <parameter type-id='type-id-28' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='257' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- hb_blob_t* hb_blob_reference(hb_blob_t*) -->
    <function-decl name='hb_blob_reference' mangled-name='hb_blob_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_reference'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1'/>
      <!-- hb_blob_t* -->
      <return type-id='type-id-56'/>
    </function-decl>
    <!-- void hb_blob_destroy(hb_blob_t*) -->
    <function-decl name='hb_blob_destroy' mangled-name='hb_blob_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_destroy'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-56' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- hb_blob_t* hb_blob_create(const char*, unsigned int, hb_memory_mode_t, void*, hb_destroy_func_t) -->
    <function-decl name='hb_blob_create' mangled-name='hb_blob_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-31' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='98' column='1'/>
      <!-- parameter of type 'enum hb_memory_mode_t' -->
      <parameter type-id='type-id-32' name='mode' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='99' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='100' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='type-id-21' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='101' column='1'/>
      <!-- hb_blob_t* -->
      <return type-id='type-id-56'/>
    </function-decl>
    <!-- hb_blob_t* hb_blob_create_sub_blob(hb_blob_t*, unsigned int, unsigned int) -->
    <function-decl name='hb_blob_create_sub_blob' mangled-name='hb_blob_create_sub_blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create_sub_blob'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-56' name='parent' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='151' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='152' column='1'/>
      <!-- hb_blob_t* -->
      <return type-id='type-id-56'/>
    </function-decl>
    <!-- void (void*) -->
    <function-type size-in-bits='64' id='type-id-69'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer-serialize.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- const char*[8] -->
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='512' id='type-id-70'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' type-id='type-id-4' id='type-id-71'/>
    </array-type-def>
    <!-- hb_codepoint_t[2][5] -->
    <array-type-def dimensions='2' type-id='type-id-72' size-in-bits='320' id='type-id-73'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
      <!-- <anonymous range>[5] -->
      <subrange length='5' type-id='type-id-4' id='type-id-74'/>
    </array-type-def>
    <!-- int16_t[2] -->
    <array-type-def dimensions='1' type-id='type-id-75' size-in-bits='32' id='type-id-76'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <!-- int8_t[4] -->
    <array-type-def dimensions='1' type-id='type-id-77' size-in-bits='32' id='type-id-78'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='type-id-4' id='type-id-79'/>
    </array-type-def>
    <!-- short int -->
    <type-decl name='short int' size-in-bits='16' id='type-id-80'/>
    <!-- signed char -->
    <type-decl name='signed char' size-in-bits='8' id='type-id-81'/>
    <!-- uint16_t[2] -->
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='32' id='type-id-83'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <!-- uint8_t[4] -->
    <array-type-def dimensions='1' type-id='type-id-84' size-in-bits='32' id='type-id-85'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='type-id-4' id='type-id-79'/>
    </array-type-def>
    <!-- uint8_t[8] -->
    <array-type-def dimensions='1' type-id='type-id-84' size-in-bits='64' id='type-id-86'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' type-id='type-id-4' id='type-id-71'/>
    </array-type-def>
    <!-- unsigned char -->
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-87'/>
    <!-- unsigned int[2] -->
    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='64' id='type-id-88'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <!-- unsigned short int -->
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-89'/>
    <!-- enum hb_buffer_serialize_format_t -->
    <enum-decl name='hb_buffer_serialize_format_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='305' column='1' id='type-id-90'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_TEXT' value='1413830740'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_JSON' value='1246973774'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_INVALID' value='0'/>
    </enum-decl>
    <!-- typedef hb_buffer_t hb_buffer_t -->
    <typedef-decl name='hb_buffer_t' type-id='type-id-91' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='93' column='1' id='type-id-92'/>
    <!-- typedef enum hb_unicode_combining_class_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* hb_unicode_combining_class_func_t -->
    <typedef-decl name='hb_unicode_combining_class_func_t' type-id='type-id-93' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='224' column='1' id='type-id-94'/>
    <!-- enum hb_unicode_combining_class_t -->
    <enum-decl name='hb_unicode_combining_class_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='87' column='1' id='type-id-95'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NOT_REORDERED' value='0'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_OVERLAY' value='1'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NUKTA' value='7'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_KANA_VOICING' value='8'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_VIRAMA' value='9'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC10' value='10'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC11' value='11'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC12' value='12'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC13' value='13'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC14' value='14'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC15' value='15'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC16' value='16'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC17' value='17'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC18' value='18'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC19' value='19'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC20' value='20'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC21' value='21'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC22' value='22'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC23' value='23'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC24' value='24'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC25' value='25'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC26' value='26'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC27' value='27'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC28' value='28'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC29' value='29'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC30' value='30'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC31' value='31'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC32' value='32'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC33' value='33'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC34' value='34'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC35' value='35'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC36' value='36'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC84' value='84'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC91' value='91'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC103' value='103'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC107' value='107'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC118' value='118'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC122' value='122'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC129' value='129'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC130' value='130'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC133' value='132'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW_LEFT' value='200'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW' value='202'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE' value='214'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE_RIGHT' value='216'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_LEFT' value='218'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW' value='220'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_RIGHT' value='222'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_LEFT' value='224'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_RIGHT' value='226'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_LEFT' value='228'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE' value='230'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_RIGHT' value='232'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_BELOW' value='233'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_ABOVE' value='234'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_IOTA_SUBSCRIPT' value='240'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_INVALID' value='255'/>
    </enum-decl>
    <!-- typedef hb_unicode_funcs_t hb_unicode_funcs_t -->
    <typedef-decl name='hb_unicode_funcs_t' type-id='type-id-96' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='171' column='1' id='type-id-97'/>
    <!-- struct hb_buffer_t -->
    <class-decl name='hb_buffer_t' size-in-bits='2752' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='46' column='1' id='type-id-91'>
      <member-type access='public'>
        <!-- typedef long int hb_buffer_t::scratch_buffer_t -->
        <typedef-decl name='scratch_buffer_t' type-id='type-id-10' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='190' column='1' id='type-id-98'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_buffer_t::header -->
        <var-decl name='header' type-id='type-id-15' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_unicode_funcs_t* hb_buffer_t::unicode -->
        <var-decl name='unicode' type-id='type-id-99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_buffer_flags_t hb_buffer_t::flags -->
        <var-decl name='flags' type-id='type-id-100' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <!-- hb_codepoint_t hb_buffer_t::replacement -->
        <var-decl name='replacement' type-id='type-id-72' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- hb_buffer_content_type_t hb_buffer_t::content_type -->
        <var-decl name='content_type' type-id='type-id-101' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- hb_segment_properties_t hb_buffer_t::props -->
        <var-decl name='props' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- bool hb_buffer_t::in_error -->
        <var-decl name='in_error' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1352'>
        <!-- bool hb_buffer_t::have_output -->
        <var-decl name='have_output' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1360'>
        <!-- bool hb_buffer_t::have_positions -->
        <var-decl name='have_positions' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <!-- unsigned int hb_buffer_t::idx -->
        <var-decl name='idx' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- unsigned int hb_buffer_t::len -->
        <var-decl name='len' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <!-- unsigned int hb_buffer_t::out_len -->
        <var-decl name='out_len' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <!-- unsigned int hb_buffer_t::allocated -->
        <var-decl name='allocated' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- hb_glyph_info_t* hb_buffer_t::info -->
        <var-decl name='info' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <!-- hb_glyph_info_t* hb_buffer_t::out_info -->
        <var-decl name='out_info' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <!-- hb_glyph_position_t* hb_buffer_t::pos -->
        <var-decl name='pos' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <!-- unsigned int hb_buffer_t::serial -->
        <var-decl name='serial' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <!-- uint8_t hb_buffer_t::allocated_var_bytes[8] -->
        <var-decl name='allocated_var_bytes' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <!-- const char* hb_buffer_t::allocated_var_owner[8] -->
        <var-decl name='allocated_var_owner' type-id='type-id-70' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='87' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static const unsigned int hb_buffer_t::CONTEXT_LENGTH -->
        <var-decl name='CONTEXT_LENGTH' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <!-- hb_codepoint_t hb_buffer_t::context[2][5] -->
        <var-decl name='context' type-id='type-id-73' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <!-- unsigned int hb_buffer_t::context_len[2] -->
        <var-decl name='context_len' type-id='type-id-88' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='94' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef uint32_t hb_codepoint_t -->
    <typedef-decl name='hb_codepoint_t' type-id='type-id-106' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='75' column='1' id='type-id-72'/>
    <!-- typedef unsigned int uint32_t -->
    <typedef-decl name='uint32_t' type-id='type-id-12' filepath='/usr/include/stdint.h' line='52' column='1' id='type-id-106'/>
    <!-- typedef unsigned int (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* hb_unicode_eastasian_width_func_t -->
    <typedef-decl name='hb_unicode_eastasian_width_func_t' type-id='type-id-107' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='227' column='1' id='type-id-108'/>
    <!-- typedef enum hb_unicode_general_category_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* hb_unicode_general_category_func_t -->
    <typedef-decl name='hb_unicode_general_category_func_t' type-id='type-id-109' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='230' column='1' id='type-id-110'/>
    <!-- enum hb_unicode_general_category_t -->
    <enum-decl name='hb_unicode_general_category_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='46' column='1' id='type-id-111'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONTROL' value='0'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FORMAT' value='1'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UNASSIGNED' value='2'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PRIVATE_USE' value='3'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SURROGATE' value='4'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LOWERCASE_LETTER' value='5'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_LETTER' value='6'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_LETTER' value='7'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_TITLECASE_LETTER' value='8'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UPPERCASE_LETTER' value='9'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACING_MARK' value='10'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_ENCLOSING_MARK' value='11'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_NON_SPACING_MARK' value='12'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DECIMAL_NUMBER' value='13'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LETTER_NUMBER' value='14'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_NUMBER' value='15'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONNECT_PUNCTUATION' value='16'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DASH_PUNCTUATION' value='17'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CLOSE_PUNCTUATION' value='18'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FINAL_PUNCTUATION' value='19'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_INITIAL_PUNCTUATION' value='20'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_PUNCTUATION' value='21'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OPEN_PUNCTUATION' value='22'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CURRENCY_SYMBOL' value='23'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_SYMBOL' value='24'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MATH_SYMBOL' value='25'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_SYMBOL' value='26'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LINE_SEPARATOR' value='27'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PARAGRAPH_SEPARATOR' value='28'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACE_SEPARATOR' value='29'/>
    </enum-decl>
    <!-- typedef typedef hb_codepoint_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* hb_unicode_mirroring_func_t -->
    <typedef-decl name='hb_unicode_mirroring_func_t' type-id='type-id-112' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='233' column='1' id='type-id-113'/>
    <!-- typedef enum hb_script_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* hb_unicode_script_func_t -->
    <typedef-decl name='hb_unicode_script_func_t' type-id='type-id-114' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='236' column='1' id='type-id-115'/>
    <!-- enum hb_script_t -->
    <enum-decl name='hb_script_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='157' column='1' id='type-id-116'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_SCRIPT_COMMON' value='1517910393'/>
      <enumerator name='HB_SCRIPT_INHERITED' value='1516858984'/>
      <enumerator name='HB_SCRIPT_UNKNOWN' value='1517976186'/>
      <enumerator name='HB_SCRIPT_ARABIC' value='1098015074'/>
      <enumerator name='HB_SCRIPT_ARMENIAN' value='1098018158'/>
      <enumerator name='HB_SCRIPT_BENGALI' value='1113943655'/>
      <enumerator name='HB_SCRIPT_CYRILLIC' value='1132032620'/>
      <enumerator name='HB_SCRIPT_DEVANAGARI' value='1147500129'/>
      <enumerator name='HB_SCRIPT_GEORGIAN' value='1197830002'/>
      <enumerator name='HB_SCRIPT_GREEK' value='1198679403'/>
      <enumerator name='HB_SCRIPT_GUJARATI' value='1198877298'/>
      <enumerator name='HB_SCRIPT_GURMUKHI' value='1198879349'/>
      <enumerator name='HB_SCRIPT_HANGUL' value='1214344807'/>
      <enumerator name='HB_SCRIPT_HAN' value='1214344809'/>
      <enumerator name='HB_SCRIPT_HEBREW' value='1214603890'/>
      <enumerator name='HB_SCRIPT_HIRAGANA' value='1214870113'/>
      <enumerator name='HB_SCRIPT_KANNADA' value='1265525857'/>
      <enumerator name='HB_SCRIPT_KATAKANA' value='1264676449'/>
      <enumerator name='HB_SCRIPT_LAO' value='1281453935'/>
      <enumerator name='HB_SCRIPT_LATIN' value='1281455214'/>
      <enumerator name='HB_SCRIPT_MALAYALAM' value='1298954605'/>
      <enumerator name='HB_SCRIPT_ORIYA' value='1332902241'/>
      <enumerator name='HB_SCRIPT_TAMIL' value='1415671148'/>
      <enumerator name='HB_SCRIPT_TELUGU' value='1415933045'/>
      <enumerator name='HB_SCRIPT_THAI' value='1416126825'/>
      <enumerator name='HB_SCRIPT_TIBETAN' value='1416192628'/>
      <enumerator name='HB_SCRIPT_BOPOMOFO' value='1114599535'/>
      <enumerator name='HB_SCRIPT_BRAILLE' value='1114792297'/>
      <enumerator name='HB_SCRIPT_CANADIAN_SYLLABICS' value='1130458739'/>
      <enumerator name='HB_SCRIPT_CHEROKEE' value='1130915186'/>
      <enumerator name='HB_SCRIPT_ETHIOPIC' value='1165256809'/>
      <enumerator name='HB_SCRIPT_KHMER' value='1265134962'/>
      <enumerator name='HB_SCRIPT_MONGOLIAN' value='1299148391'/>
      <enumerator name='HB_SCRIPT_MYANMAR' value='1299803506'/>
      <enumerator name='HB_SCRIPT_OGHAM' value='1332175213'/>
      <enumerator name='HB_SCRIPT_RUNIC' value='1383427698'/>
      <enumerator name='HB_SCRIPT_SINHALA' value='1399418472'/>
      <enumerator name='HB_SCRIPT_SYRIAC' value='1400468067'/>
      <enumerator name='HB_SCRIPT_THAANA' value='1416126817'/>
      <enumerator name='HB_SCRIPT_YI' value='1500080489'/>
      <enumerator name='HB_SCRIPT_DESERET' value='1148416628'/>
      <enumerator name='HB_SCRIPT_GOTHIC' value='1198486632'/>
      <enumerator name='HB_SCRIPT_OLD_ITALIC' value='1232363884'/>
      <enumerator name='HB_SCRIPT_BUHID' value='1114990692'/>
      <enumerator name='HB_SCRIPT_HANUNOO' value='1214344815'/>
      <enumerator name='HB_SCRIPT_TAGALOG' value='1416064103'/>
      <enumerator name='HB_SCRIPT_TAGBANWA' value='1415669602'/>
      <enumerator name='HB_SCRIPT_CYPRIOT' value='1131442804'/>
      <enumerator name='HB_SCRIPT_LIMBU' value='1281977698'/>
      <enumerator name='HB_SCRIPT_LINEAR_B' value='1281977954'/>
      <enumerator name='HB_SCRIPT_OSMANYA' value='1332964705'/>
      <enumerator name='HB_SCRIPT_SHAVIAN' value='1399349623'/>
      <enumerator name='HB_SCRIPT_TAI_LE' value='1415670885'/>
      <enumerator name='HB_SCRIPT_UGARITIC' value='1432838514'/>
      <enumerator name='HB_SCRIPT_BUGINESE' value='1114990441'/>
      <enumerator name='HB_SCRIPT_COPTIC' value='1131376756'/>
      <enumerator name='HB_SCRIPT_GLAGOLITIC' value='1198285159'/>
      <enumerator name='HB_SCRIPT_KHAROSHTHI' value='1265131890'/>
      <enumerator name='HB_SCRIPT_NEW_TAI_LUE' value='1415670901'/>
      <enumerator name='HB_SCRIPT_OLD_PERSIAN' value='1483761007'/>
      <enumerator name='HB_SCRIPT_SYLOTI_NAGRI' value='1400466543'/>
      <enumerator name='HB_SCRIPT_TIFINAGH' value='1415999079'/>
      <enumerator name='HB_SCRIPT_BALINESE' value='1113681001'/>
      <enumerator name='HB_SCRIPT_CUNEIFORM' value='1483961720'/>
      <enumerator name='HB_SCRIPT_NKO' value='1315663727'/>
      <enumerator name='HB_SCRIPT_PHAGS_PA' value='1349017959'/>
      <enumerator name='HB_SCRIPT_PHOENICIAN' value='1349021304'/>
      <enumerator name='HB_SCRIPT_CARIAN' value='1130459753'/>
      <enumerator name='HB_SCRIPT_CHAM' value='1130914157'/>
      <enumerator name='HB_SCRIPT_KAYAH_LI' value='1264675945'/>
      <enumerator name='HB_SCRIPT_LEPCHA' value='1281716323'/>
      <enumerator name='HB_SCRIPT_LYCIAN' value='1283023721'/>
      <enumerator name='HB_SCRIPT_LYDIAN' value='1283023977'/>
      <enumerator name='HB_SCRIPT_OL_CHIKI' value='1332503403'/>
      <enumerator name='HB_SCRIPT_REJANG' value='1382706791'/>
      <enumerator name='HB_SCRIPT_SAURASHTRA' value='1398895986'/>
      <enumerator name='HB_SCRIPT_SUNDANESE' value='1400204900'/>
      <enumerator name='HB_SCRIPT_VAI' value='1449224553'/>
      <enumerator name='HB_SCRIPT_AVESTAN' value='1098281844'/>
      <enumerator name='HB_SCRIPT_BAMUM' value='1113681269'/>
      <enumerator name='HB_SCRIPT_EGYPTIAN_HIEROGLYPHS' value='1164409200'/>
      <enumerator name='HB_SCRIPT_IMPERIAL_ARAMAIC' value='1098018153'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PAHLAVI' value='1349020777'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PARTHIAN' value='1349678185'/>
      <enumerator name='HB_SCRIPT_JAVANESE' value='1247901281'/>
      <enumerator name='HB_SCRIPT_KAITHI' value='1265920105'/>
      <enumerator name='HB_SCRIPT_LISU' value='1281979253'/>
      <enumerator name='HB_SCRIPT_MEETEI_MAYEK' value='1299473769'/>
      <enumerator name='HB_SCRIPT_OLD_SOUTH_ARABIAN' value='1398895202'/>
      <enumerator name='HB_SCRIPT_OLD_TURKIC' value='1332898664'/>
      <enumerator name='HB_SCRIPT_SAMARITAN' value='1398893938'/>
      <enumerator name='HB_SCRIPT_TAI_THAM' value='1281453665'/>
      <enumerator name='HB_SCRIPT_TAI_VIET' value='1415673460'/>
      <enumerator name='HB_SCRIPT_BATAK' value='1113683051'/>
      <enumerator name='HB_SCRIPT_BRAHMI' value='1114792296'/>
      <enumerator name='HB_SCRIPT_MANDAIC' value='1298230884'/>
      <enumerator name='HB_SCRIPT_CHAKMA' value='1130457965'/>
      <enumerator name='HB_SCRIPT_MEROITIC_CURSIVE' value='1298494051'/>
      <enumerator name='HB_SCRIPT_MEROITIC_HIEROGLYPHS' value='1298494063'/>
      <enumerator name='HB_SCRIPT_MIAO' value='1349284452'/>
      <enumerator name='HB_SCRIPT_SHARADA' value='1399353956'/>
      <enumerator name='HB_SCRIPT_SORA_SOMPENG' value='1399812705'/>
      <enumerator name='HB_SCRIPT_TAKRI' value='1415670642'/>
      <enumerator name='HB_SCRIPT_BASSA_VAH' value='1113682803'/>
      <enumerator name='HB_SCRIPT_CAUCASIAN_ALBANIAN' value='1097295970'/>
      <enumerator name='HB_SCRIPT_DUPLOYAN' value='1148547180'/>
      <enumerator name='HB_SCRIPT_ELBASAN' value='1164730977'/>
      <enumerator name='HB_SCRIPT_GRANTHA' value='1198678382'/>
      <enumerator name='HB_SCRIPT_KHOJKI' value='1265135466'/>
      <enumerator name='HB_SCRIPT_KHUDAWADI' value='1399418468'/>
      <enumerator name='HB_SCRIPT_LINEAR_A' value='1281977953'/>
      <enumerator name='HB_SCRIPT_MAHAJANI' value='1298229354'/>
      <enumerator name='HB_SCRIPT_MANICHAEAN' value='1298230889'/>
      <enumerator name='HB_SCRIPT_MENDE_KIKAKUI' value='1298493028'/>
      <enumerator name='HB_SCRIPT_MODI' value='1299145833'/>
      <enumerator name='HB_SCRIPT_MRO' value='1299345263'/>
      <enumerator name='HB_SCRIPT_NABATAEAN' value='1315070324'/>
      <enumerator name='HB_SCRIPT_OLD_NORTH_ARABIAN' value='1315009122'/>
      <enumerator name='HB_SCRIPT_OLD_PERMIC' value='1348825709'/>
      <enumerator name='HB_SCRIPT_PAHAWH_HMONG' value='1215131239'/>
      <enumerator name='HB_SCRIPT_PALMYRENE' value='1348562029'/>
      <enumerator name='HB_SCRIPT_PAU_CIN_HAU' value='1348564323'/>
      <enumerator name='HB_SCRIPT_PSALTER_PAHLAVI' value='1349020784'/>
      <enumerator name='HB_SCRIPT_SIDDHAM' value='1399415908'/>
      <enumerator name='HB_SCRIPT_TIRHUTA' value='1416196712'/>
      <enumerator name='HB_SCRIPT_WARANG_CITI' value='1466004065'/>
      <enumerator name='HB_SCRIPT_INVALID' value='0'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE' value='4294967295'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE_SIGNED' value='2147483647'/>
    </enum-decl>
    <!-- typedef typedef hb_bool_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, typedef hb_codepoint_t, hb_codepoint_t*, void*)* hb_unicode_compose_func_t -->
    <typedef-decl name='hb_unicode_compose_func_t' type-id='type-id-117' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='242' column='1' id='type-id-118'/>
    <!-- typedef typedef hb_bool_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, hb_codepoint_t*, hb_codepoint_t*, void*)* hb_unicode_decompose_func_t -->
    <typedef-decl name='hb_unicode_decompose_func_t' type-id='type-id-119' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='247' column='1' id='type-id-120'/>
    <!-- typedef unsigned int (hb_unicode_funcs_t*, typedef hb_codepoint_t, hb_codepoint_t*, void*)* hb_unicode_decompose_compatibility_func_t -->
    <typedef-decl name='hb_unicode_decompose_compatibility_func_t' type-id='type-id-121' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='270' column='1' id='type-id-122'/>
    <!-- struct hb_unicode_funcs_t -->
    <class-decl name='hb_unicode_funcs_t' size-in-bits='2560' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='64' column='1' id='type-id-96'>
      <member-type access='public'>
        <!-- struct {hb_unicode_combining_class_func_t combining_class; hb_unicode_eastasian_width_func_t eastasian_width; hb_unicode_general_category_func_t general_category; hb_unicode_mirroring_func_t mirroring; hb_unicode_script_func_t script; hb_unicode_compose_func_t compose; hb_unicode_decompose_func_t decompose; hb_unicode_decompose_compatibility_func_t decompose_compatibility;} -->
        <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='203' column='1' id='type-id-123'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_unicode_combining_class_func_t combining_class -->
            <var-decl name='combining_class' type-id='type-id-94' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_unicode_eastasian_width_func_t eastasian_width -->
            <var-decl name='eastasian_width' type-id='type-id-108' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_unicode_general_category_func_t general_category -->
            <var-decl name='general_category' type-id='type-id-110' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_unicode_mirroring_func_t mirroring -->
            <var-decl name='mirroring' type-id='type-id-113' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_unicode_script_func_t script -->
            <var-decl name='script' type-id='type-id-115' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_unicode_compose_func_t compose -->
            <var-decl name='compose' type-id='type-id-118' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_unicode_decompose_func_t decompose -->
            <var-decl name='decompose' type-id='type-id-120' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_unicode_decompose_compatibility_func_t decompose_compatibility -->
            <var-decl name='decompose_compatibility' type-id='type-id-122' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {void* combining_class; void* eastasian_width; void* general_category; void* mirroring; void* script; void* compose; void* decompose; void* decompose_compatibility;} -->
        <class-decl name='__anonymous_struct__1' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='209' column='1' id='type-id-124'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- void* combining_class -->
            <var-decl name='combining_class' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* eastasian_width -->
            <var-decl name='eastasian_width' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- void* general_category -->
            <var-decl name='general_category' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- void* mirroring -->
            <var-decl name='mirroring' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- void* script -->
            <var-decl name='script' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- void* compose -->
            <var-decl name='compose' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- void* decompose -->
            <var-decl name='decompose' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- void* decompose_compatibility -->
            <var-decl name='decompose_compatibility' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {hb_destroy_func_t combining_class; hb_destroy_func_t eastasian_width; hb_destroy_func_t general_category; hb_destroy_func_t mirroring; hb_destroy_func_t script; hb_destroy_func_t compose; hb_destroy_func_t decompose; hb_destroy_func_t decompose_compatibility;} -->
        <class-decl name='__anonymous_struct__2' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='215' column='1' id='type-id-125'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_destroy_func_t combining_class -->
            <var-decl name='combining_class' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_destroy_func_t eastasian_width -->
            <var-decl name='eastasian_width' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_destroy_func_t general_category -->
            <var-decl name='general_category' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_destroy_func_t mirroring -->
            <var-decl name='mirroring' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_destroy_func_t script -->
            <var-decl name='script' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_destroy_func_t compose -->
            <var-decl name='compose' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_destroy_func_t decompose -->
            <var-decl name='decompose' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_destroy_func_t decompose_compatibility -->
            <var-decl name='decompose_compatibility' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_unicode_funcs_t::header -->
        <var-decl name='header' type-id='type-id-15' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_unicode_funcs_t* hb_unicode_funcs_t::parent -->
        <var-decl name='parent' type-id='type-id-99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- bool hb_unicode_funcs_t::immutable -->
        <var-decl name='immutable' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- struct {hb_unicode_combining_class_func_t combining_class; hb_unicode_eastasian_width_func_t eastasian_width; hb_unicode_general_category_func_t general_category; hb_unicode_mirroring_func_t mirroring; hb_unicode_script_func_t script; hb_unicode_compose_func_t compose; hb_unicode_decompose_func_t decompose; hb_unicode_decompose_compatibility_func_t decompose_compatibility;} hb_unicode_funcs_t::func -->
        <var-decl name='func' type-id='type-id-123' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- struct {void* combining_class; void* eastasian_width; void* general_category; void* mirroring; void* script; void* compose; void* decompose; void* decompose_compatibility;} hb_unicode_funcs_t::user_data -->
        <var-decl name='user_data' type-id='type-id-124' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- struct {hb_destroy_func_t combining_class; hb_destroy_func_t eastasian_width; hb_destroy_func_t general_category; hb_destroy_func_t mirroring; hb_destroy_func_t script; hb_destroy_func_t compose; hb_destroy_func_t decompose; hb_destroy_func_t decompose_compatibility;} hb_unicode_funcs_t::destroy -->
        <var-decl name='destroy' type-id='type-id-125' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='219' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_language_impl_t -->
    <class-decl name='hb_language_impl_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='167' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char hb_language_impl_t::s[1] -->
        <var-decl name='s' type-id='type-id-127' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='168' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum hb_buffer_flags_t -->
    <enum-decl name='hb_buffer_flags_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='174' column='1' id='type-id-100'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_BUFFER_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_FLAG_BOT' value='1'/>
      <enumerator name='HB_BUFFER_FLAG_EOT' value='2'/>
      <enumerator name='HB_BUFFER_FLAG_PRESERVE_DEFAULT_IGNORABLES' value='4'/>
    </enum-decl>
    <!-- enum hb_buffer_content_type_t -->
    <enum-decl name='hb_buffer_content_type_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='119' column='1' id='type-id-101'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_INVALID' value='0'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_UNICODE' value='1'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_GLYPHS' value='2'/>
    </enum-decl>
    <!-- typedef hb_segment_properties_t hb_segment_properties_t -->
    <typedef-decl name='hb_segment_properties_t' type-id='type-id-128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='72' column='1' id='type-id-102'/>
    <!-- enum hb_direction_t -->
    <enum-decl name='hb_direction_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='111' column='1' id='type-id-129'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_DIRECTION_INVALID' value='0'/>
      <enumerator name='HB_DIRECTION_LTR' value='4'/>
      <enumerator name='HB_DIRECTION_RTL' value='5'/>
      <enumerator name='HB_DIRECTION_TTB' value='6'/>
      <enumerator name='HB_DIRECTION_BTT' value='7'/>
    </enum-decl>
    <!-- typedef const hb_language_impl_t* hb_language_t -->
    <typedef-decl name='hb_language_t' type-id='type-id-130' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='137' column='1' id='type-id-131'/>
    <!-- struct hb_glyph_info_t -->
    <class-decl name='hb_glyph_info_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='44' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_codepoint_t hb_glyph_info_t::codepoint -->
        <var-decl name='codepoint' type-id='type-id-72' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_mask_t hb_glyph_info_t::mask -->
        <var-decl name='mask' type-id='type-id-133' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t hb_glyph_info_t::cluster -->
        <var-decl name='cluster' type-id='type-id-106' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- hb_var_int_t hb_glyph_info_t::var1 -->
        <var-decl name='var1' type-id='type-id-134' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- hb_var_int_t hb_glyph_info_t::var2 -->
        <var-decl name='var2' type-id='type-id-134' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_glyph_info_t hb_glyph_info_t -->
    <typedef-decl name='hb_glyph_info_t' type-id='type-id-132' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='52' column='1' id='type-id-135'/>
    <!-- typedef uint32_t hb_mask_t -->
    <typedef-decl name='hb_mask_t' type-id='type-id-106' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='77' column='1' id='type-id-133'/>
    <!-- typedef _hb_var_int_t hb_var_int_t -->
    <typedef-decl name='hb_var_int_t' type-id='type-id-136' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='86' column='1' id='type-id-134'/>
    <!-- union _hb_var_int_t -->
    <union-decl name='_hb_var_int_t' size-in-bits='32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='79' column='1' id='type-id-136'>
      <data-member access='public'>
        <!-- uint32_t _hb_var_int_t::u32 -->
        <var-decl name='u32' type-id='type-id-106' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- int32_t _hb_var_int_t::i32 -->
        <var-decl name='i32' type-id='type-id-137' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='81' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- uint16_t _hb_var_int_t::u16[2] -->
        <var-decl name='u16' type-id='type-id-83' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='82' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- int16_t _hb_var_int_t::i16[2] -->
        <var-decl name='i16' type-id='type-id-76' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='83' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- uint8_t _hb_var_int_t::u8[4] -->
        <var-decl name='u8' type-id='type-id-85' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='84' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- int8_t _hb_var_int_t::i8[4] -->
        <var-decl name='i8' type-id='type-id-78' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='85' column='1'/>
      </data-member>
    </union-decl>
    <!-- typedef int int32_t -->
    <typedef-decl name='int32_t' type-id='type-id-9' filepath='/usr/include/stdint.h' line='39' column='1' id='type-id-137'/>
    <!-- typedef unsigned short int uint16_t -->
    <typedef-decl name='uint16_t' type-id='type-id-89' filepath='/usr/include/stdint.h' line='50' column='1' id='type-id-82'/>
    <!-- typedef short int int16_t -->
    <typedef-decl name='int16_t' type-id='type-id-80' filepath='/usr/include/stdint.h' line='38' column='1' id='type-id-75'/>
    <!-- typedef unsigned char uint8_t -->
    <typedef-decl name='uint8_t' type-id='type-id-87' filepath='/usr/include/stdint.h' line='49' column='1' id='type-id-84'/>
    <!-- typedef signed char int8_t -->
    <typedef-decl name='int8_t' type-id='type-id-81' filepath='/usr/include/stdint.h' line='37' column='1' id='type-id-77'/>
    <!-- typedef hb_glyph_position_t hb_glyph_position_t -->
    <typedef-decl name='hb_glyph_position_t' type-id='type-id-138' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='62' column='1' id='type-id-139'/>
    <!-- typedef int32_t hb_position_t -->
    <typedef-decl name='hb_position_t' type-id='type-id-137' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='76' column='1' id='type-id-140'/>
    <!-- typedef hb_font_t hb_font_t -->
    <typedef-decl name='hb_font_t' type-id='type-id-141' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='40' column='1' id='type-id-142'/>
    <!-- struct hb_font_t -->
    <class-decl name='hb_font_t' size-in-bits='1536' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='91' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_font_t::header -->
        <var-decl name='header' type-id='type-id-15' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_font_t::immutable -->
        <var-decl name='immutable' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_font_t* hb_font_t::parent -->
        <var-decl name='parent' type-id='type-id-143' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- hb_face_t* hb_font_t::face -->
        <var-decl name='face' type-id='type-id-144' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- int hb_font_t::x_scale -->
        <var-decl name='x_scale' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <!-- int hb_font_t::y_scale -->
        <var-decl name='y_scale' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- unsigned int hb_font_t::x_ppem -->
        <var-decl name='x_ppem' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <!-- unsigned int hb_font_t::y_ppem -->
        <var-decl name='y_ppem' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- hb_font_funcs_t* hb_font_t::klass -->
        <var-decl name='klass' type-id='type-id-145' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- void* hb_font_t::user_data -->
        <var-decl name='user_data' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- hb_destroy_func_t hb_font_t::destroy -->
        <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- hb_shaper_data_t hb_font_t::shaper_data -->
        <var-decl name='shaper_data' type-id='type-id-146' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='110' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum hb_buffer_serialize_flags_t -->
    <enum-decl name='hb_buffer_serialize_flags_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='298' column='1' id='type-id-147'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_CLUSTERS' value='1'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_POSITIONS' value='2'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_GLYPH_NAMES' value='4'/>
    </enum-decl>
    <!-- struct hb_segment_properties_t -->
    <class-decl name='hb_segment_properties_t' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='65' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_direction_t hb_segment_properties_t::direction -->
        <var-decl name='direction' type-id='type-id-129' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_script_t hb_segment_properties_t::script -->
        <var-decl name='script' type-id='type-id-116' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_language_t hb_segment_properties_t::language -->
        <var-decl name='language' type-id='type-id-131' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* hb_segment_properties_t::reserved1 -->
        <var-decl name='reserved1' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* hb_segment_properties_t::reserved2 -->
        <var-decl name='reserved2' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_glyph_position_t -->
    <class-decl name='hb_glyph_position_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='54' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_position_t hb_glyph_position_t::x_advance -->
        <var-decl name='x_advance' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_position_t hb_glyph_position_t::y_advance -->
        <var-decl name='y_advance' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_position_t hb_glyph_position_t::x_offset -->
        <var-decl name='x_offset' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- hb_position_t hb_glyph_position_t::y_offset -->
        <var-decl name='y_offset' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- hb_var_int_t hb_glyph_position_t::var -->
        <var-decl name='var' type-id='type-id-134' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <!-- const char** -->
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-148'/>
    <!-- const hb_buffer_t -->
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-149'/>
    <!-- const hb_buffer_t* -->
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-150'/>
    <!-- const hb_codepoint_t -->
    <qualified-type-def type-id='type-id-72' const='yes' id='type-id-151'/>
    <!-- const hb_codepoint_t* -->
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-152'/>
    <!-- const hb_glyph_info_t -->
    <qualified-type-def type-id='type-id-135' const='yes' id='type-id-153'/>
    <!-- const hb_glyph_info_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-153' size-in-bits='64' id='type-id-154'/>
    <!-- const hb_language_impl_t -->
    <qualified-type-def type-id='type-id-126' const='yes' id='type-id-155'/>
    <!-- const hb_language_impl_t* -->
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-130'/>
    <!-- const hb_unicode_funcs_t -->
    <qualified-type-def type-id='type-id-96' const='yes' id='type-id-156'/>
    <!-- const hb_unicode_funcs_t* -->
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-157'/>
    <!-- const unsigned int -->
    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-105'/>
    <!-- enum hb_script_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-114'/>
    <!-- enum hb_unicode_combining_class_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-93'/>
    <!-- enum hb_unicode_general_category_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-109'/>
    <!-- hb_buffer_t* -->
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-161'/>
    <!-- hb_buffer_t::scratch_buffer_t* -->
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-162'/>
    <!-- hb_codepoint_t* -->
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-163'/>
    <!-- hb_font_t* -->
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <!-- hb_glyph_info_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-135' size-in-bits='64' id='type-id-164'/>
    <!-- hb_glyph_info_t* -->
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-103'/>
    <!-- hb_glyph_position_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-139' size-in-bits='64' id='type-id-165'/>
    <!-- hb_glyph_position_t* -->
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-104'/>
    <!-- hb_unicode_funcs_t* -->
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-99'/>
    <!-- typedef hb_bool_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, hb_codepoint_t*, hb_codepoint_t*, void*)* -->
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-119'/>
    <!-- typedef hb_bool_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, typedef hb_codepoint_t, hb_codepoint_t*, void*)* -->
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-117'/>
    <!-- typedef hb_codepoint_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-112'/>
    <!-- unsigned int (hb_unicode_funcs_t*, typedef hb_codepoint_t, hb_codepoint_t*, void*)* -->
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-121'/>
    <!-- unsigned int (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-107'/>
    <!-- const char** hb_buffer_serialize_list_formats() -->
    <function-decl name='hb_buffer_serialize_list_formats' mangled-name='hb_buffer_serialize_list_formats' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_list_formats'>
      <!-- const char** -->
      <return type-id='type-id-148'/>
    </function-decl>
    <!-- const char* hb_buffer_serialize_format_to_string(hb_buffer_serialize_format_t) -->
    <function-decl name='hb_buffer_serialize_format_to_string' mangled-name='hb_buffer_serialize_format_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_to_string'>
      <!-- parameter of type 'enum hb_buffer_serialize_format_t' -->
      <parameter type-id='type-id-90' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_deserialize_glyphs(hb_buffer_t*, const char*, int, const char**, hb_font_t*, hb_buffer_serialize_format_t) -->
    <function-decl name='hb_buffer_deserialize_glyphs' mangled-name='hb_buffer_deserialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_deserialize_glyphs'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-31' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='354' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='buf_len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='355' column='1'/>
      <!-- parameter of type 'const char**' -->
      <parameter type-id='type-id-148' name='end_ptr' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='356' column='1'/>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-143' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='357' column='1'/>
      <!-- parameter of type 'enum hb_buffer_serialize_format_t' -->
      <parameter type-id='type-id-90' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='358' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- unsigned int hb_buffer_serialize_glyphs(hb_buffer_t*, unsigned int, unsigned int, char*, unsigned int, unsigned int*, hb_font_t*, hb_buffer_serialize_format_t, hb_buffer_serialize_flags_t) -->
    <function-decl name='hb_buffer_serialize_glyphs' mangled-name='hb_buffer_serialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_glyphs'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='247' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='end' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='248' column='1'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-42' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='249' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='buf_size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='250' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-68' name='buf_consumed' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='251' column='1'/>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-143' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='252' column='1'/>
      <!-- parameter of type 'enum hb_buffer_serialize_format_t' -->
      <parameter type-id='type-id-90' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='253' column='1'/>
      <!-- parameter of type 'enum hb_buffer_serialize_flags_t' -->
      <parameter type-id='type-id-147' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='254' column='1'/>
      <!-- unsigned int -->
      <return type-id='type-id-12'/>
    </function-decl>
    <!-- hb_buffer_serialize_format_t hb_buffer_serialize_format_from_string(const char*, int) -->
    <function-decl name='hb_buffer_serialize_format_from_string' mangled-name='hb_buffer_serialize_format_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-31' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <!-- enum hb_buffer_serialize_format_t -->
      <return type-id='type-id-90'/>
    </function-decl>
    <!-- struct hb_shaper_data_t -->
    <class-decl name='hb_shaper_data_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='53' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* hb_shaper_data_t::ot -->
        <var-decl name='ot' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* hb_shaper_data_t::fallback -->
        <var-decl name='fallback' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- const char[1] -->
    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='8' id='type-id-127'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='type-id-4' id='type-id-171'/>
    </array-type-def>
    <!-- hb_script_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' id='type-id-158'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-99'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-72'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33'/>
      <!-- enum hb_script_t -->
      <return type-id='type-id-116'/>
    </function-type>
    <!-- hb_unicode_combining_class_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' id='type-id-159'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-99'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-72'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33'/>
      <!-- enum hb_unicode_combining_class_t -->
      <return type-id='type-id-95'/>
    </function-type>
    <!-- hb_unicode_general_category_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' id='type-id-160'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-99'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-72'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33'/>
      <!-- enum hb_unicode_general_category_t -->
      <return type-id='type-id-111'/>
    </function-type>
    <!-- hb_bool_t (hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t*, hb_codepoint_t*, void*) -->
    <function-type size-in-bits='64' id='type-id-166'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-99'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-72'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='type-id-163'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='type-id-163'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-28'/>
    </function-type>
    <!-- hb_bool_t (hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t, hb_codepoint_t*, void*) -->
    <function-type size-in-bits='64' id='type-id-167'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-99'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-72'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-72'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='type-id-163'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-28'/>
    </function-type>
    <!-- hb_codepoint_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' id='type-id-168'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-99'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-72'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33'/>
      <!-- typedef hb_codepoint_t -->
      <return type-id='type-id-72'/>
    </function-type>
    <!-- unsigned int (hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t*, void*) -->
    <function-type size-in-bits='64' id='type-id-169'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-99'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-72'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='type-id-163'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33'/>
      <!-- unsigned int -->
      <return type-id='type-id-12'/>
    </function-type>
    <!-- unsigned int (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' id='type-id-170'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-99'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-72'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33'/>
      <!-- unsigned int -->
      <return type-id='type-id-12'/>
    </function-type>
    <!-- hb_face_t* -->
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-144'/>
    <!-- hb_font_funcs_t* -->
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-145'/>
    <!-- typedef hb_face_t hb_face_t -->
    <typedef-decl name='hb_face_t' type-id='type-id-174' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='44' column='1' id='type-id-172'/>
    <!-- typedef hb_font_funcs_t hb_font_funcs_t -->
    <typedef-decl name='hb_font_funcs_t' type-id='type-id-175' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='47' column='1' id='type-id-173'/>
    <!-- struct hb_face_t -->
    <class-decl name='hb_face_t' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='43' column='1' id='type-id-174'>
      <member-type access='public'>
        <!-- struct hb_face_t::plan_node_t -->
        <class-decl name='plan_node_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='59' column='1' id='type-id-176'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_shape_plan_t* hb_face_t::plan_node_t::shape_plan -->
            <var-decl name='shape_plan' type-id='type-id-177' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='60' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_face_t::plan_node_t* hb_face_t::plan_node_t::next -->
            <var-decl name='next' type-id='type-id-178' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='61' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_face_t::header -->
        <var-decl name='header' type-id='type-id-15' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_face_t::immutable -->
        <var-decl name='immutable' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_reference_table_func_t hb_face_t::reference_table_func -->
        <var-decl name='reference_table_func' type-id='type-id-179' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- void* hb_face_t::user_data -->
        <var-decl name='user_data' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- hb_destroy_func_t hb_face_t::destroy -->
        <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- unsigned int hb_face_t::index -->
        <var-decl name='index' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <!-- unsigned int hb_face_t::upem -->
        <var-decl name='upem' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- unsigned int hb_face_t::num_glyphs -->
        <var-decl name='num_glyphs' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- hb_shaper_data_t hb_face_t::shaper_data -->
        <var-decl name='shaper_data' type-id='type-id-146' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- hb_face_t::plan_node_t* hb_face_t::shape_plans -->
        <var-decl name='shape_plans' type-id='type-id-178' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='62' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_font_funcs_t -->
    <class-decl name='hb_font_funcs_t' size-in-bits='3072' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='58' column='1' id='type-id-175'>
      <member-type access='public'>
        <!-- struct {hb_font_get_glyph_func_t glyph; hb_font_get_glyph_h_advance_func_t glyph_h_advance; hb_font_get_glyph_v_advance_func_t glyph_v_advance; hb_font_get_glyph_h_origin_func_t glyph_h_origin; hb_font_get_glyph_v_origin_func_t glyph_v_origin; hb_font_get_glyph_h_kerning_func_t glyph_h_kerning; hb_font_get_glyph_v_kerning_func_t glyph_v_kerning; hb_font_get_glyph_extents_func_t glyph_extents; hb_font_get_glyph_contour_point_func_t glyph_contour_point; hb_font_get_glyph_name_func_t glyph_name; hb_font_get_glyph_from_name_func_t glyph_from_name;} -->
        <class-decl name='__anonymous_struct__' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='66' column='1' id='type-id-180'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_font_get_glyph_func_t glyph -->
            <var-decl name='glyph' type-id='type-id-181' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_font_get_glyph_h_advance_func_t glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='type-id-182' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_font_get_glyph_v_advance_func_t glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='type-id-183' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_font_get_glyph_h_origin_func_t glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='type-id-184' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_font_get_glyph_v_origin_func_t glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='type-id-185' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_font_get_glyph_h_kerning_func_t glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='type-id-186' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_font_get_glyph_v_kerning_func_t glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='type-id-187' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_font_get_glyph_extents_func_t glyph_extents -->
            <var-decl name='glyph_extents' type-id='type-id-188' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- hb_font_get_glyph_contour_point_func_t glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='type-id-189' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- hb_font_get_glyph_name_func_t glyph_name -->
            <var-decl name='glyph_name' type-id='type-id-190' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- hb_font_get_glyph_from_name_func_t glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='type-id-191' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {void* glyph; void* glyph_h_advance; void* glyph_v_advance; void* glyph_h_origin; void* glyph_v_origin; void* glyph_h_kerning; void* glyph_v_kerning; void* glyph_extents; void* glyph_contour_point; void* glyph_name; void* glyph_from_name;} -->
        <class-decl name='__anonymous_struct__1' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='72' column='1' id='type-id-192'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- void* glyph -->
            <var-decl name='glyph' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- void* glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- void* glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- void* glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- void* glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- void* glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- void* glyph_extents -->
            <var-decl name='glyph_extents' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- void* glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- void* glyph_name -->
            <var-decl name='glyph_name' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- void* glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {hb_destroy_func_t glyph; hb_destroy_func_t glyph_h_advance; hb_destroy_func_t glyph_v_advance; hb_destroy_func_t glyph_h_origin; hb_destroy_func_t glyph_v_origin; hb_destroy_func_t glyph_h_kerning; hb_destroy_func_t glyph_v_kerning; hb_destroy_func_t glyph_extents; hb_destroy_func_t glyph_contour_point; hb_destroy_func_t glyph_name; hb_destroy_func_t glyph_from_name;} -->
        <class-decl name='__anonymous_struct__2' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='78' column='1' id='type-id-193'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_destroy_func_t glyph -->
            <var-decl name='glyph' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_destroy_func_t glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_destroy_func_t glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_destroy_func_t glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_destroy_func_t glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_destroy_func_t glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_destroy_func_t glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_destroy_func_t glyph_extents -->
            <var-decl name='glyph_extents' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- hb_destroy_func_t glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- hb_destroy_func_t glyph_name -->
            <var-decl name='glyph_name' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- hb_destroy_func_t glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_font_funcs_t::header -->
        <var-decl name='header' type-id='type-id-15' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_font_funcs_t::immutable -->
        <var-decl name='immutable' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- struct {hb_font_get_glyph_func_t glyph; hb_font_get_glyph_h_advance_func_t glyph_h_advance; hb_font_get_glyph_v_advance_func_t glyph_v_advance; hb_font_get_glyph_h_origin_func_t glyph_h_origin; hb_font_get_glyph_v_origin_func_t glyph_v_origin; hb_font_get_glyph_h_kerning_func_t glyph_h_kerning; hb_font_get_glyph_v_kerning_func_t glyph_v_kerning; hb_font_get_glyph_extents_func_t glyph_extents; hb_font_get_glyph_contour_point_func_t glyph_contour_point; hb_font_get_glyph_name_func_t glyph_name; hb_font_get_glyph_from_name_func_t glyph_from_name;} hb_font_funcs_t::get -->
        <var-decl name='get' type-id='type-id-180' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <!-- struct {void* glyph; void* glyph_h_advance; void* glyph_v_advance; void* glyph_h_origin; void* glyph_v_origin; void* glyph_h_kerning; void* glyph_v_kerning; void* glyph_extents; void* glyph_contour_point; void* glyph_name; void* glyph_from_name;} hb_font_funcs_t::user_data -->
        <var-decl name='user_data' type-id='type-id-192' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <!-- struct {hb_destroy_func_t glyph; hb_destroy_func_t glyph_h_advance; hb_destroy_func_t glyph_v_advance; hb_destroy_func_t glyph_h_origin; hb_destroy_func_t glyph_v_origin; hb_destroy_func_t glyph_h_kerning; hb_destroy_func_t glyph_v_kerning; hb_destroy_func_t glyph_extents; hb_destroy_func_t glyph_contour_point; hb_destroy_func_t glyph_name; hb_destroy_func_t glyph_from_name;} hb_font_funcs_t::destroy -->
        <var-decl name='destroy' type-id='type-id-193' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='82' column='1'/>
      </data-member>
    </class-decl>
    <!-- hb_face_t::plan_node_t* -->
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-178'/>
    <!-- hb_shape_plan_t* -->
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-177'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, unsigned int, hb_position_t*, hb_position_t*, void*)* hb_font_get_glyph_contour_point_func_t -->
    <typedef-decl name='hb_font_get_glyph_contour_point_func_t' type-id='type-id-195' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='127' column='1' id='type-id-189'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, hb_glyph_extents_t*, void*)* hb_font_get_glyph_extents_func_t -->
    <typedef-decl name='hb_font_get_glyph_extents_func_t' type-id='type-id-196' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='123' column='1' id='type-id-188'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, const char*, int, hb_codepoint_t*, void*)* hb_font_get_glyph_from_name_func_t -->
    <typedef-decl name='hb_font_get_glyph_from_name_func_t' type-id='type-id-197' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='137' column='1' id='type-id-191'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, typedef hb_codepoint_t, hb_codepoint_t*, void*)* hb_font_get_glyph_func_t -->
    <typedef-decl name='hb_font_get_glyph_func_t' type-id='type-id-198' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='97' column='1' id='type-id-181'/>
    <!-- typedef hb_font_get_glyph_advance_func_t hb_font_get_glyph_h_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_advance_func_t' type-id='type-id-199' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='103' column='1' id='type-id-182'/>
    <!-- typedef hb_font_get_glyph_kerning_func_t hb_font_get_glyph_h_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_kerning_func_t' type-id='type-id-200' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='116' column='1' id='type-id-186'/>
    <!-- typedef hb_font_get_glyph_origin_func_t hb_font_get_glyph_h_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_origin_func_t' type-id='type-id-201' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='110' column='1' id='type-id-184'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, char*, unsigned int, void*)* hb_font_get_glyph_name_func_t -->
    <typedef-decl name='hb_font_get_glyph_name_func_t' type-id='type-id-202' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='133' column='1' id='type-id-190'/>
    <!-- typedef hb_font_get_glyph_advance_func_t hb_font_get_glyph_v_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_advance_func_t' type-id='type-id-199' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='104' column='1' id='type-id-183'/>
    <!-- typedef hb_font_get_glyph_kerning_func_t hb_font_get_glyph_v_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_kerning_func_t' type-id='type-id-200' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='117' column='1' id='type-id-187'/>
    <!-- typedef hb_font_get_glyph_origin_func_t hb_font_get_glyph_v_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_origin_func_t' type-id='type-id-201' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='111' column='1' id='type-id-185'/>
    <!-- typedef hb_blob_t* (hb_face_t*, typedef hb_tag_t, void*)* hb_reference_table_func_t -->
    <typedef-decl name='hb_reference_table_func_t' type-id='type-id-203' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='50' column='1' id='type-id-179'/>
    <!-- hb_blob_t* (hb_face_t*, typedef hb_tag_t, void*)* -->
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-203'/>
    <!-- typedef hb_bool_t (hb_font_t*, void*, const char*, int, hb_codepoint_t*, void*)* -->
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-197'/>
    <!-- typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, char*, unsigned int, void*)* -->
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-202'/>
    <!-- typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, hb_glyph_extents_t*, void*)* -->
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-196'/>
    <!-- typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, typedef hb_codepoint_t, hb_codepoint_t*, void*)* -->
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-198'/>
    <!-- typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, unsigned int, hb_position_t*, hb_position_t*, void*)* -->
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-195'/>
    <!-- typedef typedef hb_position_t (hb_font_t*, void*, typedef hb_codepoint_t, void*)* hb_font_get_glyph_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_advance_func_t' type-id='type-id-210' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='102' column='1' id='type-id-199'/>
    <!-- typedef typedef hb_position_t (hb_font_t*, void*, typedef hb_codepoint_t, typedef hb_codepoint_t, void*)* hb_font_get_glyph_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_kerning_func_t' type-id='type-id-211' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='115' column='1' id='type-id-200'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, hb_position_t*, hb_position_t*, void*)* hb_font_get_glyph_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_origin_func_t' type-id='type-id-212' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='109' column='1' id='type-id-201'/>
    <!-- typedef hb_shape_plan_t hb_shape_plan_t -->
    <typedef-decl name='hb_shape_plan_t' type-id='type-id-213' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan.h' line='39' column='1' id='type-id-194'/>
    <!-- struct hb_shape_plan_t -->
    <class-decl name='hb_shape_plan_t' size-in-bits='1664' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='36' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_shape_plan_t::header -->
        <var-decl name='header' type-id='type-id-15' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_shape_plan_t::default_shaper_list -->
        <var-decl name='default_shaper_list' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_face_t* hb_shape_plan_t::face_unsafe -->
        <var-decl name='face_unsafe' type-id='type-id-144' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- hb_segment_properties_t hb_shape_plan_t::props -->
        <var-decl name='props' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- hb_shape_func_t* hb_shape_plan_t::shaper_func -->
        <var-decl name='shaper_func' type-id='type-id-214' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- const char* hb_shape_plan_t::shaper_name -->
        <var-decl name='shaper_name' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- hb_feature_t* hb_shape_plan_t::user_features -->
        <var-decl name='user_features' type-id='type-id-215' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <!-- unsigned int hb_shape_plan_t::num_user_features -->
        <var-decl name='num_user_features' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- hb_shaper_data_t hb_shape_plan_t::shaper_data -->
        <var-decl name='shaper_data' type-id='type-id-146' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='50' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, hb_position_t*, hb_position_t*, void*)* -->
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-212'/>
    <!-- typedef hb_position_t (hb_font_t*, void*, typedef hb_codepoint_t, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-211'/>
    <!-- typedef hb_position_t (hb_font_t*, void*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-210'/>
    <!-- hb_feature_t* -->
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-215'/>
    <!-- hb_shape_func_t* -->
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-214'/>
    <!-- typedef hb_feature_t hb_feature_t -->
    <typedef-decl name='hb_feature_t' type-id='type-id-221' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='48' column='1' id='type-id-219'/>
    <!-- typedef typedef hb_bool_t (hb_shape_plan_t*, hb_font_t*, hb_buffer_t*, const hb_feature_t*, unsigned int) hb_shape_func_t -->
    <typedef-decl name='hb_shape_func_t' type-id='type-id-222' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='36' column='1' id='type-id-220'/>
    <!-- struct hb_feature_t -->
    <class-decl name='hb_feature_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='43' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_tag_t hb_feature_t::tag -->
        <var-decl name='tag' type-id='type-id-223' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t hb_feature_t::value -->
        <var-decl name='value' type-id='type-id-106' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned int hb_feature_t::start -->
        <var-decl name='start' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- unsigned int hb_feature_t::end -->
        <var-decl name='end' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef uint32_t hb_tag_t -->
    <typedef-decl name='hb_tag_t' type-id='type-id-106' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='91' column='1' id='type-id-223'/>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- struct hb_utf_t<unsigned int, true> -->
    <class-decl name='hb_utf_t&lt;unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='32' column='1' id='type-id-224'/>
    <!-- struct hb_utf_t<short unsigned int, true> -->
    <class-decl name='hb_utf_t&lt;short unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='138' column='1' id='type-id-225'/>
    <!-- struct hb_utf_t<unsigned char, true> -->
    <class-decl name='hb_utf_t&lt;unsigned char, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='39' column='1' id='type-id-226'/>
    <!-- const hb_glyph_info_t& -->
    <qualified-type-def type-id='type-id-154' id='type-id-227'/>
    <!-- const hb_segment_properties_t -->
    <qualified-type-def type-id='type-id-102' const='yes' id='type-id-228'/>
    <!-- const hb_segment_properties_t* -->
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-229'/>
    <!-- const uint16_t -->
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-230'/>
    <!-- const uint16_t* -->
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-231'/>
    <!-- const uint32_t -->
    <qualified-type-def type-id='type-id-106' const='yes' id='type-id-232'/>
    <!-- const uint32_t* -->
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-233'/>
    <!-- const uint8_t -->
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-234'/>
    <!-- const uint8_t* -->
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-235'/>
    <!-- hb_buffer_t* const -->
    <qualified-type-def type-id='type-id-161' const='yes' id='type-id-236'/>
    <!-- hb_segment_properties_t* -->
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-237'/>
    <!-- hb_unicode_funcs_t* const -->
    <qualified-type-def type-id='type-id-99' const='yes' id='type-id-238'/>
    <!-- hb_bool_t hb_segment_properties_equal(const hb_segment_properties_t*, const hb_segment_properties_t*) -->
    <function-decl name='hb_segment_properties_equal' mangled-name='hb_segment_properties_equal' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_equal'>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='type-id-229' name='a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1'/>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='type-id-229' name='b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='41' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- unsigned int hb_segment_properties_hash(const hb_segment_properties_t*) -->
    <function-decl name='hb_segment_properties_hash' mangled-name='hb_segment_properties_hash' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_hash'>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='type-id-229' name='p' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1'/>
      <!-- unsigned int -->
      <return type-id='type-id-12'/>
    </function-decl>
    <!-- hb_buffer_t* hb_buffer_get_empty() -->
    <function-decl name='hb_buffer_get_empty' mangled-name='hb_buffer_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_empty'>
      <!-- hb_buffer_t* -->
      <return type-id='type-id-161'/>
    </function-decl>
    <!-- void hb_buffer_set_content_type(hb_buffer_t*, hb_buffer_content_type_t) -->
    <function-decl name='hb_buffer_set_content_type' mangled-name='hb_buffer_set_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_content_type'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1'/>
      <!-- parameter of type 'enum hb_buffer_content_type_t' -->
      <parameter type-id='type-id-101' name='content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='811' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- hb_buffer_content_type_t hb_buffer_get_content_type(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_content_type' mangled-name='hb_buffer_get_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_content_type'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1'/>
      <!-- enum hb_buffer_content_type_t -->
      <return type-id='type-id-101'/>
    </function-decl>
    <!-- hb_unicode_funcs_t* hb_buffer_get_unicode_funcs(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_unicode_funcs' mangled-name='hb_buffer_get_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_unicode_funcs'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1'/>
      <!-- hb_unicode_funcs_t* -->
      <return type-id='type-id-99'/>
    </function-decl>
    <!-- hb_direction_t hb_buffer_get_direction(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_direction' mangled-name='hb_buffer_get_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_direction'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1'/>
      <!-- enum hb_direction_t -->
      <return type-id='type-id-129'/>
    </function-decl>
    <!-- hb_script_t hb_buffer_get_script(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_script' mangled-name='hb_buffer_get_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_script'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1'/>
      <!-- enum hb_script_t -->
      <return type-id='type-id-116'/>
    </function-decl>
    <!-- hb_language_t hb_buffer_get_language(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_language' mangled-name='hb_buffer_get_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_language'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1'/>
      <!-- typedef hb_language_t -->
      <return type-id='type-id-131'/>
    </function-decl>
    <!-- void hb_buffer_get_segment_properties(hb_buffer_t*, hb_segment_properties_t*) -->
    <function-decl name='hb_buffer_get_segment_properties' mangled-name='hb_buffer_get_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_segment_properties'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1'/>
      <!-- parameter of type 'hb_segment_properties_t*' -->
      <parameter type-id='type-id-237' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1010' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- hb_buffer_flags_t hb_buffer_get_flags(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_flags' mangled-name='hb_buffer_get_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_flags'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1'/>
      <!-- enum hb_buffer_flags_t -->
      <return type-id='type-id-100'/>
    </function-decl>
    <!-- hb_codepoint_t hb_buffer_get_replacement_codepoint(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_replacement_codepoint' mangled-name='hb_buffer_get_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_replacement_codepoint'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1'/>
      <!-- typedef hb_codepoint_t -->
      <return type-id='type-id-72'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_allocation_successful(hb_buffer_t*) -->
    <function-decl name='hb_buffer_allocation_successful' mangled-name='hb_buffer_allocation_successful' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_allocation_successful'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- unsigned int hb_buffer_get_length(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_length' mangled-name='hb_buffer_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_length'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1'/>
      <!-- unsigned int -->
      <return type-id='type-id-12'/>
    </function-decl>
    <!-- hb_glyph_info_t* hb_buffer_get_glyph_infos(hb_buffer_t*, unsigned int*) -->
    <function-decl name='hb_buffer_get_glyph_infos' mangled-name='hb_buffer_get_glyph_infos' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_infos'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-68' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1238' column='1'/>
      <!-- hb_glyph_info_t* -->
      <return type-id='type-id-103'/>
    </function-decl>
    <!-- void hb_buffer_set_replacement_codepoint(hb_buffer_t*, hb_codepoint_t) -->
    <function-decl name='hb_buffer_set_replacement_codepoint' mangled-name='hb_buffer_set_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_replacement_codepoint'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-72' name='replacement' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1063' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_set_flags(hb_buffer_t*, hb_buffer_flags_t) -->
    <function-decl name='hb_buffer_set_flags' mangled-name='hb_buffer_set_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_flags'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1'/>
      <!-- parameter of type 'enum hb_buffer_flags_t' -->
      <parameter type-id='type-id-100' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1027' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_set_segment_properties(hb_buffer_t*, const hb_segment_properties_t*) -->
    <function-decl name='hb_buffer_set_segment_properties' mangled-name='hb_buffer_set_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_segment_properties'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1'/>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='type-id-229' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='991' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_set_language(hb_buffer_t*, hb_language_t) -->
    <function-decl name='hb_buffer_set_language' mangled-name='hb_buffer_set_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_language'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1'/>
      <!-- parameter of type 'typedef hb_language_t' -->
      <parameter type-id='type-id-131' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='956' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_set_script(hb_buffer_t*, hb_script_t) -->
    <function-decl name='hb_buffer_set_script' mangled-name='hb_buffer_set_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_script'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1'/>
      <!-- parameter of type 'enum hb_script_t' -->
      <parameter type-id='type-id-116' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='921' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_set_direction(hb_buffer_t*, hb_direction_t) -->
    <function-decl name='hb_buffer_set_direction' mangled-name='hb_buffer_set_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_direction'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1'/>
      <!-- parameter of type 'enum hb_direction_t' -->
      <parameter type-id='type-id-129' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='885' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_reverse(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reverse' mangled-name='hb_buffer_reverse' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_reverse_clusters(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reverse_clusters' mangled-name='hb_buffer_reverse_clusters' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse_clusters'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- hb_glyph_position_t* hb_buffer_get_glyph_positions(hb_buffer_t*, unsigned int*) -->
    <function-decl name='hb_buffer_get_glyph_positions' mangled-name='hb_buffer_get_glyph_positions' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_positions'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-68' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1260' column='1'/>
      <!-- hb_glyph_position_t* -->
      <return type-id='type-id-104'/>
    </function-decl>
    <!-- void hb_buffer_clear_contents(hb_buffer_t*) -->
    <function-decl name='hb_buffer_clear_contents' mangled-name='hb_buffer_clear_contents' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_clear_contents'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_set_unicode_funcs(hb_buffer_t*, hb_unicode_funcs_t*) -->
    <function-decl name='hb_buffer_set_unicode_funcs' mangled-name='hb_buffer_set_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_unicode_funcs'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1'/>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-99' name='unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='844' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_reset(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reset' mangled-name='hb_buffer_reset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reset'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void* hb_buffer_get_user_data(hb_buffer_t*, hb_user_data_key_t*) -->
    <function-decl name='hb_buffer_get_user_data' mangled-name='hb_buffer_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_user_data'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-37' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='794' column='1'/>
      <!-- void* -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_set_user_data(hb_buffer_t*, hb_user_data_key_t*, void*, hb_destroy_func_t, hb_bool_t) -->
    <function-decl name='hb_buffer_set_user_data' mangled-name='hb_buffer_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_user_data'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-37' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='773' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-33' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='774' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='type-id-21' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='775' column='1'/>
      <!-- parameter of type 'typedef hb_bool_t' -->
      <parameter type-id='type-id-28' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='776' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- hb_buffer_t* hb_buffer_reference(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reference' mangled-name='hb_buffer_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reference'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1'/>
      <!-- hb_buffer_t* -->
      <return type-id='type-id-161'/>
    </function-decl>
    <!-- void hb_buffer_destroy(hb_buffer_t*) -->
    <function-decl name='hb_buffer_destroy' mangled-name='hb_buffer_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_destroy'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- hb_buffer_t* hb_buffer_create() -->
    <function-decl name='hb_buffer_create' mangled-name='hb_buffer_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_create'>
      <!-- hb_buffer_t* -->
      <return type-id='type-id-161'/>
    </function-decl>
    <!-- void hb_buffer_guess_segment_properties(hb_buffer_t*) -->
    <function-decl name='hb_buffer_guess_segment_properties' mangled-name='hb_buffer_guess_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_guess_segment_properties'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_pre_allocate(hb_buffer_t*, unsigned int) -->
    <function-decl name='hb_buffer_pre_allocate' mangled-name='hb_buffer_pre_allocate' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_pre_allocate'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- void hb_buffer_add(hb_buffer_t*, hb_codepoint_t, unsigned int) -->
    <function-decl name='hb_buffer_add' mangled-name='hb_buffer_add' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-72' name='codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1161' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='cluster' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1162' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_add_codepoints(hb_buffer_t*, const hb_codepoint_t*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_codepoints' mangled-name='hb_buffer_add_codepoints' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_codepoints'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1'/>
      <!-- parameter of type 'const hb_codepoint_t*' -->
      <parameter type-id='type-id-152' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1480' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1481' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1482' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1483' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_add_utf32(hb_buffer_t*, const uint32_t*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_utf32' mangled-name='hb_buffer_add_utf32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf32'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1'/>
      <!-- parameter of type 'const uint32_t*' -->
      <parameter type-id='type-id-233' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1458' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1459' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1460' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1461' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_add_utf16(hb_buffer_t*, const uint16_t*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_utf16' mangled-name='hb_buffer_add_utf16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf16'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1'/>
      <!-- parameter of type 'const uint16_t*' -->
      <parameter type-id='type-id-231' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1436' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1437' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1438' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1439' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_set_length(hb_buffer_t*, unsigned int) -->
    <function-decl name='hb_buffer_set_length' mangled-name='hb_buffer_set_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_length'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- void hb_buffer_add_utf8(hb_buffer_t*, const char*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_utf8' mangled-name='hb_buffer_add_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf8'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-31' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1414' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1415' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1416' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1417' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- void hb_buffer_normalize_glyphs(hb_buffer_t*) -->
    <function-decl name='hb_buffer_normalize_glyphs' mangled-name='hb_buffer_normalize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_normalize_glyphs'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-161' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- char[1] -->
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='8' id='type-id-239'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='type-id-4' id='type-id-171'/>
    </array-type-def>
    <!-- const char[1] -->
    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='8' id='type-id-127'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='type-id-4' id='type-id-171'/>
    </array-type-def>
    <!-- struct hb_language_item_t -->
    <class-decl name='hb_language_item_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='212' column='1' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_language_item_t* hb_language_item_t::next -->
        <var-decl name='next' type-id='type-id-241' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_language_t hb_language_item_t::lang -->
        <var-decl name='lang' type-id='type-id-131' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='215' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef uint32_t hb_tag_t -->
    <typedef-decl name='hb_tag_t' type-id='type-id-106' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='91' column='1' id='type-id-223'/>
    <!-- const hb_language_item_t -->
    <qualified-type-def type-id='type-id-240' const='yes' id='type-id-242'/>
    <!-- const hb_language_item_t* -->
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-243'/>
    <!-- const hb_language_item_t* const -->
    <qualified-type-def type-id='type-id-243' const='yes' id='type-id-244'/>
    <!-- const hb_user_data_array_t::hb_user_data_item_t* const -->
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-245'/>
    <!-- hb_language_item_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-240' size-in-bits='64' id='type-id-246'/>
    <!-- hb_language_item_t* -->
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-241'/>
    <!-- hb_language_item_t* const -->
    <qualified-type-def type-id='type-id-241' const='yes' id='type-id-247'/>
    <!-- hb_user_data_array_t::hb_user_data_item_t& -->
    <qualified-type-def type-id='type-id-66' id='type-id-248'/>
    <!-- hb_tag_t hb_tag_from_string(const char*, int) -->
    <function-decl name='hb_tag_from_string' mangled-name='hb_tag_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-31' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <!-- typedef hb_tag_t -->
      <return type-id='type-id-223'/>
    </function-decl>
    <!-- void hb_tag_to_string(hb_tag_t, char*) -->
    <function-decl name='hb_tag_to_string' mangled-name='hb_tag_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_to_string'>
      <!-- parameter of type 'typedef hb_tag_t' -->
      <parameter type-id='type-id-223' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-42' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- const char* hb_language_to_string(hb_language_t) -->
    <function-decl name='hb_language_to_string' mangled-name='hb_language_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_to_string'>
      <!-- parameter of type 'typedef hb_language_t' -->
      <parameter type-id='type-id-131' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- hb_tag_t hb_script_to_iso15924_tag(hb_script_t) -->
    <function-decl name='hb_script_to_iso15924_tag' mangled-name='hb_script_to_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_to_iso15924_tag'>
      <!-- parameter of type 'enum hb_script_t' -->
      <parameter type-id='type-id-116' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1'/>
      <!-- typedef hb_tag_t -->
      <return type-id='type-id-223'/>
    </function-decl>
    <!-- hb_direction_t hb_script_get_horizontal_direction(hb_script_t) -->
    <function-decl name='hb_script_get_horizontal_direction' mangled-name='hb_script_get_horizontal_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_get_horizontal_direction'>
      <!-- parameter of type 'enum hb_script_t' -->
      <parameter type-id='type-id-116' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1'/>
      <!-- enum hb_direction_t -->
      <return type-id='type-id-129'/>
    </function-decl>
    <!-- void hb_version(unsigned int*, unsigned int*, unsigned int*) -->
    <function-decl name='hb_version' mangled-name='hb_version' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version'>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-68' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-68' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='548' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-68' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='549' column='1'/>
      <!-- void -->
      <return type-id='type-id-13'/>
    </function-decl>
    <!-- const char* hb_version_string() -->
    <function-decl name='hb_version_string' mangled-name='hb_version_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_string'>
      <!-- const char* -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- hb_bool_t hb_version_atleast(unsigned int, unsigned int, unsigned int) -->
    <function-decl name='hb_version_atleast' mangled-name='hb_version_atleast' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_atleast'>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='585' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-12' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='586' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- hb_script_t hb_script_from_iso15924_tag(hb_tag_t) -->
    <function-decl name='hb_script_from_iso15924_tag' mangled-name='hb_script_from_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_iso15924_tag'>
      <!-- parameter of type 'typedef hb_tag_t' -->
      <parameter type-id='type-id-223' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1'/>
      <!-- enum hb_script_t -->
      <return type-id='type-id-116'/>
    </function-decl>
    <!-- hb_script_t hb_script_from_string(const char*, int) -->
    <function-decl name='hb_script_from_string' mangled-name='hb_script_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-31' name='s' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <!-- enum hb_script_t -->
      <return type-id='type-id-116'/>
    </function-decl>
    <!-- const char* hb_direction_to_string(hb_direction_t) -->
    <function-decl name='hb_direction_to_string' mangled-name='hb_direction_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_to_string'>
      <!-- parameter of type 'enum hb_direction_t' -->
      <parameter type-id='type-id-129' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- hb_direction_t hb_direction_from_string(const char*, int) -->
    <function-decl name='hb_direction_from_string' mangled-name='hb_direction_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-31' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <!-- enum hb_direction_t -->
      <return type-id='type-id-129'/>
    </function-decl>
    <!-- hb_language_t hb_language_from_string(const char*, int) -->
    <function-decl name='hb_language_from_string' mangled-name='hb_language_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-31' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <!-- typedef hb_language_t -->
      <return type-id='type-id-131'/>
    </function-decl>
    <!-- hb_language_t hb_language_get_default() -->
    <function-decl name='hb_language_get_default' mangled-name='hb_language_get_default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_get_default'>
      <!-- typedef hb_language_t -->
      <return type-id='type-id-131'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-face.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >[1] -->
    <array-type-def dimensions='1' type-id='type-id-249' size-in-bits='32' id='type-id-250'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='type-id-4' id='type-id-171'/>
    </array-type-def>
    <!-- TableRecord[1] -->
    <array-type-def dimensions='1' type-id='type-id-251' size-in-bits='128' id='type-id-252'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='type-id-4' id='type-id-171'/>
    </array-type-def>
    <!-- uint8_t[2] -->
    <array-type-def dimensions='1' type-id='type-id-84' size-in-bits='16' id='type-id-253'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <!-- variadic parameter type -->
    <type-decl name='variadic parameter type' id='type-id-254'/>
    <!-- struct hb_glyph_extents_t -->
    <class-decl name='hb_glyph_extents_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='84' column='1' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_position_t hb_glyph_extents_t::x_bearing -->
        <var-decl name='x_bearing' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_position_t hb_glyph_extents_t::y_bearing -->
        <var-decl name='y_bearing' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_position_t hb_glyph_extents_t::width -->
        <var-decl name='width' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- hb_position_t hb_glyph_extents_t::height -->
        <var-decl name='height' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_font_funcs_t -->
    <class-decl name='hb_font_funcs_t' size-in-bits='3072' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='58' column='1' id='type-id-175'>
      <member-type access='public'>
        <!-- struct {hb_font_get_glyph_func_t glyph; hb_font_get_glyph_h_advance_func_t glyph_h_advance; hb_font_get_glyph_v_advance_func_t glyph_v_advance; hb_font_get_glyph_h_origin_func_t glyph_h_origin; hb_font_get_glyph_v_origin_func_t glyph_v_origin; hb_font_get_glyph_h_kerning_func_t glyph_h_kerning; hb_font_get_glyph_v_kerning_func_t glyph_v_kerning; hb_font_get_glyph_extents_func_t glyph_extents; hb_font_get_glyph_contour_point_func_t glyph_contour_point; hb_font_get_glyph_name_func_t glyph_name; hb_font_get_glyph_from_name_func_t glyph_from_name;} -->
        <class-decl name='__anonymous_struct__' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='66' column='1' id='type-id-180'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_font_get_glyph_func_t glyph -->
            <var-decl name='glyph' type-id='type-id-181' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_font_get_glyph_h_advance_func_t glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='type-id-182' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_font_get_glyph_v_advance_func_t glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='type-id-183' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_font_get_glyph_h_origin_func_t glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='type-id-184' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_font_get_glyph_v_origin_func_t glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='type-id-185' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_font_get_glyph_h_kerning_func_t glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='type-id-186' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_font_get_glyph_v_kerning_func_t glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='type-id-187' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_font_get_glyph_extents_func_t glyph_extents -->
            <var-decl name='glyph_extents' type-id='type-id-188' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- hb_font_get_glyph_contour_point_func_t glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='type-id-189' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- hb_font_get_glyph_name_func_t glyph_name -->
            <var-decl name='glyph_name' type-id='type-id-190' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- hb_font_get_glyph_from_name_func_t glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='type-id-191' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {void* glyph; void* glyph_h_advance; void* glyph_v_advance; void* glyph_h_origin; void* glyph_v_origin; void* glyph_h_kerning; void* glyph_v_kerning; void* glyph_extents; void* glyph_contour_point; void* glyph_name; void* glyph_from_name;} -->
        <class-decl name='__anonymous_struct__1' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='72' column='1' id='type-id-192'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- void* glyph -->
            <var-decl name='glyph' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- void* glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- void* glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- void* glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- void* glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- void* glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- void* glyph_extents -->
            <var-decl name='glyph_extents' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- void* glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- void* glyph_name -->
            <var-decl name='glyph_name' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- void* glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {hb_destroy_func_t glyph; hb_destroy_func_t glyph_h_advance; hb_destroy_func_t glyph_v_advance; hb_destroy_func_t glyph_h_origin; hb_destroy_func_t glyph_v_origin; hb_destroy_func_t glyph_h_kerning; hb_destroy_func_t glyph_v_kerning; hb_destroy_func_t glyph_extents; hb_destroy_func_t glyph_contour_point; hb_destroy_func_t glyph_name; hb_destroy_func_t glyph_from_name;} -->
        <class-decl name='__anonymous_struct__2' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='78' column='1' id='type-id-193'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_destroy_func_t glyph -->
            <var-decl name='glyph' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_destroy_func_t glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_destroy_func_t glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_destroy_func_t glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_destroy_func_t glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_destroy_func_t glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_destroy_func_t glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_destroy_func_t glyph_extents -->
            <var-decl name='glyph_extents' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- hb_destroy_func_t glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- hb_destroy_func_t glyph_name -->
            <var-decl name='glyph_name' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- hb_destroy_func_t glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_font_funcs_t::header -->
        <var-decl name='header' type-id='type-id-15' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_font_funcs_t::immutable -->
        <var-decl name='immutable' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- struct {hb_font_get_glyph_func_t glyph; hb_font_get_glyph_h_advance_func_t glyph_h_advance; hb_font_get_glyph_v_advance_func_t glyph_v_advance; hb_font_get_glyph_h_origin_func_t glyph_h_origin; hb_font_get_glyph_v_origin_func_t glyph_v_origin; hb_font_get_glyph_h_kerning_func_t glyph_h_kerning; hb_font_get_glyph_v_kerning_func_t glyph_v_kerning; hb_font_get_glyph_extents_func_t glyph_extents; hb_font_get_glyph_contour_point_func_t glyph_contour_point; hb_font_get_glyph_name_func_t glyph_name; hb_font_get_glyph_from_name_func_t glyph_from_name;} hb_font_funcs_t::get -->
        <var-decl name='get' type-id='type-id-180' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <!-- struct {void* glyph; void* glyph_h_advance; void* glyph_v_advance; void* glyph_h_origin; void* glyph_v_origin; void* glyph_h_kerning; void* glyph_v_kerning; void* glyph_extents; void* glyph_contour_point; void* glyph_name; void* glyph_from_name;} hb_font_funcs_t::user_data -->
        <var-decl name='user_data' type-id='type-id-192' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <!-- struct {hb_destroy_func_t glyph; hb_destroy_func_t glyph_h_advance; hb_destroy_func_t glyph_v_advance; hb_destroy_func_t glyph_h_origin; hb_destroy_func_t glyph_v_origin; hb_destroy_func_t glyph_h_kerning; hb_destroy_func_t glyph_v_kerning; hb_destroy_func_t glyph_extents; hb_destroy_func_t glyph_contour_point; hb_destroy_func_t glyph_name; hb_destroy_func_t glyph_from_name;} hb_font_funcs_t::destroy -->
        <var-decl name='destroy' type-id='type-id-193' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='82' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_face_t -->
    <class-decl name='hb_face_t' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='43' column='1' id='type-id-174'>
      <member-type access='public'>
        <!-- struct hb_face_t::plan_node_t -->
        <class-decl name='plan_node_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='59' column='1' id='type-id-176'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_shape_plan_t* hb_face_t::plan_node_t::shape_plan -->
            <var-decl name='shape_plan' type-id='type-id-177' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='60' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_face_t::plan_node_t* hb_face_t::plan_node_t::next -->
            <var-decl name='next' type-id='type-id-178' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='61' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_face_t::header -->
        <var-decl name='header' type-id='type-id-15' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_face_t::immutable -->
        <var-decl name='immutable' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_reference_table_func_t hb_face_t::reference_table_func -->
        <var-decl name='reference_table_func' type-id='type-id-179' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- void* hb_face_t::user_data -->
        <var-decl name='user_data' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- hb_destroy_func_t hb_face_t::destroy -->
        <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- unsigned int hb_face_t::index -->
        <var-decl name='index' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <!-- unsigned int hb_face_t::upem -->
        <var-decl name='upem' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- unsigned int hb_face_t::num_glyphs -->
        <var-decl name='num_glyphs' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- hb_shaper_data_t hb_face_t::shaper_data -->
        <var-decl name='shaper_data' type-id='type-id-146' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- hb_face_t::plan_node_t* hb_face_t::shape_plans -->
        <var-decl name='shape_plans' type-id='type-id-178' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='62' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_shape_plan_t -->
    <class-decl name='hb_shape_plan_t' size-in-bits='1664' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='36' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_shape_plan_t::header -->
        <var-decl name='header' type-id='type-id-15' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_shape_plan_t::default_shaper_list -->
        <var-decl name='default_shaper_list' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_face_t* hb_shape_plan_t::face_unsafe -->
        <var-decl name='face_unsafe' type-id='type-id-144' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- hb_segment_properties_t hb_shape_plan_t::props -->
        <var-decl name='props' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- hb_shape_func_t* hb_shape_plan_t::shaper_func -->
        <var-decl name='shaper_func' type-id='type-id-214' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- const char* hb_shape_plan_t::shaper_name -->
        <var-decl name='shaper_name' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- hb_feature_t* hb_shape_plan_t::user_features -->
        <var-decl name='user_features' type-id='type-id-215' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <!-- unsigned int hb_shape_plan_t::num_user_features -->
        <var-decl name='num_user_features' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- hb_shaper_data_t hb_shape_plan_t::shaper_data -->
        <var-decl name='shaper_data' type-id='type-id-146' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='50' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_face_t hb_face_t -->
    <typedef-decl name='hb_face_t' type-id='type-id-174' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='44' column='1' id='type-id-172'/>
    <!-- typedef typedef hb_bool_t (hb_shape_plan_t*, hb_font_t*, hb_buffer_t*, const hb_feature_t*, unsigned int) hb_shape_func_t -->
    <typedef-decl name='hb_shape_func_t' type-id='type-id-222' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='36' column='1' id='type-id-220'/>
    <!-- typedef hb_shape_plan_t hb_shape_plan_t -->
    <typedef-decl name='hb_shape_plan_t' type-id='type-id-213' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan.h' line='39' column='1' id='type-id-194'/>
    <!-- typedef hb_font_funcs_t hb_font_funcs_t -->
    <typedef-decl name='hb_font_funcs_t' type-id='type-id-175' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='47' column='1' id='type-id-173'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, typedef hb_codepoint_t, hb_codepoint_t*, void*)* hb_font_get_glyph_func_t -->
    <typedef-decl name='hb_font_get_glyph_func_t' type-id='type-id-198' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='97' column='1' id='type-id-181'/>
    <!-- typedef hb_font_get_glyph_advance_func_t hb_font_get_glyph_h_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_advance_func_t' type-id='type-id-199' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='103' column='1' id='type-id-182'/>
    <!-- typedef typedef hb_position_t (hb_font_t*, void*, typedef hb_codepoint_t, void*)* hb_font_get_glyph_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_advance_func_t' type-id='type-id-210' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='102' column='1' id='type-id-199'/>
    <!-- typedef hb_font_get_glyph_advance_func_t hb_font_get_glyph_v_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_advance_func_t' type-id='type-id-199' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='104' column='1' id='type-id-183'/>
    <!-- typedef hb_font_get_glyph_origin_func_t hb_font_get_glyph_h_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_origin_func_t' type-id='type-id-201' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='110' column='1' id='type-id-184'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, hb_position_t*, hb_position_t*, void*)* hb_font_get_glyph_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_origin_func_t' type-id='type-id-212' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='109' column='1' id='type-id-201'/>
    <!-- typedef hb_font_get_glyph_origin_func_t hb_font_get_glyph_v_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_origin_func_t' type-id='type-id-201' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='111' column='1' id='type-id-185'/>
    <!-- typedef hb_font_get_glyph_kerning_func_t hb_font_get_glyph_h_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_kerning_func_t' type-id='type-id-200' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='116' column='1' id='type-id-186'/>
    <!-- typedef typedef hb_position_t (hb_font_t*, void*, typedef hb_codepoint_t, typedef hb_codepoint_t, void*)* hb_font_get_glyph_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_kerning_func_t' type-id='type-id-211' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='115' column='1' id='type-id-200'/>
    <!-- typedef hb_font_get_glyph_kerning_func_t hb_font_get_glyph_v_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_kerning_func_t' type-id='type-id-200' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='117' column='1' id='type-id-187'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, hb_glyph_extents_t*, void*)* hb_font_get_glyph_extents_func_t -->
    <typedef-decl name='hb_font_get_glyph_extents_func_t' type-id='type-id-196' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='123' column='1' id='type-id-188'/>
    <!-- typedef hb_glyph_extents_t hb_glyph_extents_t -->
    <typedef-decl name='hb_glyph_extents_t' type-id='type-id-255' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='89' column='1' id='type-id-256'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, unsigned int, hb_position_t*, hb_position_t*, void*)* hb_font_get_glyph_contour_point_func_t -->
    <typedef-decl name='hb_font_get_glyph_contour_point_func_t' type-id='type-id-195' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='127' column='1' id='type-id-189'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, char*, unsigned int, void*)* hb_font_get_glyph_name_func_t -->
    <typedef-decl name='hb_font_get_glyph_name_func_t' type-id='type-id-202' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='133' column='1' id='type-id-190'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, const char*, int, hb_codepoint_t*, void*)* hb_font_get_glyph_from_name_func_t -->
    <typedef-decl name='hb_font_get_glyph_from_name_func_t' type-id='type-id-197' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='137' column='1' id='type-id-191'/>
    <!-- struct hb_shaper_data_t -->
    <class-decl name='hb_shaper_data_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='53' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* hb_shaper_data_t::ot -->
        <var-decl name='ot' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* hb_shaper_data_t::fallback -->
        <var-decl name='fallback' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_feature_t -->
    <class-decl name='hb_feature_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='43' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_tag_t hb_feature_t::tag -->
        <var-decl name='tag' type-id='type-id-223' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t hb_feature_t::value -->
        <var-decl name='value' type-id='type-id-106' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned int hb_feature_t::start -->
        <var-decl name='start' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- unsigned int hb_feature_t::end -->
        <var-decl name='end' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_feature_t hb_feature_t -->
    <typedef-decl name='hb_feature_t' type-id='type-id-221' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='48' column='1' id='type-id-219'/>
    <!-- typedef hb_blob_t* (hb_face_t*, typedef hb_tag_t, void*)* hb_reference_table_func_t -->
    <typedef-decl name='hb_reference_table_func_t' type-id='type-id-203' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='50' column='1' id='type-id-179'/>
    <!-- struct hb_auto_trace_t<0, bool> -->
    <class-decl name='hb_auto_trace_t&lt;0, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='749' column='1' id='type-id-257'>
      <member-function access='public'>
        <!-- void hb_auto_trace_t<0, bool>::hb_auto_trace_t(unsigned int*, const char*, void*, const char*, const char*, ...) -->
        <function-decl name='hb_auto_trace_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='797' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_auto_trace_t<0, bool>*' -->
          <parameter type-id='type-id-258' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int*' -->
          <parameter type-id='type-id-68'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-31'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-31'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-31'/>
          <parameter is-variadic='yes'/>
          <!-- void -->
          <return type-id='type-id-13'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> >* -->
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-260'/>
    <!-- OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> >* const -->
    <qualified-type-def type-id='type-id-260' const='yes' id='type-id-261'/>
    <!-- OT::BEInt<int, 4>* -->
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <!-- OT::BEInt<short int, 2>* -->
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
    <!-- OT::BEInt<short unsigned int, 2>* -->
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-267'/>
    <!-- OT::BEInt<unsigned int, 4>* -->
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-269'/>
    <!-- OT::BEInt<unsigned int, 4>* const -->
    <qualified-type-def type-id='type-id-269' const='yes' id='type-id-270'/>
    <!-- OT::CheckSum* -->
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-272'/>
    <!-- OT::FixedVersion* -->
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-274'/>
    <!-- OT::FixedVersion* const -->
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-275'/>
    <!-- OT::IntType<int, 4u>* -->
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-277'/>
    <!-- OT::IntType<short int, 2u>* -->
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <!-- OT::IntType<short unsigned int, 2u>* -->
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-281'/>
    <!-- OT::IntType<unsigned int, 4u>* -->
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <!-- OT::IntType<unsigned int, 4u>* const -->
    <qualified-type-def type-id='type-id-283' const='yes' id='type-id-284'/>
    <!-- OT::LONGDATETIME* -->
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-286'/>
    <!-- OT::OffsetTable& -->
    <reference-type-def kind='lvalue' type-id='type-id-287' size-in-bits='64' id='type-id-288'/>
    <!-- OT::OffsetTable* -->
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-289'/>
    <!-- OT::OffsetTable* const -->
    <qualified-type-def type-id='type-id-289' const='yes' id='type-id-290'/>
    <!-- OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >& -->
    <reference-type-def kind='lvalue' type-id='type-id-249' size-in-bits='64' id='type-id-291'/>
    <!-- OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >* -->
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-292'/>
    <!-- OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >* const -->
    <qualified-type-def type-id='type-id-292' const='yes' id='type-id-293'/>
    <!-- OT::OpenTypeFontFile* -->
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <!-- OT::OpenTypeFontFile* const -->
    <qualified-type-def type-id='type-id-295' const='yes' id='type-id-296'/>
    <!-- OT::Supplier<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> > >& -->
    <reference-type-def kind='lvalue' type-id='type-id-297' size-in-bits='64' id='type-id-298'/>
    <!-- OT::TTCHeader* -->
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-300'/>
    <!-- OT::TTCHeader* const -->
    <qualified-type-def type-id='type-id-300' const='yes' id='type-id-301'/>
    <!-- OT::TTCHeaderVersion1* -->
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <!-- OT::TTCHeaderVersion1* const -->
    <qualified-type-def type-id='type-id-303' const='yes' id='type-id-304'/>
    <!-- OT::TableRecord* -->
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-305'/>
    <!-- OT::Tag* -->
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-307'/>
    <!-- OT::hb_sanitize_context_t* -->
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <!-- OT::hb_sanitize_context_t* const -->
    <qualified-type-def type-id='type-id-309' const='yes' id='type-id-310'/>
    <!-- OT::hb_serialize_context_t* -->
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-312'/>
    <!-- OT::head* -->
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <!-- OT::head* const -->
    <qualified-type-def type-id='type-id-314' const='yes' id='type-id-315'/>
    <!-- OT::maxp* -->
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-317'/>
    <!-- OT::maxp* const -->
    <qualified-type-def type-id='type-id-317' const='yes' id='type-id-318'/>
    <!-- const OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> > -->
    <qualified-type-def type-id='type-id-259' const='yes' id='type-id-319'/>
    <!-- const OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> >* -->
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
    <!-- const OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> >* const -->
    <qualified-type-def type-id='type-id-320' const='yes' id='type-id-321'/>
    <!-- const OT::BEInt<int, 4> -->
    <qualified-type-def type-id='type-id-262' const='yes' id='type-id-322'/>
    <!-- const OT::BEInt<int, 4>& -->
    <reference-type-def kind='lvalue' type-id='type-id-322' size-in-bits='64' id='type-id-323'/>
    <!-- const OT::BEInt<int, 4>* -->
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-324'/>
    <!-- const OT::BEInt<short int, 2> -->
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-325'/>
    <!-- const OT::BEInt<short int, 2>& -->
    <reference-type-def kind='lvalue' type-id='type-id-325' size-in-bits='64' id='type-id-326'/>
    <!-- const OT::BEInt<short int, 2>* -->
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-327'/>
    <!-- const OT::BEInt<short unsigned int, 2> -->
    <qualified-type-def type-id='type-id-266' const='yes' id='type-id-328'/>
    <!-- const OT::BEInt<short unsigned int, 2>& -->
    <reference-type-def kind='lvalue' type-id='type-id-328' size-in-bits='64' id='type-id-329'/>
    <!-- const OT::BEInt<short unsigned int, 2>* -->
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-330'/>
    <!-- const OT::BEInt<short unsigned int, 2>* const -->
    <qualified-type-def type-id='type-id-330' const='yes' id='type-id-331'/>
    <!-- const OT::BEInt<unsigned int, 4> -->
    <qualified-type-def type-id='type-id-268' const='yes' id='type-id-332'/>
    <!-- const OT::BEInt<unsigned int, 4>& -->
    <qualified-type-def type-id='type-id-333' id='type-id-334'/>
    <!-- const OT::BEInt<unsigned int, 4>& -->
    <reference-type-def kind='lvalue' type-id='type-id-332' size-in-bits='64' id='type-id-333'/>
    <!-- const OT::BEInt<unsigned int, 4>* -->
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-335'/>
    <!-- const OT::BEInt<unsigned int, 4>* const -->
    <qualified-type-def type-id='type-id-335' const='yes' id='type-id-336'/>
    <!-- const OT::CheckSum -->
    <qualified-type-def type-id='type-id-271' const='yes' id='type-id-337'/>
    <!-- const OT::CheckSum* -->
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-338'/>
    <!-- const OT::FixedVersion -->
    <qualified-type-def type-id='type-id-273' const='yes' id='type-id-339'/>
    <!-- const OT::FixedVersion* -->
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-340'/>
    <!-- const OT::IntType<int, 4u> -->
    <qualified-type-def type-id='type-id-276' const='yes' id='type-id-341'/>
    <!-- const OT::IntType<int, 4u>& -->
    <reference-type-def kind='lvalue' type-id='type-id-341' size-in-bits='64' id='type-id-342'/>
    <!-- const OT::IntType<int, 4u>* -->
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-343'/>
    <!-- const OT::IntType<short int, 2u> -->
    <qualified-type-def type-id='type-id-278' const='yes' id='type-id-344'/>
    <!-- const OT::IntType<short int, 2u>& -->
    <reference-type-def kind='lvalue' type-id='type-id-344' size-in-bits='64' id='type-id-345'/>
    <!-- const OT::IntType<short int, 2u>* -->
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-346'/>
    <!-- const OT::IntType<short unsigned int, 2u> -->
    <qualified-type-def type-id='type-id-280' const='yes' id='type-id-347'/>
    <!-- const OT::IntType<short unsigned int, 2u>& -->
    <reference-type-def kind='lvalue' type-id='type-id-347' size-in-bits='64' id='type-id-348'/>
    <!-- const OT::IntType<short unsigned int, 2u>* -->
    <pointer-type-def type-id='type-id-347' size-in-bits='64' id='type-id-349'/>
    <!-- const OT::IntType<short unsigned int, 2u>* const -->
    <qualified-type-def type-id='type-id-349' const='yes' id='type-id-350'/>
    <!-- const OT::IntType<unsigned int, 4u> -->
    <qualified-type-def type-id='type-id-282' const='yes' id='type-id-351'/>
    <!-- const OT::IntType<unsigned int, 4u>& -->
    <qualified-type-def type-id='type-id-352' id='type-id-353'/>
    <!-- const OT::IntType<unsigned int, 4u>& -->
    <reference-type-def kind='lvalue' type-id='type-id-351' size-in-bits='64' id='type-id-352'/>
    <!-- const OT::IntType<unsigned int, 4u>* -->
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-354'/>
    <!-- const OT::IntType<unsigned int, 4u>* const -->
    <qualified-type-def type-id='type-id-354' const='yes' id='type-id-355'/>
    <!-- const OT::LONGDATETIME -->
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-356'/>
    <!-- const OT::LONGDATETIME* -->
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-357'/>
    <!-- const OT::Offset<OT::IntType<unsigned int, 4u> > -->
    <qualified-type-def type-id='type-id-358' const='yes' id='type-id-359'/>
    <!-- const OT::Offset<OT::IntType<unsigned int, 4u> >* -->
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-360'/>
    <!-- const OT::OffsetTable -->
    <qualified-type-def type-id='type-id-287' const='yes' id='type-id-361'/>
    <!-- const OT::OffsetTable& -->
    <reference-type-def kind='lvalue' type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <!-- const OT::OffsetTable* -->
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-363'/>
    <!-- const OT::OffsetTable* const -->
    <qualified-type-def type-id='type-id-363' const='yes' id='type-id-364'/>
    <!-- const OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> > -->
    <qualified-type-def type-id='type-id-249' const='yes' id='type-id-365'/>
    <!-- const OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >& -->
    <reference-type-def kind='lvalue' type-id='type-id-365' size-in-bits='64' id='type-id-366'/>
    <!-- const OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >* -->
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-367'/>
    <!-- const OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >* const -->
    <qualified-type-def type-id='type-id-367' const='yes' id='type-id-368'/>
    <!-- const OT::OpenTypeFontFace -->
    <qualified-type-def type-id='type-id-369' const='yes' id='type-id-370'/>
    <!-- const OT::OpenTypeFontFace& -->
    <reference-type-def kind='lvalue' type-id='type-id-370' size-in-bits='64' id='type-id-371'/>
    <!-- const OT::OpenTypeFontFile -->
    <qualified-type-def type-id='type-id-294' const='yes' id='type-id-372'/>
    <!-- const OT::OpenTypeFontFile* -->
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-373'/>
    <!-- const OT::OpenTypeFontFile* const -->
    <qualified-type-def type-id='type-id-373' const='yes' id='type-id-374'/>
    <!-- const OT::TTCHeader -->
    <qualified-type-def type-id='type-id-299' const='yes' id='type-id-375'/>
    <!-- const OT::TTCHeader* -->
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-376'/>
    <!-- const OT::TTCHeader* const -->
    <qualified-type-def type-id='type-id-376' const='yes' id='type-id-377'/>
    <!-- const OT::TTCHeaderVersion1 -->
    <qualified-type-def type-id='type-id-302' const='yes' id='type-id-378'/>
    <!-- const OT::TTCHeaderVersion1* -->
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-379'/>
    <!-- const OT::TTCHeaderVersion1* const -->
    <qualified-type-def type-id='type-id-379' const='yes' id='type-id-380'/>
    <!-- const OT::TableRecord -->
    <qualified-type-def type-id='type-id-251' const='yes' id='type-id-381'/>
    <!-- const OT::TableRecord& -->
    <reference-type-def kind='lvalue' type-id='type-id-381' size-in-bits='64' id='type-id-382'/>
    <!-- const OT::TableRecord* -->
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-383'/>
    <!-- const OT::Tag -->
    <qualified-type-def type-id='type-id-306' const='yes' id='type-id-384'/>
    <!-- const OT::Tag* -->
    <pointer-type-def type-id='type-id-384' size-in-bits='64' id='type-id-385'/>
    <!-- const OT::ULONG -->
    <qualified-type-def type-id='type-id-386' const='yes' id='type-id-387'/>
    <!-- const OT::ULONG* -->
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-388'/>
    <!-- const OT::hb_sanitize_context_t -->
    <qualified-type-def type-id='type-id-308' const='yes' id='type-id-389'/>
    <!-- const OT::hb_sanitize_context_t* -->
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-390'/>
    <!-- const OT::hb_sanitize_context_t* const -->
    <qualified-type-def type-id='type-id-390' const='yes' id='type-id-391'/>
    <!-- const OT::head -->
    <qualified-type-def type-id='type-id-313' const='yes' id='type-id-392'/>
    <!-- const OT::head* -->
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-393'/>
    <!-- const OT::head* const -->
    <qualified-type-def type-id='type-id-393' const='yes' id='type-id-394'/>
    <!-- const OT::maxp -->
    <qualified-type-def type-id='type-id-316' const='yes' id='type-id-395'/>
    <!-- const OT::maxp* -->
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-396'/>
    <!-- const OT::maxp* const -->
    <qualified-type-def type-id='type-id-396' const='yes' id='type-id-397'/>
    <!-- const hb_face_t -->
    <qualified-type-def type-id='type-id-174' const='yes' id='type-id-398'/>
    <!-- const hb_face_t* -->
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-399'/>
    <!-- const hb_face_t* const -->
    <qualified-type-def type-id='type-id-399' const='yes' id='type-id-400'/>
    <!-- const hb_feature_t -->
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-401'/>
    <!-- const hb_feature_t* -->
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-402'/>
    <!-- const hb_font_funcs_t -->
    <qualified-type-def type-id='type-id-175' const='yes' id='type-id-403'/>
    <!-- const hb_font_funcs_t* -->
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-404'/>
    <!-- const hb_font_t -->
    <qualified-type-def type-id='type-id-141' const='yes' id='type-id-405'/>
    <!-- const hb_font_t* -->
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-406'/>
    <!-- const hb_shape_plan_t -->
    <qualified-type-def type-id='type-id-213' const='yes' id='type-id-407'/>
    <!-- const hb_shape_plan_t* -->
    <pointer-type-def type-id='type-id-407' size-in-bits='64' id='type-id-408'/>
    <!-- const hb_tag_t -->
    <qualified-type-def type-id='type-id-223' const='yes' id='type-id-409'/>
    <!-- const int -->
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-410'/>
    <!-- const int& -->
    <reference-type-def kind='lvalue' type-id='type-id-410' size-in-bits='64' id='type-id-411'/>
    <!-- hb_auto_trace_t<0, bool>* -->
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-258'/>
    <!-- hb_auto_trace_t<0, bool>* const -->
    <qualified-type-def type-id='type-id-258' const='yes' id='type-id-412'/>
    <!-- hb_blob_t* (hb_face_t*, typedef hb_tag_t, void*)* -->
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-203'/>
    <!-- hb_face_t* -->
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-144'/>
    <!-- hb_face_t::plan_node_t* -->
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-178'/>
    <!-- hb_feature_t* -->
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-215'/>
    <!-- hb_font_funcs_t* -->
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-145'/>
    <!-- hb_glyph_extents_t* -->
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-413'/>
    <!-- hb_position_t* -->
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-414'/>
    <!-- hb_shape_func_t* -->
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-214'/>
    <!-- hb_shape_plan_t* -->
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-177'/>
    <!-- typedef hb_bool_t (hb_font_t*, void*, const char*, int, hb_codepoint_t*, void*)* -->
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-197'/>
    <!-- typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, char*, unsigned int, void*)* -->
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-202'/>
    <!-- typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, hb_glyph_extents_t*, void*)* -->
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-196'/>
    <!-- typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, hb_position_t*, hb_position_t*, void*)* -->
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-212'/>
    <!-- typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, typedef hb_codepoint_t, hb_codepoint_t*, void*)* -->
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-198'/>
    <!-- typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, unsigned int, hb_position_t*, hb_position_t*, void*)* -->
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-195'/>
    <!-- typedef hb_position_t (hb_font_t*, void*, typedef hb_codepoint_t, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-211'/>
    <!-- typedef hb_position_t (hb_font_t*, void*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-210'/>
    <!-- namespace OT -->
    <namespace-decl name='OT'>
      <!-- struct OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> > -->
      <class-decl name='OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='741' column='1' id='type-id-249'>
        <!-- struct OT::Offset<OT::IntType<unsigned int, 4u> > -->
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-358'/>
        <data-member access='public' static='yes'>
          <!-- static const unsigned int OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >::static_size -->
          <var-decl name='static_size' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='778' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const unsigned int OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >::min_size -->
          <var-decl name='min_size' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='778' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::Offset<OT::IntType<unsigned int, 4u> > -->
      <class-decl name='Offset&lt;OT::IntType&lt;unsigned int, 4u&gt; &gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='683' column='1' id='type-id-358'>
        <!-- struct OT::IntType<unsigned int, 4u> -->
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-282'/>
        <data-member access='public' static='yes'>
          <!-- static const unsigned int OT::Offset<OT::IntType<unsigned int, 4u> >::static_size -->
          <var-decl name='static_size' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='686' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const unsigned int OT::Offset<OT::IntType<unsigned int, 4u> >::min_size -->
          <var-decl name='min_size' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='686' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::OffsetTable -->
      <class-decl name='OffsetTable' size-in-bits='224' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='71' column='1' id='type-id-287'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- OT::Tag OT::OffsetTable::sfnt_version -->
          <var-decl name='sfnt_version' type-id='type-id-306' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='111' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <!-- OT::USHORT OT::OffsetTable::numTables -->
          <var-decl name='numTables' type-id='type-id-415' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='112' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='48'>
          <!-- OT::USHORT OT::OffsetTable::searchRangeZ -->
          <var-decl name='searchRangeZ' type-id='type-id-415' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='113' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <!-- OT::USHORT OT::OffsetTable::entrySelectorZ -->
          <var-decl name='entrySelectorZ' type-id='type-id-415' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='114' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='80'>
          <!-- OT::USHORT OT::OffsetTable::rangeShiftZ -->
          <var-decl name='rangeShiftZ' type-id='type-id-415' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='115' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='96'>
          <!-- OT::TableRecord OT::OffsetTable::tables[1] -->
          <var-decl name='tables' type-id='type-id-252' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='116' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const unsigned int OT::OffsetTable::min_size -->
          <var-decl name='min_size' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='118' column='1'/>
        </data-member>
      </class-decl>
      <!-- typedef OT::IntType<short unsigned int, 2u> OT::USHORT -->
      <typedef-decl name='USHORT' type-id='type-id-280' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='632' column='1' id='type-id-415'/>
      <!-- struct OT::BEInt<unsigned int, 4> -->
      <class-decl name='BEInt&lt;unsigned int, 4&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' id='type-id-268'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- uint8_t OT::BEInt<unsigned int, 4>::v[4] -->
          <var-decl name='v' type-id='type-id-85' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='607' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::TableRecord -->
      <class-decl name='TableRecord' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='55' column='1' id='type-id-251'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- OT::Tag OT::TableRecord::tag -->
          <var-decl name='tag' type-id='type-id-306' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <!-- OT::CheckSum OT::TableRecord::checkSum -->
          <var-decl name='checkSum' type-id='type-id-271' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- OT::ULONG OT::TableRecord::offset -->
          <var-decl name='offset' type-id='type-id-386' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <!-- OT::ULONG OT::TableRecord::length -->
          <var-decl name='length' type-id='type-id-386' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='65' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const unsigned int OT::TableRecord::static_size -->
          <var-decl name='static_size' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='67' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const unsigned int OT::TableRecord::min_size -->
          <var-decl name='min_size' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='67' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::CheckSum -->
      <class-decl name='CheckSum' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='692' column='1' id='type-id-271'>
        <!-- struct OT::IntType<unsigned int, 4u> -->
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-282'/>
        <data-member access='public' static='yes'>
          <!-- static const unsigned int OT::CheckSum::static_size -->
          <var-decl name='static_size' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='709' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const unsigned int OT::CheckSum::min_size -->
          <var-decl name='min_size' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='709' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::BEInt<short unsigned int, 2> -->
      <class-decl name='BEInt&lt;short unsigned int, 2&gt;' size-in-bits='16' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' id='type-id-266'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- uint8_t OT::BEInt<short unsigned int, 2>::v[2] -->
          <var-decl name='v' type-id='type-id-253' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='554' column='1'/>
        </data-member>
      </class-decl>
      <!-- typedef OT::IntType<unsigned int, 4u> OT::ULONG -->
      <typedef-decl name='ULONG' type-id='type-id-282' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='634' column='1' id='type-id-386'/>
      <!-- struct OT::IntType<short unsigned int, 2u> -->
      <class-decl name='IntType&lt;short unsigned int, 2u&gt;' size-in-bits='16' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' id='type-id-280'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- OT::BEInt<short unsigned int, 2> OT::IntType<short unsigned int, 2u>::v -->
          <var-decl name='v' type-id='type-id-266' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const unsigned int OT::IntType<short unsigned int, 2u>::static_size -->
          <var-decl name='static_size' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const unsigned int OT::IntType<short unsigned int, 2u>::min_size -->
          <var-decl name='min_size' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::hb_serialize_context_t -->
      <class-decl name='hb_serialize_context_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='377' column='1' id='type-id-311'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- unsigned int OT::hb_serialize_context_t::debug_depth -->
          <var-decl name='debug_depth' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='480' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- char* OT::hb_serialize_context_t::start -->
          <var-decl name='start' type-id='type-id-42' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- char* OT::hb_serialize_context_t::end -->
          <var-decl name='end' type-id='type-id-42' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <!-- char* OT::hb_serialize_context_t::head -->
          <var-decl name='head' type-id='type-id-42' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <!-- bool OT::hb_serialize_context_t::ran_out_of_room -->
          <var-decl name='ran_out_of_room' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='482' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <!-- OT::hb_serialize_context_t::hb_serialize_context_t(void*, unsigned int) -->
          <function-decl name='hb_serialize_context_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-33'/>
            <!-- parameter of type 'unsigned int' -->
            <parameter type-id='type-id-12'/>
            <!-- void -->
            <return type-id='type-id-13'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::Coverage* OT::hb_serialize_context_t::start_embed<OT::Coverage>() -->
          <function-decl name='start_embed&lt;OT::Coverage&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- OT::Coverage* -->
            <return type-id='type-id-416'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::Ligature* OT::hb_serialize_context_t::start_embed<OT::Ligature>() -->
          <function-decl name='start_embed&lt;OT::Ligature&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- OT::Ligature* -->
            <return type-id='type-id-417'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::LigatureSet* OT::hb_serialize_context_t::start_embed<OT::LigatureSet>() -->
          <function-decl name='start_embed&lt;OT::LigatureSet&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- OT::LigatureSet* -->
            <return type-id='type-id-418'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::SubstLookupSubTable* OT::hb_serialize_context_t::start_embed<OT::SubstLookupSubTable>() -->
          <function-decl name='start_embed&lt;OT::SubstLookupSubTable&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- OT::SubstLookupSubTable* -->
            <return type-id='type-id-419'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::SubstLookup* OT::hb_serialize_context_t::start_embed<OT::SubstLookup>() -->
          <function-decl name='start_embed&lt;OT::SubstLookup&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- OT::SubstLookup* -->
            <return type-id='type-id-420'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::Lookup* OT::hb_serialize_context_t::allocate_size<OT::Lookup>(unsigned int) -->
          <function-decl name='allocate_size&lt;OT::Lookup&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='421' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'unsigned int' -->
            <parameter type-id='type-id-12'/>
            <!-- OT::Lookup* -->
            <return type-id='type-id-421'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> >* OT::hb_serialize_context_t::allocate_size<OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> > >(unsigned int) -->
          <function-decl name='allocate_size&lt;OT::ArrayOf&lt;OT::Offset&lt;OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='421' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'unsigned int' -->
            <parameter type-id='type-id-12'/>
            <!-- OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> >* -->
            <return type-id='type-id-422'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> >* OT::hb_serialize_context_t::extend_min<OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> > >(OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> >&) -->
          <function-decl name='extend_min&lt;OT::ArrayOf&lt;OT::Offset&lt;OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> >&' -->
            <parameter type-id='type-id-423'/>
            <!-- OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> >* -->
            <return type-id='type-id-422'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> >* OT::hb_serialize_context_t::extend<OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> > >(OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> >&) -->
          <function-decl name='extend&lt;OT::ArrayOf&lt;OT::Offset&lt;OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='466' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> >&' -->
            <parameter type-id='type-id-423'/>
            <!-- OT::ArrayOf<OT::Offset<OT::IntType<short unsigned int, 2u> >, OT::IntType<short unsigned int, 2u> >* -->
            <return type-id='type-id-422'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::Lookup* OT::hb_serialize_context_t::extend_min<OT::Lookup>(OT::Lookup&) -->
          <function-decl name='extend_min&lt;OT::Lookup&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'OT::Lookup&' -->
            <parameter type-id='type-id-424'/>
            <!-- OT::Lookup* -->
            <return type-id='type-id-421'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::IntType<short unsigned int, 2u>* OT::hb_serialize_context_t::allocate_size<OT::IntType<short unsigned int, 2u> >(unsigned int) -->
          <function-decl name='allocate_size&lt;OT::IntType&lt;short unsigned int, 2u&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='421' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'unsigned int' -->
            <parameter type-id='type-id-12'/>
            <!-- OT::IntType<short unsigned int, 2u>* -->
            <return type-id='type-id-281'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::SingleSubstFormat1* OT::hb_serialize_context_t::allocate_size<OT::SingleSubstFormat1>(unsigned int) -->
          <function-decl name='allocate_size&lt;OT::SingleSubstFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='421' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'unsigned int' -->
            <parameter type-id='type-id-12'/>
            <!-- OT::SingleSubstFormat1* -->
            <return type-id='type-id-425'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::Coverage* OT::hb_serialize_context_t::allocate_size<OT::Coverage>(unsigned int) -->
          <function-decl name='allocate_size&lt;OT::Coverage&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='421' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'unsigned int' -->
            <parameter type-id='type-id-12'/>
            <!-- OT::Coverage* -->
            <return type-id='type-id-416'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::CoverageFormat1* OT::hb_serialize_context_t::allocate_size<OT::CoverageFormat1>(unsigned int) -->
          <function-decl name='allocate_size&lt;OT::CoverageFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='421' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'unsigned int' -->
            <parameter type-id='type-id-12'/>
            <!-- OT::CoverageFormat1* -->
            <return type-id='type-id-426'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::SortedArrayOf<OT::IntType<short unsigned int, 2u>, OT::IntType<short unsigned int, 2u> >* OT::hb_serialize_context_t::allocate_size<OT::SortedArrayOf<OT::IntType<short unsigned int, 2u>, OT::IntType<short unsigned int, 2u> > >(unsigned int) -->
          <function-decl name='allocate_size&lt;OT::SortedArrayOf&lt;OT::IntType&lt;short unsigned int, 2u&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='421' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'unsigned int' -->
            <parameter type-id='type-id-12'/>
            <!-- OT::SortedArrayOf<OT::IntType<short unsigned int, 2u>, OT::IntType<short unsigned int, 2u> >* -->
            <return type-id='type-id-427'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::CoverageFormat1* OT::hb_serialize_context_t::extend_min<OT::CoverageFormat1>(OT::CoverageFormat1&) -->
          <function-decl name='extend_min&lt;OT::CoverageFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'OT::CoverageFormat1&' -->
            <parameter type-id='type-id-428'/>
            <!-- OT::CoverageFormat1* -->
            <return type-id='type-id-426'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::SortedArrayOf<OT::IntType<short unsigned int, 2u>, OT::IntType<short unsigned int, 2u> >* OT::hb_serialize_context_t::extend<OT::SortedArrayOf<OT::IntType<short unsigned int, 2u>, OT::IntType<short unsigned int, 2u> > >(OT::SortedArrayOf<OT::IntType<short unsigned int, 2u>, OT::IntType<short unsigned int, 2u> >&) -->
          <function-decl name='extend&lt;OT::SortedArrayOf&lt;OT::IntType&lt;short unsigned int, 2u&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='466' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'OT::SortedArrayOf<OT::IntType<short unsigned int, 2u>, OT::IntType<short unsigned int, 2u> >&' -->
            <parameter type-id='type-id-429'/>
            <!-- OT::SortedArrayOf<OT::IntType<short unsigned int, 2u>, OT::IntType<short unsigned int, 2u> >* -->
            <return type-id='type-id-427'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::CoverageFormat2* OT::hb_serialize_context_t::allocate_size<OT::CoverageFormat2>(unsigned int) -->
          <function-decl name='allocate_size&lt;OT::CoverageFormat2&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='421' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'unsigned int' -->
            <parameter type-id='type-id-12'/>
            <!-- OT::CoverageFormat2* -->
            <return type-id='type-id-430'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::SortedArrayOf<OT::RangeRecord, OT::IntType<short unsigned int, 2u> >* OT::hb_serialize_context_t::allocate_size<OT::SortedArrayOf<OT::RangeRecord, OT::IntType<short unsigned int, 2u> > >(unsigned int) -->
          <function-decl name='allocate_size&lt;OT::SortedArrayOf&lt;OT::RangeRecord, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='421' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'unsigned int' -->
            <parameter type-id='type-id-12'/>
            <!-- OT::SortedArrayOf<OT::RangeRecord, OT::IntType<short unsigned int, 2u> >* -->
            <return type-id='type-id-431'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::CoverageFormat2* OT::hb_serialize_context_t::extend_min<OT::CoverageFormat2>(OT::CoverageFormat2&) -->
          <function-decl name='extend_min&lt;OT::CoverageFormat2&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'OT::CoverageFormat2&' -->
            <parameter type-id='type-id-432'/>
            <!-- OT::CoverageFormat2* -->
            <return type-id='type-id-430'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::SortedArrayOf<OT::RangeRecord, OT::IntType<short unsigned int, 2u> >* OT::hb_serialize_context_t::extend<OT::SortedArrayOf<OT::RangeRecord, OT::IntType<short unsigned int, 2u> > >(OT::SortedArrayOf<OT::RangeRecord, OT::IntType<short unsigned int, 2u> >&) -->
          <function-decl name='extend&lt;OT::SortedArrayOf&lt;OT::RangeRecord, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='466' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
            <parameter type-id='type-id-312' is-artificial='yes'/>
            <!-- parameter of type 'OT::SortedArrayOf<OT::RangeRecord, OT::IntType<short unsigned int, 2u> >&' -->
            <parameter type-id='type-id-433'/>
            <!-- OT::SortedArrayOf<OT::RangeRecord, OT::IntType<short unsigned int, 2u> >* -->
            <return type-id='type-id-431'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- OT::Coverage* OT::hb_serialize_context_t::extend_min<OT::Coverage>(OT::Coverage&) -->
          <function-decl name='extend_min&lt;OT::Coverage&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'OT::hb_serialize_context_t*' -->
