<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libtcmalloc_and_profiler.so.4'>
  <elf-needed>
    <dependency name='libunwind.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- GetHeapProfile -->
    <elf-symbol name='GetHeapProfile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- HeapProfilerDump -->
    <elf-symbol name='HeapProfilerDump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- HeapProfilerStart -->
    <elf-symbol name='HeapProfilerStart' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- HeapProfilerStop -->
    <elf-symbol name='HeapProfilerStop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- IsHeapProfilerRunning -->
    <elf-symbol name='IsHeapProfilerRunning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- MallocExtension_GetAllocatedSize -->
    <elf-symbol name='MallocExtension_GetAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTV22TCMallocImplementation' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kPageHeapType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE13kPageHeapType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kLargeSpanType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE14kLargeSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kThreadCacheType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE16kThreadCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kCentralCacheType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE17kCentralCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kTransferCacheType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE18kTransferCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kPageHeapUnmappedType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE21kPageHeapUnmappedType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kLargeUnmappedSpanType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE22kLargeUnmappedSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __free_hook -->
    <elf-symbol name='__free_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __malloc_hook -->
    <elf-symbol name='__malloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __memalign_hook -->
    <elf-symbol name='__memalign_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __realloc_hook -->
    <elf-symbol name='__realloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- heap_leak_checker_bcad_variable -->
    <elf-symbol name='heap_leak_checker_bcad_variable' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- sys_alloc -->
    <elf-symbol name='sys_alloc' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/base/atomicops-internals-x86.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/dynamic_annotations.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C89'>
    <!-- int RunningOnValgrind() -->
    <function-decl name='RunningOnValgrind' mangled-name='RunningOnValgrind' filepath='src/base/dynamic_annotations.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='RunningOnValgrind'>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- double ValgrindSlowdown() -->
    <function-decl name='ValgrindSlowdown' mangled-name='ValgrindSlowdown' filepath='src/base/dynamic_annotations.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ValgrindSlowdown'>
      <!-- double -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- double -->
    <type-decl name='double' size-in-bits='64' id='type-id-2'/>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/elf_mem_image.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- unsigned char[16] -->
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='128' id='type-id-4'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-5' id='type-id-6'/>
    </array-type-def>
    <!-- struct Elf64_Sym -->
    <class-decl name='Elf64_Sym' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='389' column='1' id='type-id-7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Word Elf64_Sym::st_name -->
        <var-decl name='st_name' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned char Elf64_Sym::st_info -->
        <var-decl name='st_info' type-id='type-id-3' visibility='default' filepath='/usr/include/elf.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <!-- unsigned char Elf64_Sym::st_other -->
        <var-decl name='st_other' type-id='type-id-3' visibility='default' filepath='/usr/include/elf.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <!-- Elf64_Section Elf64_Sym::st_shndx -->
        <var-decl name='st_shndx' type-id='type-id-9' visibility='default' filepath='/usr/include/elf.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- Elf64_Addr Elf64_Sym::st_value -->
        <var-decl name='st_value' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Elf64_Xword Elf64_Sym::st_size -->
        <var-decl name='st_size' type-id='type-id-11' visibility='default' filepath='/usr/include/elf.h' line='395' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef uint32_t Elf64_Word -->
    <typedef-decl name='Elf64_Word' type-id='type-id-12' filepath='/usr/include/elf.h' line='39' column='1' id='type-id-8'/>
    <!-- typedef uint16_t Elf64_Section -->
    <typedef-decl name='Elf64_Section' type-id='type-id-13' filepath='/usr/include/elf.h' line='58' column='1' id='type-id-9'/>
    <!-- typedef unsigned short int uint16_t -->
    <typedef-decl name='uint16_t' type-id='type-id-14' filepath='/usr/include/stdint.h' line='50' column='1' id='type-id-13'/>
    <!-- typedef uint64_t Elf64_Addr -->
    <typedef-decl name='Elf64_Addr' type-id='type-id-15' filepath='/usr/include/elf.h' line='50' column='1' id='type-id-10'/>
    <!-- typedef uint64_t Elf64_Xword -->
    <typedef-decl name='Elf64_Xword' type-id='type-id-15' filepath='/usr/include/elf.h' line='45' column='1' id='type-id-11'/>
    <!-- struct Elf64_Ehdr -->
    <class-decl name='Elf64_Ehdr' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='88' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned char Elf64_Ehdr::e_ident[16] -->
        <var-decl name='e_ident' type-id='type-id-4' visibility='default' filepath='/usr/include/elf.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Elf64_Half Elf64_Ehdr::e_type -->
        <var-decl name='e_type' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <!-- Elf64_Half Elf64_Ehdr::e_machine -->
        <var-decl name='e_machine' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- Elf64_Word Elf64_Ehdr::e_version -->
        <var-decl name='e_version' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- Elf64_Addr Elf64_Ehdr::e_entry -->
        <var-decl name='e_entry' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- Elf64_Off Elf64_Ehdr::e_phoff -->
        <var-decl name='e_phoff' type-id='type-id-18' visibility='default' filepath='/usr/include/elf.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- Elf64_Off Elf64_Ehdr::e_shoff -->
        <var-decl name='e_shoff' type-id='type-id-18' visibility='default' filepath='/usr/include/elf.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- Elf64_Word Elf64_Ehdr::e_flags -->
        <var-decl name='e_flags' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <!-- Elf64_Half Elf64_Ehdr::e_ehsize -->
        <var-decl name='e_ehsize' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <!-- Elf64_Half Elf64_Ehdr::e_phentsize -->
        <var-decl name='e_phentsize' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- Elf64_Half Elf64_Ehdr::e_phnum -->
        <var-decl name='e_phnum' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <!-- Elf64_Half Elf64_Ehdr::e_shentsize -->
        <var-decl name='e_shentsize' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- Elf64_Half Elf64_Ehdr::e_shnum -->
        <var-decl name='e_shnum' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <!-- Elf64_Half Elf64_Ehdr::e_shstrndx -->
        <var-decl name='e_shstrndx' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef uint16_t Elf64_Half -->
    <typedef-decl name='Elf64_Half' type-id='type-id-13' filepath='/usr/include/elf.h' line='34' column='1' id='type-id-17'/>
    <!-- typedef uint64_t Elf64_Off -->
    <typedef-decl name='Elf64_Off' type-id='type-id-15' filepath='/usr/include/elf.h' line='54' column='1' id='type-id-18'/>
    <!-- typedef Elf64_Half Elf64_Versym -->
    <typedef-decl name='Elf64_Versym' type-id='type-id-17' filepath='/usr/include/elf.h' line='62' column='1' id='type-id-19'/>
    <!-- struct Elf64_Verdef -->
    <class-decl name='Elf64_Verdef' size-in-bits='160' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='812' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Half Elf64_Verdef::vd_version -->
        <var-decl name='vd_version' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <!-- Elf64_Half Elf64_Verdef::vd_flags -->
        <var-decl name='vd_flags' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- Elf64_Half Elf64_Verdef::vd_ndx -->
        <var-decl name='vd_ndx' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <!-- Elf64_Half Elf64_Verdef::vd_cnt -->
        <var-decl name='vd_cnt' type-id='type-id-17' visibility='default' filepath='/usr/include/elf.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- Elf64_Word Elf64_Verdef::vd_hash -->
        <var-decl name='vd_hash' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- Elf64_Word Elf64_Verdef::vd_aux -->
        <var-decl name='vd_aux' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Elf64_Word Elf64_Verdef::vd_next -->
        <var-decl name='vd_next' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='819' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct Elf64_Phdr -->
    <class-decl name='Elf64_Phdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='551' column='1' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Word Elf64_Phdr::p_type -->
        <var-decl name='p_type' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- Elf64_Word Elf64_Phdr::p_flags -->
        <var-decl name='p_flags' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- Elf64_Off Elf64_Phdr::p_offset -->
        <var-decl name='p_offset' type-id='type-id-18' visibility='default' filepath='/usr/include/elf.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Elf64_Addr Elf64_Phdr::p_vaddr -->
        <var-decl name='p_vaddr' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- Elf64_Addr Elf64_Phdr::p_paddr -->
        <var-decl name='p_paddr' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- Elf64_Xword Elf64_Phdr::p_filesz -->
        <var-decl name='p_filesz' type-id='type-id-11' visibility='default' filepath='/usr/include/elf.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- Elf64_Xword Elf64_Phdr::p_memsz -->
        <var-decl name='p_memsz' type-id='type-id-11' visibility='default' filepath='/usr/include/elf.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- Elf64_Xword Elf64_Phdr::p_align -->
        <var-decl name='p_align' type-id='type-id-11' visibility='default' filepath='/usr/include/elf.h' line='559' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct Elf64_Verdaux -->
    <class-decl name='Elf64_Verdaux' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='849' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Word Elf64_Verdaux::vda_name -->
        <var-decl name='vda_name' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='850' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- Elf64_Word Elf64_Verdaux::vda_next -->
        <var-decl name='vda_next' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='851' column='1'/>
      </data-member>
    </class-decl>
    <!-- base::ElfMemImage* -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
    <!-- base::ElfMemImage* const -->
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-25'/>
    <!-- base::ElfMemImage::SymbolInfo* -->
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <!-- base::ElfMemImage::SymbolIterator& -->
    <reference-type-def kind='lvalue' type-id='type-id-28' size-in-bits='64' id='type-id-29'/>
    <!-- base::ElfMemImage::SymbolIterator* -->
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-30'/>
    <!-- base::ElfMemImage::SymbolIterator* const -->
    <qualified-type-def type-id='type-id-30' const='yes' id='type-id-31'/>
    <!-- const Elf64_Ehdr -->
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-32'/>
    <!-- const Elf64_Ehdr* -->
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-33'/>
    <!-- const Elf64_Phdr -->
    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-34'/>
    <!-- const Elf64_Phdr* -->
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-35'/>
    <!-- const Elf64_Sym -->
    <qualified-type-def type-id='type-id-7' const='yes' id='type-id-36'/>
    <!-- const Elf64_Sym* -->
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-37'/>
    <!-- const Elf64_Verdaux -->
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-38'/>
    <!-- const Elf64_Verdaux* -->
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-39'/>
    <!-- const Elf64_Verdef -->
    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-40'/>
    <!-- const Elf64_Verdef* -->
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <!-- const Elf64_Versym -->
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-42'/>
    <!-- const Elf64_Versym* -->
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-43'/>
    <!-- const Elf64_Word -->
    <qualified-type-def type-id='type-id-8' const='yes' id='type-id-44'/>
    <!-- const Elf64_Word* -->
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <!-- const base::ElfMemImage -->
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-46'/>
    <!-- const base::ElfMemImage* -->
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <!-- const base::ElfMemImage* const -->
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-48'/>
    <!-- const base::ElfMemImage::SymbolInfo -->
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-49'/>
    <!-- const base::ElfMemImage::SymbolInfo& -->
    <reference-type-def kind='lvalue' type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <!-- const base::ElfMemImage::SymbolInfo* -->
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-51'/>
    <!-- const base::ElfMemImage::SymbolIterator -->
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-52'/>
    <!-- const base::ElfMemImage::SymbolIterator& -->
    <qualified-type-def type-id='type-id-53' id='type-id-54'/>
    <!-- const base::ElfMemImage::SymbolIterator& -->
    <reference-type-def kind='lvalue' type-id='type-id-52' size-in-bits='64' id='type-id-53'/>
    <!-- const base::ElfMemImage::SymbolIterator* -->
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-55'/>
    <!-- const base::ElfMemImage::SymbolIterator* const -->
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-56'/>
    <!-- namespace base -->
    <namespace-decl name='base'>
      <!-- class base::ElfMemImage -->
      <class-decl name='ElfMemImage' size-in-bits='576' visibility='default' filepath='./src/base/elf_mem_image.h' line='56' column='1' id='type-id-23'>
        <member-type access='private'>
          <!-- struct base::ElfMemImage::SymbolInfo -->
          <class-decl name='SymbolInfo' size-in-bits='256' is-struct='yes' visibility='default' filepath='./src/base/elf_mem_image.h' line='64' column='1' id='type-id-26'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- const char* base::ElfMemImage::SymbolInfo::name -->
              <var-decl name='name' type-id='type-id-57' visibility='default' filepath='./src/base/elf_mem_image.h' line='65' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- const char* base::ElfMemImage::SymbolInfo::version -->
              <var-decl name='version' type-id='type-id-57' visibility='default' filepath='./src/base/elf_mem_image.h' line='66' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <!-- void* base::ElfMemImage::SymbolInfo::address -->
              <var-decl name='address' type-id='type-id-58' visibility='default' filepath='./src/base/elf_mem_image.h' line='68' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <!-- const Elf64_Sym* base::ElfMemImage::SymbolInfo::symbol -->
              <var-decl name='symbol' type-id='type-id-37' visibility='default' filepath='./src/base/elf_mem_image.h' line='69' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <!-- class base::ElfMemImage::SymbolIterator -->
          <class-decl name='SymbolIterator' size-in-bits='384' visibility='default' filepath='./src/base/elf_mem_image.h' line='73' column='1' id='type-id-28'>
            <data-member access='private' layout-offset-in-bits='0'>
              <!-- base::ElfMemImage::SymbolInfo base::ElfMemImage::SymbolIterator::info_ -->
              <var-decl name='info_' type-id='type-id-26' visibility='default' filepath='./src/base/elf_mem_image.h' line='84' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='256'>
              <!-- int base::ElfMemImage::SymbolIterator::index_ -->
              <var-decl name='index_' type-id='type-id-1' visibility='default' filepath='./src/base/elf_mem_image.h' line='85' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='320'>
              <!-- void* const base::ElfMemImage::SymbolIterator::image_ -->
              <var-decl name='image_' type-id='type-id-59' visibility='default' filepath='./src/base/elf_mem_image.h' line='86' column='1'/>
            </data-member>
            <member-function access='private' constructor='yes'>
              <!-- base::ElfMemImage::SymbolIterator::SymbolIterator(void*, int) -->
              <function-decl name='SymbolIterator' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi' filepath='./src/base/elf_mem_image.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi'>
                <!-- implicit parameter of type 'base::ElfMemImage::SymbolIterator*' -->
                <parameter type-id='type-id-30' is-artificial='yes'/>
                <!-- parameter of type 'void*' -->
                <parameter type-id='type-id-58'/>
                <!-- parameter of type 'int' -->
                <parameter type-id='type-id-1'/>
                <!-- void -->
                <return type-id='type-id-60'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- const base::ElfMemImage::SymbolInfo* base::ElfMemImage::SymbolIterator::operator&#45;>() -->
              <function-decl name='operator-&gt;' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorptEv' filepath='src/base/elf_mem_image.cc' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorptEv'>
                <!-- implicit parameter of type 'const base::ElfMemImage::SymbolIterator* const' -->
                <parameter type-id='type-id-56' name='this' is-artificial='yes'/>
                <!-- const base::ElfMemImage::SymbolInfo* -->
                <return type-id='type-id-51'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- const base::ElfMemImage::SymbolInfo& base::ElfMemImage::SymbolIterator::operator*() -->
              <function-decl name='operator*' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratordeEv' filepath='src/base/elf_mem_image.cc' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratordeEv'>
                <!-- implicit parameter of type 'const base::ElfMemImage::SymbolIterator* const' -->
                <parameter type-id='type-id-56' name='this' is-artificial='yes'/>
                <!-- const base::ElfMemImage::SymbolInfo& -->
                <return type-id='type-id-50'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- bool base::ElfMemImage::SymbolIterator::operator==(const base::ElfMemImage::SymbolIterator&) -->
              <function-decl name='operator==' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_' filepath='src/base/elf_mem_image.cc' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_'>
                <!-- implicit parameter of type 'const base::ElfMemImage::SymbolIterator* const' -->
                <parameter type-id='type-id-56' name='this' is-artificial='yes'/>
                <!-- parameter of type 'const base::ElfMemImage::SymbolIterator&' -->
                <parameter type-id='type-id-54' name='rhs' filepath='src/base/elf_mem_image.cc' line='370' column='1'/>
                <!-- bool -->
                <return type-id='type-id-61'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- bool base::ElfMemImage::SymbolIterator::operator!=(const base::ElfMemImage::SymbolIterator&) -->
              <function-decl name='operator!=' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_' filepath='src/base/elf_mem_image.cc' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_'>
                <!-- implicit parameter of type 'const base::ElfMemImage::SymbolIterator* const' -->
                <parameter type-id='type-id-56' name='this' is-artificial='yes'/>
                <!-- parameter of type 'const base::ElfMemImage::SymbolIterator&' -->
                <parameter type-id='type-id-54' name='rhs' filepath='src/base/elf_mem_image.cc' line='370' column='1'/>
                <!-- bool -->
                <return type-id='type-id-61'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- void base::ElfMemImage::SymbolIterator::Update(int) -->
              <function-decl name='Update' mangled-name='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi' filepath='src/base/elf_mem_image.cc' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi'>
                <!-- implicit parameter of type 'base::ElfMemImage::SymbolIterator* const' -->
                <parameter type-id='type-id-31' name='this' is-artificial='yes'/>
                <!-- parameter of type 'int' -->
                <parameter type-id='type-id-1' name='increment' filepath='src/base/elf_mem_image.cc' line='393' column='1'/>
                <!-- void -->
                <return type-id='type-id-60'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- base::ElfMemImage::SymbolIterator& base::ElfMemImage::SymbolIterator::operator++() -->
              <function-decl name='operator++' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorppEv' filepath='src/base/elf_mem_image.cc' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorppEv'>
                <!-- implicit parameter of type 'base::ElfMemImage::SymbolIterator* const' -->
                <parameter type-id='type-id-31' name='this' is-artificial='yes'/>
                <!-- base::ElfMemImage::SymbolIterator& -->
                <return type-id='type-id-29'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <!-- static void* const base::ElfMemImage::kInvalidBase -->
          <var-decl name='kInvalidBase' type-id='type-id-59' mangled-name='_ZN4base11ElfMemImage12kInvalidBaseE' visibility='default' filepath='./src/base/elf_mem_image.h' line='59' column='1' elf-symbol-id='_ZN4base11ElfMemImage12kInvalidBaseE'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- const Elf64_Ehdr* base::ElfMemImage::ehdr_ -->
          <var-decl name='ehdr_' type-id='type-id-33' visibility='default' filepath='./src/base/elf_mem_image.h' line='120' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- const Elf64_Sym* base::ElfMemImage::dynsym_ -->
          <var-decl name='dynsym_' type-id='type-id-37' visibility='default' filepath='./src/base/elf_mem_image.h' line='121' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- const Elf64_Versym* base::ElfMemImage::versym_ -->
          <var-decl name='versym_' type-id='type-id-43' visibility='default' filepath='./src/base/elf_mem_image.h' line='122' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <!-- const Elf64_Verdef* base::ElfMemImage::verdef_ -->
          <var-decl name='verdef_' type-id='type-id-41' visibility='default' filepath='./src/base/elf_mem_image.h' line='123' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <!-- const Elf64_Word* base::ElfMemImage::hash_ -->
          <var-decl name='hash_' type-id='type-id-45' visibility='default' filepath='./src/base/elf_mem_image.h' line='124' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <!-- const char* base::ElfMemImage::dynstr_ -->
          <var-decl name='dynstr_' type-id='type-id-57' visibility='default' filepath='./src/base/elf_mem_image.h' line='125' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <!-- size_t base::ElfMemImage::strsize_ -->
          <var-decl name='strsize_' type-id='type-id-62' visibility='default' filepath='./src/base/elf_mem_image.h' line='126' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='448'>
          <!-- size_t base::ElfMemImage::verdefnum_ -->
          <var-decl name='verdefnum_' type-id='type-id-62' visibility='default' filepath='./src/base/elf_mem_image.h' line='127' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='512'>
          <!-- Elf64_Addr base::ElfMemImage::link_base_ -->
          <var-decl name='link_base_' type-id='type-id-10' visibility='default' filepath='./src/base/elf_mem_image.h' line='128' column='1'/>
        </data-member>
        <member-function access='private' constructor='yes'>
          <!-- base::ElfMemImage::ElfMemImage(void*) -->
          <function-decl name='ElfMemImage' mangled-name='_ZN4base11ElfMemImageC1EPKv' filepath='./src/base/elf_mem_image.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImageC1EPKv'>
            <!-- implicit parameter of type 'base::ElfMemImage*' -->
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-58'/>
            <!-- void -->
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- int base::ElfMemImage::GetNumSymbols() -->
          <function-decl name='GetNumSymbols' mangled-name='_ZNK4base11ElfMemImage13GetNumSymbolsEv' filepath='src/base/elf_mem_image.cc' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage13GetNumSymbolsEv'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- int -->
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Verdaux* base::ElfMemImage::GetVerdefAux(const Elf64_Verdef*) -->
          <function-decl name='GetVerdefAux' mangled-name='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' filepath='src/base/elf_mem_image.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- parameter of type 'const Elf64_Verdef*' -->
            <parameter type-id='type-id-41' name='verdef' filepath='src/base/elf_mem_image.cc' line='173' column='1'/>
            <!-- const Elf64_Verdaux* -->
            <return type-id='type-id-39'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- base::ElfMemImage::SymbolIterator base::ElfMemImage::end() -->
          <function-decl name='end' mangled-name='_ZNK4base11ElfMemImage3endEv' filepath='src/base/elf_mem_image.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage3endEv'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- class base::ElfMemImage::SymbolIterator -->
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const char* base::ElfMemImage::GetVerstr(Elf64_Word) -->
          <function-decl name='GetVerstr' mangled-name='_ZNK4base11ElfMemImage9GetVerstrEj' filepath='src/base/elf_mem_image.cc' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerstrEj'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- parameter of type 'typedef Elf64_Word' -->
            <parameter type-id='type-id-8' name='offset' filepath='src/base/elf_mem_image.cc' line='177' column='1'/>
            <!-- const char* -->
            <return type-id='type-id-57'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Verdef* base::ElfMemImage::GetVerdef(int) -->
          <function-decl name='GetVerdef' mangled-name='_ZNK4base11ElfMemImage9GetVerdefEi' filepath='src/base/elf_mem_image.cc' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerdefEi'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='159' column='1'/>
            <!-- const Elf64_Verdef* -->
            <return type-id='type-id-41'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void* base::ElfMemImage::GetSymAddr(const Elf64_Sym*) -->
          <function-decl name='GetSymAddr' mangled-name='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' filepath='src/base/elf_mem_image.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- parameter of type 'const Elf64_Sym*' -->
            <parameter type-id='type-id-37' name='sym' filepath='src/base/elf_mem_image.cc' line='150' column='1'/>
            <!-- void* -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const char* base::ElfMemImage::GetDynstr(Elf64_Word) -->
          <function-decl name='GetDynstr' mangled-name='_ZNK4base11ElfMemImage9GetDynstrEj' filepath='src/base/elf_mem_image.cc' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynstrEj'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- parameter of type 'typedef Elf64_Word' -->
            <parameter type-id='type-id-8' name='offset' filepath='src/base/elf_mem_image.cc' line='177' column='1'/>
            <!-- const char* -->
            <return type-id='type-id-57'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Phdr* base::ElfMemImage::GetPhdr(int) -->
          <function-decl name='GetPhdr' mangled-name='_ZNK4base11ElfMemImage7GetPhdrEi' filepath='src/base/elf_mem_image.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage7GetPhdrEi'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='137' column='1'/>
            <!-- const Elf64_Phdr* -->
            <return type-id='type-id-35'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void base::ElfMemImage::Init(void*) -->
          <function-decl name='Init' mangled-name='_ZN4base11ElfMemImage4InitEPKv' filepath='src/base/elf_mem_image.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage4InitEPKv'>
            <!-- implicit parameter of type 'base::ElfMemImage* const' -->
            <parameter type-id='type-id-25' name='this' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-58' name='base' filepath='src/base/elf_mem_image.cc' line='182' column='1'/>
            <!-- void -->
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Versym* base::ElfMemImage::GetVersym(int) -->
          <function-decl name='GetVersym' mangled-name='_ZNK4base11ElfMemImage9GetVersymEi' filepath='src/base/elf_mem_image.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVersymEi'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='132' column='1'/>
            <!-- const Elf64_Versym* -->
            <return type-id='type-id-43'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Sym* base::ElfMemImage::GetDynsym(int) -->
          <function-decl name='GetDynsym' mangled-name='_ZNK4base11ElfMemImage9GetDynsymEi' filepath='src/base/elf_mem_image.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynsymEi'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='127' column='1'/>
            <!-- const Elf64_Sym* -->
            <return type-id='type-id-37'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- base::ElfMemImage::SymbolIterator base::ElfMemImage::begin() -->
          <function-decl name='begin' mangled-name='_ZNK4base11ElfMemImage5beginEv' filepath='src/base/elf_mem_image.cc' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage5beginEv'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- class base::ElfMemImage::SymbolIterator -->
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool base::ElfMemImage::LookupSymbolByAddress(void*, base::ElfMemImage::SymbolInfo*) -->
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-58' name='address' filepath='src/base/elf_mem_image.cc' line='332' column='1'/>
            <!-- parameter of type 'base::ElfMemImage::SymbolInfo*' -->
            <parameter type-id='type-id-27' name='info_out' filepath='src/base/elf_mem_image.cc' line='333' column='1'/>
            <!-- bool -->
            <return type-id='type-id-61'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool base::ElfMemImage::LookupSymbol(const char*, const char*, int, base::ElfMemImage::SymbolInfo*) -->
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE'>
            <!-- implicit parameter of type 'const base::ElfMemImage* const' -->
            <parameter type-id='type-id-48' name='this' is-artificial='yes'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-57' name='name' filepath='src/base/elf_mem_image.cc' line='316' column='1'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-57' name='version' filepath='src/base/elf_mem_image.cc' line='317' column='1'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1' name='type' filepath='src/base/elf_mem_image.cc' line='318' column='1'/>
            <!-- parameter of type 'base::ElfMemImage::SymbolInfo*' -->
            <parameter type-id='type-id-27' name='info' filepath='src/base/elf_mem_image.cc' line='319' column='1'/>
            <!-- bool -->
            <return type-id='type-id-61'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <!-- bool -->
    <type-decl name='bool' size-in-bits='8' id='type-id-61'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-57'/>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='type-id-5' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='type-id-62'/>
    <!-- typedef unsigned int uint32_t -->
    <typedef-decl name='uint32_t' type-id='type-id-64' filepath='/usr/include/stdint.h' line='52' column='1' id='type-id-12'/>
    <!-- typedef unsigned long int uint64_t -->
    <typedef-decl name='uint64_t' type-id='type-id-5' filepath='/usr/include/stdint.h' line='56' column='1' id='type-id-15'/>
    <!-- unsigned char -->
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-3'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-5'/>
    <!-- unsigned short int -->
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-14'/>
    <!-- void -->
    <type-decl name='void' id='type-id-60'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-58'/>
    <!-- void* const -->
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-59'/>
    <!-- const char -->
    <qualified-type-def type-id='type-id-65' const='yes' id='type-id-63'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-64'/>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-65'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/linuxthreads.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- typedef int (void*, int, pid_t*, typedef __va_list_tag __va_list_tag*)* ListAllProcessThreadsCallBack -->
    <typedef-decl name='ListAllProcessThreadsCallBack' type-id='type-id-66' filepath='./src/base/thread_lister.h' line='48' column='1' id='type-id-67'/>
    <!-- typedef __pid_t pid_t -->
    <typedef-decl name='pid_t' type-id='type-id-68' filepath='/usr/include/sched.h' line='37' column='1' id='type-id-69'/>
    <!-- typedef int __pid_t -->
    <typedef-decl name='__pid_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='143' column='1' id='type-id-68'/>
    <!-- int (void*, int, pid_t*, typedef __va_list_tag __va_list_tag*)* -->
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-66'/>
    <!-- pid_t* -->
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-71'/>
    <!-- int TCMalloc_ListAllProcessThreads(void*, ListAllProcessThreadsCallBack, ...) -->
    <function-decl name='TCMalloc_ListAllProcessThreads' mangled-name='TCMalloc_ListAllProcessThreads' filepath='src/base/linuxthreads.cc' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ListAllProcessThreads'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-58' name='parameter' filepath='src/base/linuxthreads.cc' line='551' column='1'/>
      <!-- parameter of type 'typedef ListAllProcessThreadsCallBack' -->
      <parameter type-id='type-id-67' name='callback' filepath='src/base/linuxthreads.cc' line='552' column='1'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- int TCMalloc_ResumeAllProcessThreads(int, pid_t*) -->
    <function-decl name='TCMalloc_ResumeAllProcessThreads' mangled-name='TCMalloc_ResumeAllProcessThreads' filepath='src/base/linuxthreads.cc' line='696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ResumeAllProcessThreads'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1' name='num_threads' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <!-- parameter of type 'pid_t*' -->
      <parameter type-id='type-id-71' name='thread_pids' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- int (void*, int, pid_t*, typedef __va_list_tag __va_list_tag*) -->
    <function-type size-in-bits='64' id='type-id-70'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-58'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- parameter of type 'pid_t*' -->
      <parameter type-id='type-id-71'/>
      <!-- parameter of type 'typedef __va_list_tag __va_list_tag*' -->
      <parameter type-id='type-id-72'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-type>
    <!-- typedef __va_list_tag __va_list_tag* -->
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-72'/>
    <!-- struct typedef __va_list_tag __va_list_tag -->
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int typedef __va_list_tag __va_list_tag::gp_offset -->
        <var-decl name='gp_offset' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int typedef __va_list_tag __va_list_tag::fp_offset -->
        <var-decl name='fp_offset' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* typedef __va_list_tag __va_list_tag::overflow_arg_area -->
        <var-decl name='overflow_arg_area' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* typedef __va_list_tag __va_list_tag::reg_save_area -->
        <var-decl name='reg_save_area' type-id='type-id-58' visibility='default'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/logging.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- namespace FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead -->
    <namespace-decl name='FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead'>
      <!-- int32 FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead::FLAGS_verbose -->
      <var-decl name='FLAGS_verbose' type-id='type-id-74' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE' visibility='default' filepath='./src/base/logging.h' line='76' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE'/>
      <!-- char FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead::FLAGS_noverbose -->
      <var-decl name='FLAGS_noverbose' type-id='type-id-65' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE' visibility='default' filepath='src/base/logging.cc' line='40' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE'/>
    </namespace-decl>
    <!-- void RawClose(RawFD) -->
    <function-decl name='RawClose' mangled-name='_Z8RawClosei' filepath='src/base/logging.cc' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawClosei'>
      <!-- parameter of type 'typedef RawFD' -->
      <parameter type-id='type-id-75'/>
      <!-- void -->
      <return type-id='type-id-60'/>
    </function-decl>
    <!-- void RawWrite(RawFD, const char*, size_t) -->
    <function-decl name='RawWrite' mangled-name='_Z8RawWriteiPKcm' filepath='src/base/logging.cc' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawWriteiPKcm'>
      <!-- parameter of type 'typedef RawFD' -->
      <parameter type-id='type-id-75' name='fd' filepath='src/base/logging.cc' line='94' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-57' name='buf' filepath='src/base/logging.cc' line='94' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-62' name='len' filepath='src/base/logging.cc' line='94' column='1'/>
      <!-- void -->
      <return type-id='type-id-60'/>
    </function-decl>
    <!-- RawFD RawOpenForWriting(const char*) -->
    <function-decl name='RawOpenForWriting' mangled-name='_Z17RawOpenForWritingPKc' filepath='src/base/logging.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17RawOpenForWritingPKc'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-57' name='filename' filepath='src/base/logging.cc' line='90' column='1'/>
      <!-- typedef RawFD -->
      <return type-id='type-id-75'/>
    </function-decl>
    <!-- typedef int RawFD -->
    <typedef-decl name='RawFD' type-id='type-id-1' filepath='./src/base/logging.h' line='251' column='1' id='type-id-75'/>
    <!-- typedef int32_t int32 -->
    <typedef-decl name='int32' type-id='type-id-76' filepath='src/base/basictypes.h' line='60' column='1' id='type-id-74'/>
    <!-- typedef int int32_t -->
    <typedef-decl name='int32_t' type-id='type-id-1' filepath='/usr/include/stdint.h' line='39' column='1' id='type-id-76'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/low_level_alloc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- AllocList*[30] -->
    <array-type-def dimensions='1' type-id='type-id-77' size-in-bits='1920' id='type-id-78'>
      <!-- <anonymous range>[30] -->
      <subrange length='30' type-id='type-id-5' id='type-id-79'/>
    </array-type-def>
    <!-- low_level_alloc_internal::AllocList* -->
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-77'/>
    <!-- namespace low_level_alloc_internal -->
    <namespace-decl name='low_level_alloc_internal'>
      <!-- struct low_level_alloc_internal::AllocList -->
      <class-decl name='AllocList' size-in-bits='2240' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='67' column='1' id='type-id-80'>
        <member-type access='public'>
          <!-- struct low_level_alloc_internal::AllocList::Header -->
          <class-decl name='Header' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='68' column='1' id='type-id-81'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- intptr_t low_level_alloc_internal::AllocList::Header::size -->
              <var-decl name='size' type-id='type-id-82' visibility='default' filepath='src/base/low_level_alloc.cc' line='69' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- intptr_t low_level_alloc_internal::AllocList::Header::magic -->
              <var-decl name='magic' type-id='type-id-82' visibility='default' filepath='src/base/low_level_alloc.cc' line='71' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <!-- LowLevelAlloc::Arena* low_level_alloc_internal::AllocList::Header::arena -->
              <var-decl name='arena' type-id='type-id-83' visibility='default' filepath='src/base/low_level_alloc.cc' line='72' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <!-- void* low_level_alloc_internal::AllocList::Header::dummy_for_alignment -->
              <var-decl name='dummy_for_alignment' type-id='type-id-58' visibility='default' filepath='src/base/low_level_alloc.cc' line='73' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- low_level_alloc_internal::AllocList::Header low_level_alloc_internal::AllocList::header -->
          <var-decl name='header' type-id='type-id-81' visibility='default' filepath='src/base/low_level_alloc.cc' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <!-- int low_level_alloc_internal::AllocList::levels -->
          <var-decl name='levels' type-id='type-id-1' visibility='default' filepath='src/base/low_level_alloc.cc' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <!-- low_level_alloc_internal::AllocList* low_level_alloc_internal::AllocList::next[30] -->
          <var-decl name='next' type-id='type-id-78' visibility='default' filepath='src/base/low_level_alloc.cc' line='79' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <!-- LowLevelAlloc::Arena* -->
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-83'/>
    <!-- typedef long int intptr_t -->
    <typedef-decl name='intptr_t' type-id='type-id-85' filepath='/usr/include/stdint.h' line='120' column='1' id='type-id-82'/>
    <class-decl name='LowLevelAlloc' size-in-bits='8' visibility='default' filepath='src/base/low_level_alloc.h' line='44' column='1' id='type-id-86'>
      <member-type access='private'>
        <!-- struct LowLevelAlloc::Arena -->
        <class-decl name='Arena' size-in-bits='2560' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='184' column='1' id='type-id-84'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- SpinLock LowLevelAlloc::Arena::mu -->
            <var-decl name='mu' type-id='type-id-87' visibility='default' filepath='src/base/low_level_alloc.cc' line='189' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- low_level_alloc_internal::AllocList LowLevelAlloc::Arena::freelist -->
            <var-decl name='freelist' type-id='type-id-80' visibility='default' filepath='src/base/low_level_alloc.cc' line='191' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2304'>
            <!-- int32 LowLevelAlloc::Arena::allocation_count -->
            <var-decl name='allocation_count' type-id='type-id-74' visibility='default' filepath='src/base/low_level_alloc.cc' line='192' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2336'>
            <!-- int32 LowLevelAlloc::Arena::flags -->
            <var-decl name='flags' type-id='type-id-74' visibility='default' filepath='src/base/low_level_alloc.cc' line='193' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2368'>
            <!-- size_t LowLevelAlloc::Arena::pagesize -->
            <var-decl name='pagesize' type-id='type-id-62' visibility='default' filepath='src/base/low_level_alloc.cc' line='194' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2432'>
            <!-- size_t LowLevelAlloc::Arena::roundup -->
            <var-decl name='roundup' type-id='type-id-62' visibility='default' filepath='src/base/low_level_alloc.cc' line='195' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2496'>
            <!-- size_t LowLevelAlloc::Arena::min_size -->
            <var-decl name='min_size' type-id='type-id-62' visibility='default' filepath='src/base/low_level_alloc.cc' line='197' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <!-- LowLevelAlloc::Arena::Arena() -->
            <function-decl name='Arena' filepath='src/base/low_level_alloc.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'LowLevelAlloc::Arena*' -->
              <parameter type-id='type-id-83' is-artificial='yes'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <!-- LowLevelAlloc::Arena::Arena(int) -->
            <function-decl name='Arena' filepath='src/base/low_level_alloc.cc' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'LowLevelAlloc::Arena*' -->
              <parameter type-id='type-id-83' is-artificial='yes'/>
              <!-- parameter of type 'int' -->
              <parameter type-id='type-id-1'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
    </class-decl>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='type-id-85'/>
    <!-- class SpinLock -->
    <class-decl name='SpinLock' size-in-bits='32' visibility='default' filepath='./src/base/spinlock.h' line='48' column='1' id='type-id-87'>
      <member-type access='private'>
        <!-- enum SpinLock::__anonymous_enum__2 -->
        <enum-decl name='__anonymous_enum__2' is-anonymous='yes' filepath='./src/base/spinlock.h' line='116' column='1' id='type-id-88'>
          <underlying-type type-id='type-id-89'/>
          <enumerator name='kSpinLockSleeper' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <!-- enum SpinLock::__anonymous_enum__ -->
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='src/base/spinlock.h' line='114' column='1' id='type-id-90'>
          <underlying-type type-id='type-id-89'/>
          <enumerator name='kSpinLockFree' value='0'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <!-- enum SpinLock::__anonymous_enum__1 -->
        <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='src/base/spinlock.h' line='115' column='1' id='type-id-91'>
          <underlying-type type-id='type-id-89'/>
          <enumerator name='kSpinLockHeld' value='1'/>
        </enum-decl>
      </member-type>
      <data-member access='private' static='yes'>
        <!-- static const base::LinkerInitialized SpinLock::LINKER_INITIALIZED -->
        <var-decl name='LINKER_INITIALIZED' type-id='type-id-92' mangled-name='_ZN8SpinLock18LINKER_INITIALIZEDE' visibility='default' filepath='src/base/spinlock.h' line='112' column='1' elf-symbol-id='_ZN8SpinLock18LINKER_INITIALIZEDE'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- volatile Atomic32 SpinLock::lockword_ -->
        <var-decl name='lockword_' type-id='type-id-93' visibility='default' filepath='src/base/spinlock.h' line='118' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- SpinLock::SpinLock() -->
        <function-decl name='SpinLock' filepath='src/base/spinlock.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'SpinLock*' -->
          <parameter type-id='type-id-94' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- SpinLock::SpinLock(base::LinkerInitialized) -->
        <function-decl name='SpinLock' filepath='src/base/spinlock.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'SpinLock*' -->
          <parameter type-id='type-id-94' is-artificial='yes'/>
          <!-- parameter of type 'enum base::LinkerInitialized' -->
          <parameter type-id='type-id-95'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- SpinLock::SpinLock(const SpinLock&) -->
        <function-decl name='SpinLock' filepath='src/base/spinlock.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'SpinLock*' -->
          <parameter type-id='type-id-94' is-artificial='yes'/>
          <!-- parameter of type 'const SpinLock&' -->
          <parameter type-id='type-id-96'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- Atomic32 SpinLock::SpinLoop(int64, Atomic32*) -->
        <function-decl name='SpinLoop' mangled-name='_ZN8SpinLock8SpinLoopElPi' filepath='src/base/spinlock.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8SpinLock8SpinLoopElPi'>
          <!-- implicit parameter of type 'SpinLock* const' -->
          <parameter type-id='type-id-97' name='this' is-artificial='yes'/>
          <!-- parameter of type 'typedef int64' -->
          <parameter type-id='type-id-98' name='initial_wait_timestamp' filepath='src/base/spinlock.cc' line='82' column='1'/>
          <!-- parameter of type 'Atomic32*' -->
          <parameter type-id='type-id-99' name='wait_cycles' filepath='src/base/spinlock.cc' line='83' column='1'/>
          <!-- typedef Atomic32 -->
          <return type-id='type-id-100'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void SpinLock::SlowUnlock(uint64) -->
        <function-decl name='SlowUnlock' mangled-name='_ZN8SpinLock10SlowUnlockEm' filepath='src/base/spinlock.cc' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8SpinLock10SlowUnlockEm'>
          <!-- implicit parameter of type 'SpinLock* const' -->
          <parameter type-id='type-id-97' name='this' is-artificial='yes'/>
          <!-- parameter of type 'typedef uint64' -->
          <parameter type-id='type-id-101' name='wait_cycles' filepath='src/base/spinlock.cc' line='152' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void SpinLock::SlowLock() -->
        <function-decl name='SlowLock' mangled-name='_ZN8SpinLock8SlowLockEv' filepath='src/base/spinlock.cc' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8SpinLock8SlowLockEv'>
          <!-- implicit parameter of type 'SpinLock*' -->
          <parameter type-id='type-id-94' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- Atomic32* -->
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-99'/>
    <!-- SpinLock* -->
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-94'/>
    <!-- SpinLock* const -->
    <qualified-type-def type-id='type-id-94' const='yes' id='type-id-97'/>
    <!-- const SpinLock& -->
    <reference-type-def kind='lvalue' type-id='type-id-102' size-in-bits='64' id='type-id-96'/>
    <!-- const base::LinkerInitialized -->
    <qualified-type-def type-id='type-id-95' const='yes' id='type-id-92'/>
    <namespace-decl name='base'>
      <!-- enum base::LinkerInitialized -->
      <enum-decl name='LinkerInitialized' filepath='src/base/basictypes.h' line='381' column='1' id='type-id-95'>
        <underlying-type type-id='type-id-89'/>
        <enumerator name='LINKER_INITIALIZED' value='0'/>
      </enum-decl>
    </namespace-decl>
    <!-- typedef int32_t Atomic32 -->
    <typedef-decl name='Atomic32' type-id='type-id-76' filepath='./src/base/atomicops-internals-x86.h' line='43' column='1' id='type-id-100'/>
    <!-- typedef int64_t int64 -->
    <typedef-decl name='int64' type-id='type-id-103' filepath='src/base/basictypes.h' line='61' column='1' id='type-id-98'/>
    <!-- typedef uint64_t uint64 -->
    <typedef-decl name='uint64' type-id='type-id-15' filepath='src/base/basictypes.h' line='72' column='1' id='type-id-101'/>
    <!-- volatile Atomic32 -->
    <qualified-type-def type-id='type-id-100' volatile='yes' id='type-id-93'/>
    <!-- const SpinLock -->
    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-102'/>
    <!-- typedef long int int64_t -->
    <typedef-decl name='int64_t' type-id='type-id-85' filepath='/usr/include/stdint.h' line='41' column='1' id='type-id-103'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- struct CycleClock -->
    <class-decl name='CycleClock' size-in-bits='8' is-struct='yes' visibility='default' filepath='./src/base/cycleclock.h' line='79' column='1' id='type-id-104'/>
    <!-- namespace base -->
    <namespace-decl name='base'>
      <!-- void base::SubmitSpinLockProfileData(void*, int64) -->
      <function-decl name='SubmitSpinLockProfileData' mangled-name='_ZN4base25SubmitSpinLockProfileDataEPKvl' filepath='./src/base/synchronization_profiling.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base25SubmitSpinLockProfileDataEPKvl'>
        <!-- parameter of type 'void*' -->
        <parameter type-id='type-id-58'/>
        <!-- parameter of type 'typedef int64' -->
        <parameter type-id='type-id-98'/>
        <!-- void -->
        <return type-id='type-id-60'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock_internal.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- const base::internal::SpinLockWaitTransition -->
    <qualified-type-def type-id='type-id-105' const='yes' id='type-id-106'/>
    <!-- const base::internal::SpinLockWaitTransition* -->
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-107'/>
    <!-- namespace base -->
    <namespace-decl name='base'>
      <!-- namespace base::internal -->
      <namespace-decl name='internal'>
        <!-- struct base::internal::SpinLockWaitTransition -->
        <class-decl name='SpinLockWaitTransition' size-in-bits='96' is-struct='yes' visibility='default' filepath='./src/base/spinlock_internal.h' line='48' column='1' id='type-id-105'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- int32 base::internal::SpinLockWaitTransition::from -->
            <var-decl name='from' type-id='type-id-74' visibility='default' filepath='./src/base/spinlock_internal.h' line='49' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <!-- int32 base::internal::SpinLockWaitTransition::to -->
            <var-decl name='to' type-id='type-id-74' visibility='default' filepath='./src/base/spinlock_internal.h' line='50' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- bool base::internal::SpinLockWaitTransition::done -->
            <var-decl name='done' type-id='type-id-61' visibility='default' filepath='./src/base/spinlock_internal.h' line='51' column='1'/>
          </data-member>
        </class-decl>
        <!-- void base::internal::SpinLockWake(volatile Atomic32*, bool) -->
        <function-decl name='SpinLockWake' mangled-name='_ZN4base8internal12SpinLockWakeEPVib' filepath='./src/base/spinlock_linux-inl.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWakeEPVib'>
          <!-- parameter of type 'volatile Atomic32*' -->
          <parameter type-id='type-id-108'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-61'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
        <!-- void base::internal::SpinLockDelay(volatile Atomic32*, int32, int) -->
        <function-decl name='SpinLockDelay' mangled-name='_ZN4base8internal13SpinLockDelayEPViii' filepath='./src/base/spinlock_linux-inl.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal13SpinLockDelayEPViii'>
          <!-- parameter of type 'volatile Atomic32*' -->
          <parameter type-id='type-id-108'/>
          <!-- parameter of type 'typedef int32' -->
          <parameter type-id='type-id-74'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
        <!-- int32 base::internal::SpinLockWait(volatile Atomic32*, int, const base::internal::SpinLockWaitTransition*) -->
        <function-decl name='SpinLockWait' mangled-name='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE' filepath='src/base/spinlock_internal.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE'>
          <!-- parameter of type 'volatile Atomic32*' -->
          <parameter type-id='type-id-108'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'const base::internal::SpinLockWaitTransition*' -->
          <parameter type-id='type-id-107'/>
          <!-- typedef int32 -->
          <return type-id='type-id-74'/>
        </function-decl>
      </namespace-decl>
      <!-- namespace base::subtle -->
      <namespace-decl name='subtle'>
        <!-- Atomic32 base::subtle::Acquire_Load(const volatile Atomic32*) -->
        <function-decl name='Acquire_Load' filepath='./src/base/atomicops-internals-x86.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'const volatile Atomic32*' -->
          <parameter type-id='type-id-109'/>
          <!-- typedef Atomic32 -->
          <return type-id='type-id-100'/>
        </function-decl>
      </namespace-decl>
    </namespace-decl>
    <!-- const volatile Atomic32* -->
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-109'/>
    <!-- volatile Atomic32* -->
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-108'/>
    <!-- const volatile Atomic32 -->
    <qualified-type-def type-id='type-id-93' const='yes' id='type-id-110'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/sysinfo.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- char[10] -->
    <array-type-def dimensions='1' type-id='type-id-65' size-in-bits='80' id='type-id-111'>
      <!-- <anonymous range>[10] -->
      <subrange length='10' type-id='type-id-5' id='type-id-112'/>
    </array-type-def>
    <!-- char[5120] -->
    <array-type-def dimensions='1' type-id='type-id-65' size-in-bits='40960' id='type-id-113'>
      <!-- <anonymous range>[5120] -->
      <subrange length='5120' type-id='type-id-5' id='type-id-114'/>
    </array-type-def>
    <!-- class ProcMapsIterator -->
    <class-decl name='ProcMapsIterator' size-in-bits='640' visibility='default' filepath='./src/base/sysinfo.h' line='102' column='1' id='type-id-115'>
      <member-type access='private'>
        <!-- struct ProcMapsIterator::Buffer -->
        <class-decl name='Buffer' size-in-bits='40960' is-struct='yes' visibility='default' filepath='./src/base/sysinfo.h' line='104' column='1' id='type-id-116'>
          <data-member access='public' static='yes'>
            <!-- static const size_t ProcMapsIterator::Buffer::kBufSize -->
            <var-decl name='kBufSize' type-id='type-id-117' visibility='default' filepath='./src/base/sysinfo.h' line='110' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- char ProcMapsIterator::Buffer::buf_[5120] -->
            <var-decl name='buf_' type-id='type-id-113' visibility='default' filepath='./src/base/sysinfo.h' line='112' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- char* ProcMapsIterator::ibuf_ -->
        <var-decl name='ibuf_' type-id='type-id-118' visibility='default' filepath='./src/base/sysinfo.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- char* ProcMapsIterator::stext_ -->
        <var-decl name='stext_' type-id='type-id-118' visibility='default' filepath='./src/base/sysinfo.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- char* ProcMapsIterator::etext_ -->
        <var-decl name='etext_' type-id='type-id-118' visibility='default' filepath='./src/base/sysinfo.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- char* ProcMapsIterator::nextline_ -->
        <var-decl name='nextline_' type-id='type-id-118' visibility='default' filepath='./src/base/sysinfo.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- char* ProcMapsIterator::ebuf_ -->
        <var-decl name='ebuf_' type-id='type-id-118' visibility='default' filepath='./src/base/sysinfo.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <!-- int ProcMapsIterator::fd_ -->
        <var-decl name='fd_' type-id='type-id-1' visibility='default' filepath='./src/base/sysinfo.h' line='219' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <!-- pid_t ProcMapsIterator::pid_ -->
        <var-decl name='pid_' type-id='type-id-69' visibility='default' filepath='./src/base/sysinfo.h' line='221' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <!-- char ProcMapsIterator::flags_[10] -->
        <var-decl name='flags_' type-id='type-id-111' visibility='default' filepath='./src/base/sysinfo.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <!-- ProcMapsIterator::Buffer* ProcMapsIterator::dynamic_buffer_ -->
        <var-decl name='dynamic_buffer_' type-id='type-id-119' visibility='default' filepath='./src/base/sysinfo.h' line='223' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- bool ProcMapsIterator::using_maps_backing_ -->
        <var-decl name='using_maps_backing_' type-id='type-id-61' visibility='default' filepath='./src/base/sysinfo.h' line='224' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- ProcMapsIterator::ProcMapsIterator(pid_t) -->
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1Ei' filepath='./src/base/sysinfo.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1Ei'>
          <!-- implicit parameter of type 'ProcMapsIterator*' -->
          <parameter type-id='type-id-120' is-artificial='yes'/>
          <!-- parameter of type 'typedef pid_t' -->
          <parameter type-id='type-id-69'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- ProcMapsIterator::ProcMapsIterator(pid_t, ProcMapsIterator::Buffer*) -->
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC2EiPNS_6BufferE' filepath='./src/base/sysinfo.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC2EiPNS_6BufferE'>
          <!-- implicit parameter of type 'ProcMapsIterator*' -->
          <parameter type-id='type-id-120' is-artificial='yes'/>
          <!-- parameter of type 'typedef pid_t' -->
          <parameter type-id='type-id-69'/>
          <!-- parameter of type 'ProcMapsIterator::Buffer*' -->
          <parameter type-id='type-id-119'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- ProcMapsIterator::ProcMapsIterator(pid_t, ProcMapsIterator::Buffer*, bool) -->
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb' filepath='./src/base/sysinfo.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb'>
          <!-- implicit parameter of type 'ProcMapsIterator*' -->
          <parameter type-id='type-id-120' is-artificial='yes'/>
          <!-- parameter of type 'typedef pid_t' -->
          <parameter type-id='type-id-69'/>
          <!-- parameter of type 'ProcMapsIterator::Buffer*' -->
          <parameter type-id='type-id-119'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-61'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- ProcMapsIterator::~ProcMapsIterator(int) -->
        <function-decl name='~ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorD1Ev' filepath='./src/base/sysinfo.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorD1Ev'>
          <!-- implicit parameter of type 'ProcMapsIterator*' -->
          <parameter type-id='type-id-120' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool ProcMapsIterator::Valid() -->
        <function-decl name='Valid' mangled-name='_ZNK16ProcMapsIterator5ValidEv' filepath='src/base/sysinfo.cc' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16ProcMapsIterator5ValidEv'>
          <!-- implicit parameter of type 'const ProcMapsIterator* const' -->
          <parameter type-id='type-id-121' name='this' is-artificial='yes'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- int ProcMapsIterator::FormatLine(int, uint64, uint64, const char*, uint64, int64, const char*, dev_t) -->
        <function-decl name='FormatLine' mangled-name='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m' filepath='src/base/sysinfo.cc' line='1084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m'>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-118'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef uint64' -->
          <parameter type-id='type-id-101'/>
          <!-- parameter of type 'typedef uint64' -->
          <parameter type-id='type-id-101'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57'/>
          <!-- parameter of type 'typedef uint64' -->
          <parameter type-id='type-id-101'/>
          <!-- parameter of type 'typedef int64' -->
          <parameter type-id='type-id-98'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57'/>
          <!-- parameter of type 'typedef dev_t' -->
          <parameter type-id='type-id-122'/>
          <!-- int -->
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void ProcMapsIterator::Init(pid_t, ProcMapsIterator::Buffer*, bool) -->
        <function-decl name='Init' mangled-name='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb' filepath='src/base/sysinfo.cc' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb'>
          <!-- implicit parameter of type 'ProcMapsIterator* const' -->
          <parameter type-id='type-id-123' name='this' is-artificial='yes'/>
          <!-- parameter of type 'typedef pid_t' -->
          <parameter type-id='type-id-69' name='pid' filepath='src/base/sysinfo.cc' line='741' column='1'/>
          <!-- parameter of type 'ProcMapsIterator::Buffer*' -->
          <parameter type-id='type-id-119' name='buffer' filepath='src/base/sysinfo.cc' line='741' column='1'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-61' name='use_maps_backing' filepath='src/base/sysinfo.cc' line='742' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool ProcMapsIterator::NextExt(uint64*, uint64*, char**, uint64*, int64*, char**, uint64*, uint64*, uint64*, uint64*, dev_t*) -->
        <function-decl name='NextExt' mangled-name='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_' filepath='src/base/sysinfo.cc' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_'>
          <!-- implicit parameter of type 'ProcMapsIterator* const' -->
          <parameter type-id='type-id-123' name='this' is-artificial='yes'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-124' name='start' filepath='src/base/sysinfo.cc' line='834' column='1'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-124' name='end' filepath='src/base/sysinfo.cc' line='834' column='1'/>
          <!-- parameter of type 'char**' -->
          <parameter type-id='type-id-125' name='flags' filepath='src/base/sysinfo.cc' line='834' column='1'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-124' name='offset' filepath='src/base/sysinfo.cc' line='835' column='1'/>
          <!-- parameter of type 'int64*' -->
          <parameter type-id='type-id-126' name='inode' filepath='src/base/sysinfo.cc' line='835' column='1'/>
          <!-- parameter of type 'char**' -->
          <parameter type-id='type-id-125' name='filename' filepath='src/base/sysinfo.cc' line='835' column='1'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-124' name='file_mapping' filepath='src/base/sysinfo.cc' line='836' column='1'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-124' name='file_pages' filepath='src/base/sysinfo.cc' line='836' column='1'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-124' name='anon_mapping' filepath='src/base/sysinfo.cc' line='837' column='1'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-124' name='anon_pages' filepath='src/base/sysinfo.cc' line='837' column='1'/>
          <!-- parameter of type 'dev_t*' -->
          <parameter type-id='type-id-127' name='dev' filepath='src/base/sysinfo.cc' line='838' column='1'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool ProcMapsIterator::Next(uint64*, uint64*, char**, uint64*, int64*, char**) -->
        <function-decl name='Next' mangled-name='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_' filepath='src/base/sysinfo.cc' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_'>
          <!-- implicit parameter of type 'ProcMapsIterator* const' -->
          <parameter type-id='type-id-123' name='this' is-artificial='yes'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-124' name='start' filepath='src/base/sysinfo.cc' line='825' column='1'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-124' name='end' filepath='src/base/sysinfo.cc' line='825' column='1'/>
          <!-- parameter of type 'char**' -->
          <parameter type-id='type-id-125' name='flags' filepath='src/base/sysinfo.cc' line='825' column='1'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-124' name='offset' filepath='src/base/sysinfo.cc' line='826' column='1'/>
          <!-- parameter of type 'int64*' -->
          <parameter type-id='type-id-126' name='inode' filepath='src/base/sysinfo.cc' line='826' column='1'/>
          <!-- parameter of type 'char**' -->
          <parameter type-id='type-id-125' name='filename' filepath='src/base/sysinfo.cc' line='826' column='1'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- typedef __dev_t dev_t -->
    <typedef-decl name='dev_t' type-id='type-id-128' filepath='/usr/include/sys/types.h' line='61' column='1' id='type-id-122'/>
    <!-- typedef unsigned long int __dev_t -->
    <typedef-decl name='__dev_t' type-id='type-id-5' filepath='/usr/include/bits/types.h' line='134' column='1' id='type-id-128'/>
    <!-- ProcMapsIterator* -->
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-120'/>
    <!-- ProcMapsIterator* const -->
    <qualified-type-def type-id='type-id-120' const='yes' id='type-id-123'/>
    <!-- ProcMapsIterator::Buffer* -->
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-119'/>
    <!-- const ProcMapsIterator -->
    <qualified-type-def type-id='type-id-115' const='yes' id='type-id-129'/>
    <!-- const ProcMapsIterator* -->
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <!-- const ProcMapsIterator* const -->
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-121'/>
    <!-- dev_t* -->
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-127'/>
    <!-- int64* -->
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-126'/>
    <!-- uint64* -->
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-124'/>
    <!-- bool HasPosixThreads() -->
    <function-decl name='HasPosixThreads' mangled-name='_Z15HasPosixThreadsv' filepath='src/base/sysinfo.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15HasPosixThreadsv'>
      <!-- bool -->
      <return type-id='type-id-61'/>
    </function-decl>
    <!-- void SleepForMilliseconds(int) -->
    <function-decl name='SleepForMilliseconds' mangled-name='_Z20SleepForMillisecondsi' filepath='src/base/sysinfo.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20SleepForMillisecondsi'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1' name='milliseconds' filepath='src/base/sysinfo.cc' line='226' column='1'/>
      <!-- void -->
      <return type-id='type-id-60'/>
    </function-decl>
    <!-- int NumCPUs() -->
    <function-decl name='NumCPUs' mangled-name='_Z7NumCPUsv' filepath='src/base/sysinfo.cc' line='505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z7NumCPUsv'>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- double CyclesPerSecond() -->
    <function-decl name='CyclesPerSecond' mangled-name='_Z15CyclesPerSecondv' filepath='src/base/sysinfo.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15CyclesPerSecondv'>
      <!-- double -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- bool GetUniquePathFromEnv(const char*, char*) -->
    <function-decl name='GetUniquePathFromEnv' mangled-name='_Z20GetUniquePathFromEnvPKcPc' filepath='src/base/sysinfo.cc' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20GetUniquePathFromEnvPKcPc'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-57' name='env_name' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-118' name='path' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <!-- bool -->
      <return type-id='type-id-61'/>
    </function-decl>
    <!-- const char* GetenvBeforeMain(const char*) -->
    <function-decl name='GetenvBeforeMain' mangled-name='_Z16GetenvBeforeMainPKc' filepath='src/base/sysinfo.cc' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16GetenvBeforeMainPKc'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-57' name='name' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-57'/>
    </function-decl>
    <!-- const char* TCMallocGetenvSafe(const char*) -->
    <function-decl name='TCMallocGetenvSafe' mangled-name='TCMallocGetenvSafe' filepath='src/base/sysinfo.cc' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMallocGetenvSafe'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-57' name='name' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-57'/>
    </function-decl>
    <!-- namespace tcmalloc -->
    <namespace-decl name='tcmalloc'>
      <!-- void tcmalloc::DumpProcSelfMaps(RawFD) -->
      <function-decl name='DumpProcSelfMaps' mangled-name='_ZN8tcmalloc16DumpProcSelfMapsEi' filepath='src/base/sysinfo.cc' line='1137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16DumpProcSelfMapsEi'>
        <!-- parameter of type 'typedef RawFD' -->
        <parameter type-id='type-id-75'/>
        <!-- void -->
        <return type-id='type-id-60'/>
      </function-decl>
      <!-- int tcmalloc::FillProcSelfMaps(char*, int, bool*) -->
      <function-decl name='FillProcSelfMaps' mangled-name='_ZN8tcmalloc16FillProcSelfMapsEPciPb' filepath='src/base/sysinfo.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16FillProcSelfMapsEPciPb'>
        <!-- parameter of type 'char*' -->
        <parameter type-id='type-id-118'/>
        <!-- parameter of type 'int' -->
        <parameter type-id='type-id-1'/>
        <!-- parameter of type 'bool*' -->
        <parameter type-id='type-id-131'/>
        <!-- int -->
        <return type-id='type-id-1'/>
      </function-decl>
    </namespace-decl>
    <!-- bool* -->
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-131'/>
    <!-- char* -->
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-118'/>
    <!-- char** -->
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-125'/>
    <!-- const size_t -->
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-117'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/vdso_support.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- base::VDSOInitHelper* -->
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-133'/>
    <!-- base::VDSOSupport* -->
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-135'/>
    <!-- base::VDSOSupport* const -->
    <qualified-type-def type-id='type-id-135' const='yes' id='type-id-136'/>
    <!-- base::VDSOSupport::SymbolInfo* -->
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
    <!-- const base::VDSOSupport -->
    <qualified-type-def type-id='type-id-134' const='yes' id='type-id-139'/>
    <!-- const base::VDSOSupport& -->
    <reference-type-def kind='lvalue' type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <!-- const base::VDSOSupport* -->
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-141'/>
    <!-- const base::VDSOSupport* const -->
    <qualified-type-def type-id='type-id-141' const='yes' id='type-id-142'/>
    <!-- namespace base -->
    <namespace-decl name='base'>
      <!-- class base::VDSOInitHelper -->
      <class-decl name='VDSOInitHelper' size-in-bits='8' visibility='default' filepath='src/base/vdso_support.cc' line='137' column='1' id='type-id-132'>
        <member-function access='private' constructor='yes'>
          <!-- base::VDSOInitHelper::VDSOInitHelper() -->
          <function-decl name='VDSOInitHelper' filepath='src/base/vdso_support.cc' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'base::VDSOInitHelper*' -->
            <parameter type-id='type-id-133' is-artificial='yes'/>
            <!-- void -->
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class base::VDSOSupport -->
      <class-decl name='VDSOSupport' size-in-bits='576' visibility='default' filepath='./src/base/vdso_support.h' line='72' column='1' id='type-id-134'>
        <member-type access='private'>
          <!-- typedef base::ElfMemImage::SymbolInfo base::VDSOSupport::SymbolInfo -->
          <typedef-decl name='SymbolInfo' type-id='type-id-26' filepath='./src/base/vdso_support.h' line='76' column='1' id='type-id-137'/>
        </member-type>
        <member-type access='private'>
          <!-- typedef base::ElfMemImage::SymbolIterator base::VDSOSupport::SymbolIterator -->
          <typedef-decl name='SymbolIterator' type-id='type-id-28' filepath='./src/base/vdso_support.h' line='77' column='1' id='type-id-143'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- base::ElfMemImage base::VDSOSupport::image_ -->
          <var-decl name='image_' type-id='type-id-23' visibility='default' filepath='./src/base/vdso_support.h' line='112' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <!-- static void* base::VDSOSupport::vdso_base_ -->
          <var-decl name='vdso_base_' type-id='type-id-58' mangled-name='_ZN4base11VDSOSupport10vdso_base_E' visibility='default' filepath='./src/base/vdso_support.h' line='123' column='1' elf-symbol-id='_ZN4base11VDSOSupport10vdso_base_E'/>
        </data-member>
        <member-function access='private' constructor='yes'>
          <!-- base::VDSOSupport::VDSOSupport() -->
          <function-decl name='VDSOSupport' mangled-name='_ZN4base11VDSOSupportC1Ev' filepath='./src/base/vdso_support.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupportC1Ev'>
            <!-- implicit parameter of type 'base::VDSOSupport*' -->
            <parameter type-id='type-id-135' is-artificial='yes'/>
            <!-- void -->
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <!-- base::VDSOSupport::VDSOSupport(const base::VDSOSupport&) -->
          <function-decl name='VDSOSupport' filepath='./src/base/vdso_support.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'base::VDSOSupport*' -->
            <parameter type-id='type-id-135' is-artificial='yes'/>
            <!-- parameter of type 'const base::VDSOSupport&' -->
            <parameter type-id='type-id-140'/>
            <!-- void -->
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool base::VDSOSupport::LookupSymbolByAddress(void*, base::VDSOSupport::SymbolInfo*) -->
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE' filepath='src/base/vdso_support.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE'>
            <!-- implicit parameter of type 'const base::VDSOSupport* const' -->
            <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-58' name='address' filepath='src/base/vdso_support.cc' line='124' column='1'/>
            <!-- parameter of type 'base::VDSOSupport::SymbolInfo*' -->
            <parameter type-id='type-id-138' name='info_out' filepath='src/base/vdso_support.cc' line='125' column='1'/>
            <!-- bool -->
            <return type-id='type-id-61'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool base::VDSOSupport::LookupSymbol(const char*, const char*, int, base::VDSOSupport::SymbolInfo*) -->
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE' filepath='src/base/vdso_support.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE'>
            <!-- implicit parameter of type 'const base::VDSOSupport* const' -->
            <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-57' name='name' filepath='src/base/vdso_support.cc' line='117' column='1'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-57' name='version' filepath='src/base/vdso_support.cc' line='118' column='1'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1' name='type' filepath='src/base/vdso_support.cc' line='119' column='1'/>
            <!-- parameter of type 'base::VDSOSupport::SymbolInfo*' -->
            <parameter type-id='type-id-138' name='info' filepath='src/base/vdso_support.cc' line='120' column='1'/>
            <!-- bool -->
            <return type-id='type-id-61'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void* base::VDSOSupport::SetBase(void*) -->
          <function-decl name='SetBase' mangled-name='_ZN4base11VDSOSupport7SetBaseEPKv' filepath='src/base/vdso_support.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport7SetBaseEPKv'>
            <!-- implicit parameter of type 'base::VDSOSupport* const' -->
            <parameter type-id='type-id-136' name='this' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-58' name='base' filepath='src/base/vdso_support.cc' line='109' column='1'/>
            <!-- void* -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <!-- void* base::VDSOSupport::Init() -->
          <function-decl name='Init' mangled-name='_ZN4base11VDSOSupport4InitEv' filepath='src/base/vdso_support.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport4InitEv'>
            <!-- void* -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/central_freelist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- const int& -->
    <reference-type-def kind='lvalue' type-id='type-id-144' size-in-bits='64' id='type-id-145'/>
    <!-- const int32_t -->
    <qualified-type-def type-id='type-id-76' const='yes' id='type-id-146'/>
    <!-- const int32_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-146' size-in-bits='64' id='type-id-147'/>
    <!-- const tcmalloc::Span -->
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-149'/>
    <!-- const tcmalloc::Span* -->
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-150'/>
    <!-- namespace std -->
    <namespace-decl name='std'>
      <!-- const int& std::max<int>(const int&, const int&) -->
      <function-decl name='max&lt;int&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'const int&' -->
        <parameter type-id='type-id-145'/>
        <!-- parameter of type 'const int&' -->
        <parameter type-id='type-id-145'/>
        <!-- const int& -->
        <return type-id='type-id-145'/>
      </function-decl>
      <!-- const int32_t& std::min<int32_t>(const int32_t&, const int32_t&) -->
      <function-decl name='min&lt;int32_t&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'const int32_t&' -->
        <parameter type-id='type-id-147'/>
        <!-- parameter of type 'const int32_t&' -->
        <parameter type-id='type-id-147'/>
        <!-- const int32_t& -->
        <return type-id='type-id-147'/>
      </function-decl>
    </namespace-decl>
    <!-- namespace tcmalloc -->
    <namespace-decl name='tcmalloc'>
      <!-- bool tcmalloc::DLL_IsEmpty(const tcmalloc::Span*) -->
      <function-decl name='DLL_IsEmpty' filepath='src/span.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'const tcmalloc::Span*' -->
        <parameter type-id='type-id-150'/>
        <!-- bool -->
        <return type-id='type-id-61'/>
      </function-decl>
      <!-- void tcmalloc::SLL_PushRange(void**, void*, void*) -->
      <function-decl name='SLL_PushRange' filepath='src/linked_list.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'void**' -->
        <parameter type-id='type-id-151'/>
        <!-- parameter of type 'void*' -->
        <parameter type-id='type-id-58'/>
        <!-- parameter of type 'void*' -->
        <parameter type-id='type-id-58'/>
        <!-- void -->
        <return type-id='type-id-60'/>
      </function-decl>
    </namespace-decl>
    <namespace-decl name='tcmalloc'>
      <!-- struct tcmalloc::Span -->
      <class-decl name='Span' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/span.h' line='45' column='1' id='type-id-148'>
        <member-type access='public'>
          <!-- enum tcmalloc::Span::__anonymous_enum__ -->
          <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='src/span.h' line='65' column='1' id='type-id-152'>
            <underlying-type type-id='type-id-89'/>
            <enumerator name='IN_USE' value='0'/>
            <enumerator name='ON_NORMAL_FREELIST' value='1'/>
            <enumerator name='ON_RETURNED_FREELIST' value='2'/>
          </enum-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- PageID tcmalloc::Span::start -->
          <var-decl name='start' type-id='type-id-153' visibility='default' filepath='src/span.h' line='46' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- Length tcmalloc::Span::length -->
          <var-decl name='length' type-id='type-id-154' visibility='default' filepath='src/span.h' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- tcmalloc::Span* tcmalloc::Span::next -->
          <var-decl name='next' type-id='type-id-155' visibility='default' filepath='src/span.h' line='48' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <!-- tcmalloc::Span* tcmalloc::Span::prev -->
          <var-decl name='prev' type-id='type-id-155' visibility='default' filepath='src/span.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <!-- void* tcmalloc::Span::objects -->
          <var-decl name='objects' type-id='type-id-58' visibility='default' filepath='src/span.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- unsigned int tcmalloc::Span::refcount -->
          <var-decl name='refcount' type-id='type-id-64' visibility='default' filepath='src/span.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <!-- unsigned int tcmalloc::Span::sizeclass -->
          <var-decl name='sizeclass' type-id='type-id-64' visibility='default' filepath='src/span.h' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <!-- unsigned int tcmalloc::Span::location -->
          <var-decl name='location' type-id='type-id-64' visibility='default' filepath='src/span.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26'>
          <!-- unsigned int tcmalloc::Span::sample -->
          <var-decl name='sample' type-id='type-id-64' visibility='default' filepath='src/span.h' line='54' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <!-- const int -->
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-144'/>
    <!-- void** -->
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-151'/>
    <!-- tcmalloc::Span* -->
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-155'/>
    <!-- typedef uintptr_t Length -->
    <typedef-decl name='Length' type-id='type-id-156' filepath='src/common.h' line='59' column='1' id='type-id-154'/>
    <!-- typedef uintptr_t PageID -->
    <typedef-decl name='PageID' type-id='type-id-156' filepath='src/common.h' line='56' column='1' id='type-id-153'/>
    <!-- typedef unsigned long int uintptr_t -->
    <typedef-decl name='uintptr_t' type-id='type-id-5' filepath='/usr/include/stdint.h' line='123' column='1' id='type-id-156'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- namespace tcmalloc -->
    <namespace-decl name='tcmalloc'>
      <!-- uint64_t tcmalloc::metadata_system_bytes() -->
      <function-decl name='metadata_system_bytes' mangled-name='_ZN8tcmalloc21metadata_system_bytesEv' filepath='src/common.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc21metadata_system_bytesEv'>
        <!-- typedef uint64_t -->
        <return type-id='type-id-15'/>
      </function-decl>
      <!-- void* tcmalloc::MetaDataAlloc(size_t) -->
      <function-decl name='MetaDataAlloc' mangled-name='_ZN8tcmalloc13MetaDataAllocEm' filepath='src/common.cc' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc13MetaDataAllocEm'>
        <!-- parameter of type 'typedef size_t' -->
        <parameter type-id='type-id-62'/>
        <!-- void* -->
        <return type-id='type-id-58'/>
      </function-decl>
      <!-- int tcmalloc::AlignmentForSize(size_t) -->
      <function-decl name='AlignmentForSize' mangled-name='_ZN8tcmalloc16AlignmentForSizeEm' filepath='src/common.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16AlignmentForSizeEm'>
        <!-- parameter of type 'typedef size_t' -->
        <parameter type-id='type-id-62'/>
        <!-- int -->
        <return type-id='type-id-1'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker-bcad.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- class HeapLeakCheckerGlobalPrePost -->
    <class-decl name='HeapLeakCheckerGlobalPrePost' size-in-bits='8' visibility='default' filepath='src/heap-checker-bcad.cc' line='60' column='1' id='type-id-157'>
      <data-member access='private' static='yes'>
        <!-- static int HeapLeakCheckerGlobalPrePost::count_ -->
        <var-decl name='count_' type-id='type-id-1' mangled-name='_ZN28HeapLeakCheckerGlobalPrePost6count_E' visibility='default' filepath='src/heap-checker-bcad.cc' line='87' column='1' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePost6count_E'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- HeapLeakCheckerGlobalPrePost::HeapLeakCheckerGlobalPrePost() -->
        <function-decl name='HeapLeakCheckerGlobalPrePost' filepath='src/heap-checker-bcad.cc' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'HeapLeakCheckerGlobalPrePost*' -->
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- HeapLeakCheckerGlobalPrePost::~HeapLeakCheckerGlobalPrePost(int) -->
        <function-decl name='~HeapLeakCheckerGlobalPrePost' mangled-name='_ZN28HeapLeakCheckerGlobalPrePostD1Ev' filepath='src/heap-checker-bcad.cc' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePostD1Ev'>
          <!-- implicit parameter of type 'HeapLeakCheckerGlobalPrePost*' -->
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- HeapLeakCheckerGlobalPrePost* -->
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <!-- bool heap_leak_checker_bcad_variable -->
    <var-decl name='heap_leak_checker_bcad_variable' type-id='type-id-61' mangled-name='heap_leak_checker_bcad_variable' visibility='default' filepath='src/heap-checker-bcad.cc' line='53' column='1' elf-symbol-id='heap_leak_checker_bcad_variable'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- char[] -->
    <array-type-def dimensions='1' type-id='type-id-65' size-in-bits='infinite' id='type-id-159'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' id='type-id-160'/>
    </array-type-def>
    <!-- size_t[4] -->
    <array-type-def dimensions='1' type-id='type-id-62' size-in-bits='256' id='type-id-161'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='type-id-5' id='type-id-162'/>
    </array-type-def>
    <!-- void*[32] -->
    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='2048' id='type-id-163'>
      <!-- <anonymous range>[32] -->
      <subrange length='32' type-id='type-id-5' id='type-id-164'/>
    </array-type-def>
    <!-- struct AllocObject -->
    <class-decl name='AllocObject' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='356' column='1' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* AllocObject::ptr -->
        <var-decl name='ptr' type-id='type-id-58' visibility='default' filepath='src/heap-checker.cc' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uintptr_t AllocObject::size -->
        <var-decl name='size' type-id='type-id-156' visibility='default' filepath='src/heap-checker.cc' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- ObjectPlacement AllocObject::place -->
        <var-decl name='place' type-id='type-id-166' visibility='default' filepath='src/heap-checker.cc' line='359' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- AllocObject::AllocObject(void*, size_t, ObjectPlacement) -->
        <function-decl name='AllocObject' filepath='src/heap-checker.cc' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'AllocObject*' -->
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62'/>
          <!-- parameter of type 'enum ObjectPlacement' -->
          <parameter type-id='type-id-166'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- enum ObjectPlacement -->
    <enum-decl name='ObjectPlacement' filepath='src/heap-checker.cc' line='345' column='1' id='type-id-166'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='MUST_BE_ON_HEAP' value='0'/>
      <enumerator name='IGNORED_ON_HEAP' value='1'/>
      <enumerator name='MAYBE_LIVE' value='2'/>
      <enumerator name='IN_GLOBAL_DATA' value='3'/>
      <enumerator name='THREAD_DATA' value='4'/>
      <enumerator name='THREAD_REGISTERS' value='5'/>
    </enum-decl>
    <!-- class STL_Allocator<AllocObject, HeapLeakChecker::Allocator> -->
    <class-decl name='STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-168'>
      <member-function access='private'>
        <!-- void STL_Allocator<AllocObject, HeapLeakChecker::Allocator>::STL_Allocator() -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<AllocObject, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-169' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<AllocObject, HeapLeakChecker::Allocator>::STL_Allocator(const STL_Allocator<AllocObject, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<AllocObject, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-169' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<AllocObject, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-170'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- STL_Allocator<AllocObject, HeapLeakChecker::Allocator>::~STL_Allocator(int) -->
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<AllocObject, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-169' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class STL_Allocator<void*, HeapLeakChecker::Allocator> -->
    <class-decl name='STL_Allocator&lt;void*, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-171'>
      <member-function access='private'>
        <!-- void STL_Allocator<void*, HeapLeakChecker::Allocator>::STL_Allocator() -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<void*, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-172' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<void*, HeapLeakChecker::Allocator>::STL_Allocator(const STL_Allocator<void*, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<void*, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-172' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<void*, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-173'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- STL_Allocator<void*, HeapLeakChecker::Allocator>::~STL_Allocator(int) -->
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<void*, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-172' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class GoogleInitializer -->
    <class-decl name='GoogleInitializer' size-in-bits='128' visibility='default' filepath='src/base/googleinit.h' line='39' column='1' id='type-id-174'>
      <member-type access='private'>
        <!-- typedef void ()* GoogleInitializer::VoidFunction -->
        <typedef-decl name='VoidFunction' type-id='type-id-176' filepath='src/base/googleinit.h' line='41' column='1' id='type-id-175'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- const char* const GoogleInitializer::name_ -->
        <var-decl name='name_' type-id='type-id-177' visibility='default' filepath='src/base/googleinit.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- const GoogleInitializer::VoidFunction GoogleInitializer::destructor_ -->
        <var-decl name='destructor_' type-id='type-id-178' visibility='default' filepath='src/base/googleinit.h' line='56' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- GoogleInitializer::GoogleInitializer(const char*, GoogleInitializer::VoidFunction, GoogleInitializer::VoidFunction) -->
        <function-decl name='GoogleInitializer' filepath='src/base/googleinit.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GoogleInitializer*' -->
          <parameter type-id='type-id-179' is-artificial='yes'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57'/>
          <!-- parameter of type 'typedef GoogleInitializer::VoidFunction' -->
          <parameter type-id='type-id-175'/>
          <!-- parameter of type 'typedef GoogleInitializer::VoidFunction' -->
          <parameter type-id='type-id-175'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- GoogleInitializer::~GoogleInitializer(int) -->
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <!-- implicit parameter of type 'GoogleInitializer*' -->
          <parameter type-id='type-id-179' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct HeapProfileStats -->
    <class-decl name='HeapProfileStats' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-profile-stats.h' line='54' column='1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int32 HeapProfileStats::allocs -->
        <var-decl name='allocs' type-id='type-id-74' visibility='default' filepath='src/heap-profile-stats.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int32 HeapProfileStats::frees -->
        <var-decl name='frees' type-id='type-id-74' visibility='default' filepath='src/heap-profile-stats.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int64 HeapProfileStats::alloc_size -->
        <var-decl name='alloc_size' type-id='type-id-98' visibility='default' filepath='src/heap-profile-stats.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int64 HeapProfileStats::free_size -->
        <var-decl name='free_size' type-id='type-id-98' visibility='default' filepath='src/heap-profile-stats.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <!-- class MemoryRegionMap -->
    <class-decl name='MemoryRegionMap' size-in-bits='8' visibility='default' filepath='src/memory_region_map.h' line='69' column='1' id='type-id-181'>
      <member-type access='private'>
        <!-- struct MemoryRegionMap::RegionCmp -->
        <class-decl name='RegionCmp' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='245' column='1' id='type-id-182'/>
      </member-type>
      <member-type access='private'>
        <!-- struct MemoryRegionMap::Region -->
        <class-decl name='Region' size-in-bits='2304' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='137' column='1' id='type-id-183'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- uintptr_t MemoryRegionMap::Region::start_addr -->
            <var-decl name='start_addr' type-id='type-id-156' visibility='default' filepath='src/memory_region_map.h' line='138' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- uintptr_t MemoryRegionMap::Region::end_addr -->
            <var-decl name='end_addr' type-id='type-id-156' visibility='default' filepath='src/memory_region_map.h' line='139' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- int MemoryRegionMap::Region::call_stack_depth -->
            <var-decl name='call_stack_depth' type-id='type-id-1' visibility='default' filepath='src/memory_region_map.h' line='140' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- void* MemoryRegionMap::Region::call_stack[32] -->
            <var-decl name='call_stack' type-id='type-id-163' visibility='default' filepath='src/memory_region_map.h' line='141' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2240'>
            <!-- bool MemoryRegionMap::Region::is_stack -->
            <var-decl name='is_stack' type-id='type-id-61' visibility='default' filepath='src/memory_region_map.h' line='143' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct MemoryRegionMap::MyAllocator -->
        <class-decl name='MyAllocator' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='252' column='1' id='type-id-184'/>
      </member-type>
      <member-type access='private'>
        <!-- typedef std::set<MemoryRegionMap::Region, MemoryRegionMap::RegionCmp, STL_Allocator<MemoryRegionMap::Region, MemoryRegionMap::MyAllocator> > MemoryRegionMap::RegionSet -->
        <typedef-decl name='RegionSet' type-id='type-id-186' filepath='src/memory_region_map.h' line='263' column='1' id='type-id-185'/>
      </member-type>
      <member-type access='private'>
        <!-- union MemoryRegionMap::RegionSetRep -->
        <union-decl name='RegionSetRep' size-in-bits='384' visibility='default' filepath='src/memory_region_map.cc' line='177' column='1' id='type-id-187'>
          <data-member access='public'>
            <!-- char MemoryRegionMap::RegionSetRep::rep[48] -->
            <var-decl name='rep' type-id='type-id-188' visibility='default' filepath='src/memory_region_map.cc' line='178' column='1'/>
          </data-member>
          <data-member access='public'>
            <!-- void* MemoryRegionMap::RegionSetRep::align_it -->
            <var-decl name='align_it' type-id='type-id-58' visibility='default' filepath='src/memory_region_map.cc' line='179' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='private'>
        <!-- class MemoryRegionMap::LockHolder -->
        <class-decl name='LockHolder' size-in-bits='8' visibility='default' filepath='src/memory_region_map.h' line='126' column='1' id='type-id-189'>
          <member-function access='private' constructor='yes'>
            <!-- MemoryRegionMap::LockHolder::LockHolder() -->
            <function-decl name='LockHolder' filepath='src/memory_region_map.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'MemoryRegionMap::LockHolder*' -->
              <parameter type-id='type-id-190' is-artificial='yes'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' destructor='yes'>
            <!-- MemoryRegionMap::LockHolder::~LockHolder(int) -->
            <function-decl name='~LockHolder' filepath='src/memory_region_map.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'MemoryRegionMap::LockHolder*' -->
              <parameter type-id='type-id-190' is-artificial='yes'/>
              <!-- artificial parameter of type 'int' -->
              <parameter type-id='type-id-1' is-artificial='yes'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <!-- MemoryRegionMap::LockHolder::LockHolder(const MemoryRegionMap::LockHolder&) -->
            <function-decl name='LockHolder' filepath='src/memory_region_map.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'MemoryRegionMap::LockHolder*' -->
              <parameter type-id='type-id-190' is-artificial='yes'/>
              <!-- parameter of type 'const MemoryRegionMap::LockHolder&' -->
              <parameter type-id='type-id-191'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- typedef std::_Rb_tree_const_iterator<MemoryRegionMap::Region> MemoryRegionMap::RegionIterator -->
        <typedef-decl name='RegionIterator' type-id='type-id-193' filepath='src/memory_region_map.h' line='268' column='1' id='type-id-192'/>
      </member-type>
      <data-member access='private' static='yes'>
        <!-- static int MemoryRegionMap::client_count_ -->
        <var-decl name='client_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap13client_count_E' visibility='default' filepath='src/memory_region_map.h' line='292' column='1' elf-symbol-id='_ZN15MemoryRegionMap13client_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static int MemoryRegionMap::max_stack_depth_ -->
        <var-decl name='max_stack_depth_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16max_stack_depth_E' visibility='default' filepath='src/memory_region_map.h' line='295' column='1' elf-symbol-id='_ZN15MemoryRegionMap16max_stack_depth_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static LowLevelAlloc::Arena* MemoryRegionMap::arena_ -->
        <var-decl name='arena_' type-id='type-id-83' mangled-name='_ZN15MemoryRegionMap6arena_E' visibility='default' filepath='src/memory_region_map.h' line='298' column='1' elf-symbol-id='_ZN15MemoryRegionMap6arena_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static MemoryRegionMap::RegionSet* MemoryRegionMap::regions_ -->
        <var-decl name='regions_' type-id='type-id-194' mangled-name='_ZN15MemoryRegionMap8regions_E' visibility='default' filepath='src/memory_region_map.h' line='306' column='1' elf-symbol-id='_ZN15MemoryRegionMap8regions_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static SpinLock MemoryRegionMap::lock_ -->
        <var-decl name='lock_' type-id='type-id-87' mangled-name='_ZN15MemoryRegionMap5lock_E' visibility='default' filepath='src/memory_region_map.h' line='309' column='1' elf-symbol-id='_ZN15MemoryRegionMap5lock_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static SpinLock MemoryRegionMap::owner_lock_ -->
        <var-decl name='owner_lock_' type-id='type-id-87' mangled-name='_ZN15MemoryRegionMap11owner_lock_E' visibility='default' filepath='src/memory_region_map.h' line='311' column='1' elf-symbol-id='_ZN15MemoryRegionMap11owner_lock_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static int MemoryRegionMap::recursion_count_ -->
        <var-decl name='recursion_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16recursion_count_E' visibility='default' filepath='src/memory_region_map.h' line='314' column='1' elf-symbol-id='_ZN15MemoryRegionMap16recursion_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static pthread_t MemoryRegionMap::lock_owner_tid_ -->
        <var-decl name='lock_owner_tid_' type-id='type-id-195' mangled-name='_ZN15MemoryRegionMap15lock_owner_tid_E' visibility='default' filepath='src/memory_region_map.h' line='316' column='1' elf-symbol-id='_ZN15MemoryRegionMap15lock_owner_tid_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static int64 MemoryRegionMap::map_size_ -->
        <var-decl name='map_size_' type-id='type-id-98' mangled-name='_ZN15MemoryRegionMap9map_size_E' visibility='default' filepath='src/memory_region_map.h' line='319' column='1' elf-symbol-id='_ZN15MemoryRegionMap9map_size_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static int64 MemoryRegionMap::unmap_size_ -->
        <var-decl name='unmap_size_' type-id='type-id-98' mangled-name='_ZN15MemoryRegionMap11unmap_size_E' visibility='default' filepath='src/memory_region_map.h' line='321' column='1' elf-symbol-id='_ZN15MemoryRegionMap11unmap_size_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static HeapProfileBucket** MemoryRegionMap::bucket_table_ -->
        <var-decl name='bucket_table_' type-id='type-id-196' mangled-name='_ZN15MemoryRegionMap13bucket_table_E' visibility='default' filepath='src/memory_region_map.h' line='324' column='1' elf-symbol-id='_ZN15MemoryRegionMap13bucket_table_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static int MemoryRegionMap::num_buckets_ -->
        <var-decl name='num_buckets_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap12num_buckets_E' visibility='default' filepath='src/memory_region_map.h' line='325' column='1' elf-symbol-id='_ZN15MemoryRegionMap12num_buckets_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static int MemoryRegionMap::saved_buckets_count_ -->
        <var-decl name='saved_buckets_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap20saved_buckets_count_E' visibility='default' filepath='src/memory_region_map.h' line='337' column='1' elf-symbol-id='_ZN15MemoryRegionMap20saved_buckets_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static HeapProfileBucket MemoryRegionMap::saved_buckets_[20] -->
        <var-decl name='saved_buckets_' type-id='type-id-197' mangled-name='_ZN15MemoryRegionMap14saved_buckets_E' visibility='default' filepath='src/memory_region_map.h' line='343' column='1' elf-symbol-id='_ZN15MemoryRegionMap14saved_buckets_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static void* MemoryRegionMap::saved_buckets_keys_[20][32] -->
        <var-decl name='saved_buckets_keys_' type-id='type-id-198' mangled-name='_ZN15MemoryRegionMap19saved_buckets_keys_E' visibility='default' filepath='src/memory_region_map.h' line='345' column='1' elf-symbol-id='_ZN15MemoryRegionMap19saved_buckets_keys_E'/>
      </data-member>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::IterateBuckets<HeapProfileTable::BufferArgs*>(HeapProfileTable::BufferArgs*) -->
        <function-decl name='IterateBuckets&lt;HeapProfileTable::BufferArgs*&gt;' filepath='src/memory_region_map.h' line='402' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'void (const HeapProfileBucket*, HeapProfileTable::BufferArgs*)*' -->
          <parameter type-id='type-id-199'/>
          <!-- parameter of type 'HeapProfileTable::BufferArgs*' -->
          <parameter type-id='type-id-200'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::HandleSavedRegionsLocked() -->
        <function-decl name='HandleSavedRegionsLocked' mangled-name='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE' filepath='src/memory_region_map.cc' line='487' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE'>
          <!-- parameter of type 'void (const MemoryRegionMap::Region&)*' -->
          <parameter type-id='type-id-201'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::Unlock() -->
        <function-decl name='Unlock' mangled-name='_ZN15MemoryRegionMap6UnlockEv' filepath='src/memory_region_map.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap6UnlockEv'>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool MemoryRegionMap::LockIsHeld() -->
        <function-decl name='LockIsHeld' mangled-name='_ZN15MemoryRegionMap10LockIsHeldEv' filepath='src/memory_region_map.cc' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10LockIsHeldEv'>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::LogAllLocked() -->
        <function-decl name='LogAllLocked' mangled-name='_ZN15MemoryRegionMap12LogAllLockedEv' filepath='src/memory_region_map.cc' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap12LogAllLockedEv'>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::DoInsertRegionLocked() -->
        <function-decl name='DoInsertRegionLocked' mangled-name='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.cc' line='443' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE'>
          <!-- parameter of type 'const MemoryRegionMap::Region&' -->
          <parameter type-id='type-id-202' name='region' filepath='src/memory_region_map.cc' line='443' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- MemoryRegionMap::RegionIterator MemoryRegionMap::EndRegionLocked() -->
        <function-decl name='EndRegionLocked' mangled-name='_ZN15MemoryRegionMap15EndRegionLockedEv' filepath='src/memory_region_map.cc' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap15EndRegionLockedEv'>
          <!-- typedef MemoryRegionMap::RegionIterator -->
          <return type-id='type-id-192'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- MemoryRegionMap::RegionIterator MemoryRegionMap::BeginRegionLocked() -->
        <function-decl name='BeginRegionLocked' mangled-name='_ZN15MemoryRegionMap17BeginRegionLockedEv' filepath='src/memory_region_map.cc' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17BeginRegionLockedEv'>
          <!-- typedef MemoryRegionMap::RegionIterator -->
          <return type-id='type-id-192'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- const MemoryRegionMap::Region* MemoryRegionMap::DoFindRegionLocked() -->
        <function-decl name='DoFindRegionLocked' mangled-name='_ZN15MemoryRegionMap18DoFindRegionLockedEm' filepath='src/memory_region_map.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18DoFindRegionLockedEm'>
          <!-- parameter of type 'typedef uintptr_t' -->
          <parameter type-id='type-id-156'/>
          <!-- const MemoryRegionMap::Region* -->
          <return type-id='type-id-203'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool MemoryRegionMap::IsRecordingLocked() -->
        <function-decl name='IsRecordingLocked' mangled-name='_ZN15MemoryRegionMap17IsRecordingLockedEv' filepath='src/memory_region_map.cc' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17IsRecordingLockedEv'>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::Lock() -->
        <function-decl name='Lock' mangled-name='_ZN15MemoryRegionMap4LockEv' filepath='src/memory_region_map.cc' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4LockEv'>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool MemoryRegionMap::FindAndMarkStackRegion(MemoryRegionMap::Region*) -->
        <function-decl name='FindAndMarkStackRegion' mangled-name='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE' filepath='src/memory_region_map.cc' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE'>
          <!-- parameter of type 'typedef uintptr_t' -->
          <parameter type-id='type-id-156'/>
          <!-- parameter of type 'MemoryRegionMap::Region*' -->
          <parameter type-id='type-id-204'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool MemoryRegionMap::FindRegion(MemoryRegionMap::Region*) -->
        <function-decl name='FindRegion' mangled-name='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE' filepath='src/memory_region_map.cc' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE'>
          <!-- parameter of type 'typedef uintptr_t' -->
          <parameter type-id='type-id-156'/>
          <!-- parameter of type 'MemoryRegionMap::Region*' -->
          <parameter type-id='type-id-204'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool MemoryRegionMap::Shutdown() -->
        <function-decl name='Shutdown' mangled-name='_ZN15MemoryRegionMap8ShutdownEv' filepath='src/memory_region_map.cc' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8ShutdownEv'>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::Init(bool) -->
        <function-decl name='Init' mangled-name='_ZN15MemoryRegionMap4InitEib' filepath='src/memory_region_map.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4InitEib'>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-61'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::RestoreSavedBucketsLocked() -->
        <function-decl name='RestoreSavedBucketsLocked' mangled-name='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv' filepath='src/memory_region_map.cc' line='499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv'>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- HeapProfileBucket* MemoryRegionMap::GetBucket(void* const*) -->
        <function-decl name='GetBucket' mangled-name='_ZN15MemoryRegionMap9GetBucketEiPKPKv' filepath='src/memory_region_map.cc' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap9GetBucketEiPKPKv'>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'void* const*' -->
          <parameter type-id='type-id-205'/>
          <!-- HeapProfileBucket* -->
          <return type-id='type-id-206'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::RecordRegionRemovalInBucket(void* const*, size_t) -->
        <function-decl name='RecordRegionRemovalInBucket' mangled-name='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm' filepath='src/memory_region_map.cc' line='752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm'>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'void* const*' -->
          <parameter type-id='type-id-205'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::InsertRegionLocked() -->
        <function-decl name='InsertRegionLocked' mangled-name='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.cc' line='537' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE'>
          <!-- parameter of type 'const MemoryRegionMap::Region&' -->
          <parameter type-id='type-id-202' name='region' filepath='src/memory_region_map.cc' line='443' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::RecordRegionAddition(size_t) -->
        <function-decl name='RecordRegionAddition' mangled-name='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm' filepath='src/memory_region_map.cc' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::MmapHook(void*, size_t, int, int, int, off_t) -->
        <function-decl name='MmapHook' mangled-name='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil' filepath='src/memory_region_map.cc' line='762' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef off_t' -->
          <parameter type-id='type-id-207'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::RecordRegionRemoval(size_t) -->
        <function-decl name='RecordRegionRemoval' mangled-name='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm' filepath='src/memory_region_map.cc' line='634' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::MunmapHook(size_t) -->
        <function-decl name='MunmapHook' mangled-name='_ZN15MemoryRegionMap10MunmapHookEPKvm' filepath='src/memory_region_map.cc' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MunmapHookEPKvm'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::SbrkHook(ptrdiff_t) -->
        <function-decl name='SbrkHook' mangled-name='_ZN15MemoryRegionMap8SbrkHookEPKvl' filepath='src/memory_region_map.cc' line='800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8SbrkHookEPKvl'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'typedef ptrdiff_t' -->
          <parameter type-id='type-id-208'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::MremapHook(void*, size_t, size_t, int, void*) -->
        <function-decl name='MremapHook' mangled-name='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_' filepath='src/memory_region_map.cc' line='785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class HeapProfileTable -->
    <class-decl name='HeapProfileTable' size-in-bits='832' visibility='default' filepath='src/heap-profile-table.h' line='51' column='1' id='type-id-209'>
      <member-type access='private'>
        <!-- struct HeapProfileTable::AllocValue -->
        <class-decl name='AllocValue' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='190' column='1' id='type-id-210'>
          <member-type access='private'>
            <!-- typedef HeapProfileBucket HeapProfileTable::AllocValue::Bucket -->
            <typedef-decl name='Bucket' type-id='type-id-212' filepath='src/heap-profile-table.h' line='187' column='1' id='type-id-211'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- size_t HeapProfileTable::AllocValue::bytes -->
            <var-decl name='bytes' type-id='type-id-62' visibility='default' filepath='src/heap-profile-table.h' line='197' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <!-- static const int HeapProfileTable::AllocValue::kLive -->
            <var-decl name='kLive' type-id='type-id-144' visibility='default' filepath='src/heap-profile-table.h' line='214' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <!-- static const int HeapProfileTable::AllocValue::kIgnore -->
            <var-decl name='kIgnore' type-id='type-id-144' visibility='default' filepath='src/heap-profile-table.h' line='215' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <!-- static const int HeapProfileTable::AllocValue::kMask -->
            <var-decl name='kMask' type-id='type-id-144' visibility='default' filepath='src/heap-profile-table.h' line='216' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <!-- uintptr_t HeapProfileTable::AllocValue::bucket_rep -->
            <var-decl name='bucket_rep' type-id='type-id-156' visibility='default' filepath='src/heap-profile-table.h' line='218' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::DumpArgs -->
        <class-decl name='DumpArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='242' column='1' id='type-id-213'>
          <member-type access='public'>
            <!-- typedef HeapProfileStats HeapProfileTable::DumpArgs::Stats -->
            <typedef-decl name='Stats' type-id='type-id-180' filepath='src/heap-profile-table.h' line='63' column='1' id='type-id-214'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- RawFD HeapProfileTable::DumpArgs::fd -->
            <var-decl name='fd' type-id='type-id-75' visibility='default' filepath='src/heap-profile-table.h' line='248' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- HeapProfileTable::DumpArgs::Stats* HeapProfileTable::DumpArgs::profile_stats -->
            <var-decl name='profile_stats' type-id='type-id-215' visibility='default' filepath='src/heap-profile-table.h' line='249' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <!-- HeapProfileTable::DumpArgs::DumpArgs(RawFD, HeapProfileTable::DumpArgs::Stats*) -->
            <function-decl name='DumpArgs' filepath='src/heap-profile-table.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'HeapProfileTable::DumpArgs*' -->
              <parameter type-id='type-id-216' is-artificial='yes'/>
              <!-- parameter of type 'typedef RawFD' -->
              <parameter type-id='type-id-75'/>
              <!-- parameter of type 'HeapProfileTable::DumpArgs::Stats*' -->
              <parameter type-id='type-id-215'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::Snapshot -->
        <class-decl name='Snapshot' size-in-bits='768' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='347' column='1' id='type-id-217'>
          <member-type access='private'>
            <!-- struct HeapProfileTable::Snapshot::Entry -->
            <class-decl name='Entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.cc' line='514' column='1' id='type-id-218'>
              <data-member access='public' layout-offset-in-bits='0'>
                <!-- int HeapProfileTable::Snapshot::Entry::count -->
                <var-decl name='count' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='515' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <!-- int HeapProfileTable::Snapshot::Entry::bytes -->
                <var-decl name='bytes' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='516' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <!-- HeapProfileTable::AllocValue::Bucket* HeapProfileTable::Snapshot::Entry::bucket -->
                <var-decl name='bucket' type-id='type-id-219' visibility='default' filepath='src/heap-profile-table.cc' line='517' column='1'/>
              </data-member>
              <member-function access='public' constructor='yes'>
                <!-- HeapProfileTable::Snapshot::Entry::Entry() -->
                <function-decl name='Entry' filepath='src/heap-profile-table.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64'>
                  <!-- implicit parameter of type 'HeapProfileTable::Snapshot::Entry*' -->
                  <parameter type-id='type-id-220' is-artificial='yes'/>
                  <!-- void -->
                  <return type-id='type-id-60'/>
                </function-decl>
              </member-function>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <!-- struct HeapProfileTable::Snapshot::ReportState -->
            <class-decl name='ReportState' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/heap-profile-table.cc' line='528' column='1' id='type-id-221'>
              <data-member access='public' layout-offset-in-bits='0'>
                <!-- std::map<HeapProfileTable::Bucket*, HeapProfileTable::Snapshot::Entry, std::less<HeapProfileTable::Bucket*>, std::allocator<std::pair<HeapProfileTable::Bucket* const, HeapProfileTable::Snapshot::Entry> > > HeapProfileTable::Snapshot::ReportState::buckets_ -->
                <var-decl name='buckets_' type-id='type-id-222' visibility='default' filepath='src/heap-profile-table.cc' line='529' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <!-- HeapProfileTable::AllocValue::Bucket HeapProfileTable::Snapshot::total_ -->
            <var-decl name='total_' type-id='type-id-211' visibility='default' filepath='src/heap-profile-table.h' line='372' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <!-- HeapProfileTable::AllocationMap HeapProfileTable::Snapshot::map_ -->
            <var-decl name='map_' type-id='type-id-223' visibility='default' filepath='src/heap-profile-table.h' line='376' column='1'/>
          </data-member>
          <member-function access='private' constructor='yes'>
            <!-- HeapProfileTable::Snapshot::Snapshot(HeapProfileTable::Allocator, HeapProfileTable::DeAllocator) -->
            <function-decl name='Snapshot' filepath='src/heap-profile-table.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'HeapProfileTable::Snapshot*' -->
              <parameter type-id='type-id-224' is-artificial='yes'/>
              <!-- parameter of type 'typedef HeapProfileTable::Allocator' -->
              <parameter type-id='type-id-225'/>
              <!-- parameter of type 'typedef HeapProfileTable::DeAllocator' -->
              <parameter type-id='type-id-226'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <!-- HeapProfileTable::Snapshot::Snapshot(const HeapProfileTable::Snapshot&) -->
            <function-decl name='Snapshot' filepath='src/heap-profile-table.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'HeapProfileTable::Snapshot*' -->
              <parameter type-id='type-id-224' is-artificial='yes'/>
              <!-- parameter of type 'const HeapProfileTable::Snapshot&' -->
              <parameter type-id='type-id-227'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <!-- void HeapProfileTable::Snapshot::ReportObject(HeapProfileTable::AllocValue*, char*) -->
            <function-decl name='ReportObject' mangled-name='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc' filepath='src/heap-profile-table.cc' line='614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc'>
              <!-- parameter of type 'void*' -->
              <parameter type-id='type-id-58'/>
              <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
              <parameter type-id='type-id-228'/>
              <!-- parameter of type 'char*' -->
              <parameter type-id='type-id-118'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- void HeapProfileTable::Snapshot::ReportIndividualObjects() -->
            <function-decl name='ReportIndividualObjects' mangled-name='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv' filepath='src/heap-profile-table.cc' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv'>
              <!-- implicit parameter of type 'HeapProfileTable::Snapshot* const' -->
              <parameter type-id='type-id-229' name='this' is-artificial='yes'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <!-- void HeapProfileTable::Snapshot::ReportCallback(HeapProfileTable::AllocValue*, HeapProfileTable::Snapshot::ReportState*) -->
            <function-decl name='ReportCallback' mangled-name='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE' filepath='src/heap-profile-table.cc' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE'>
              <!-- parameter of type 'void*' -->
              <parameter type-id='type-id-58'/>
              <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
              <parameter type-id='type-id-228'/>
              <!-- parameter of type 'HeapProfileTable::Snapshot::ReportState*' -->
              <parameter type-id='type-id-230'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- void HeapProfileTable::Snapshot::ReportLeaks(const char*, const char*, bool) -->
            <function-decl name='ReportLeaks' mangled-name='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b' filepath='src/heap-profile-table.cc' line='542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b'>
              <!-- implicit parameter of type 'HeapProfileTable::Snapshot* const' -->
              <parameter type-id='type-id-229' name='this' is-artificial='yes'/>
              <!-- parameter of type 'const char*' -->
              <parameter type-id='type-id-57' name='checker_name' filepath='src/heap-profile-table.cc' line='542' column='1'/>
              <!-- parameter of type 'const char*' -->
              <parameter type-id='type-id-57' name='filename' filepath='src/heap-profile-table.cc' line='543' column='1'/>
              <!-- parameter of type 'bool' -->
              <parameter type-id='type-id-61' name='should_symbolize' filepath='src/heap-profile-table.cc' line='544' column='1'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::AddNonLiveArgs -->
        <class-decl name='AddNonLiveArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='305' column='1' id='type-id-231'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- HeapProfileTable::Snapshot* HeapProfileTable::AddNonLiveArgs::dest -->
            <var-decl name='dest' type-id='type-id-224' visibility='default' filepath='src/heap-profile-table.h' line='306' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- HeapProfileTable::Snapshot* HeapProfileTable::AddNonLiveArgs::base -->
            <var-decl name='base' type-id='type-id-224' visibility='default' filepath='src/heap-profile-table.h' line='307' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::AllocContextInfo -->
        <class-decl name='AllocContextInfo' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='77' column='1' id='type-id-232'>
          <!-- struct HeapProfileStats -->
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-180'/>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- int HeapProfileTable::AllocContextInfo::stack_depth -->
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='78' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- void* const* HeapProfileTable::AllocContextInfo::call_stack -->
            <var-decl name='call_stack' type-id='type-id-205' visibility='default' filepath='src/heap-profile-table.h' line='79' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- typedef void* (typedef size_t)* HeapProfileTable::Allocator -->
        <typedef-decl name='Allocator' type-id='type-id-233' filepath='src/heap-profile-table.h' line='83' column='1' id='type-id-225'/>
      </member-type>
      <member-type access='private'>
        <!-- typedef void (void*)* HeapProfileTable::DeAllocator -->
        <typedef-decl name='DeAllocator' type-id='type-id-234' filepath='src/heap-profile-table.h' line='84' column='1' id='type-id-226'/>
      </member-type>
      <member-type access='private'>
        <!-- typedef AddressMap<HeapProfileTable::AllocValue> HeapProfileTable::AllocationMap -->
        <typedef-decl name='AllocationMap' type-id='type-id-235' filepath='src/heap-profile-table.h' line='224' column='1' id='type-id-223'/>
      </member-type>
      <member-type access='private'>
        <!-- typedef void (void*, const HeapProfileTable::AllocInfo&)* HeapProfileTable::AllocIterator -->
        <typedef-decl name='AllocIterator' type-id='type-id-237' filepath='src/heap-profile-table.h' line='138' column='1' id='type-id-236'/>
      </member-type>
      <member-type access='private'>
        <!-- typedef void (const HeapProfileTable::AllocContextInfo&)* HeapProfileTable::AllocContextIterator -->
        <typedef-decl name='AllocContextIterator' type-id='type-id-239' filepath='src/heap-profile-table.h' line='147' column='1' id='type-id-238'/>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::BufferArgs -->
        <class-decl name='BufferArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='227' column='1' id='type-id-240'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- char* HeapProfileTable::BufferArgs::buf -->
            <var-decl name='buf' type-id='type-id-118' visibility='default' filepath='src/heap-profile-table.h' line='234' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- int HeapProfileTable::BufferArgs::buflen -->
            <var-decl name='buflen' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='235' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <!-- int HeapProfileTable::BufferArgs::bufsize -->
            <var-decl name='bufsize' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='236' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <!-- HeapProfileTable::BufferArgs::BufferArgs(char*, int, int) -->
            <function-decl name='BufferArgs' filepath='src/heap-profile-table.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'HeapProfileTable::BufferArgs*' -->
              <parameter type-id='type-id-200' is-artificial='yes'/>
              <!-- parameter of type 'char*' -->
              <parameter type-id='type-id-118'/>
              <!-- parameter of type 'int' -->
              <parameter type-id='type-id-1'/>
              <!-- parameter of type 'int' -->
              <parameter type-id='type-id-1'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <!-- HeapProfileTable::BufferArgs::BufferArgs(const HeapProfileTable::BufferArgs&) -->
            <function-decl name='BufferArgs' filepath='src/heap-profile-table.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'HeapProfileTable::BufferArgs*' -->
              <parameter type-id='type-id-200' is-artificial='yes'/>
              <!-- parameter of type 'const HeapProfileTable::BufferArgs&' -->
              <parameter type-id='type-id-241'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::AllocInfo -->
        <class-decl name='AllocInfo' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='66' column='1' id='type-id-242'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- size_t HeapProfileTable::AllocInfo::object_size -->
            <var-decl name='object_size' type-id='type-id-62' visibility='default' filepath='src/heap-profile-table.h' line='67' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* const* HeapProfileTable::AllocInfo::call_stack -->
            <var-decl name='call_stack' type-id='type-id-205' visibility='default' filepath='src/heap-profile-table.h' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- int HeapProfileTable::AllocInfo::stack_depth -->
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='69' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <!-- bool HeapProfileTable::AllocInfo::live -->
            <var-decl name='live' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='70' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='168'>
            <!-- bool HeapProfileTable::AllocInfo::ignored -->
            <var-decl name='ignored' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='71' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' static='yes'>
        <!-- static char HeapProfileTable::kFileExt[] -->
        <var-decl name='kFileExt' type-id='type-id-159' mangled-name='_ZN16HeapProfileTable8kFileExtE' visibility='default' filepath='src/heap-profile-table.h' line='55' column='1' elf-symbol-id='_ZN16HeapProfileTable8kFileExtE'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static const int HeapProfileTable::kMaxStackDepth -->
        <var-decl name='kMaxStackDepth' type-id='type-id-144' mangled-name='_ZN16HeapProfileTable14kMaxStackDepthE' visibility='default' filepath='src/heap-profile-table.h' line='58' column='1' elf-symbol-id='_ZN16HeapProfileTable14kMaxStackDepthE'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- HeapProfileTable::Allocator HeapProfileTable::alloc_ -->
        <var-decl name='alloc_' type-id='type-id-225' visibility='default' filepath='src/heap-profile-table.h' line='325' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- HeapProfileTable::DeAllocator HeapProfileTable::dealloc_ -->
        <var-decl name='dealloc_' type-id='type-id-226' visibility='default' filepath='src/heap-profile-table.h' line='326' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- HeapProfileTable::AllocValue::Bucket HeapProfileTable::total_ -->
        <var-decl name='total_' type-id='type-id-211' visibility='default' filepath='src/heap-profile-table.h' line='330' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- bool HeapProfileTable::profile_mmap_ -->
        <var-decl name='profile_mmap_' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='332' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <!-- HeapProfileTable::AllocValue::Bucket** HeapProfileTable::bucket_table_ -->
        <var-decl name='bucket_table_' type-id='type-id-243' visibility='default' filepath='src/heap-profile-table.h' line='338' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <!-- int HeapProfileTable::num_buckets_ -->
        <var-decl name='num_buckets_' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='339' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <!-- HeapProfileTable::AllocationMap* HeapProfileTable::address_map_ -->
        <var-decl name='address_map_' type-id='type-id-244' visibility='default' filepath='src/heap-profile-table.h' line='342' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- HeapProfileTable::HeapProfileTable(HeapProfileTable::Allocator, HeapProfileTable::DeAllocator, bool) -->
        <function-decl name='HeapProfileTable' mangled-name='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb' filepath='src/heap-profile-table.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-245' is-artificial='yes'/>
          <!-- parameter of type 'typedef HeapProfileTable::Allocator' -->
          <parameter type-id='type-id-225'/>
          <!-- parameter of type 'typedef HeapProfileTable::DeAllocator' -->
          <parameter type-id='type-id-226'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-61'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- HeapProfileTable::~HeapProfileTable(int) -->
        <function-decl name='~HeapProfileTable' mangled-name='_ZN16HeapProfileTableD1Ev' filepath='src/heap-profile-table.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableD1Ev'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-245' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- HeapProfileTable::HeapProfileTable(const HeapProfileTable&) -->
        <function-decl name='HeapProfileTable' filepath='src/heap-profile-table.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-245' is-artificial='yes'/>
          <!-- parameter of type 'const HeapProfileTable&' -->
          <parameter type-id='type-id-246'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::MapArgsAllocIterator(HeapProfileTable::AllocValue*, HeapProfileTable::AllocIterator) -->
        <function-decl name='MapArgsAllocIterator' mangled-name='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE' filepath='src/heap-profile-table.h' line='276' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
          <parameter type-id='type-id-228'/>
          <!-- parameter of type 'typedef HeapProfileTable::AllocIterator' -->
          <parameter type-id='type-id-236'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- size_t HeapProfileTable::AllocValueSize() -->
        <function-decl name='AllocValueSize' mangled-name='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE' filepath='src/heap-profile-table.h' line='222' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE'>
          <!-- parameter of type 'const HeapProfileTable::AllocValue&' -->
          <parameter type-id='type-id-247' name='v' filepath='src/heap-profile-table.h' line='222' column='1'/>
          <!-- typedef size_t -->
          <return type-id='type-id-62'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapProfileTable::ReleaseSnapshot(HeapProfileTable::Snapshot*) -->
        <function-decl name='ReleaseSnapshot' mangled-name='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE'>
          <!-- implicit parameter of type 'HeapProfileTable* const' -->
          <parameter type-id='type-id-248' name='this' is-artificial='yes'/>
          <!-- parameter of type 'HeapProfileTable::Snapshot*' -->
          <parameter type-id='type-id-224' name='s' filepath='src/heap-profile-table.cc' line='485' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- int HeapProfileTable::UnparseBucket(char*, int, int, const char*, HeapProfileTable::DumpArgs::Stats*) -->
        <function-decl name='UnparseBucket' mangled-name='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats' filepath='src/heap-profile-table.cc' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats'>
          <!-- parameter of type 'const HeapProfileTable::AllocValue::Bucket&' -->
          <parameter type-id='type-id-249' name='b' filepath='src/heap-profile-table.cc' line='280' column='1'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-118' name='buf' filepath='src/heap-profile-table.cc' line='281' column='1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1' name='buflen' filepath='src/heap-profile-table.cc' line='281' column='1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1' name='bufsize' filepath='src/heap-profile-table.cc' line='281' column='1'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57' name='extra' filepath='src/heap-profile-table.cc' line='282' column='1'/>
          <!-- parameter of type 'HeapProfileTable::DumpArgs::Stats*' -->
          <parameter type-id='type-id-215' name='profile_stats' filepath='src/heap-profile-table.cc' line='283' column='1'/>
          <!-- int -->
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::DumpNonLiveIterator(HeapProfileTable::AllocValue*, const HeapProfileTable::DumpArgs&) -->
        <function-decl name='DumpNonLiveIterator' mangled-name='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE' filepath='src/heap-profile-table.cc' line='397' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='397' column='1'/>
          <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
          <parameter type-id='type-id-228' name='v' filepath='src/heap-profile-table.cc' line='397' column='1'/>
          <!-- parameter of type 'const HeapProfileTable::DumpArgs&' -->
          <parameter type-id='type-id-250' name='args' filepath='src/heap-profile-table.cc' line='398' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::DumpBucketIterator(HeapProfileTable::BufferArgs*) -->
        <function-decl name='DumpBucketIterator' mangled-name='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE' filepath='src/heap-profile-table.cc' line='390' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE'>
          <!-- parameter of type 'const HeapProfileTable::AllocValue::Bucket*' -->
          <parameter type-id='type-id-251'/>
          <!-- parameter of type 'HeapProfileTable::BufferArgs*' -->
          <parameter type-id='type-id-200'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- HeapProfileTable::AllocValue::Bucket* HeapProfileTable::GetBucket(int, void* const*) -->
        <function-decl name='GetBucket' mangled-name='_ZN16HeapProfileTable9GetBucketEiPKPKv' filepath='src/heap-profile-table.cc' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable9GetBucketEiPKPKv'>
          <!-- implicit parameter of type 'HeapProfileTable* const' -->
          <parameter type-id='type-id-248' name='this' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1' name='depth' filepath='src/heap-profile-table.cc' line='167' column='1'/>
          <!-- parameter of type 'void* const*' -->
          <parameter type-id='type-id-205' name='key' filepath='src/heap-profile-table.cc' line='168' column='1'/>
          <!-- HeapProfileTable::AllocValue::Bucket* -->
          <return type-id='type-id-219'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- int HeapProfileTable::GetCallerStackTrace(void**) -->
        <function-decl name='GetCallerStackTrace' mangled-name='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv' filepath='src/heap-profile-table.cc' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv'>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'void**' -->
          <parameter type-id='type-id-151'/>
          <!-- int -->
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- HeapProfileTable::AllocValue::Bucket** HeapProfileTable::MakeSortedBucketList() -->
        <function-decl name='MakeSortedBucketList' mangled-name='_ZNK16HeapProfileTable20MakeSortedBucketListEv' filepath='src/heap-profile-table.cc' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable20MakeSortedBucketListEv'>
          <!-- implicit parameter of type 'const HeapProfileTable* const' -->
          <parameter type-id='type-id-252' name='this' is-artificial='yes'/>
          <!-- HeapProfileTable::AllocValue::Bucket** -->
          <return type-id='type-id-243'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapProfileTable::IterateOrderedAllocContexts(HeapProfileTable::AllocContextIterator) -->
        <function-decl name='IterateOrderedAllocContexts' mangled-name='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE' filepath='src/heap-profile-table.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE'>
          <!-- implicit parameter of type 'const HeapProfileTable* const' -->
          <parameter type-id='type-id-252' name='this' is-artificial='yes'/>
          <!-- parameter of type 'typedef HeapProfileTable::AllocContextIterator' -->
          <parameter type-id='type-id-238' name='callback' filepath='src/heap-profile-table.cc' line='330' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- int HeapProfileTable::FillOrderedProfile(char*, int) -->
        <function-decl name='FillOrderedProfile' mangled-name='_ZNK16HeapProfileTable18FillOrderedProfileEPci' filepath='src/heap-profile-table.cc' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable18FillOrderedProfileEPci'>
          <!-- implicit parameter of type 'const HeapProfileTable* const' -->
          <parameter type-id='type-id-252' name='this' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-118' name='buf' filepath='src/heap-profile-table.cc' line='342' column='1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1' name='size' filepath='src/heap-profile-table.cc' line='342' column='1'/>
          <!-- int -->
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapProfileTable::MarkAsIgnored(void*) -->
        <function-decl name='MarkAsIgnored' mangled-name='_ZN16HeapProfileTable13MarkAsIgnoredEPKv' filepath='src/heap-profile-table.cc' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13MarkAsIgnoredEPKv'>
          <!-- implicit parameter of type 'HeapProfileTable* const' -->
          <parameter type-id='type-id-248' name='this' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='272' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool HeapProfileTable::WriteProfile(const HeapProfileTable::AllocValue::Bucket&, HeapProfileTable::AllocationMap*) -->
        <function-decl name='WriteProfile' mangled-name='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE' filepath='src/heap-profile-table.cc' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE'>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57' name='file_name' filepath='src/heap-profile-table.cc' line='432' column='1'/>
          <!-- parameter of type 'const HeapProfileTable::AllocValue::Bucket&' -->
          <parameter type-id='type-id-249' name='total' filepath='src/heap-profile-table.cc' line='433' column='1'/>
          <!-- parameter of type 'HeapProfileTable::AllocationMap*' -->
          <parameter type-id='type-id-244' name='allocations' filepath='src/heap-profile-table.cc' line='434' column='1'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool HeapProfileTable::FindInsideAlloc(void*, size_t, void**, size_t*) -->
        <function-decl name='FindInsideAlloc' mangled-name='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm' filepath='src/heap-profile-table.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm'>
          <!-- implicit parameter of type 'const HeapProfileTable* const' -->
          <parameter type-id='type-id-252' name='this' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='253' column='1'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62' name='max_size' filepath='src/heap-profile-table.cc' line='254' column='1'/>
          <!-- parameter of type 'void**' -->
          <parameter type-id='type-id-151' name='object_ptr' filepath='src/heap-profile-table.cc' line='255' column='1'/>
          <!-- parameter of type 'size_t*' -->
          <parameter type-id='type-id-253' name='object_size' filepath='src/heap-profile-table.cc' line='256' column='1'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::AddToSnapshot(HeapProfileTable::AllocValue*, HeapProfileTable::Snapshot*) -->
        <function-decl name='AddToSnapshot' mangled-name='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
          <parameter type-id='type-id-228'/>
          <!-- parameter of type 'HeapProfileTable::Snapshot*' -->
          <parameter type-id='type-id-224'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- HeapProfileTable::Snapshot* HeapProfileTable::TakeSnapshot() -->
        <function-decl name='TakeSnapshot' mangled-name='_ZN16HeapProfileTable12TakeSnapshotEv' filepath='src/heap-profile-table.cc' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12TakeSnapshotEv'>
          <!-- implicit parameter of type 'HeapProfileTable* const' -->
          <parameter type-id='type-id-248' name='this' is-artificial='yes'/>
          <!-- HeapProfileTable::Snapshot* -->
          <return type-id='type-id-224'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapProfileTable::RecordAlloc(void*, size_t, int, void* const*) -->
        <function-decl name='RecordAlloc' mangled-name='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_' filepath='src/heap-profile-table.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_'>
          <!-- implicit parameter of type 'HeapProfileTable* const' -->
          <parameter type-id='type-id-248' name='this' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='211' column='1'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62' name='bytes' filepath='src/heap-profile-table.cc' line='211' column='1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1' name='stack_depth' filepath='src/heap-profile-table.cc' line='211' column='1'/>
          <!-- parameter of type 'void* const*' -->
          <parameter type-id='type-id-205' name='call_stack' filepath='src/heap-profile-table.cc' line='212' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapProfileTable::RecordFree(void*) -->
        <function-decl name='RecordFree' mangled-name='_ZN16HeapProfileTable10RecordFreeEPKv' filepath='src/heap-profile-table.cc' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10RecordFreeEPKv'>
          <!-- implicit parameter of type 'HeapProfileTable* const' -->
          <parameter type-id='type-id-248' name='this' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='272' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::AddIfNonLive(HeapProfileTable::AllocValue*, HeapProfileTable::AddNonLiveArgs*) -->
        <function-decl name='AddIfNonLive' mangled-name='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE' filepath='src/heap-profile-table.cc' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
          <parameter type-id='type-id-228'/>
          <!-- parameter of type 'HeapProfileTable::AddNonLiveArgs*' -->
          <parameter type-id='type-id-254'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- HeapProfileTable::Snapshot* HeapProfileTable::NonLiveSnapshot(HeapProfileTable::Snapshot*) -->
        <function-decl name='NonLiveSnapshot' mangled-name='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE'>
          <!-- implicit parameter of type 'HeapProfileTable* const' -->
          <parameter type-id='type-id-248' name='this' is-artificial='yes'/>
          <!-- parameter of type 'HeapProfileTable::Snapshot*' -->
          <parameter type-id='type-id-224' name='base' filepath='src/heap-profile-table.cc' line='497' column='1'/>
          <!-- HeapProfileTable::Snapshot* -->
          <return type-id='type-id-224'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool HeapProfileTable::MarkAsLive(void*) -->
        <function-decl name='MarkAsLive' mangled-name='_ZN16HeapProfileTable10MarkAsLiveEPKv' filepath='src/heap-profile-table.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10MarkAsLiveEPKv'>
          <!-- implicit parameter of type 'HeapProfileTable* const' -->
          <parameter type-id='type-id-248' name='this' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='263' column='1'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::CleanupOldProfiles() -->
        <function-decl name='CleanupOldProfiles' mangled-name='_ZN16HeapProfileTable18CleanupOldProfilesEPKc' filepath='src/heap-profile-table.cc' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18CleanupOldProfilesEPKc'>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool HeapProfileTable::FindAllocDetails(void*, HeapProfileTable::AllocInfo*) -->
        <function-decl name='FindAllocDetails' mangled-name='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE' filepath='src/heap-profile-table.cc' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE'>
          <!-- implicit parameter of type 'const HeapProfileTable* const' -->
          <parameter type-id='type-id-252' name='this' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='242' column='1'/>
          <!-- parameter of type 'HeapProfileTable::AllocInfo*' -->
          <parameter type-id='type-id-255' name='info' filepath='src/heap-profile-table.cc' line='243' column='1'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool HeapProfileTable::FindAlloc(void*, size_t*) -->
        <function-decl name='FindAlloc' mangled-name='_ZNK16HeapProfileTable9FindAllocEPKvPm' filepath='src/heap-profile-table.cc' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable9FindAllocEPKvPm'>
          <!-- implicit parameter of type 'const HeapProfileTable* const' -->
          <parameter type-id='type-id-252' name='this' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58' name='ptr' filepath='src/heap-profile-table.cc' line='236' column='1'/>
          <!-- parameter of type 'size_t*' -->
          <parameter type-id='type-id-253' name='object_size' filepath='src/heap-profile-table.cc' line='236' column='1'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class LowLevelAlloc -->
    <class-decl name='LowLevelAlloc' size-in-bits='8' visibility='default' filepath='src/base/low_level_alloc.h' line='44' column='1' id='type-id-86'>
      <member-type access='private'>
        <!-- struct LowLevelAlloc::Arena -->
        <class-decl name='Arena' size-in-bits='2560' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='184' column='1' id='type-id-84'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- SpinLock LowLevelAlloc::Arena::mu -->
            <var-decl name='mu' type-id='type-id-87' visibility='default' filepath='src/base/low_level_alloc.cc' line='189' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- low_level_alloc_internal::AllocList LowLevelAlloc::Arena::freelist -->
            <var-decl name='freelist' type-id='type-id-80' visibility='default' filepath='src/base/low_level_alloc.cc' line='191' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2304'>
            <!-- int32 LowLevelAlloc::Arena::allocation_count -->
            <var-decl name='allocation_count' type-id='type-id-74' visibility='default' filepath='src/base/low_level_alloc.cc' line='192' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2336'>
            <!-- int32 LowLevelAlloc::Arena::flags -->
            <var-decl name='flags' type-id='type-id-74' visibility='default' filepath='src/base/low_level_alloc.cc' line='193' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2368'>
            <!-- size_t LowLevelAlloc::Arena::pagesize -->
            <var-decl name='pagesize' type-id='type-id-62' visibility='default' filepath='src/base/low_level_alloc.cc' line='194' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2432'>
            <!-- size_t LowLevelAlloc::Arena::roundup -->
            <var-decl name='roundup' type-id='type-id-62' visibility='default' filepath='src/base/low_level_alloc.cc' line='195' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2496'>
            <!-- size_t LowLevelAlloc::Arena::min_size -->
            <var-decl name='min_size' type-id='type-id-62' visibility='default' filepath='src/base/low_level_alloc.cc' line='197' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <!-- LowLevelAlloc::Arena::Arena() -->
            <function-decl name='Arena' filepath='src/base/low_level_alloc.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'LowLevelAlloc::Arena*' -->
              <parameter type-id='type-id-83' is-artificial='yes'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <!-- LowLevelAlloc::Arena::Arena(int) -->
            <function-decl name='Arena' filepath='src/base/low_level_alloc.cc' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'LowLevelAlloc::Arena*' -->
              <parameter type-id='type-id-83' is-artificial='yes'/>
              <!-- parameter of type 'int' -->
              <parameter type-id='type-id-1'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-function access='private' static='yes'>
        <!-- LowLevelAlloc::Arena* LowLevelAlloc::DefaultArena() -->
        <function-decl name='DefaultArena' mangled-name='_ZN13LowLevelAlloc12DefaultArenaEv' filepath='src/base/low_level_alloc.cc' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc12DefaultArenaEv'>
          <!-- LowLevelAlloc::Arena* -->
          <return type-id='type-id-83'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void* LowLevelAlloc::AllocWithArena(LowLevelAlloc::Arena*) -->
        <function-decl name='AllocWithArena' mangled-name='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE'>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62'/>
          <!-- parameter of type 'LowLevelAlloc::Arena*' -->
          <parameter type-id='type-id-83'/>
          <!-- void* -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- LowLevelAlloc::Arena* LowLevelAlloc::NewArena(LowLevelAlloc::Arena*) -->
        <function-decl name='NewArena' mangled-name='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE'>
          <!-- parameter of type 'typedef int32' -->
          <parameter type-id='type-id-74'/>
          <!-- parameter of type 'LowLevelAlloc::Arena*' -->
          <parameter type-id='type-id-83'/>
          <!-- LowLevelAlloc::Arena* -->
          <return type-id='type-id-83'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void* LowLevelAlloc::Alloc() -->
        <function-decl name='Alloc' mangled-name='_ZN13LowLevelAlloc5AllocEm' filepath='src/base/low_level_alloc.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc5AllocEm'>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-62'/>
          <!-- void* -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void LowLevelAlloc::Free() -->
        <function-decl name='Free' mangled-name='_ZN13LowLevelAlloc4FreeEPv' filepath='src/base/low_level_alloc.cc' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc4FreeEPv'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool LowLevelAlloc::DeleteArena() -->
        <function-decl name='DeleteArena' mangled-name='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE'>
          <!-- parameter of type 'LowLevelAlloc::Arena*' -->
          <parameter type-id='type-id-83'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class AddressMap<HeapProfileTable::AllocValue> -->
    <class-decl name='AddressMap&lt;HeapProfileTable::AllocValue&gt;' size-in-bits='320' visibility='default' filepath='src/addressmap-inl.h' line='104' column='1' id='type-id-235'>
      <member-type access='private'>
        <!-- struct AddressMap<HeapProfileTable::AllocValue>::Cluster -->
        <class-decl name='Cluster' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-256'/>
      </member-type>
      <member-type access='private'>
        <!-- struct AddressMap<HeapProfileTable::AllocValue>::Entry -->
        <class-decl name='Entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-257'/>
      </member-type>
      <member-type access='private'>
        <!-- struct AddressMap<HeapProfileTable::AllocValue>::Object -->
        <class-decl name='Object' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-258'/>
      </member-type>
      <data-member access='private' static='yes'>
        <!-- static const int AddressMap<HeapProfileTable::AllocValue>::kBlockBits -->
        <var-decl name='kBlockBits' type-id='type-id-144' visibility='default' filepath='src/addressmap-inl.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static const int AddressMap<HeapProfileTable::AllocValue>::kBlockSize -->
        <var-decl name='kBlockSize' type-id='type-id-144' visibility='default' filepath='src/addressmap-inl.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static const int AddressMap<HeapProfileTable::AllocValue>::kClusterBits -->
        <var-decl name='kClusterBits' type-id='type-id-144' visibility='default' filepath='src/addressmap-inl.h' line='172' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static const uintptr_t AddressMap<HeapProfileTable::AllocValue>::kClusterSize -->
        <var-decl name='kClusterSize' type-id='type-id-259' visibility='default' filepath='src/addressmap-inl.h' line='173' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static const int AddressMap<HeapProfileTable::AllocValue>::kClusterBlocks -->
        <var-decl name='kClusterBlocks' type-id='type-id-144' visibility='default' filepath='src/addressmap-inl.h' line='174' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static const int AddressMap<HeapProfileTable::AllocValue>::kHashBits -->
        <var-decl name='kHashBits' type-id='type-id-144' visibility='default' filepath='src/addressmap-inl.h' line='187' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static const int AddressMap<HeapProfileTable::AllocValue>::kHashSize -->
        <var-decl name='kHashSize' type-id='type-id-144' visibility='default' filepath='src/addressmap-inl.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static const int AddressMap<HeapProfileTable::AllocValue>::ALLOC_COUNT -->
        <var-decl name='ALLOC_COUNT' type-id='type-id-144' visibility='default' filepath='src/addressmap-inl.h' line='191' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- AddressMap<HeapProfileTable::AllocValue>::Cluster** AddressMap<HeapProfileTable::AllocValue>::hashtable_ -->
        <var-decl name='hashtable_' type-id='type-id-260' visibility='default' filepath='src/addressmap-inl.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- AddressMap<HeapProfileTable::AllocValue>::Entry* AddressMap<HeapProfileTable::AllocValue>::free_ -->
        <var-decl name='free_' type-id='type-id-261' visibility='default' filepath='src/addressmap-inl.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static const uint32_t AddressMap<HeapProfileTable::AllocValue>::kHashMultiplier -->
        <var-decl name='kHashMultiplier' type-id='type-id-262' visibility='default' filepath='src/addressmap-inl.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- void* (unsigned long int)* AddressMap<HeapProfileTable::AllocValue>::alloc_ -->
        <var-decl name='alloc_' type-id='type-id-263' visibility='default' filepath='src/addressmap-inl.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- void (void*)* AddressMap<HeapProfileTable::AllocValue>::dealloc_ -->
        <var-decl name='dealloc_' type-id='type-id-234' visibility='default' filepath='src/addressmap-inl.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- AddressMap<HeapProfileTable::AllocValue>::Object* AddressMap<HeapProfileTable::AllocValue>::allocated_ -->
        <var-decl name='allocated_' type-id='type-id-264' visibility='default' filepath='src/addressmap-inl.h' line='253' column='1'/>
      </data-member>
      <member-function access='private'>
        <!-- void AddressMap<HeapProfileTable::AllocValue>::AddressMap(void* (unsigned long int)*, void (void*)*) -->
        <function-decl name='AddressMap' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E' filepath='src/addressmap-inl.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E'>
          <!-- implicit parameter of type 'AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <!-- parameter of type 'void* (unsigned long int)*' -->
          <parameter type-id='type-id-263'/>
          <!-- parameter of type 'void (void*)*' -->
          <parameter type-id='type-id-234'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- AddressMap<HeapProfileTable::AllocValue>::~AddressMap(int) -->
        <function-decl name='~AddressMap' filepath='src/addressmap-inl.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void AddressMap<HeapProfileTable::AllocValue>::Iterate<void (*)(const void*, const HeapProfileTable::AllocInfo&)>(void (void*, HeapProfileTable::AllocValue*, void (void*, const HeapProfileTable::AllocInfo&)*)*, void (void*, const HeapProfileTable::AllocInfo&)*) -->
        <function-decl name='Iterate&lt;void (*)(const void*, const HeapProfileTable::AllocInfo&amp;)&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-266' is-artificial='yes'/>
          <!-- parameter of type 'void (void*, HeapProfileTable::AllocValue*, void (void*, const HeapProfileTable::AllocInfo&)*)*' -->
          <parameter type-id='type-id-267'/>
          <!-- parameter of type 'void (void*, const HeapProfileTable::AllocInfo&)*' -->
          <parameter type-id='type-id-237'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void AddressMap<HeapProfileTable::AllocValue>::Iterate<char*>(void (void*, HeapProfileTable::AllocValue*, char*)*, char*) -->
        <function-decl name='Iterate&lt;char*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-266' is-artificial='yes'/>
          <!-- parameter of type 'void (void*, HeapProfileTable::AllocValue*, char*)*' -->
          <parameter type-id='type-id-268'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-118'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- AddressMap<HeapProfileTable::AllocValue>::Cluster** AddressMap<HeapProfileTable::AllocValue>::New<AddressMap<HeapProfileTable::AllocValue>::Cluster*>(int) -->
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Cluster*&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- AddressMap<HeapProfileTable::AllocValue>::Cluster** -->
          <return type-id='type-id-260'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void AddressMap<HeapProfileTable::AllocValue>::Iterate<HeapProfileTable::AddNonLiveArgs*>(void (void*, HeapProfileTable::AllocValue*, HeapProfileTable::AddNonLiveArgs*)*, HeapProfileTable::AddNonLiveArgs*) -->
        <function-decl name='Iterate&lt;HeapProfileTable::AddNonLiveArgs*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-266' is-artificial='yes'/>
          <!-- parameter of type 'void (void*, HeapProfileTable::AllocValue*, HeapProfileTable::AddNonLiveArgs*)*' -->
          <parameter type-id='type-id-269'/>
          <!-- parameter of type 'HeapProfileTable::AddNonLiveArgs*' -->
          <parameter type-id='type-id-254'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void AddressMap<HeapProfileTable::AllocValue>::Iterate<HeapProfileTable::Snapshot*>(void (void*, HeapProfileTable::AllocValue*, HeapProfileTable::Snapshot*)*, HeapProfileTable::Snapshot*) -->
        <function-decl name='Iterate&lt;HeapProfileTable::Snapshot*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-266' is-artificial='yes'/>
          <!-- parameter of type 'void (void*, HeapProfileTable::AllocValue*, HeapProfileTable::Snapshot*)*' -->
          <parameter type-id='type-id-270'/>
          <!-- parameter of type 'HeapProfileTable::Snapshot*' -->
          <parameter type-id='type-id-224'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- AddressMap<HeapProfileTable::AllocValue>::Cluster* AddressMap<HeapProfileTable::AllocValue>::New<AddressMap<HeapProfileTable::AllocValue>::Cluster>(int) -->
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Cluster&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- AddressMap<HeapProfileTable::AllocValue>::Cluster* -->
          <return type-id='type-id-271'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- AddressMap<HeapProfileTable::AllocValue>::Entry* AddressMap<HeapProfileTable::AllocValue>::New<AddressMap<HeapProfileTable::AllocValue>::Entry>(int) -->
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Entry&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-265' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- AddressMap<HeapProfileTable::AllocValue>::Entry* -->
          <return type-id='type-id-261'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void AddressMap<HeapProfileTable::AllocValue>::Iterate<const HeapProfileTable::DumpArgs&>(void (void*, HeapProfileTable::AllocValue*, const HeapProfileTable::DumpArgs&)*, const HeapProfileTable::DumpArgs&) -->
        <function-decl name='Iterate&lt;const HeapProfileTable::DumpArgs&amp;&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-266' is-artificial='yes'/>
          <!-- parameter of type 'void (void*, HeapProfileTable::AllocValue*, const HeapProfileTable::DumpArgs&)*' -->
          <parameter type-id='type-id-272'/>
          <!-- parameter of type 'const HeapProfileTable::DumpArgs&' -->
          <parameter type-id='type-id-273'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void AddressMap<HeapProfileTable::AllocValue>::Iterate<HeapProfileTable::Snapshot::ReportState*>(void (void*, HeapProfileTable::AllocValue*, HeapProfileTable::Snapshot::ReportState*)*, HeapProfileTable::Snapshot::ReportState*) -->
        <function-decl name='Iterate&lt;HeapProfileTable::Snapshot::ReportState*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-266' is-artificial='yes'/>
          <!-- parameter of type 'void (void*, HeapProfileTable::AllocValue*, HeapProfileTable::Snapshot::ReportState*)*' -->
          <parameter type-id='type-id-274'/>
          <!-- parameter of type 'HeapProfileTable::Snapshot::ReportState*' -->
          <parameter type-id='type-id-230'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void AddressMap<HeapProfileTable::AllocValue>::Insert(void*, HeapProfileTable::AllocValue) -->
        <function-decl name='Insert' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_' filepath='src/addressmap-inl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_'>
          <!-- implicit parameter of type 'AddressMap<HeapProfileTable::AllocValue>* const' -->
          <parameter type-id='type-id-275' name='this' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58' name='key' filepath='src/addressmap-inl.h' line='309' column='1'/>
          <!-- parameter of type 'struct HeapProfileTable::AllocValue' -->
          <parameter type-id='type-id-210' name='value' filepath='src/addressmap-inl.h' line='309' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class HeapLeakChecker -->
    <class-decl name='HeapLeakChecker' size-in-bits='448' visibility='default' filepath='src/gperftools/heap-checker.h' line='78' column='1' id='type-id-276'>
      <member-type access='private'>
        <!-- class HeapLeakChecker::Disabler -->
        <class-decl name='Disabler' size-in-bits='8' visibility='default' filepath='./src/gperftools/heap-checker.h' line='175' column='1' id='type-id-277'>
          <member-function access='private' constructor='yes'>
            <!-- HeapLeakChecker::Disabler::Disabler() -->
            <function-decl name='Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerC1Ev' filepath='./src/gperftools/heap-checker.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerC1Ev'>
              <!-- implicit parameter of type 'HeapLeakChecker::Disabler*' -->
              <parameter type-id='type-id-278' is-artificial='yes'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' destructor='yes'>
            <!-- HeapLeakChecker::Disabler::~Disabler(int) -->
            <function-decl name='~Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerD1Ev' filepath='./src/gperftools/heap-checker.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerD1Ev'>
              <!-- implicit parameter of type 'HeapLeakChecker::Disabler*' -->
              <parameter type-id='type-id-278' is-artificial='yes'/>
              <!-- artificial parameter of type 'int' -->
              <parameter type-id='type-id-1' is-artificial='yes'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <!-- HeapLeakChecker::Disabler::Disabler(const HeapLeakChecker::Disabler&) -->
            <function-decl name='Disabler' filepath='./src/gperftools/heap-checker.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'HeapLeakChecker::Disabler*' -->
              <parameter type-id='type-id-278' is-artificial='yes'/>
              <!-- parameter of type 'const HeapLeakChecker::Disabler&' -->
              <parameter type-id='type-id-279'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- enum HeapLeakChecker::ShouldSymbolize -->
        <enum-decl name='ShouldSymbolize' filepath='./src/gperftools/heap-checker.h' line='225' column='1' id='type-id-280'>
          <underlying-type type-id='type-id-89'/>
          <enumerator name='SYMBOLIZE' value='0'/>
          <enumerator name='DO_NOT_SYMBOLIZE' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <!-- enum HeapLeakChecker::ProcMapsTask -->
        <enum-decl name='ProcMapsTask' filepath='./src/gperftools/heap-checker.h' line='295' column='1' id='type-id-281'>
          <underlying-type type-id='type-id-89'/>
          <enumerator name='RECORD_GLOBAL_DATA' value='0'/>
          <enumerator name='DISABLE_LIBRARY_ALLOCS' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <!-- enum HeapLeakChecker::ProcMapsResult -->
        <enum-decl name='ProcMapsResult' filepath='./src/gperftools/heap-checker.h' line='301' column='1' id='type-id-282'>
          <underlying-type type-id='type-id-89'/>
          <enumerator name='PROC_MAPS_USED' value='0'/>
          <enumerator name='CANT_OPEN_PROC_MAPS' value='1'/>
          <enumerator name='NO_SHARED_LIBS_IN_PROC_MAPS' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapLeakChecker::RangeValue -->
        <class-decl name='RangeValue' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='404' column='1' id='type-id-283'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- uintptr_t HeapLeakChecker::RangeValue::start_address -->
            <var-decl name='start_address' type-id='type-id-156' visibility='default' filepath='src/heap-checker.cc' line='405' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- int HeapLeakChecker::RangeValue::max_depth -->
            <var-decl name='max_depth' type-id='type-id-1' visibility='default' filepath='src/heap-checker.cc' line='406' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapLeakChecker::Allocator -->
        <class-decl name='Allocator' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='292' column='1' id='type-id-284'>
          <data-member access='private' static='yes'>
            <!-- static LowLevelAlloc::Arena* HeapLeakChecker::Allocator::arena_ -->
            <var-decl name='arena_' type-id='type-id-83' mangled-name='_ZN15HeapLeakChecker9Allocator6arena_E' visibility='default' filepath='src/heap-checker.cc' line='333' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator6arena_E'/>
          </data-member>
          <data-member access='private' static='yes'>
            <!-- static int HeapLeakChecker::Allocator::alloc_count_ -->
            <var-decl name='alloc_count_' type-id='type-id-1' mangled-name='_ZN15HeapLeakChecker9Allocator12alloc_count_E' visibility='default' filepath='src/heap-checker.cc' line='334' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator12alloc_count_E'/>
          </data-member>
          <member-function access='public' static='yes'>
            <!-- void HeapLeakChecker::Allocator::DeleteAndNull<DisabledRangeMap>() -->
            <function-decl name='DeleteAndNull&lt;DisabledRangeMap&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- parameter of type 'DisabledRangeMap**' -->
              <parameter type-id='type-id-285'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <!-- void HeapLeakChecker::Allocator::DeleteAndNull<GlobalRegionCallerRangeMap>() -->
            <function-decl name='DeleteAndNull&lt;GlobalRegionCallerRangeMap&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- parameter of type 'GlobalRegionCallerRangeMap**' -->
              <parameter type-id='type-id-286'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <!-- void HeapLeakChecker::Allocator::DeleteAndNull<HeapProfileTable>() -->
            <function-decl name='DeleteAndNull&lt;HeapProfileTable&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- parameter of type 'HeapProfileTable**' -->
              <parameter type-id='type-id-287'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <!-- void HeapLeakChecker::Allocator::DeleteAndNullIfNot<DisabledRangeMap>() -->
            <function-decl name='DeleteAndNullIfNot&lt;DisabledRangeMap&gt;' filepath='src/heap-checker.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- parameter of type 'DisabledRangeMap**' -->
              <parameter type-id='type-id-285'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <!-- void HeapLeakChecker::Allocator::DeleteAndNull<LibraryLiveObjectsStacks>() -->
            <function-decl name='DeleteAndNull&lt;LibraryLiveObjectsStacks&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- parameter of type 'LibraryLiveObjectsStacks**' -->
              <parameter type-id='type-id-288'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <!-- void HeapLeakChecker::Allocator::DeleteAndNull<LiveObjectsStack>() -->
            <function-decl name='DeleteAndNull&lt;LiveObjectsStack&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- parameter of type 'LiveObjectsStack**' -->
              <parameter type-id='type-id-289'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <!-- void HeapLeakChecker::Allocator::DeleteAndNull<StackTopSet>() -->
            <function-decl name='DeleteAndNull&lt;StackTopSet&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- parameter of type 'StackTopSet**' -->
              <parameter type-id='type-id-290'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <!-- void HeapLeakChecker::Allocator::DeleteAndNullIfNot<GlobalRegionCallerRangeMap>() -->
            <function-decl name='DeleteAndNullIfNot&lt;GlobalRegionCallerRangeMap&gt;' filepath='src/heap-checker.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- parameter of type 'GlobalRegionCallerRangeMap**' -->
              <parameter type-id='type-id-286'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <!-- void* HeapLeakChecker::Allocator::Allocate() -->
            <function-decl name='Allocate' mangled-name='_ZN15HeapLeakChecker9Allocator8AllocateEm' filepath='src/heap-checker.cc' line='309' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator8AllocateEm'>
              <!-- parameter of type 'typedef size_t' -->
              <parameter type-id='type-id-62'/>
              <!-- void* -->
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <!-- void HeapLeakChecker::Allocator::Free() -->
            <function-decl name='Free' mangled-name='_ZN15HeapLeakChecker9Allocator4FreeEPv' filepath='src/heap-checker.cc' line='315' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator4FreeEPv'>
              <!-- parameter of type 'void*' -->
              <parameter type-id='type-id-58'/>
              <!-- void -->
              <return type-id='type-id-60'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- SpinLock* HeapLeakChecker::lock_ -->
        <var-decl name='lock_' type-id='type-id-94' visibility='default' filepath='./src/gperftools/heap-checker.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- const char* HeapLeakChecker::name_ -->
        <var-decl name='name_' type-id='type-id-57' visibility='default' filepath='./src/gperftools/heap-checker.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- void* HeapLeakChecker::start_snapshot_ -->
        <var-decl name='start_snapshot_' type-id='type-id-58' visibility='default' filepath='./src/gperftools/heap-checker.h' line='365' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- bool HeapLeakChecker::has_checked_ -->
        <var-decl name='has_checked_' type-id='type-id-61' visibility='default' filepath='./src/gperftools/heap-checker.h' line='367' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- ssize_t HeapLeakChecker::inuse_bytes_increase_ -->
        <var-decl name='inuse_bytes_increase_' type-id='type-id-291' visibility='default' filepath='./src/gperftools/heap-checker.h' line='368' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <!-- ssize_t HeapLeakChecker::inuse_allocs_increase_ -->
        <var-decl name='inuse_allocs_increase_' type-id='type-id-291' visibility='default' filepath='./src/gperftools/heap-checker.h' line='369' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <!-- bool HeapLeakChecker::keep_profiles_ -->
        <var-decl name='keep_profiles_' type-id='type-id-61' visibility='default' filepath='./src/gperftools/heap-checker.h' line='371' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- HeapLeakChecker::HeapLeakChecker(const char*) -->
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1EPKc' filepath='./src/gperftools/heap-checker.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1EPKc'>
          <!-- implicit parameter of type 'HeapLeakChecker*' -->
          <parameter type-id='type-id-292' is-artificial='yes'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- HeapLeakChecker::~HeapLeakChecker(int) -->
        <function-decl name='~HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerD1Ev' filepath='./src/gperftools/heap-checker.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerD1Ev'>
          <!-- implicit parameter of type 'HeapLeakChecker*' -->
          <parameter type-id='type-id-292' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- HeapLeakChecker::HeapLeakChecker() -->
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1Ev' filepath='./src/gperftools/heap-checker.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1Ev'>
          <!-- implicit parameter of type 'HeapLeakChecker*' -->
          <parameter type-id='type-id-292' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- HeapLeakChecker::HeapLeakChecker(const HeapLeakChecker&) -->
        <function-decl name='HeapLeakChecker' filepath='./src/gperftools/heap-checker.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'HeapLeakChecker*' -->
          <parameter type-id='type-id-292' is-artificial='yes'/>
          <!-- parameter of type 'const HeapLeakChecker&' -->
          <parameter type-id='type-id-293'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- char* HeapLeakChecker::IgnoreObject<char>() -->
        <function-decl name='IgnoreObject&lt;char&gt;' filepath='./src/gperftools/heap-checker.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-118'/>
          <!-- char* -->
          <return type-id='type-id-118'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::DisableChecksIn() -->
        <function-decl name='DisableChecksIn' mangled-name='_ZN15HeapLeakChecker15DisableChecksInEPKc' filepath='src/heap-checker.cc' line='1514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DisableChecksInEPKc'>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::BeforeConstructorsLocked() -->
        <function-decl name='BeforeConstructorsLocked' mangled-name='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv' filepath='src/heap-checker.cc' line='2203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv'>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- char* HeapLeakChecker::MakeProfileNameLocked() -->
        <function-decl name='MakeProfileNameLocked' mangled-name='_ZN15HeapLeakChecker21MakeProfileNameLockedEv' filepath='src/heap-checker.cc' line='1564' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker21MakeProfileNameLockedEv'>
          <!-- implicit parameter of type 'HeapLeakChecker* const' -->
          <parameter type-id='type-id-294' name='this' is-artificial='yes'/>
          <!-- char* -->
          <return type-id='type-id-118'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::DisableChecksFromToLocked(void*, int) -->
        <function-decl name='DisableChecksFromToLocked' mangled-name='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i' filepath='src/heap-checker.cc' line='2336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::DisableLibraryAllocsLocked(uintptr_t, uintptr_t) -->
        <function-decl name='DisableLibraryAllocsLocked' mangled-name='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm' filepath='src/heap-checker.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm'>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57'/>
          <!-- parameter of type 'typedef uintptr_t' -->
          <parameter type-id='type-id-156'/>
          <!-- parameter of type 'typedef uintptr_t' -->
          <parameter type-id='type-id-156'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::TurnItselfOffLocked() -->
        <function-decl name='TurnItselfOffLocked' mangled-name='_ZN15HeapLeakChecker19TurnItselfOffLockedEv' filepath='src/heap-checker.cc' line='2229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker19TurnItselfOffLockedEv'>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::IgnoreLiveObjectsLocked(const char*) -->
        <function-decl name='IgnoreLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_' filepath='src/heap-checker.cc' line='1392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_'>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void* HeapLeakChecker::GetAllocCaller() -->
        <function-decl name='GetAllocCaller' mangled-name='_ZN15HeapLeakChecker14GetAllocCallerEPv' filepath='src/heap-checker.cc' line='2380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14GetAllocCallerEPv'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- void* -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::CancelGlobalCheck() -->
        <function-decl name='CancelGlobalCheck' mangled-name='_ZN15HeapLeakChecker17CancelGlobalCheckEv' filepath='src/heap-checker.cc' line='2193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17CancelGlobalCheckEv'>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- HeapLeakChecker* HeapLeakChecker::GlobalChecker() -->
        <function-decl name='GlobalChecker' mangled-name='_ZN15HeapLeakChecker13GlobalCheckerEv' filepath='src/heap-checker.cc' line='2181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13GlobalCheckerEv'>
          <!-- HeapLeakChecker* -->
          <return type-id='type-id-292'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool HeapLeakChecker::IsActive() -->
        <function-decl name='IsActive' mangled-name='_ZN15HeapLeakChecker8IsActiveEv' filepath='src/heap-checker.cc' line='1901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8IsActiveEv'>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- ssize_t HeapLeakChecker::ObjectsLeaked() -->
        <function-decl name='ObjectsLeaked' mangled-name='_ZNK15HeapLeakChecker13ObjectsLeakedEv' filepath='src/heap-checker.cc' line='1645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker13ObjectsLeakedEv'>
          <!-- implicit parameter of type 'const HeapLeakChecker* const' -->
          <parameter type-id='type-id-295' name='this' is-artificial='yes'/>
          <!-- typedef ssize_t -->
          <return type-id='type-id-291'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- ssize_t HeapLeakChecker::BytesLeaked() -->
        <function-decl name='BytesLeaked' mangled-name='_ZNK15HeapLeakChecker11BytesLeakedEv' filepath='src/heap-checker.cc' line='1637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker11BytesLeakedEv'>
          <!-- implicit parameter of type 'const HeapLeakChecker* const' -->
          <parameter type-id='type-id-295' name='this' is-artificial='yes'/>
          <!-- typedef ssize_t -->
          <return type-id='type-id-291'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::UnIgnoreObject() -->
        <function-decl name='UnIgnoreObject' mangled-name='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv' filepath='src/heap-checker.cc' line='1539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::IgnoreNonThreadLiveObjectsLocked() -->
        <function-decl name='IgnoreNonThreadLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv' filepath='src/heap-checker.cc' line='1093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv'>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::DoIgnoreObject() -->
        <function-decl name='DoIgnoreObject' mangled-name='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv' filepath='src/heap-checker.cc' line='1519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapLeakChecker::Create(const char*, bool) -->
        <function-decl name='Create' mangled-name='_ZN15HeapLeakChecker6CreateEPKcb' filepath='src/heap-checker.cc' line='1576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker6CreateEPKcb'>
          <!-- implicit parameter of type 'HeapLeakChecker* const' -->
          <parameter type-id='type-id-294' name='this' is-artificial='yes'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-57' name='name' filepath='src/heap-checker.cc' line='1576' column='1'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-61' name='make_start_snapshot' filepath='src/heap-checker.cc' line='1576' column='1'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- HeapLeakChecker::ProcMapsResult HeapLeakChecker::UseProcMapsLocked() -->
        <function-decl name='UseProcMapsLocked' mangled-name='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE' filepath='src/heap-checker.cc' line='892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE'>
          <!-- parameter of type 'enum HeapLeakChecker::ProcMapsTask' -->
          <parameter type-id='type-id-281'/>
          <!-- enum HeapLeakChecker::ProcMapsResult -->
          <return type-id='type-id-282'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- int HeapLeakChecker::IgnoreLiveThreadsLocked(int, pid_t*, typedef __va_list_tag __va_list_tag*) -->
        <function-decl name='IgnoreLiveThreadsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag' filepath='src/heap-checker.cc' line='1021' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'pid_t*' -->
          <parameter type-id='type-id-71'/>
          <!-- parameter of type 'typedef __va_list_tag __va_list_tag*' -->
          <parameter type-id='type-id-72'/>
          <!-- int -->
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::IgnoreAllLiveObjectsLocked() -->
        <function-decl name='IgnoreAllLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv' filepath='src/heap-checker.cc' line='1261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-58'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool HeapLeakChecker::DoNoLeaks(HeapLeakChecker::ShouldSymbolize) -->
        <function-decl name='DoNoLeaks' mangled-name='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE' filepath='src/heap-checker.cc' line='1712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE'>
          <!-- implicit parameter of type 'HeapLeakChecker* const' -->
          <parameter type-id='type-id-294' name='this' is-artificial='yes'/>
          <!-- parameter of type 'enum HeapLeakChecker::ShouldSymbolize' -->
          <parameter type-id='type-id-280' name='should_symbolize' filepath='src/heap-checker.cc' line='1712' column='1'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool HeapLeakChecker::NoGlobalLeaksMaybeSymbolize() -->
        <function-decl name='NoGlobalLeaksMaybeSymbolize' mangled-name='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE' filepath='src/heap-checker.cc' line='2141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE'>
          <!-- parameter of type 'enum HeapLeakChecker::ShouldSymbolize' -->
          <parameter type-id='type-id-280'/>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool HeapLeakChecker::NoGlobalLeaks() -->
        <function-decl name='NoGlobalLeaks' mangled-name='_ZN15HeapLeakChecker13NoGlobalLeaksEv' filepath='src/heap-checker.cc' line='2187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13NoGlobalLeaksEv'>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool HeapLeakChecker::DoMainHeapCheck() -->
        <function-decl name='DoMainHeapCheck' mangled-name='_ZN15HeapLeakChecker15DoMainHeapCheckEv' filepath='src/heap-checker.cc' line='2153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DoMainHeapCheckEv'>
          <!-- bool -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- MallocExtension* HeapLeakChecker::IgnoreObject<MallocExtension>() -->
        <function-decl name='IgnoreObject&lt;MallocExtension&gt;' filepath='src/gperftools/heap-checker.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'MallocExtension*' -->
          <parameter type-id='type-id-296'/>
          <!-- MallocExtension* -->
          <return type-id='type-id-296'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct HeapProfileBucket -->
    <class-decl name='HeapProfileBucket' size-in-bits='448' is-struct='yes' visibility='default' filepath='src/heap-profile-stats.h' line='68' column='1' id='type-id-212'>
      <!-- struct HeapProfileStats -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-180'/>
      <data-member access='public' static='yes'>
        <!-- static const int HeapProfileBucket::kMaxStackDepth -->
        <var-decl name='kMaxStackDepth' type-id='type-id-144' visibility='default' filepath='src/heap-profile-stats.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- uintptr_t HeapProfileBucket::hash -->
        <var-decl name='hash' type-id='type-id-156' visibility='default' filepath='src/heap-profile-stats.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int HeapProfileBucket::depth -->
        <var-decl name='depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-stats.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void** HeapProfileBucket::stack -->
        <var-decl name='stack' type-id='type-id-151' visibility='default' filepath='src/heap-profile-stats.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- HeapProfileBucket* HeapProfileBucket::next -->
        <var-decl name='next' type-id='type-id-206' visibility='default' filepath='src/heap-profile-stats.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <!-- class STL_Allocator<char, HeapLeakChecker::Allocator> -->
    <class-decl name='STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-297'>
      <member-function access='private'>
        <!-- void STL_Allocator<char, HeapLeakChecker::Allocator>::STL_Allocator() -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<char, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-298' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<char, HeapLeakChecker::Allocator>::STL_Allocator(const STL_Allocator<char, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<char, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-298' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<char, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-299'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- STL_Allocator<char, HeapLeakChecker::Allocator>::~STL_Allocator(int) -->
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<char, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-298' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- typedef int RawFD -->
    <typedef-decl name='RawFD' type-id='type-id-1' filepath='./src/base/logging.h' line='251' column='1' id='type-id-75'/>
    <!-- typedef long int __intptr_t -->
    <typedef-decl name='__intptr_t' type-id='type-id-85' filepath='/usr/include/bits/types.h' line='189' column='1' id='type-id-300'/>
    <!-- typedef __off_t off_t -->
    <typedef-decl name='off_t' type-id='type-id-301' filepath='/usr/include/sys/types.h' line='87' column='1' id='type-id-207'/>
    <!-- class STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > >, HeapLeakChecker::Allocator> -->
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-302'>
      <member-function access='private'>
        <!-- void STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > >, HeapLeakChecker::Allocator>::STL_Allocator() -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-303' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > >, HeapLeakChecker::Allocator>::STL_Allocator(const STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > >, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-303' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > >, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-304'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > >, HeapLeakChecker::Allocator>::~STL_Allocator(int) -->
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-303' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class STL_Allocator<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > >, HeapLeakChecker::Allocator> -->
    <class-decl name='STL_Allocator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-305'>
      <member-function access='private'>
        <!-- void STL_Allocator<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > >, HeapLeakChecker::Allocator>::STL_Allocator() -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > >, HeapLeakChecker::Allocator>::STL_Allocator(const STL_Allocator<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > >, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > >, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-307'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- STL_Allocator<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > >, HeapLeakChecker::Allocator>::~STL_Allocator(int) -->
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > >, HeapLeakChecker::Allocator>::STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > > >(const STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > >, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<std::_Rb_tree_node<std::pair<const std::basic_string<char, std::char_traits<char>, STL_Allocator<char, HeapLeakChecker::Allocator> >, std::vector<AllocObject, STL_Allocator<AllocObject, HeapLeakChecker::Allocator> > > >, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-304'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> >, HeapLeakChecker::Allocator> -->
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-308'>
      <member-function access='private'>
        <!-- void STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> >, HeapLeakChecker::Allocator>::STL_Allocator() -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-309' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> >, HeapLeakChecker::Allocator>::STL_Allocator(const STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> >, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-309' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> >, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-310'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> >, HeapLeakChecker::Allocator>::~STL_Allocator(int) -->
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-309' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class STL_Allocator<std::pair<const long unsigned int, HeapLeakChecker::RangeValue>, HeapLeakChecker::Allocator> -->
    <class-decl name='STL_Allocator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-311'>
      <member-function access='private'>
        <!-- void STL_Allocator<std::pair<const long unsigned int, HeapLeakChecker::RangeValue>, HeapLeakChecker::Allocator>::STL_Allocator() -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::pair<const long unsigned int, HeapLeakChecker::RangeValue>, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-312' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<std::pair<const long unsigned int, HeapLeakChecker::RangeValue>, HeapLeakChecker::Allocator>::STL_Allocator(const STL_Allocator<std::pair<const long unsigned int, HeapLeakChecker::RangeValue>, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::pair<const long unsigned int, HeapLeakChecker::RangeValue>, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-312' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<std::pair<const long unsigned int, HeapLeakChecker::RangeValue>, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-313'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- STL_Allocator<std::pair<const long unsigned int, HeapLeakChecker::RangeValue>, HeapLeakChecker::Allocator>::~STL_Allocator(int) -->
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::pair<const long unsigned int, HeapLeakChecker::RangeValue>, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-312' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<std::pair<const long unsigned int, HeapLeakChecker::RangeValue>, HeapLeakChecker::Allocator>::STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> > >(const STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> >, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::pair<const long unsigned int, HeapLeakChecker::RangeValue>, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-312' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, HeapLeakChecker::RangeValue> >, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-310'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class STL_Allocator<std::_Rb_tree_node<long unsigned int>, HeapLeakChecker::Allocator> -->
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;long unsigned int&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-314'>
      <member-function access='private'>
        <!-- void STL_Allocator<std::_Rb_tree_node<long unsigned int>, HeapLeakChecker::Allocator>::STL_Allocator() -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<long unsigned int>, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-315' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<std::_Rb_tree_node<long unsigned int>, HeapLeakChecker::Allocator>::STL_Allocator(const STL_Allocator<std::_Rb_tree_node<long unsigned int>, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<long unsigned int>, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-315' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<std::_Rb_tree_node<long unsigned int>, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-316'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- STL_Allocator<std::_Rb_tree_node<long unsigned int>, HeapLeakChecker::Allocator>::~STL_Allocator(int) -->
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<long unsigned int>, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-315' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class STL_Allocator<long unsigned int, HeapLeakChecker::Allocator> -->
    <class-decl name='STL_Allocator&lt;long unsigned int, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-317'>
      <member-function access='private'>
        <!-- void STL_Allocator<long unsigned int, HeapLeakChecker::Allocator>::STL_Allocator() -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<long unsigned int, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<long unsigned int, HeapLeakChecker::Allocator>::STL_Allocator(const STL_Allocator<long unsigned int, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<long unsigned int, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<long unsigned int, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-319'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- STL_Allocator<long unsigned int, HeapLeakChecker::Allocator>::~STL_Allocator(int) -->
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<long unsigned int, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<long unsigned int, HeapLeakChecker::Allocator>::STL_Allocator<std::_Rb_tree_node<long unsigned int> >(const STL_Allocator<std::_Rb_tree_node<long unsigned int>, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;long unsigned int&gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<long unsigned int, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<std::_Rb_tree_node<long unsigned int>, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-316'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, long unsigned int> >, HeapLeakChecker::Allocator> -->
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-320'>
      <member-function access='private'>
        <!-- void STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, long unsigned int> >, HeapLeakChecker::Allocator>::STL_Allocator() -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, long unsigned int> >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-321' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, long unsigned int> >, HeapLeakChecker::Allocator>::STL_Allocator(const STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, long unsigned int> >, HeapLeakChecker::Allocator>&) -->
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, long unsigned int> >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-321' is-artificial='yes'/>
          <!-- parameter of type 'const STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, long unsigned int> >, HeapLeakChecker::Allocator>&' -->
          <parameter type-id='type-id-322'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, long unsigned int> >, HeapLeakChecker::Allocator>::~STL_Allocator(int) -->
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'STL_Allocator<std::_Rb_tree_node<std::pair<const long unsigned int, long unsigned int> >, HeapLeakChecker::Allocator>*' -->
          <parameter type-id='type-id-321' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class STL_Allocator<std::pair<const long unsigned int, long unsigned int>, HeapLeakChecker::Allocator> -->
