<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libdbus-1.so.3'>
  <elf-needed>
    <dependency name='librt.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- dbus_address_entries_free -->
    <elf-symbol name='dbus_address_entries_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_address_entry_get_method -->
    <elf-symbol name='dbus_address_entry_get_method' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_address_entry_get_value -->
    <elf-symbol name='dbus_address_entry_get_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_address_escape_value -->
    <elf-symbol name='dbus_address_escape_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_address_unescape_value -->
    <elf-symbol name='dbus_address_unescape_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_bus_add_match -->
    <elf-symbol name='dbus_bus_add_match' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_bus_get -->
    <elf-symbol name='dbus_bus_get' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='dbus_signature_iter_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_signature_iter_recurse -->
    <elf-symbol name='dbus_signature_iter_recurse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_signature_validate -->
    <elf-symbol name='dbus_signature_validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_signature_validate_single -->
    <elf-symbol name='dbus_signature_validate_single' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_threads_init -->
    <elf-symbol name='dbus_threads_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_threads_init_default -->
    <elf-symbol name='dbus_threads_init_default' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_timeout_get_data -->
    <elf-symbol name='dbus_timeout_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_timeout_get_enabled -->
    <elf-symbol name='dbus_timeout_get_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_timeout_get_interval -->
    <elf-symbol name='dbus_timeout_get_interval' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_timeout_handle -->
    <elf-symbol name='dbus_timeout_handle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_timeout_set_data -->
    <elf-symbol name='dbus_timeout_set_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_type_is_basic -->
    <elf-symbol name='dbus_type_is_basic' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_type_is_container -->
    <elf-symbol name='dbus_type_is_container' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_type_is_fixed -->
    <elf-symbol name='dbus_type_is_fixed' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_type_is_valid -->
    <elf-symbol name='dbus_type_is_valid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_bus_name -->
    <elf-symbol name='dbus_validate_bus_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_error_name -->
    <elf-symbol name='dbus_validate_error_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_interface -->
    <elf-symbol name='dbus_validate_interface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_member -->
    <elf-symbol name='dbus_validate_member' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_path -->
    <elf-symbol name='dbus_validate_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_utf8 -->
    <elf-symbol name='dbus_validate_utf8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_data -->
    <elf-symbol name='dbus_watch_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_enabled -->
    <elf-symbol name='dbus_watch_get_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_fd -->
    <elf-symbol name='dbus_watch_get_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_flags -->
    <elf-symbol name='dbus_watch_get_flags' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_socket -->
    <elf-symbol name='dbus_watch_get_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_unix_fd -->
    <elf-symbol name='dbus_watch_get_unix_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_handle -->
    <elf-symbol name='dbus_watch_handle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_set_data -->
    <elf-symbol name='dbus_watch_set_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='dbus-address.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-3'/>
    <!-- void -->
    <type-decl name='void' id='type-id-4'/>
    <!-- typedef DBusAddressEntry DBusAddressEntry -->
    <typedef-decl name='DBusAddressEntry' type-id='type-id-5' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.h' line='41' column='1' id='type-id-6'/>
    <!-- struct DBusAddressEntry -->
    <class-decl name='DBusAddressEntry' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='44' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusString DBusAddressEntry::method -->
        <var-decl name='method' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusList* DBusAddressEntry::keys -->
        <var-decl name='keys' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- DBusList* DBusAddressEntry::values -->
        <var-decl name='values' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='48' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusString DBusString -->
    <typedef-decl name='DBusString' type-id='type-id-9' filepath='../dbus/dbus-string.h' line='40' column='1' id='type-id-7'/>
    <!-- struct DBusString -->
    <class-decl name='DBusString' size-in-bits='192' is-struct='yes' visibility='default' filepath='../dbus/dbus-string.h' line='43' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* DBusString::dummy1 -->
        <var-decl name='dummy1' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-string.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int DBusString::dummy2 -->
        <var-decl name='dummy2' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-string.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int DBusString::dummy3 -->
        <var-decl name='dummy3' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-string.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int DBusString::dummy_bit1 -->
        <var-decl name='dummy_bit1' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-string.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <!-- unsigned int DBusString::dummy_bit2 -->
        <var-decl name='dummy_bit2' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-string.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <!-- unsigned int DBusString::dummy_bit3 -->
        <var-decl name='dummy_bit3' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-string.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <!-- unsigned int DBusString::dummy_bits -->
        <var-decl name='dummy_bits' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-string.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusList -->
    <class-decl name='DBusList' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='35' column='1' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusList* DBusList::prev -->
        <var-decl name='prev' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusList* DBusList::next -->
        <var-decl name='next' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* DBusList::data -->
        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusList DBusList -->
    <typedef-decl name='DBusList' type-id='type-id-11' filepath='../dbus/dbus-sysdeps.h' line='74' column='1' id='type-id-12'/>
    <!-- typedef DBusError DBusError -->
    <typedef-decl name='DBusError' type-id='type-id-13' filepath='../dbus/dbus-errors.h' line='43' column='1' id='type-id-14'/>
    <!-- struct DBusError -->
    <class-decl name='DBusError' size-in-bits='256' is-struct='yes' visibility='default' filepath='../dbus/dbus-errors.h' line='49' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* DBusError::name -->
        <var-decl name='name' type-id='type-id-15' visibility='default' filepath='../dbus/dbus-errors.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* DBusError::message -->
        <var-decl name='message' type-id='type-id-15' visibility='default' filepath='../dbus/dbus-errors.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int DBusError::dummy1 -->
        <var-decl name='dummy1' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <!-- unsigned int DBusError::dummy2 -->
        <var-decl name='dummy2' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <!-- unsigned int DBusError::dummy3 -->
        <var-decl name='dummy3' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <!-- unsigned int DBusError::dummy4 -->
        <var-decl name='dummy4' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <!-- unsigned int DBusError::dummy5 -->
        <var-decl name='dummy5' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* DBusError::padding1 -->
        <var-decl name='padding1' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-errors.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef dbus_uint32_t dbus_bool_t -->
    <typedef-decl name='dbus_bool_t' type-id='type-id-16' filepath='../dbus/dbus-types.h' line='35' column='1' id='type-id-17'/>
    <!-- typedef unsigned int dbus_uint32_t -->
    <typedef-decl name='dbus_uint32_t' type-id='type-id-3' filepath='../dbus/dbus-arch-deps.h' line='43' column='1' id='type-id-16'/>
    <!-- DBusAddressEntry* -->
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-18'/>
    <!-- DBusAddressEntry** -->
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-19'/>
    <!-- DBusAddressEntry*** -->
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-20'/>
    <!-- DBusError* -->
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-21'/>
    <!-- DBusList* -->
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-8'/>
    <!-- char* -->
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-22'/>
    <!-- const char -->
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-23'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-15'/>
    <!-- int* -->
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-24'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-10'/>
    <!-- const char* dbus_address_entry_get_method(DBusAddressEntry*) -->
    <function-decl name='dbus_address_entry_get_method' mangled-name='dbus_address_entry_get_method' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entry_get_method'>
      <!-- parameter of type 'DBusAddressEntry*' -->
      <parameter type-id='type-id-18' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='227' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- char* dbus_address_unescape_value(const char*, DBusError*) -->
    <function-decl name='dbus_address_unescape_value' mangled-name='dbus_address_unescape_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='617' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_unescape_value'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='617' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='618' column='1'/>
      <!-- char* -->
      <return type-id='type-id-22'/>
    </function-decl>
    <!-- void dbus_address_entries_free(DBusAddressEntry**) -->
    <function-decl name='dbus_address_entries_free' mangled-name='dbus_address_entries_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entries_free'>
      <!-- parameter of type 'DBusAddressEntry**' -->
      <parameter type-id='type-id-19' name='entries' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='189' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_parse_address(const char*, DBusAddressEntry***, int*, DBusError*) -->
    <function-decl name='dbus_parse_address' mangled-name='dbus_parse_address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_parse_address'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='363' column='1'/>
      <!-- parameter of type 'DBusAddressEntry***' -->
      <parameter type-id='type-id-20' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='364' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-24' name='array_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='365' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='366' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- const char* dbus_address_entry_get_value(DBusAddressEntry*, const char*) -->
    <function-decl name='dbus_address_entry_get_value' mangled-name='dbus_address_entry_get_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entry_get_value'>
      <!-- parameter of type 'DBusAddressEntry*' -->
      <parameter type-id='type-id-18' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='244' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='245' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- char* dbus_address_escape_value(const char*) -->
    <function-decl name='dbus_address_escape_value' mangled-name='dbus_address_escape_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_escape_value'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='583' column='1'/>
      <!-- char* -->
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-bus.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- struct DBusConnection -->
    <class-decl name='DBusConnection' size-in-bits='2112' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='257' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusAtomic DBusConnection::refcount -->
        <var-decl name='refcount' type-id='type-id-26' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusRMutex* DBusConnection::mutex -->
        <var-decl name='mutex' type-id='type-id-27' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- DBusCMutex* DBusConnection::dispatch_mutex -->
        <var-decl name='dispatch_mutex' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusCondVar* DBusConnection::dispatch_cond -->
        <var-decl name='dispatch_cond' type-id='type-id-29' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- DBusCMutex* DBusConnection::io_path_mutex -->
        <var-decl name='io_path_mutex' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- DBusCondVar* DBusConnection::io_path_cond -->
        <var-decl name='io_path_cond' type-id='type-id-29' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- DBusList* DBusConnection::outgoing_messages -->
        <var-decl name='outgoing_messages' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- DBusList* DBusConnection::incoming_messages -->
        <var-decl name='incoming_messages' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- DBusList* DBusConnection::expired_messages -->
        <var-decl name='expired_messages' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- DBusMessage* DBusConnection::message_borrowed -->
        <var-decl name='message_borrowed' type-id='type-id-30' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- int DBusConnection::n_outgoing -->
        <var-decl name='n_outgoing' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- int DBusConnection::n_incoming -->
        <var-decl name='n_incoming' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- DBusCounter* DBusConnection::outgoing_counter -->
        <var-decl name='outgoing_counter' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- DBusTransport* DBusConnection::transport -->
        <var-decl name='transport' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- DBusWatchList* DBusConnection::watches -->
        <var-decl name='watches' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- DBusTimeoutList* DBusConnection::timeouts -->
        <var-decl name='timeouts' type-id='type-id-34' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- DBusList* DBusConnection::filter_list -->
        <var-decl name='filter_list' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- DBusRMutex* DBusConnection::slot_mutex -->
        <var-decl name='slot_mutex' type-id='type-id-27' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- DBusDataSlotList DBusConnection::slot_list -->
        <var-decl name='slot_list' type-id='type-id-35' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- DBusHashTable* DBusConnection::pending_replies -->
        <var-decl name='pending_replies' type-id='type-id-36' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- dbus_uint32_t DBusConnection::client_serial -->
        <var-decl name='client_serial' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- DBusList* DBusConnection::disconnect_message_link -->
        <var-decl name='disconnect_message_link' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- DBusWakeupMainFunction DBusConnection::wakeup_main_function -->
        <var-decl name='wakeup_main_function' type-id='type-id-37' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <!-- void* DBusConnection::wakeup_main_data -->
        <var-decl name='wakeup_main_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- DBusFreeFunction DBusConnection::free_wakeup_main_data -->
        <var-decl name='free_wakeup_main_data' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <!-- DBusDispatchStatusFunction DBusConnection::dispatch_status_function -->
        <var-decl name='dispatch_status_function' type-id='type-id-39' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <!-- void* DBusConnection::dispatch_status_data -->
        <var-decl name='dispatch_status_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <!-- DBusFreeFunction DBusConnection::free_dispatch_status_data -->
        <var-decl name='free_dispatch_status_data' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <!-- DBusDispatchStatus DBusConnection::last_dispatch_status -->
        <var-decl name='last_dispatch_status' type-id='type-id-40' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <!-- DBusObjectTree* DBusConnection::objects -->
        <var-decl name='objects' type-id='type-id-41' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <!-- char* DBusConnection::server_guid -->
        <var-decl name='server_guid' type-id='type-id-22' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <!-- dbus_bool_t DBusConnection::dispatch_acquired -->
        <var-decl name='dispatch_acquired' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <!-- dbus_bool_t DBusConnection::io_path_acquired -->
        <var-decl name='io_path_acquired' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int DBusConnection::shareable -->
        <var-decl name='shareable' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <!-- unsigned int DBusConnection::exit_on_disconnect -->
        <var-decl name='exit_on_disconnect' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <!-- unsigned int DBusConnection::route_peer_messages -->
        <var-decl name='route_peer_messages' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <!-- unsigned int DBusConnection::disconnected_message_arrived -->
        <var-decl name='disconnected_message_arrived' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <!-- unsigned int DBusConnection::disconnected_message_processed -->
        <var-decl name='disconnected_message_processed' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <!-- unsigned int DBusConnection::have_connection_lock -->
        <var-decl name='have_connection_lock' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <!-- int DBusConnection::generation -->
        <var-decl name='generation' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='334' column='1'/>
      </data-member>
    </class-decl>
    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-42'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-43'/>
    <!-- typedef DBusConnection DBusConnection -->
    <typedef-decl name='DBusConnection' type-id='type-id-25' filepath='../dbus/dbus-connection.h' line='51' column='1' id='type-id-44'/>
    <!-- typedef __anonymous_enum__ DBusBusType -->
    <typedef-decl name='DBusBusType' type-id='type-id-45' filepath='../dbus/dbus-shared.h' line='61' column='1' id='type-id-46'/>
    <!-- enum __anonymous_enum__ -->
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../dbus/dbus-shared.h' line='57' column='1' id='type-id-45'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='DBUS_BUS_SESSION' value='0'/>
      <enumerator name='DBUS_BUS_SYSTEM' value='1'/>
      <enumerator name='DBUS_BUS_STARTER' value='2'/>
    </enum-decl>
    <!-- DBusConnection* -->
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-47'/>
    <!-- dbus_uint32_t* -->
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-48'/>
    <!-- void dbus_bus_remove_match(DBusConnection*, const char*, DBusError*) -->
    <function-decl name='dbus_bus_remove_match' mangled-name='dbus_bus_remove_match' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_remove_match'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1576' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='rule' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1577' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1578' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_bus_add_match(DBusConnection*, const char*, DBusError*) -->
    <function-decl name='dbus_bus_add_match' mangled-name='dbus_bus_add_match' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_add_match'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1526' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='rule' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1527' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1528' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_bus_start_service_by_name(DBusConnection*, const char*, dbus_uint32_t, dbus_uint32_t*, DBusError*) -->
    <function-decl name='dbus_bus_start_service_by_name' mangled-name='dbus_bus_start_service_by_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_start_service_by_name'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1356' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1357' column='1'/>
      <!-- parameter of type 'typedef dbus_uint32_t' -->
      <parameter type-id='type-id-16' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1358' column='1'/>
      <!-- parameter of type 'dbus_uint32_t*' -->
      <parameter type-id='type-id-48' name='result' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1359' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1360' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_bus_name_has_owner(DBusConnection*, const char*, DBusError*) -->
    <function-decl name='dbus_bus_name_has_owner' mangled-name='dbus_bus_name_has_owner' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_name_has_owner'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1280' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1281' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1282' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- int dbus_bus_release_name(DBusConnection*, const char*, DBusError*) -->
    <function-decl name='dbus_bus_release_name' mangled-name='dbus_bus_release_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_release_name'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1198' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1199' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1200' column='1'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- int dbus_bus_request_name(DBusConnection*, const char*, unsigned int, DBusError*) -->
    <function-decl name='dbus_bus_request_name' mangled-name='dbus_bus_request_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_request_name'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1112' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1113' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-3' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1114' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1115' column='1'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- unsigned long int dbus_bus_get_unix_user(DBusConnection*, const char*, DBusError*) -->
    <function-decl name='dbus_bus_get_unix_user' mangled-name='dbus_bus_get_unix_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='865' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_unix_user'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='865' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='866' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='867' column='1'/>
      <!-- unsigned long int -->
      <return type-id='type-id-43'/>
    </function-decl>
    <!-- char* dbus_bus_get_id(DBusConnection*, DBusError*) -->
    <function-decl name='dbus_bus_get_id' mangled-name='dbus_bus_get_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_id'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='948' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='949' column='1'/>
      <!-- char* -->
      <return type-id='type-id-22'/>
    </function-decl>
    <!-- const char* dbus_bus_get_unique_name(DBusConnection*) -->
    <function-decl name='dbus_bus_get_unique_name' mangled-name='dbus_bus_get_unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_unique_name'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='815' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- dbus_bool_t dbus_bus_set_unique_name(DBusConnection*, const char*) -->
    <function-decl name='dbus_bus_set_unique_name' mangled-name='dbus_bus_set_unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_set_unique_name'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='766' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='767' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_bus_register(DBusConnection*, DBusError*) -->
    <function-decl name='dbus_bus_register' mangled-name='dbus_bus_register' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_register'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='646' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='647' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- DBusConnection* dbus_bus_get_private(DBusBusType, DBusError*) -->
    <function-decl name='dbus_bus_get_private' mangled-name='dbus_bus_get_private' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_private'>
      <!-- parameter of type 'typedef DBusBusType' -->
      <parameter type-id='type-id-46' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='590' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='591' column='1'/>
      <!-- DBusConnection* -->
      <return type-id='type-id-47'/>
    </function-decl>
    <!-- DBusConnection* dbus_bus_get(DBusBusType, DBusError*) -->
    <function-decl name='dbus_bus_get' mangled-name='dbus_bus_get' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='558' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get'>
      <!-- parameter of type 'typedef DBusBusType' -->
      <parameter type-id='type-id-46' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='558' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='559' column='1'/>
      <!-- DBusConnection* -->
      <return type-id='type-id-47'/>
    </function-decl>
    <!-- DBusCMutex* -->
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-28'/>
    <!-- DBusCondVar* -->
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-29'/>
    <!-- DBusCounter* -->
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-31'/>
    <!-- DBusHashTable* -->
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-36'/>
    <!-- DBusMessage* -->
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-30'/>
    <!-- DBusObjectTree* -->
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-41'/>
    <!-- DBusRMutex* -->
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-27'/>
    <!-- DBusTimeoutList* -->
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-34'/>
    <!-- DBusTransport* -->
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-32'/>
    <!-- DBusWatchList* -->
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-33'/>
    <!-- typedef DBusAtomic DBusAtomic -->
    <typedef-decl name='DBusAtomic' type-id='type-id-59' filepath='../dbus/dbus-sysdeps.h' line='222' column='1' id='type-id-26'/>
    <!-- typedef DBusDataSlotList DBusDataSlotList -->
    <typedef-decl name='DBusDataSlotList' type-id='type-id-60' filepath='../dbus/dbus-dataslot.h' line='31' column='1' id='type-id-35'/>
    <!-- typedef __anonymous_enum__ DBusDispatchStatus -->
    <typedef-decl name='DBusDispatchStatus' type-id='type-id-61' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='84' column='1' id='type-id-40'/>
    <!-- typedef void (DBusConnection*, typedef DBusDispatchStatus, void*)* DBusDispatchStatusFunction -->
    <typedef-decl name='DBusDispatchStatusFunction' type-id='type-id-62' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='128' column='1' id='type-id-39'/>
    <!-- typedef void (void*)* DBusFreeFunction -->
    <typedef-decl name='DBusFreeFunction' type-id='type-id-63' filepath='../dbus/dbus-memory.h' line='64' column='1' id='type-id-38'/>
    <!-- typedef void (void*)* DBusWakeupMainFunction -->
    <typedef-decl name='DBusWakeupMainFunction' type-id='type-id-63' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='135' column='1' id='type-id-37'/>
    <!-- struct DBusAtomic -->
    <class-decl name='DBusAtomic' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='228' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- volatile dbus_int32_t DBusAtomic::value -->
        <var-decl name='value' type-id='type-id-64' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusDataSlotList -->
    <class-decl name='DBusDataSlotList' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='70' column='1' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusDataSlot* DBusDataSlotList::slots -->
        <var-decl name='slots' type-id='type-id-65' visibility='default' filepath='../dbus/dbus-dataslot.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int DBusDataSlotList::n_slots -->
        <var-decl name='n_slots' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-dataslot.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum __anonymous_enum__ -->
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='80' column='1' id='type-id-61'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='DBUS_DISPATCH_DATA_REMAINS' value='0'/>
      <enumerator name='DBUS_DISPATCH_COMPLETE' value='1'/>
      <enumerator name='DBUS_DISPATCH_NEED_MEMORY' value='2'/>
    </enum-decl>
    <!-- typedef DBusCMutex DBusCMutex -->
    <typedef-decl name='DBusCMutex' type-id='type-id-66' filepath='../dbus/dbus-threads-internal.h' line='45' column='1' id='type-id-49'/>
    <!-- typedef DBusCondVar DBusCondVar -->
    <typedef-decl name='DBusCondVar' type-id='type-id-67' filepath='../dbus/dbus-threads.h' line='43' column='1' id='type-id-50'/>
    <!-- typedef DBusCounter DBusCounter -->
    <typedef-decl name='DBusCounter' type-id='type-id-68' filepath='../dbus/dbus-resources.h' line='32' column='1' id='type-id-51'/>
    <!-- typedef DBusHashTable DBusHashTable -->
    <typedef-decl name='DBusHashTable' type-id='type-id-69' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-hash.h' line='59' column='1' id='type-id-52'/>
    <!-- typedef DBusMessage DBusMessage -->
    <typedef-decl name='DBusMessage' type-id='type-id-70' filepath='../dbus/dbus-message.h' line='44' column='1' id='type-id-53'/>
    <!-- typedef DBusObjectTree DBusObjectTree -->
    <typedef-decl name='DBusObjectTree' type-id='type-id-71' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-object-tree.h' line='30' column='1' id='type-id-54'/>
    <!-- typedef DBusRMutex DBusRMutex -->
    <typedef-decl name='DBusRMutex' type-id='type-id-72' filepath='../dbus/dbus-threads-internal.h' line='39' column='1' id='type-id-55'/>
    <!-- typedef DBusTimeoutList DBusTimeoutList -->
    <typedef-decl name='DBusTimeoutList' type-id='type-id-73' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='38' column='1' id='type-id-56'/>
    <!-- typedef DBusTransport DBusTransport -->
    <typedef-decl name='DBusTransport' type-id='type-id-74' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-transport.h' line='33' column='1' id='type-id-57'/>
    <!-- typedef DBusWatchList DBusWatchList -->
    <typedef-decl name='DBusWatchList' type-id='type-id-75' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='38' column='1' id='type-id-58'/>
    <!-- void (DBusConnection*, typedef DBusDispatchStatus, void*)* -->
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-62'/>
    <!-- void (void*)* -->
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-63'/>
    <!-- DBusDataSlot* -->
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-65'/>
    <!-- struct DBusCMutex -->
    <class-decl name='DBusCMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-66'/>
    <!-- struct DBusCondVar -->
    <class-decl name='DBusCondVar' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-67'/>
    <!-- struct DBusCounter -->
    <class-decl name='DBusCounter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-68'/>
    <!-- struct DBusHashTable -->
    <class-decl name='DBusHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-69'/>
    <!-- struct DBusMessage -->
    <class-decl name='DBusMessage' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='100' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusAtomic DBusMessage::refcount -->
        <var-decl name='refcount' type-id='type-id-26' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusHeader DBusMessage::header -->
        <var-decl name='header' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- DBusString DBusMessage::body -->
        <var-decl name='body' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int DBusMessage::locked -->
        <var-decl name='locked' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <!-- unsigned int DBusMessage::in_cache -->
        <var-decl name='in_cache' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- DBusList* DBusMessage::counters -->
        <var-decl name='counters' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- long int DBusMessage::size_counter_delta -->
        <var-decl name='size_counter_delta' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- dbus_uint32_t DBusMessage::changed_stamp -->
        <var-decl name='changed_stamp' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- DBusDataSlotList DBusMessage::slot_list -->
        <var-decl name='slot_list' type-id='type-id-35' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- int DBusMessage::generation -->
        <var-decl name='generation' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- int* DBusMessage::unix_fds -->
        <var-decl name='unix_fds' type-id='type-id-24' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- unsigned int DBusMessage::n_unix_fds -->
        <var-decl name='n_unix_fds' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <!-- unsigned int DBusMessage::n_unix_fds_allocated -->
        <var-decl name='n_unix_fds_allocated' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- long int DBusMessage::unix_fd_counter_delta -->
        <var-decl name='unix_fd_counter_delta' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusObjectTree -->
    <class-decl name='DBusObjectTree' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-71'/>
    <!-- struct DBusRMutex -->
    <class-decl name='DBusRMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-72'/>
    <!-- struct DBusTimeoutList -->
    <class-decl name='DBusTimeoutList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-73'/>
    <!-- struct DBusTransport -->
    <class-decl name='DBusTransport' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-74'/>
    <!-- struct DBusWatchList -->
    <class-decl name='DBusWatchList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-75'/>
    <!-- volatile dbus_int32_t -->
    <qualified-type-def type-id='type-id-81' volatile='yes' id='type-id-64'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='type-id-80'/>
    <!-- typedef DBusDataSlot DBusDataSlot -->
    <typedef-decl name='DBusDataSlot' type-id='type-id-82' filepath='../dbus/dbus-dataslot.h' line='34' column='1' id='type-id-78'/>
    <!-- typedef DBusHeader DBusHeader -->
    <typedef-decl name='DBusHeader' type-id='type-id-83' filepath='../dbus/dbus-marshal-header.h' line='30' column='1' id='type-id-79'/>
    <!-- typedef int dbus_int32_t -->
    <typedef-decl name='dbus_int32_t' type-id='type-id-2' filepath='../dbus/dbus-arch-deps.h' line='42' column='1' id='type-id-81'/>
    <!-- struct DBusDataSlot -->
    <class-decl name='DBusDataSlot' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='37' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* DBusDataSlot::data -->
        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-dataslot.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusFreeFunction DBusDataSlot::free_data_func -->
        <var-decl name='free_data_func' type-id='type-id-38' visibility='default' filepath='../dbus/dbus-dataslot.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusHeader -->
    <class-decl name='DBusHeader' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='48' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusString DBusHeader::data -->
        <var-decl name='data' type-id='type-id-7' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusHeaderField DBusHeader::fields[10] -->
        <var-decl name='fields' type-id='type-id-84' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- dbus_uint32_t DBusHeader::padding -->
        <var-decl name='padding' type-id='type-id-16' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <!-- dbus_uint32_t DBusHeader::byte_order -->
        <var-decl name='byte_order' type-id='type-id-16' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <!-- DBusHeaderField[10] -->
    <array-type-def dimensions='1' type-id='type-id-85' size-in-bits='320' id='type-id-84'>
      <!-- <anonymous range>[10] -->
      <subrange length='10' type-id='type-id-43' id='type-id-86'/>
    </array-type-def>
    <!-- typedef DBusHeaderField DBusHeaderField -->
    <typedef-decl name='DBusHeaderField' type-id='type-id-87' filepath='../dbus/dbus-marshal-header.h' line='31' column='1' id='type-id-85'/>
    <!-- struct DBusHeaderField -->
    <class-decl name='DBusHeaderField' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='40' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int DBusHeaderField::value_pos -->
        <var-decl name='value_pos' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='41' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-connection.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- DBusHeaderField[10] -->
    <array-type-def dimensions='1' type-id='type-id-85' size-in-bits='320' id='type-id-84'>
      <!-- <anonymous range>[10] -->
      <subrange length='10' type-id='type-id-43' id='type-id-86'/>
    </array-type-def>
    <!-- struct DBusCMutex -->
    <class-decl name='DBusCMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-66'/>
    <!-- struct DBusCondVar -->
    <class-decl name='DBusCondVar' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-67'/>
    <!-- struct DBusCounter -->
    <class-decl name='DBusCounter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-68'/>
    <!-- struct DBusHashTable -->
    <class-decl name='DBusHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-69'/>
    <!-- struct DBusObjectTree -->
    <class-decl name='DBusObjectTree' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-71'/>
    <!-- struct DBusPendingCall -->
    <class-decl name='DBusPendingCall' size-in-bits='576' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='63' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusAtomic DBusPendingCall::refcount -->
        <var-decl name='refcount' type-id='type-id-26' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusDataSlotList DBusPendingCall::slot_list -->
        <var-decl name='slot_list' type-id='type-id-35' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusPendingCallNotifyFunction DBusPendingCall::function -->
        <var-decl name='function' type-id='type-id-89' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- DBusConnection* DBusPendingCall::connection -->
        <var-decl name='connection' type-id='type-id-47' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- DBusMessage* DBusPendingCall::reply -->
        <var-decl name='reply' type-id='type-id-30' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- DBusTimeout* DBusPendingCall::timeout -->
        <var-decl name='timeout' type-id='type-id-90' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- DBusList* DBusPendingCall::timeout_link -->
        <var-decl name='timeout_link' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- dbus_uint32_t DBusPendingCall::reply_serial -->
        <var-decl name='reply_serial' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int DBusPendingCall::completed -->
        <var-decl name='completed' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <!-- unsigned int DBusPendingCall::timeout_added -->
        <var-decl name='timeout_added' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='79' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusRMutex -->
    <class-decl name='DBusRMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-72'/>
    <!-- struct DBusTimeout -->
    <class-decl name='DBusTimeout' size-in-bits='448' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='41' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int DBusTimeout::refcount -->
        <var-decl name='refcount' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int DBusTimeout::interval -->
        <var-decl name='interval' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusTimeoutHandler DBusTimeout::handler -->
        <var-decl name='handler' type-id='type-id-92' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* DBusTimeout::handler_data -->
        <var-decl name='handler_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusFreeFunction DBusTimeout::free_handler_data_function -->
        <var-decl name='free_handler_data_function' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void* DBusTimeout::data -->
        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- DBusFreeFunction DBusTimeout::free_data_function -->
        <var-decl name='free_data_function' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int DBusTimeout::enabled -->
        <var-decl name='enabled' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='51' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusTimeoutList -->
    <class-decl name='DBusTimeoutList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-73'/>
    <!-- struct DBusTransport -->
    <class-decl name='DBusTransport' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-74'/>
    <!-- struct DBusWatch -->
    <class-decl name='DBusWatch' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='41' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int DBusWatch::refcount -->
        <var-decl name='refcount' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int DBusWatch::fd -->
        <var-decl name='fd' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned int DBusWatch::flags -->
        <var-decl name='flags' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- DBusWatchHandler DBusWatch::handler -->
        <var-decl name='handler' type-id='type-id-94' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* DBusWatch::handler_data -->
        <var-decl name='handler_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- DBusFreeFunction DBusWatch::free_handler_data_function -->
        <var-decl name='free_handler_data_function' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void* DBusWatch::data -->
        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- DBusFreeFunction DBusWatch::free_data_function -->
        <var-decl name='free_data_function' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int DBusWatch::enabled -->
        <var-decl name='enabled' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <!-- unsigned int DBusWatch::oom_last_time -->
        <var-decl name='oom_last_time' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='53' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusWatchList -->
    <class-decl name='DBusWatchList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-75'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='type-id-80'/>
    <!-- typedef DBusAtomic DBusAtomic -->
    <typedef-decl name='DBusAtomic' type-id='type-id-59' filepath='../dbus/dbus-sysdeps.h' line='222' column='1' id='type-id-26'/>
    <!-- struct DBusAtomic -->
    <class-decl name='DBusAtomic' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='228' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- volatile dbus_int32_t DBusAtomic::value -->
        <var-decl name='value' type-id='type-id-64' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef int dbus_int32_t -->
    <typedef-decl name='dbus_int32_t' type-id='type-id-2' filepath='../dbus/dbus-arch-deps.h' line='42' column='1' id='type-id-81'/>
    <!-- typedef DBusRMutex DBusRMutex -->
    <typedef-decl name='DBusRMutex' type-id='type-id-72' filepath='../dbus/dbus-threads-internal.h' line='39' column='1' id='type-id-55'/>
    <!-- typedef DBusCMutex DBusCMutex -->
    <typedef-decl name='DBusCMutex' type-id='type-id-66' filepath='../dbus/dbus-threads-internal.h' line='45' column='1' id='type-id-49'/>
    <!-- typedef DBusCondVar DBusCondVar -->
    <typedef-decl name='DBusCondVar' type-id='type-id-67' filepath='../dbus/dbus-threads.h' line='43' column='1' id='type-id-50'/>
    <!-- typedef DBusMessage DBusMessage -->
    <typedef-decl name='DBusMessage' type-id='type-id-70' filepath='../dbus/dbus-message.h' line='44' column='1' id='type-id-53'/>
    <!-- struct DBusMessage -->
    <class-decl name='DBusMessage' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='100' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusAtomic DBusMessage::refcount -->
        <var-decl name='refcount' type-id='type-id-26' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusHeader DBusMessage::header -->
        <var-decl name='header' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- DBusString DBusMessage::body -->
        <var-decl name='body' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int DBusMessage::locked -->
        <var-decl name='locked' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <!-- unsigned int DBusMessage::in_cache -->
        <var-decl name='in_cache' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- DBusList* DBusMessage::counters -->
        <var-decl name='counters' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- long int DBusMessage::size_counter_delta -->
        <var-decl name='size_counter_delta' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- dbus_uint32_t DBusMessage::changed_stamp -->
        <var-decl name='changed_stamp' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- DBusDataSlotList DBusMessage::slot_list -->
        <var-decl name='slot_list' type-id='type-id-35' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- int DBusMessage::generation -->
        <var-decl name='generation' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- int* DBusMessage::unix_fds -->
        <var-decl name='unix_fds' type-id='type-id-24' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- unsigned int DBusMessage::n_unix_fds -->
        <var-decl name='n_unix_fds' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <!-- unsigned int DBusMessage::n_unix_fds_allocated -->
        <var-decl name='n_unix_fds_allocated' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- long int DBusMessage::unix_fd_counter_delta -->
        <var-decl name='unix_fd_counter_delta' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusHeader DBusHeader -->
    <typedef-decl name='DBusHeader' type-id='type-id-83' filepath='../dbus/dbus-marshal-header.h' line='30' column='1' id='type-id-79'/>
    <!-- struct DBusHeader -->
    <class-decl name='DBusHeader' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='48' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusString DBusHeader::data -->
        <var-decl name='data' type-id='type-id-7' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusHeaderField DBusHeader::fields[10] -->
        <var-decl name='fields' type-id='type-id-84' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- dbus_uint32_t DBusHeader::padding -->
        <var-decl name='padding' type-id='type-id-16' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <!-- dbus_uint32_t DBusHeader::byte_order -->
        <var-decl name='byte_order' type-id='type-id-16' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusHeaderField DBusHeaderField -->
    <typedef-decl name='DBusHeaderField' type-id='type-id-87' filepath='../dbus/dbus-marshal-header.h' line='31' column='1' id='type-id-85'/>
    <!-- struct DBusHeaderField -->
    <class-decl name='DBusHeaderField' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='40' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int DBusHeaderField::value_pos -->
        <var-decl name='value_pos' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusDataSlotList DBusDataSlotList -->
    <typedef-decl name='DBusDataSlotList' type-id='type-id-60' filepath='../dbus/dbus-dataslot.h' line='31' column='1' id='type-id-35'/>
    <!-- struct DBusDataSlotList -->
    <class-decl name='DBusDataSlotList' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='70' column='1' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusDataSlot* DBusDataSlotList::slots -->
        <var-decl name='slots' type-id='type-id-65' visibility='default' filepath='../dbus/dbus-dataslot.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int DBusDataSlotList::n_slots -->
        <var-decl name='n_slots' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-dataslot.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusDataSlot DBusDataSlot -->
    <typedef-decl name='DBusDataSlot' type-id='type-id-82' filepath='../dbus/dbus-dataslot.h' line='34' column='1' id='type-id-78'/>
    <!-- struct DBusDataSlot -->
    <class-decl name='DBusDataSlot' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='37' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* DBusDataSlot::data -->
        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-dataslot.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusFreeFunction DBusDataSlot::free_data_func -->
        <var-decl name='free_data_func' type-id='type-id-38' visibility='default' filepath='../dbus/dbus-dataslot.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef void (void*)* DBusFreeFunction -->
    <typedef-decl name='DBusFreeFunction' type-id='type-id-63' filepath='../dbus/dbus-memory.h' line='64' column='1' id='type-id-38'/>
    <!-- typedef DBusCounter DBusCounter -->
    <typedef-decl name='DBusCounter' type-id='type-id-68' filepath='../dbus/dbus-resources.h' line='32' column='1' id='type-id-51'/>
    <!-- typedef DBusTransport DBusTransport -->
    <typedef-decl name='DBusTransport' type-id='type-id-74' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-transport.h' line='33' column='1' id='type-id-57'/>
    <!-- typedef DBusWatchList DBusWatchList -->
    <typedef-decl name='DBusWatchList' type-id='type-id-75' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='38' column='1' id='type-id-58'/>
    <!-- typedef DBusTimeoutList DBusTimeoutList -->
    <typedef-decl name='DBusTimeoutList' type-id='type-id-73' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='38' column='1' id='type-id-56'/>
    <!-- typedef DBusHashTable DBusHashTable -->
    <typedef-decl name='DBusHashTable' type-id='type-id-69' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-hash.h' line='59' column='1' id='type-id-52'/>
    <!-- typedef void (void*)* DBusWakeupMainFunction -->
    <typedef-decl name='DBusWakeupMainFunction' type-id='type-id-63' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='135' column='1' id='type-id-37'/>
    <!-- typedef void (DBusConnection*, typedef DBusDispatchStatus, void*)* DBusDispatchStatusFunction -->
    <typedef-decl name='DBusDispatchStatusFunction' type-id='type-id-62' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='128' column='1' id='type-id-39'/>
    <!-- typedef __anonymous_enum__ DBusDispatchStatus -->
    <typedef-decl name='DBusDispatchStatus' type-id='type-id-61' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='84' column='1' id='type-id-40'/>
    <!-- enum __anonymous_enum__ -->
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='80' column='1' id='type-id-61'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='DBUS_DISPATCH_DATA_REMAINS' value='0'/>
      <enumerator name='DBUS_DISPATCH_COMPLETE' value='1'/>
      <enumerator name='DBUS_DISPATCH_NEED_MEMORY' value='2'/>
    </enum-decl>
    <!-- typedef DBusObjectTree DBusObjectTree -->
    <typedef-decl name='DBusObjectTree' type-id='type-id-71' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-object-tree.h' line='30' column='1' id='type-id-54'/>
    <!-- typedef DBusObjectPathVTable DBusObjectPathVTable -->
    <typedef-decl name='DBusObjectPathVTable' type-id='type-id-95' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='53' column='1' id='type-id-96'/>
    <!-- struct DBusObjectPathVTable -->
    <class-decl name='DBusObjectPathVTable' size-in-bits='384' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='385' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusObjectPathUnregisterFunction DBusObjectPathVTable::unregister_function -->
        <var-decl name='unregister_function' type-id='type-id-97' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusObjectPathMessageFunction DBusObjectPathVTable::message_function -->
        <var-decl name='message_function' type-id='type-id-98' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad1 -->
        <var-decl name='dbus_internal_pad1' type-id='type-id-63' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad2 -->
        <var-decl name='dbus_internal_pad2' type-id='type-id-63' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad3 -->
        <var-decl name='dbus_internal_pad3' type-id='type-id-63' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad4 -->
        <var-decl name='dbus_internal_pad4' type-id='type-id-63' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='392' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef void (DBusConnection*, void*)* DBusObjectPathUnregisterFunction -->
    <typedef-decl name='DBusObjectPathUnregisterFunction' type-id='type-id-99' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='367' column='1' id='type-id-97'/>
    <!-- typedef typedef DBusHandlerResult (DBusConnection*, DBusMessage*, void*)* DBusObjectPathMessageFunction -->
    <typedef-decl name='DBusObjectPathMessageFunction' type-id='type-id-100' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='374' column='1' id='type-id-98'/>
    <!-- typedef __anonymous_enum__1 DBusHandlerResult -->
    <typedef-decl name='DBusHandlerResult' type-id='type-id-101' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-shared.h' line='71' column='1' id='type-id-102'/>
    <!-- enum __anonymous_enum__1 -->
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-shared.h' line='67' column='1' id='type-id-101'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='DBUS_HANDLER_RESULT_HANDLED' value='0'/>
      <enumerator name='DBUS_HANDLER_RESULT_NOT_YET_HANDLED' value='1'/>
      <enumerator name='DBUS_HANDLER_RESULT_NEED_MEMORY' value='2'/>
    </enum-decl>
    <!-- typedef typedef DBusHandlerResult (DBusConnection*, DBusMessage*, void*)* DBusHandleMessageFunction -->
    <typedef-decl name='DBusHandleMessageFunction' type-id='type-id-100' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='169' column='1' id='type-id-103'/>
    <!-- typedef typedef dbus_bool_t (DBusConnection*, const char*, void*)* DBusAllowWindowsUserFunction -->
    <typedef-decl name='DBusAllowWindowsUserFunction' type-id='type-id-104' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='153' column='1' id='type-id-105'/>
    <!-- typedef typedef dbus_bool_t (DBusConnection*, unsigned long int, void*)* DBusAllowUnixUserFunction -->
    <typedef-decl name='DBusAllowUnixUserFunction' type-id='type-id-106' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='143' column='1' id='type-id-107'/>
    <!-- typedef typedef dbus_bool_t (DBusTimeout*, void*)* DBusAddTimeoutFunction -->
    <typedef-decl name='DBusAddTimeoutFunction' type-id='type-id-108' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='110' column='1' id='type-id-109'/>
    <!-- typedef DBusTimeout DBusTimeout -->
    <typedef-decl name='DBusTimeout' type-id='type-id-91' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='45' column='1' id='type-id-110'/>
    <!-- typedef void (DBusTimeout*, void*)* DBusRemoveTimeoutFunction -->
    <typedef-decl name='DBusRemoveTimeoutFunction' type-id='type-id-111' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='123' column='1' id='type-id-112'/>
    <!-- typedef void (DBusTimeout*, void*)* DBusTimeoutToggledFunction -->
    <typedef-decl name='DBusTimeoutToggledFunction' type-id='type-id-111' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='117' column='1' id='type-id-113'/>
    <!-- typedef typedef dbus_bool_t (DBusWatch*, void*)* DBusAddWatchFunction -->
    <typedef-decl name='DBusAddWatchFunction' type-id='type-id-114' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='91' column='1' id='type-id-115'/>
    <!-- typedef DBusWatch DBusWatch -->
    <typedef-decl name='DBusWatch' type-id='type-id-93' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='43' column='1' id='type-id-116'/>
    <!-- typedef void (DBusWatch*, void*)* DBusRemoveWatchFunction -->
    <typedef-decl name='DBusRemoveWatchFunction' type-id='type-id-117' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='103' column='1' id='type-id-118'/>
    <!-- typedef void (DBusWatch*, void*)* DBusWatchToggledFunction -->
    <typedef-decl name='DBusWatchToggledFunction' type-id='type-id-117' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='97' column='1' id='type-id-119'/>
    <!-- typedef DBusPreallocatedSend DBusPreallocatedSend -->
    <typedef-decl name='DBusPreallocatedSend' type-id='type-id-120' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='47' column='1' id='type-id-121'/>
    <!-- struct DBusPreallocatedSend -->
    <class-decl name='DBusPreallocatedSend' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='241' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusConnection* DBusPreallocatedSend::connection -->
        <var-decl name='connection' type-id='type-id-47' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusList* DBusPreallocatedSend::queue_link -->
        <var-decl name='queue_link' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- DBusList* DBusPreallocatedSend::counter_link -->
        <var-decl name='counter_link' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='244' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusPendingCall DBusPendingCall -->
    <typedef-decl name='DBusPendingCall' type-id='type-id-88' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='49' column='1' id='type-id-122'/>
    <!-- DBusCMutex* -->
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-28'/>
    <!-- DBusCondVar* -->
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-29'/>
    <!-- DBusCounter* -->
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-31'/>
    <!-- DBusDataSlot* -->
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-65'/>
    <!-- DBusHashTable* -->
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-36'/>
    <!-- DBusMessage* -->
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-30'/>
    <!-- DBusObjectTree* -->
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-41'/>
    <!-- DBusPendingCall* -->
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
    <!-- DBusPendingCall** -->
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <!-- DBusPreallocatedSend* -->
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-125'/>
    <!-- DBusRMutex* -->
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-27'/>
    <!-- DBusTimeout* -->
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-90'/>
    <!-- DBusTimeoutList* -->
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-34'/>
    <!-- DBusTransport* -->
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-32'/>
    <!-- DBusWatch* -->
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-126'/>
    <!-- DBusWatchList* -->
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-33'/>
    <!-- char** -->
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-127'/>
    <!-- char*** -->
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <!-- const DBusObjectPathVTable -->
    <qualified-type-def type-id='type-id-96' const='yes' id='type-id-129'/>
    <!-- const DBusObjectPathVTable* -->
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <!-- dbus_int32_t* -->
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-131'/>
    <!-- typedef DBusHandlerResult (DBusConnection*, DBusMessage*, void*)* -->
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-100'/>
    <!-- typedef dbus_bool_t (DBusConnection*, const char*, void*)* -->
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-104'/>
    <!-- typedef dbus_bool_t (DBusConnection*, unsigned long int, void*)* -->
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-106'/>
    <!-- typedef dbus_bool_t (DBusTimeout*, void*)* -->
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-108'/>
    <!-- typedef dbus_bool_t (DBusWatch*, void*)* -->
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-114'/>
    <!-- unsigned long int* -->
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-137'/>
    <!-- void (DBusConnection*, typedef DBusDispatchStatus, void*)* -->
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-62'/>
    <!-- void (DBusConnection*, void*)* -->
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-99'/>
    <!-- void (DBusTimeout*, void*)* -->
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-111'/>
    <!-- void (DBusWatch*, void*)* -->
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-117'/>
    <!-- void (void*)* -->
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-63'/>
    <!-- void** -->
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-141'/>
    <!-- volatile dbus_int32_t -->
    <qualified-type-def type-id='type-id-81' volatile='yes' id='type-id-64'/>
    <!-- void dbus_connection_set_change_sigpipe(dbus_bool_t) -->
    <function-decl name='dbus_connection_set_change_sigpipe' mangled-name='dbus_connection_set_change_sigpipe' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_change_sigpipe'>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='type-id-17' name='will_modify_sigpipe' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6043' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void* dbus_connection_get_data(DBusConnection*, dbus_int32_t) -->
    <function-decl name='dbus_connection_get_data' mangled-name='dbus_connection_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6017' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_data'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6017' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6018' column='1'/>
      <!-- void* -->
      <return type-id='type-id-10'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_set_data(DBusConnection*, dbus_int32_t, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_data' mangled-name='dbus_connection_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_data'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5968' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5969' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5970' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5971' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_connection_free_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_connection_free_data_slot' mangled-name='dbus_connection_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5938' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_free_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5938' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_allocate_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_connection_allocate_data_slot' mangled-name='dbus_connection_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_allocate_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5920' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_list_registered(DBusConnection*, const char*, char***) -->
    <function-decl name='dbus_connection_list_registered' mangled-name='dbus_connection_list_registered' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5878' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_list_registered'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5878' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='parent_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5879' column='1'/>
      <!-- parameter of type 'char***' -->
      <parameter type-id='type-id-128' name='child_entries' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5880' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_unregister_object_path(DBusConnection*, const char*) -->
    <function-decl name='dbus_connection_unregister_object_path' mangled-name='dbus_connection_unregister_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_unregister_object_path'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5809' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5810' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- DBusConnection* dbus_connection_ref(DBusConnection*) -->
    <function-decl name='dbus_connection_ref' mangled-name='dbus_connection_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_ref'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2681' column='1'/>
      <!-- DBusConnection* -->
      <return type-id='type-id-47'/>
    </function-decl>
    <!-- long int dbus_connection_get_outgoing_unix_fds(DBusConnection*) -->
    <function-decl name='dbus_connection_get_outgoing_unix_fds' mangled-name='dbus_connection_get_outgoing_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_outgoing_unix_fds'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6296' column='1'/>
      <!-- long int -->
      <return type-id='type-id-80'/>
    </function-decl>
    <!-- long int dbus_connection_get_outgoing_size(DBusConnection*) -->
    <function-decl name='dbus_connection_get_outgoing_size' mangled-name='dbus_connection_get_outgoing_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_outgoing_size'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6235' column='1'/>
      <!-- long int -->
      <return type-id='type-id-80'/>
    </function-decl>
    <!-- long int dbus_connection_get_max_received_unix_fds(DBusConnection*) -->
    <function-decl name='dbus_connection_get_max_received_unix_fds' mangled-name='dbus_connection_get_max_received_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_received_unix_fds'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6212' column='1'/>
      <!-- long int -->
      <return type-id='type-id-80'/>
    </function-decl>
    <!-- void dbus_connection_set_max_received_unix_fds(DBusConnection*, long int) -->
    <function-decl name='dbus_connection_set_max_received_unix_fds' mangled-name='dbus_connection_set_max_received_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_received_unix_fds'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6194' column='1'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-80' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6195' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- long int dbus_connection_get_max_received_size(DBusConnection*) -->
    <function-decl name='dbus_connection_get_max_received_size' mangled-name='dbus_connection_get_max_received_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_received_size'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6170' column='1'/>
      <!-- long int -->
      <return type-id='type-id-80'/>
    </function-decl>
    <!-- void dbus_connection_set_max_received_size(DBusConnection*, long int) -->
    <function-decl name='dbus_connection_set_max_received_size' mangled-name='dbus_connection_set_max_received_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_received_size'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6152' column='1'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-80' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6153' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- long int dbus_connection_get_max_message_unix_fds(DBusConnection*) -->
    <function-decl name='dbus_connection_get_max_message_unix_fds' mangled-name='dbus_connection_get_max_message_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_message_unix_fds'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6114' column='1'/>
      <!-- long int -->
      <return type-id='type-id-80'/>
    </function-decl>
    <!-- void dbus_connection_set_max_message_unix_fds(DBusConnection*, long int) -->
    <function-decl name='dbus_connection_set_max_message_unix_fds' mangled-name='dbus_connection_set_max_message_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_message_unix_fds'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6096' column='1'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-80' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6097' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- long int dbus_connection_get_max_message_size(DBusConnection*) -->
    <function-decl name='dbus_connection_get_max_message_size' mangled-name='dbus_connection_get_max_message_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6075' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_message_size'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6075' column='1'/>
      <!-- long int -->
      <return type-id='type-id-80'/>
    </function-decl>
    <!-- void dbus_connection_set_max_message_size(DBusConnection*, long int) -->
    <function-decl name='dbus_connection_set_max_message_size' mangled-name='dbus_connection_set_max_message_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_message_size'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6057' column='1'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-80' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6058' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_object_path_data(DBusConnection*, const char*, void**) -->
    <function-decl name='dbus_connection_get_object_path_data' mangled-name='dbus_connection_get_object_path_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_object_path_data'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5841' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5842' column='1'/>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-141' name='data_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5843' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_register_fallback(DBusConnection*, const char*, const DBusObjectPathVTable*, void*) -->
    <function-decl name='dbus_connection_register_fallback' mangled-name='dbus_connection_register_fallback' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_register_fallback'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5774' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5775' column='1'/>
      <!-- parameter of type 'const DBusObjectPathVTable*' -->
      <parameter type-id='type-id-130' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5776' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5777' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_try_register_fallback(DBusConnection*, const char*, const DBusObjectPathVTable*, void*, DBusError*) -->
    <function-decl name='dbus_connection_try_register_fallback' mangled-name='dbus_connection_try_register_fallback' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_try_register_fallback'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5742' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5743' column='1'/>
      <!-- parameter of type 'const DBusObjectPathVTable*' -->
      <parameter type-id='type-id-130' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5744' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5745' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5746' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_register_object_path(DBusConnection*, const char*, const DBusObjectPathVTable*, void*) -->
    <function-decl name='dbus_connection_register_object_path' mangled-name='dbus_connection_register_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_register_object_path'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5702' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5703' column='1'/>
      <!-- parameter of type 'const DBusObjectPathVTable*' -->
      <parameter type-id='type-id-130' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5704' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5705' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_try_register_object_path(DBusConnection*, const char*, const DBusObjectPathVTable*, void*, DBusError*) -->
    <function-decl name='dbus_connection_try_register_object_path' mangled-name='dbus_connection_try_register_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_try_register_object_path'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5672' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5673' column='1'/>
      <!-- parameter of type 'const DBusObjectPathVTable*' -->
      <parameter type-id='type-id-130' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5674' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5675' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5676' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_connection_remove_filter(DBusConnection*, DBusHandleMessageFunction, void*) -->
    <function-decl name='dbus_connection_remove_filter' mangled-name='dbus_connection_remove_filter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_remove_filter'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5563' column='1'/>
      <!-- parameter of type 'typedef DBusHandleMessageFunction' -->
      <parameter type-id='type-id-103' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5564' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5565' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_add_filter(DBusConnection*, DBusHandleMessageFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_add_filter' mangled-name='dbus_connection_add_filter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_add_filter'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5511' column='1'/>
      <!-- parameter of type 'typedef DBusHandleMessageFunction' -->
      <parameter type-id='type-id-103' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5512' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5513' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5514' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_connection_set_route_peer_messages(DBusConnection*, dbus_bool_t) -->
    <function-decl name='dbus_connection_set_route_peer_messages' mangled-name='dbus_connection_set_route_peer_messages' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_route_peer_messages'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5479' column='1'/>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='type-id-17' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5480' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_connection_set_allow_anonymous(DBusConnection*, dbus_bool_t) -->
    <function-decl name='dbus_connection_set_allow_anonymous' mangled-name='dbus_connection_set_allow_anonymous' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_allow_anonymous'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5451' column='1'/>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='type-id-17' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5452' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_connection_set_windows_user_function(DBusConnection*, DBusAllowWindowsUserFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_windows_user_function' mangled-name='dbus_connection_set_windows_user_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_windows_user_function'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5404' column='1'/>
      <!-- parameter of type 'typedef DBusAllowWindowsUserFunction' -->
      <parameter type-id='type-id-105' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5405' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5406' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5407' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_windows_user(DBusConnection*, char**) -->
    <function-decl name='dbus_connection_get_windows_user' mangled-name='dbus_connection_get_windows_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_windows_user'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5357' column='1'/>
      <!-- parameter of type 'char**' -->
      <parameter type-id='type-id-127' name='windows_sid_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5358' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_connection_set_unix_user_function(DBusConnection*, DBusAllowUnixUserFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_unix_user_function' mangled-name='dbus_connection_set_unix_user_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_unix_user_function'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5305' column='1'/>
      <!-- parameter of type 'typedef DBusAllowUnixUserFunction' -->
      <parameter type-id='type-id-107' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5306' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5307' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5308' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_adt_audit_session_data(DBusConnection*, void**, dbus_int32_t*) -->
    <function-decl name='dbus_connection_get_adt_audit_session_data' mangled-name='dbus_connection_get_adt_audit_session_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_adt_audit_session_data'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5259' column='1'/>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-141' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5260' column='1'/>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='type-id-131' name='data_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5261' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_unix_process_id(DBusConnection*, unsigned long int*) -->
    <function-decl name='dbus_connection_get_unix_process_id' mangled-name='dbus_connection_get_unix_process_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_process_id'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5226' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='type-id-137' name='pid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5227' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_unix_user(DBusConnection*, unsigned long int*) -->
    <function-decl name='dbus_connection_get_unix_user' mangled-name='dbus_connection_get_unix_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_user'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5190' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='type-id-137' name='uid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5191' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_socket(DBusConnection*, int*) -->
    <function-decl name='dbus_connection_get_socket' mangled-name='dbus_connection_get_socket' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_socket'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5148' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-24' name='fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5149' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_unix_fd(DBusConnection*, int*) -->
    <function-decl name='dbus_connection_get_unix_fd' mangled-name='dbus_connection_get_unix_fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_fd'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5118' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-24' name='fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5119' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_connection_set_dispatch_status_function(DBusConnection*, DBusDispatchStatusFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_dispatch_status_function' mangled-name='dbus_connection_set_dispatch_status_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5073' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_dispatch_status_function'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5073' column='1'/>
      <!-- parameter of type 'typedef DBusDispatchStatusFunction' -->
      <parameter type-id='type-id-39' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5074' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5075' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5076' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_connection_set_wakeup_main_function(DBusConnection*, DBusWakeupMainFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_wakeup_main_function' mangled-name='dbus_connection_set_wakeup_main_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5027' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_wakeup_main_function'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5027' column='1'/>
      <!-- parameter of type 'typedef DBusWakeupMainFunction' -->
      <parameter type-id='type-id-37' name='wakeup_main_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5028' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5029' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5030' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_set_timeout_functions(DBusConnection*, DBusAddTimeoutFunction, DBusRemoveTimeoutFunction, DBusTimeoutToggledFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_timeout_functions' mangled-name='dbus_connection_set_timeout_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4989' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_timeout_functions'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4989' column='1'/>
      <!-- parameter of type 'typedef DBusAddTimeoutFunction' -->
      <parameter type-id='type-id-109' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4990' column='1'/>
      <!-- parameter of type 'typedef DBusRemoveTimeoutFunction' -->
      <parameter type-id='type-id-112' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4991' column='1'/>
      <!-- parameter of type 'typedef DBusTimeoutToggledFunction' -->
      <parameter type-id='type-id-113' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4992' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4993' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4994' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_set_watch_functions(DBusConnection*, DBusAddWatchFunction, DBusRemoveWatchFunction, DBusWatchToggledFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_watch_functions' mangled-name='dbus_connection_set_watch_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4926' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_watch_functions'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4926' column='1'/>
      <!-- parameter of type 'typedef DBusAddWatchFunction' -->
      <parameter type-id='type-id-115' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4927' column='1'/>
      <!-- parameter of type 'typedef DBusRemoveWatchFunction' -->
      <parameter type-id='type-id-118' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4928' column='1'/>
      <!-- parameter of type 'typedef DBusWatchToggledFunction' -->
      <parameter type-id='type-id-119' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4929' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4930' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4931' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_connection_set_exit_on_disconnect(DBusConnection*, dbus_bool_t) -->
    <function-decl name='dbus_connection_set_exit_on_disconnect' mangled-name='dbus_connection_set_exit_on_disconnect' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_exit_on_disconnect'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3145' column='1'/>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='type-id-17' name='exit_on_disconnect' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3146' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_is_authenticated(DBusConnection*) -->
    <function-decl name='dbus_connection_get_is_authenticated' mangled-name='dbus_connection_get_is_authenticated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2995' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_authenticated'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2995' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_has_messages_to_send(DBusConnection*) -->
    <function-decl name='dbus_connection_has_messages_to_send' mangled-name='dbus_connection_has_messages_to_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_has_messages_to_send'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='588' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- DBusPreallocatedSend* dbus_connection_preallocate_send(DBusConnection*) -->
    <function-decl name='dbus_connection_preallocate_send' mangled-name='dbus_connection_preallocate_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_preallocate_send'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3165' column='1'/>
      <!-- DBusPreallocatedSend* -->
      <return type-id='type-id-125'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_is_connected(DBusConnection*) -->
    <function-decl name='dbus_connection_get_is_connected' mangled-name='dbus_connection_get_is_connected' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_connected'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2973' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_connection_free_preallocated_send(DBusConnection*, DBusPreallocatedSend*) -->
    <function-decl name='dbus_connection_free_preallocated_send' mangled-name='dbus_connection_free_preallocated_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_free_preallocated_send'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3191' column='1'/>
      <!-- parameter of type 'DBusPreallocatedSend*' -->
      <parameter type-id='type-id-125' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3192' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_can_send_type(DBusConnection*, int) -->
    <function-decl name='dbus_connection_can_send_type' mangled-name='dbus_connection_can_send_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_can_send_type'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3105' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3106' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- char* dbus_connection_get_server_id(DBusConnection*) -->
    <function-decl name='dbus_connection_get_server_id' mangled-name='dbus_connection_get_server_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3074' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_server_id'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3074' column='1'/>
      <!-- char* -->
      <return type-id='type-id-22'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_is_anonymous(DBusConnection*) -->
    <function-decl name='dbus_connection_get_is_anonymous' mangled-name='dbus_connection_get_is_anonymous' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_anonymous'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3029' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_connection_unref(DBusConnection*) -->
    <function-decl name='dbus_connection_unref' mangled-name='dbus_connection_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_unref'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2817' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- DBusDispatchStatus dbus_connection_get_dispatch_status(DBusConnection*) -->
    <function-decl name='dbus_connection_get_dispatch_status' mangled-name='dbus_connection_get_dispatch_status' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_dispatch_status'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4378' column='1'/>
      <!-- typedef DBusDispatchStatus -->
      <return type-id='type-id-40'/>
    </function-decl>
    <!-- DBusMessage* dbus_connection_borrow_message(DBusConnection*) -->
    <function-decl name='dbus_connection_borrow_message' mangled-name='dbus_connection_borrow_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3850' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_borrow_message'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3850' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- DBusMessage* dbus_connection_pop_message(DBusConnection*) -->
    <function-decl name='dbus_connection_pop_message' mangled-name='dbus_connection_pop_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_pop_message'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4091' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- void dbus_connection_steal_borrowed_message(DBusConnection*, DBusMessage*) -->
    <function-decl name='dbus_connection_steal_borrowed_message' mangled-name='dbus_connection_steal_borrowed_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3935' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_steal_borrowed_message'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3935' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3936' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_connection_return_message(DBusConnection*, DBusMessage*) -->
    <function-decl name='dbus_connection_return_message' mangled-name='dbus_connection_return_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_return_message'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3901' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3902' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_connection_flush(DBusConnection*) -->
    <function-decl name='dbus_connection_flush' mangled-name='dbus_connection_flush' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_flush'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3641' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_connection_send_preallocated(DBusConnection*, DBusPreallocatedSend*, DBusMessage*, dbus_uint32_t*) -->
    <function-decl name='dbus_connection_send_preallocated' mangled-name='dbus_connection_send_preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_preallocated'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3217' column='1'/>
      <!-- parameter of type 'DBusPreallocatedSend*' -->
      <parameter type-id='type-id-125' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3218' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3219' column='1'/>
      <!-- parameter of type 'dbus_uint32_t*' -->
      <parameter type-id='type-id-48' name='client_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3220' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_send(DBusConnection*, DBusMessage*, dbus_uint32_t*) -->
    <function-decl name='dbus_connection_send' mangled-name='dbus_connection_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3302' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3303' column='1'/>
      <!-- parameter of type 'dbus_uint32_t*' -->
      <parameter type-id='type-id-48' name='serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3304' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_connection_close(DBusConnection*) -->
    <function-decl name='dbus_connection_close' mangled-name='dbus_connection_close' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_close'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2932' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- DBusConnection* dbus_connection_open_private(const char*, DBusError*) -->
    <function-decl name='dbus_connection_open_private' mangled-name='dbus_connection_open_private' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_open_private'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2659' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2660' column='1'/>
      <!-- DBusConnection* -->
      <return type-id='type-id-47'/>
    </function-decl>
    <!-- DBusConnection* dbus_connection_open(const char*, DBusError*) -->
    <function-decl name='dbus_connection_open' mangled-name='dbus_connection_open' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_open'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2616' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2617' column='1'/>
      <!-- DBusConnection* -->
      <return type-id='type-id-47'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_send_with_reply(DBusConnection*, DBusMessage*, DBusPendingCall**, int) -->
    <function-decl name='dbus_connection_send_with_reply' mangled-name='dbus_connection_send_with_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_with_reply'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3399' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3400' column='1'/>
      <!-- parameter of type 'DBusPendingCall**' -->
      <parameter type-id='type-id-124' name='pending_return' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3401' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3402' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- DBusMessage* dbus_connection_send_with_reply_and_block(DBusConnection*, DBusMessage*, int, DBusError*) -->
    <function-decl name='dbus_connection_send_with_reply_and_block' mangled-name='dbus_connection_send_with_reply_and_block' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_with_reply_and_block'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3535' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3536' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3537' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3538' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- DBusDispatchStatus dbus_connection_dispatch(DBusConnection*) -->
    <function-decl name='dbus_connection_dispatch' mangled-name='dbus_connection_dispatch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4549' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_dispatch'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4549' column='1'/>
      <!-- typedef DBusDispatchStatus -->
      <return type-id='type-id-40'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_read_write(DBusConnection*, int) -->
    <function-decl name='dbus_connection_read_write' mangled-name='dbus_connection_read_write' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_read_write'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3801' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3802' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_read_write_dispatch(DBusConnection*, int) -->
    <function-decl name='dbus_connection_read_write_dispatch' mangled-name='dbus_connection_read_write_dispatch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_read_write_dispatch'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3769' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3770' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- DBusHandlerResult (DBusConnection*, DBusMessage*, void*) -->
    <function-type size-in-bits='64' id='type-id-132'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- typedef DBusHandlerResult -->
      <return type-id='type-id-102'/>
    </function-type>
    <!-- dbus_bool_t (DBusConnection*, const char*, void*) -->
    <function-type size-in-bits='64' id='type-id-133'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-type>
    <!-- dbus_bool_t (DBusConnection*, unsigned long int, void*) -->
    <function-type size-in-bits='64' id='type-id-134'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47'/>
      <!-- parameter of type 'unsigned long int' -->
      <parameter type-id='type-id-43'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-type>
    <!-- dbus_bool_t (DBusTimeout*, void*) -->
    <function-type size-in-bits='64' id='type-id-135'>
      <!-- parameter of type 'DBusTimeout*' -->
      <parameter type-id='type-id-90'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-type>
    <!-- dbus_bool_t (DBusWatch*, void*) -->
    <function-type size-in-bits='64' id='type-id-136'>
      <!-- parameter of type 'DBusWatch*' -->
      <parameter type-id='type-id-126'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-type>
    <!-- void (DBusConnection*, DBusDispatchStatus, void*) -->
    <function-type size-in-bits='64' id='type-id-76'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47'/>
      <!-- parameter of type 'typedef DBusDispatchStatus' -->
      <parameter type-id='type-id-40'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-type>
    <!-- void (DBusConnection*, void*) -->
    <function-type size-in-bits='64' id='type-id-138'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-type>
    <!-- void (DBusTimeout*, void*) -->
    <function-type size-in-bits='64' id='type-id-139'>
      <!-- parameter of type 'DBusTimeout*' -->
      <parameter type-id='type-id-90'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-type>
    <!-- void (DBusWatch*, void*) -->
    <function-type size-in-bits='64' id='type-id-140'>
      <!-- parameter of type 'DBusWatch*' -->
      <parameter type-id='type-id-126'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-type>
    <!-- void (void*) -->
    <function-type size-in-bits='64' id='type-id-77'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-type>
    <!-- typedef void (DBusPendingCall*, void*)* DBusPendingCallNotifyFunction -->
    <typedef-decl name='DBusPendingCallNotifyFunction' type-id='type-id-142' filepath='../dbus/dbus-connection.h' line='162' column='1' id='type-id-89'/>
    <!-- typedef typedef dbus_bool_t (void*)* DBusTimeoutHandler -->
    <typedef-decl name='DBusTimeoutHandler' type-id='type-id-143' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='41' column='1' id='type-id-92'/>
    <!-- typedef typedef dbus_bool_t (DBusWatch*, unsigned int, void*)* DBusWatchHandler -->
    <typedef-decl name='DBusWatchHandler' type-id='type-id-144' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='43' column='1' id='type-id-94'/>
    <!-- typedef dbus_bool_t (DBusWatch*, unsigned int, void*)* -->
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-144'/>
    <!-- typedef dbus_bool_t (void*)* -->
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-143'/>
    <!-- void (DBusPendingCall*, void*)* -->
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-142'/>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-errors.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- variadic parameter type -->
    <type-decl name='variadic parameter type' id='type-id-148'/>
    <!-- const DBusError -->
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-149'/>
    <!-- const DBusError* -->
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-150'/>
    <!-- dbus_bool_t dbus_error_is_set(const DBusError*) -->
    <function-decl name='dbus_error_is_set' mangled-name='dbus_error_is_set' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_is_set'>
      <!-- parameter of type 'const DBusError*' -->
      <parameter type-id='type-id-150' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='329' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_error_init(DBusError*) -->
    <function-decl name='dbus_error_init' mangled-name='dbus_error_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_init'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='188' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_error_free(DBusError*) -->
    <function-decl name='dbus_error_free' mangled-name='dbus_error_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_free'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='211' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_move_error(DBusError*, DBusError*) -->
    <function-decl name='dbus_move_error' mangled-name='dbus_move_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_move_error'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='src' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='279' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='dest' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='280' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_set_error_const(DBusError*, const char*, const char*) -->
    <function-decl name='dbus_set_error_const' mangled-name='dbus_set_error_const' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_set_error_const'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='243' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='244' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='245' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_set_error(DBusError*, const char*, const char*, ...) -->
    <function-decl name='dbus_set_error' mangled-name='dbus_set_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_set_error'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='354' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='355' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='356' column='1'/>
      <parameter is-variadic='yes'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_error_has_name(const DBusError*, const char*) -->
    <function-decl name='dbus_error_has_name' mangled-name='dbus_error_has_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_has_name'>
      <!-- parameter of type 'const DBusError*' -->
      <parameter type-id='type-id-150' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='302' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='303' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-memory.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='type-id-43' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='type-id-151'/>
    <!-- void dbus_free(void*) -->
    <function-decl name='dbus_free' mangled-name='dbus_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_free'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='memory' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='701' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_shutdown() -->
    <function-decl name='dbus_shutdown' mangled-name='dbus_shutdown' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='890' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_shutdown'>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_free_string_array(char**) -->
    <function-decl name='dbus_free_string_array' mangled-name='dbus_free_string_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_free_string_array'>
      <!-- parameter of type 'char**' -->
      <parameter type-id='type-id-127' name='str_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='749' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void* dbus_realloc(void*, size_t) -->
    <function-decl name='dbus_realloc' mangled-name='dbus_realloc' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_realloc'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='memory' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='601' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-151' name='bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='602' column='1'/>
      <!-- void* -->
      <return type-id='type-id-10'/>
    </function-decl>
    <!-- void* dbus_malloc0(size_t) -->
    <function-decl name='dbus_malloc0' mangled-name='dbus_malloc0' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_malloc0'>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-151' name='bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='531' column='1'/>
      <!-- void* -->
      <return type-id='type-id-10'/>
    </function-decl>
    <!-- void* dbus_malloc(size_t) -->
    <function-decl name='dbus_malloc' mangled-name='dbus_malloc' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_malloc'>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-151' name='bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='461' column='1'/>
      <!-- void* -->
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-message.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- struct __va_list_tag -->
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int __va_list_tag::gp_offset -->
        <var-decl name='gp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int __va_list_tag::fp_offset -->
        <var-decl name='fp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* __va_list_tag::overflow_arg_area -->
        <var-decl name='overflow_arg_area' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* __va_list_tag::reg_save_area -->
        <var-decl name='reg_save_area' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusMessageIter DBusMessageIter -->
    <typedef-decl name='DBusMessageIter' type-id='type-id-153' filepath='../dbus/dbus-message.h' line='46' column='1' id='type-id-154'/>
    <!-- struct DBusMessageIter -->
    <class-decl name='DBusMessageIter' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-message.h' line='52' column='1' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* DBusMessageIter::dummy1 -->
        <var-decl name='dummy1' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-message.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* DBusMessageIter::dummy2 -->
        <var-decl name='dummy2' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-message.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- dbus_uint32_t DBusMessageIter::dummy3 -->
        <var-decl name='dummy3' type-id='type-id-16' visibility='default' filepath='../dbus/dbus-message.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int DBusMessageIter::dummy4 -->
        <var-decl name='dummy4' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int DBusMessageIter::dummy5 -->
        <var-decl name='dummy5' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- int DBusMessageIter::dummy6 -->
        <var-decl name='dummy6' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int DBusMessageIter::dummy7 -->
        <var-decl name='dummy7' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- int DBusMessageIter::dummy8 -->
        <var-decl name='dummy8' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int DBusMessageIter::dummy9 -->
        <var-decl name='dummy9' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- int DBusMessageIter::dummy10 -->
        <var-decl name='dummy10' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- int DBusMessageIter::dummy11 -->
        <var-decl name='dummy11' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <!-- int DBusMessageIter::pad1 -->
        <var-decl name='pad1' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int DBusMessageIter::pad2 -->
        <var-decl name='pad2' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- void* DBusMessageIter::pad3 -->
        <var-decl name='pad3' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-message.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <!-- DBusMessageIter* -->
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
    <!-- __va_list_tag* -->
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-156'/>
    <!-- const DBusMessage -->
    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-157'/>
    <!-- const DBusMessage* -->
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <!-- dbus_bool_t dbus_message_contains_unix_fds(DBusMessage*) -->
    <function-decl name='dbus_message_contains_unix_fds' mangled-name='dbus_message_contains_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_contains_unix_fds'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3825' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- const char* dbus_message_type_to_string(int) -->
    <function-decl name='dbus_message_type_to_string' mangled-name='dbus_message_type_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_type_to_string'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4691' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- int dbus_message_demarshal_bytes_needed(const char*, int) -->
    <function-decl name='dbus_message_demarshal_bytes_needed' mangled-name='dbus_message_demarshal_bytes_needed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_demarshal_bytes_needed'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4841' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4842' column='1'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- int dbus_message_type_from_string(const char*) -->
    <function-decl name='dbus_message_type_from_string' mangled-name='dbus_message_type_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_type_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='type_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4663' column='1'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- void* dbus_message_get_data(DBusMessage*, dbus_int32_t) -->
    <function-decl name='dbus_message_get_data' mangled-name='dbus_message_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_data'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4635' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4636' column='1'/>
      <!-- void* -->
      <return type-id='type-id-10'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_data(DBusMessage*, dbus_int32_t, void*, DBusFreeFunction) -->
    <function-decl name='dbus_message_set_data' mangled-name='dbus_message_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_data'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4599' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4600' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4601' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4602' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_message_free_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_message_free_data_slot' mangled-name='dbus_message_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_free_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4578' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_allocate_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_message_allocate_data_slot' mangled-name='dbus_message_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_allocate_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4560' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_ref(DBusMessage*) -->
    <function-decl name='dbus_message_ref' mangled-name='dbus_message_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_ref'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1667' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- const char* dbus_message_get_sender(DBusMessage*) -->
    <function-decl name='dbus_message_get_sender' mangled-name='dbus_message_get_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_sender'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3510' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_sender(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_sender' mangled-name='dbus_message_has_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_sender'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3725' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3726' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- const char* dbus_message_get_destination(DBusMessage*) -->
    <function-decl name='dbus_message_get_destination' mangled-name='dbus_message_get_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_destination'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3450' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_destination(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_destination' mangled-name='dbus_message_has_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_destination'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3690' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3691' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- const char* dbus_message_get_error_name(DBusMessage*) -->
    <function-decl name='dbus_message_get_error_name' mangled-name='dbus_message_get_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_error_name'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3397' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- const char* dbus_message_get_member(DBusMessage*) -->
    <function-decl name='dbus_message_get_member' mangled-name='dbus_message_get_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_member'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3313' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_member(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_member' mangled-name='dbus_message_has_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_member'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3335' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3336' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- const char* dbus_message_get_interface(DBusMessage*) -->
    <function-decl name='dbus_message_get_interface' mangled-name='dbus_message_get_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_interface'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3227' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_interface(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_interface' mangled-name='dbus_message_has_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_interface'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3249' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3250' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- const char* dbus_message_get_path(DBusMessage*) -->
    <function-decl name='dbus_message_get_path' mangled-name='dbus_message_get_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_path'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3096' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_path(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_path' mangled-name='dbus_message_has_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_path'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3120' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3121' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_uint32_t dbus_message_get_reply_serial(DBusMessage*) -->
    <function-decl name='dbus_message_get_reply_serial' mangled-name='dbus_message_get_reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_reply_serial'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1163' column='1'/>
      <!-- typedef dbus_uint32_t -->
      <return type-id='type-id-16'/>
    </function-decl>
    <!-- const char* dbus_message_get_signature(DBusMessage*) -->
    <function-decl name='dbus_message_get_signature' mangled-name='dbus_message_get_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_signature'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3543' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_signature(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_signature' mangled-name='dbus_message_has_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3754' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_signature'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3754' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3755' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_sender(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_sender' mangled-name='dbus_message_set_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_sender'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3479' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3480' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_destination(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_destination' mangled-name='dbus_message_set_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_destination'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3425' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3426' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_reply_serial(DBusMessage*, dbus_uint32_t) -->
    <function-decl name='dbus_message_set_reply_serial' mangled-name='dbus_message_set_reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_reply_serial'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1143' column='1'/>
      <!-- parameter of type 'typedef dbus_uint32_t' -->
      <parameter type-id='type-id-16' name='reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1144' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_error_name(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_error_name' mangled-name='dbus_message_set_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_error_name'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3371' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3372' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_member(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_member' mangled-name='dbus_message_set_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_member'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3286' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3287' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_interface(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_interface' mangled-name='dbus_message_set_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_interface'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3198' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3199' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_get_path_decomposed(DBusMessage*, char***) -->
    <function-decl name='dbus_message_get_path_decomposed' mangled-name='dbus_message_get_path_decomposed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_path_decomposed'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3164' column='1'/>
      <!-- parameter of type 'char***' -->
      <parameter type-id='type-id-128' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3165' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_path(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_path' mangled-name='dbus_message_set_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3067' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_path'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3067' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3068' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_get_auto_start(DBusMessage*) -->
    <function-decl name='dbus_message_get_auto_start' mangled-name='dbus_message_get_auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3045' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_auto_start'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3045' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_get_no_reply(DBusMessage*) -->
    <function-decl name='dbus_message_get_no_reply' mangled-name='dbus_message_get_no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_no_reply'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3003' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_message_set_auto_start(DBusMessage*, dbus_bool_t) -->
    <function-decl name='dbus_message_set_auto_start' mangled-name='dbus_message_set_auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_auto_start'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3026' column='1'/>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='type-id-17' name='auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3027' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_message_set_no_reply(DBusMessage*, dbus_bool_t) -->
    <function-decl name='dbus_message_set_no_reply' mangled-name='dbus_message_set_no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_no_reply'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2984' column='1'/>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='type-id-17' name='no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2985' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_message_iter_abandon_container(DBusMessageIter*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_abandon_container' mangled-name='dbus_message_iter_abandon_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_abandon_container'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2951' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2952' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_close_container(DBusMessageIter*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_close_container' mangled-name='dbus_message_iter_close_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_close_container'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2918' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2919' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_open_container(DBusMessageIter*, int, const char*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_open_container' mangled-name='dbus_message_iter_open_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_open_container'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2849' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2850' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='contained_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2851' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2852' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_append_fixed_array(DBusMessageIter*, int, void*, int) -->
    <function-decl name='dbus_message_iter_append_fixed_array' mangled-name='dbus_message_iter_append_fixed_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_append_fixed_array'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2791' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='element_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2792' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2793' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='n_elements' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2794' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_append_basic(DBusMessageIter*, int, void*) -->
    <function-decl name='dbus_message_iter_append_basic' mangled-name='dbus_message_iter_append_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_append_basic'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2656' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2657' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2658' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_message_iter_init_append(DBusMessage*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_init_append' mangled-name='dbus_message_iter_init_append' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_init_append'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2421' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2422' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- int dbus_message_iter_get_arg_type(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_get_arg_type' mangled-name='dbus_message_iter_get_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_arg_type'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2139' column='1'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- void dbus_message_iter_get_fixed_array(DBusMessageIter*, void*, int*) -->
    <function-decl name='dbus_message_iter_get_fixed_array' mangled-name='dbus_message_iter_get_fixed_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2391' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_fixed_array'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2391' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2392' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-24' name='n_elements' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2393' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- int dbus_message_iter_get_array_len(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_get_array_len' mangled-name='dbus_message_iter_get_array_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_array_len'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2346' column='1'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- void dbus_message_iter_get_basic(DBusMessageIter*, void*) -->
    <function-decl name='dbus_message_iter_get_basic' mangled-name='dbus_message_iter_get_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_basic'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2293' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2294' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- char* dbus_message_iter_get_signature(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_get_signature' mangled-name='dbus_message_iter_get_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_signature'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2220' column='1'/>
      <!-- char* -->
      <return type-id='type-id-22'/>
    </function-decl>
    <!-- void dbus_message_iter_recurse(DBusMessageIter*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_recurse' mangled-name='dbus_message_iter_recurse' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_recurse'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2195' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2196' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- int dbus_message_iter_get_element_type(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_get_element_type' mangled-name='dbus_message_iter_get_element_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_element_type'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2158' column='1'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_next(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_next' mangled-name='dbus_message_iter_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_next'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2114' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_has_next(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_has_next' mangled-name='dbus_message_iter_has_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_has_next'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2095' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_init(DBusMessage*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_init' mangled-name='dbus_message_iter_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2064' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_init'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2064' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2065' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_append_args_valist(DBusMessage*, int, __va_list_tag*) -->
    <function-decl name='dbus_message_append_args_valist' mangled-name='dbus_message_append_args_valist' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1824' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_append_args_valist'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1824' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1825' column='1'/>
      <!-- parameter of type '__va_list_tag*' -->
      <parameter type-id='type-id-156' name='var_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1826' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_append_args(DBusMessage*, int, ...) -->
    <function-decl name='dbus_message_append_args' mangled-name='dbus_message_append_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_append_args'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1792' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1793' column='1'/>
      <parameter is-variadic='yes'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- int dbus_message_get_type(DBusMessage*) -->
    <function-decl name='dbus_message_get_type' mangled-name='dbus_message_get_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_type'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1722' column='1'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_is_error(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_is_error' mangled-name='dbus_message_is_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_error'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3657' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3658' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_is_signal(DBusMessage*, const char*, const char*) -->
    <function-decl name='dbus_message_is_signal' mangled-name='dbus_message_is_signal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_signal'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3630' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3631' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='signal_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3632' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_is_method_call(DBusMessage*, const char*, const char*) -->
    <function-decl name='dbus_message_is_method_call' mangled-name='dbus_message_is_method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3602' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_method_call'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3602' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3603' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='method' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3604' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_message_unref(DBusMessage*) -->
    <function-decl name='dbus_message_unref' mangled-name='dbus_message_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_unref'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1690' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_demarshal(const char*, int, DBusError*) -->
    <function-decl name='dbus_message_demarshal' mangled-name='dbus_message_demarshal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_demarshal'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4783' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4784' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4785' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_copy(const DBusMessage*) -->
    <function-decl name='dbus_message_copy' mangled-name='dbus_message_copy' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_copy'>
      <!-- parameter of type 'const DBusMessage*' -->
      <parameter type-id='type-id-158' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1587' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new_signal(const char*, const char*, const char*) -->
    <function-decl name='dbus_message_new_signal' mangled-name='dbus_message_new_signal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_signal'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1424' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1425' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1426' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new_method_call(const char*, const char*, const char*, const char*) -->
    <function-decl name='dbus_message_new_method_call' mangled-name='dbus_message_new_method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_method_call'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1333' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1334' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1335' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='method' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1336' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new(int) -->
    <function-decl name='dbus_message_new' mangled-name='dbus_message_new' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='message_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1289' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- dbus_uint32_t dbus_message_get_serial(DBusMessage*) -->
    <function-decl name='dbus_message_get_serial' mangled-name='dbus_message_get_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_serial'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1127' column='1'/>
      <!-- typedef dbus_uint32_t -->
      <return type-id='type-id-16'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new_error(DBusMessage*, const char*, const char*) -->
    <function-decl name='dbus_message_new_error' mangled-name='dbus_message_new_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_error'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='reply_to' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1470' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1471' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='error_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1472' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new_error_printf(DBusMessage*, const char*, const char*, ...) -->
    <function-decl name='dbus_message_new_error_printf' mangled-name='dbus_message_new_error_printf' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_error_printf'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='reply_to' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1542' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1543' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='error_format' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1544' column='1'/>
      <parameter is-variadic='yes'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new_method_return(DBusMessage*) -->
    <function-decl name='dbus_message_new_method_return' mangled-name='dbus_message_new_method_return' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_method_return'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1373' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_get_args_valist(DBusMessage*, DBusError*, int, __va_list_tag*) -->
    <function-decl name='dbus_message_get_args_valist' mangled-name='dbus_message_get_args_valist' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_args_valist'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2009' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2010' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2011' column='1'/>
      <!-- parameter of type '__va_list_tag*' -->
      <parameter type-id='type-id-156' name='var_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2012' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_get_args(DBusMessage*, DBusError*, int, ...) -->
    <function-decl name='dbus_message_get_args' mangled-name='dbus_message_get_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_args'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1980' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1981' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1982' column='1'/>
      <parameter is-variadic='yes'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_set_error_from_message(DBusError*, DBusMessage*) -->
    <function-decl name='dbus_set_error_from_message' mangled-name='dbus_set_error_from_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_set_error_from_message'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3796' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3797' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_message_lock(DBusMessage*) -->
    <function-decl name='dbus_message_lock' mangled-name='dbus_message_lock' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_lock'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='384' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_marshal(DBusMessage*, char**, int*) -->
    <function-decl name='dbus_message_marshal' mangled-name='dbus_message_marshal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_marshal'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='msg' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4721' column='1'/>
      <!-- parameter of type 'char**' -->
      <parameter type-id='type-id-127' name='marshalled_data_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4722' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-24' name='len_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4723' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_message_set_serial(DBusMessage*, dbus_uint32_t) -->
    <function-decl name='dbus_message_set_serial' mangled-name='dbus_message_set_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_serial'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='254' column='1'/>
      <!-- parameter of type 'typedef dbus_uint32_t' -->
      <parameter type-id='type-id-16' name='serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='255' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-misc.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- void dbus_get_version(int*, int*, int*) -->
    <function-decl name='dbus_get_version' mangled-name='dbus_get_version' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_get_version'>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-24' name='major_version_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='161' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-24' name='minor_version_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='162' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-24' name='micro_version_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='163' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- char* dbus_get_local_machine_id() -->
    <function-decl name='dbus_get_local_machine_id' mangled-name='dbus_get_local_machine_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_get_local_machine_id'>
      <!-- char* -->
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-pending-call.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- typedef void (DBusPendingCall*, void*)* DBusPendingCallNotifyFunction -->
    <typedef-decl name='DBusPendingCallNotifyFunction' type-id='type-id-142' filepath='../dbus/dbus-connection.h' line='162' column='1' id='type-id-89'/>
    <!-- void (DBusPendingCall*, void*)* -->
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-142'/>
    <!-- void* dbus_pending_call_get_data(DBusPendingCall*, dbus_int32_t) -->
    <function-decl name='dbus_pending_call_get_data' mangled-name='dbus_pending_call_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_get_data'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='827' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='828' column='1'/>
      <!-- void* -->
      <return type-id='type-id-10'/>
    </function-decl>
    <!-- DBusMessage* dbus_pending_call_steal_reply(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_steal_reply' mangled-name='dbus_pending_call_steal_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_steal_reply'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='702' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='type-id-30'/>
    </function-decl>
    <!-- dbus_bool_t dbus_pending_call_get_completed(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_get_completed' mangled-name='dbus_pending_call_get_completed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_get_completed'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='679' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_pending_call_free_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_pending_call_free_data_slot' mangled-name='dbus_pending_call_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_free_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='779' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_pending_call_allocate_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_pending_call_allocate_data_slot' mangled-name='dbus_pending_call_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_allocate_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='759' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_pending_call_block(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_block' mangled-name='dbus_pending_call_block' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_block'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='737' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_pending_call_cancel(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_cancel' mangled-name='dbus_pending_call_cancel' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_cancel'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='663' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- void dbus_pending_call_unref(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_unref' mangled-name='dbus_pending_call_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_unref'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='597' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- DBusPendingCall* dbus_pending_call_ref(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_ref' mangled-name='dbus_pending_call_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='577' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_ref'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='577' column='1'/>
      <!-- DBusPendingCall* -->
      <return type-id='type-id-123'/>
    </function-decl>
    <!-- dbus_bool_t dbus_pending_call_set_data(DBusPendingCall*, dbus_int32_t, void*, DBusFreeFunction) -->
    <function-decl name='dbus_pending_call_set_data' mangled-name='dbus_pending_call_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_set_data'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='801' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='802' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='803' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='804' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_pending_call_set_notify(DBusPendingCall*, DBusPendingCallNotifyFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_pending_call_set_notify' mangled-name='dbus_pending_call_set_notify' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_set_notify'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='622' column='1'/>
      <!-- parameter of type 'typedef DBusPendingCallNotifyFunction' -->
      <parameter type-id='type-id-89' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='623' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='624' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='625' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void (DBusPendingCall*, void*) -->
    <function-type size-in-bits='64' id='type-id-147'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='type-id-123'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-server.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- char[16] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-159'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='type-id-43' id='type-id-160'/>
    </array-type-def>
    <!-- dbus_uint32_t[4] -->
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='128' id='type-id-161'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='type-id-43' id='type-id-162'/>
    </array-type-def>
    <!-- struct DBusServer -->
    <class-decl name='DBusServer' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../dbus/dbus-server-protected.h' line='57' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusAtomic DBusServer::refcount -->
        <var-decl name='refcount' type-id='type-id-26' visibility='default' filepath='../dbus/dbus-server-protected.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const DBusServerVTable* DBusServer::vtable -->
        <var-decl name='vtable' type-id='type-id-164' visibility='default' filepath='../dbus/dbus-server-protected.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- DBusRMutex* DBusServer::mutex -->
        <var-decl name='mutex' type-id='type-id-27' visibility='default' filepath='../dbus/dbus-server-protected.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusGUID DBusServer::guid -->
        <var-decl name='guid' type-id='type-id-165' visibility='default' filepath='../dbus/dbus-server-protected.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- DBusString DBusServer::guid_hex -->
        <var-decl name='guid_hex' type-id='type-id-7' visibility='default' filepath='../dbus/dbus-server-protected.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- DBusWatchList* DBusServer::watches -->
        <var-decl name='watches' type-id='type-id-33' visibility='default' filepath='../dbus/dbus-server-protected.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- DBusTimeoutList* DBusServer::timeouts -->
        <var-decl name='timeouts' type-id='type-id-34' visibility='default' filepath='../dbus/dbus-server-protected.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- char* DBusServer::address -->
        <var-decl name='address' type-id='type-id-22' visibility='default' filepath='../dbus/dbus-server-protected.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- dbus_bool_t DBusServer::published_address -->
        <var-decl name='published_address' type-id='type-id-17' visibility='default' filepath='../dbus/dbus-server-protected.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <!-- int DBusServer::max_connections -->
        <var-decl name='max_connections' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-server-protected.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- DBusDataSlotList DBusServer::slot_list -->
        <var-decl name='slot_list' type-id='type-id-35' visibility='default' filepath='../dbus/dbus-server-protected.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- DBusNewConnectionFunction DBusServer::new_connection_function -->
        <var-decl name='new_connection_function' type-id='type-id-166' visibility='default' filepath='../dbus/dbus-server-protected.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- void* DBusServer::new_connection_data -->
        <var-decl name='new_connection_data' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-server-protected.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- DBusFreeFunction DBusServer::new_connection_free_data_function -->
        <var-decl name='new_connection_free_data_function' type-id='type-id-38' visibility='default' filepath='../dbus/dbus-server-protected.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- char** DBusServer::auth_mechanisms -->
        <var-decl name='auth_mechanisms' type-id='type-id-127' visibility='default' filepath='../dbus/dbus-server-protected.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int DBusServer::disconnected -->
        <var-decl name='disconnected' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-server-protected.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <!-- unsigned int DBusServer::have_server_lock -->
        <var-decl name='have_server_lock' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-server-protected.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusServerVTable DBusServerVTable -->
    <typedef-decl name='DBusServerVTable' type-id='type-id-167' filepath='../dbus/dbus-server-protected.h' line='38' column='1' id='type-id-168'/>
    <!-- struct DBusServerVTable -->
    <class-decl name='DBusServerVTable' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-server-protected.h' line='44' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void (DBusServer*)* DBusServerVTable::finalize -->
        <var-decl name='finalize' type-id='type-id-169' visibility='default' filepath='../dbus/dbus-server-protected.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void (DBusServer*)* DBusServerVTable::disconnect -->
        <var-decl name='disconnect' type-id='type-id-169' visibility='default' filepath='../dbus/dbus-server-protected.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusServer DBusServer -->
    <typedef-decl name='DBusServer' type-id='type-id-163' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.h' line='42' column='1' id='type-id-170'/>
    <!-- typedef DBusGUID DBusGUID -->
    <typedef-decl name='DBusGUID' type-id='type-id-171' filepath='../dbus/dbus-sysdeps.h' line='507' column='1' id='type-id-165'/>
    <!-- union DBusGUID -->
    <union-decl name='DBusGUID' size-in-bits='128' visibility='default' filepath='../dbus/dbus-internals.h' line='351' column='1' id='type-id-171'>
      <data-member access='public'>
        <!-- dbus_uint32_t DBusGUID::as_uint32s[4] -->
        <var-decl name='as_uint32s' type-id='type-id-161' visibility='default' filepath='../dbus/dbus-internals.h' line='352' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- char DBusGUID::as_bytes[16] -->
        <var-decl name='as_bytes' type-id='type-id-159' visibility='default' filepath='../dbus/dbus-internals.h' line='353' column='1'/>
      </data-member>
    </union-decl>
    <!-- typedef void (DBusServer*, DBusConnection*, void*)* DBusNewConnectionFunction -->
    <typedef-decl name='DBusNewConnectionFunction' type-id='type-id-172' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.h' line='47' column='1' id='type-id-166'/>
    <!-- DBusServer* -->
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-173'/>
    <!-- const DBusServerVTable -->
    <qualified-type-def type-id='type-id-168' const='yes' id='type-id-174'/>
    <!-- const DBusServerVTable* -->
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-164'/>
    <!-- const char** -->
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-175'/>
    <!-- void (DBusServer*)* -->
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-169'/>
    <!-- void (DBusServer*, DBusConnection*, void*)* -->
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-172'/>
    <!-- void* dbus_server_get_data(DBusServer*, int) -->
    <function-decl name='dbus_server_get_data' mangled-name='dbus_server_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_data'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1156' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1157' column='1'/>
      <!-- void* -->
      <return type-id='type-id-10'/>
    </function-decl>
    <!-- void dbus_server_set_new_connection_function(DBusServer*, DBusNewConnectionFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_server_set_new_connection_function' mangled-name='dbus_server_set_new_connection_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_new_connection_function'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='889' column='1'/>
      <!-- parameter of type 'typedef DBusNewConnectionFunction' -->
      <parameter type-id='type-id-166' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='890' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='891' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='892' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_get_is_connected(DBusServer*) -->
    <function-decl name='dbus_server_get_is_connected' mangled-name='dbus_server_get_is_connected' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_is_connected'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='797' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_set_data(DBusServer*, int, void*, DBusFreeFunction) -->
    <function-decl name='dbus_server_set_data' mangled-name='dbus_server_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_data'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1116' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1117' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1118' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1119' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_server_free_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_server_free_data_slot' mangled-name='dbus_server_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_free_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1095' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_allocate_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_server_allocate_data_slot' mangled-name='dbus_server_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_allocate_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1077' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_set_auth_mechanisms(DBusServer*, const char**) -->
    <function-decl name='dbus_server_set_auth_mechanisms' mangled-name='dbus_server_set_auth_mechanisms' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1033' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_auth_mechanisms'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1033' column='1'/>
      <!-- parameter of type 'const char**' -->
      <parameter type-id='type-id-175' name='mechanisms' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1034' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_set_timeout_functions(DBusServer*, DBusAddTimeoutFunction, DBusRemoveTimeoutFunction, DBusTimeoutToggledFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_server_set_timeout_functions' mangled-name='dbus_server_set_timeout_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_timeout_functions'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='982' column='1'/>
      <!-- parameter of type 'typedef DBusAddTimeoutFunction' -->
      <parameter type-id='type-id-109' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='983' column='1'/>
      <!-- parameter of type 'typedef DBusRemoveTimeoutFunction' -->
      <parameter type-id='type-id-112' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='984' column='1'/>
      <!-- parameter of type 'typedef DBusTimeoutToggledFunction' -->
      <parameter type-id='type-id-113' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='985' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='986' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='987' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_set_watch_functions(DBusServer*, DBusAddWatchFunction, DBusRemoveWatchFunction, DBusWatchToggledFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_server_set_watch_functions' mangled-name='dbus_server_set_watch_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='929' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_watch_functions'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='929' column='1'/>
      <!-- parameter of type 'typedef DBusAddWatchFunction' -->
      <parameter type-id='type-id-115' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='930' column='1'/>
      <!-- parameter of type 'typedef DBusRemoveWatchFunction' -->
      <parameter type-id='type-id-118' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='931' column='1'/>
      <!-- parameter of type 'typedef DBusWatchToggledFunction' -->
      <parameter type-id='type-id-119' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='932' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='933' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='934' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- char* dbus_server_get_id(DBusServer*) -->
    <function-decl name='dbus_server_get_id' mangled-name='dbus_server_get_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_id'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='854' column='1'/>
      <!-- char* -->
      <return type-id='type-id-22'/>
    </function-decl>
    <!-- char* dbus_server_get_address(DBusServer*) -->
    <function-decl name='dbus_server_get_address' mangled-name='dbus_server_get_address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='818' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_address'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='818' column='1'/>
      <!-- char* -->
      <return type-id='type-id-22'/>
    </function-decl>
    <!-- void dbus_server_unref(DBusServer*) -->
    <function-decl name='dbus_server_unref' mangled-name='dbus_server_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_unref'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='720' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- DBusServer* dbus_server_ref(DBusServer*) -->
    <function-decl name='dbus_server_ref' mangled-name='dbus_server_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_ref'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='687' column='1'/>
      <!-- DBusServer* -->
      <return type-id='type-id-173'/>
    </function-decl>
    <!-- void dbus_server_disconnect(DBusServer*) -->
    <function-decl name='dbus_server_disconnect' mangled-name='dbus_server_disconnect' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_disconnect'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='770' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- DBusServer* dbus_server_listen(const char*, DBusError*) -->
    <function-decl name='dbus_server_listen' mangled-name='dbus_server_listen' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='549' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_listen'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='549' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='550' column='1'/>
      <!-- DBusServer* -->
      <return type-id='type-id-173'/>
    </function-decl>
    <!-- void (DBusServer*) -->
    <function-type size-in-bits='64' id='type-id-176'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-type>
    <!-- void (DBusServer*, DBusConnection*, void*) -->
    <function-type size-in-bits='64' id='type-id-177'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='type-id-173'/>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='type-id-47'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-10'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-signature.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- typedef __anonymous_struct__ DBusSignatureIter -->
    <typedef-decl name='DBusSignatureIter' type-id='type-id-178' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='51' column='1' id='type-id-179'/>
    <!-- struct {void* dummy1; void* dummy2; dbus_uint32_t dummy8; int dummy12; int dummy17;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-179' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='45' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* dummy1 -->
        <var-decl name='dummy1' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* dummy2 -->
        <var-decl name='dummy2' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- dbus_uint32_t dummy8 -->
        <var-decl name='dummy8' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int dummy12 -->
        <var-decl name='dummy12' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int dummy17 -->
        <var-decl name='dummy17' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <!-- DBusSignatureIter* -->
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <!-- const DBusSignatureIter -->
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-181'/>
    <!-- const DBusSignatureIter* -->
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <!-- void dbus_signature_iter_init(DBusSignatureIter*, const char*) -->
    <function-decl name='dbus_signature_iter_init' mangled-name='dbus_signature_iter_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_init'>
      <!-- parameter of type 'DBusSignatureIter*' -->
      <parameter type-id='type-id-180' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='67' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='68' column='1'/>
      <!-- void -->
      <return type-id='type-id-4'/>
    </function-decl>
    <!-- dbus_bool_t dbus_type_is_valid(int) -->
    <function-decl name='dbus_type_is_valid' mangled-name='dbus_type_is_valid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_valid'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='383' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_type_is_fixed(int) -->
    <function-decl name='dbus_type_is_fixed' mangled-name='dbus_type_is_fixed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_fixed'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='349' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_type_is_basic(int) -->
    <function-decl name='dbus_type_is_basic' mangled-name='dbus_type_is_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_basic'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='318' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_type_is_container(int) -->
    <function-decl name='dbus_type_is_container' mangled-name='dbus_type_is_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_container'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-2' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='294' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_signature_validate(const char*, DBusError*) -->
    <function-decl name='dbus_signature_validate' mangled-name='dbus_signature_validate' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_validate'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='233' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='234' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- dbus_bool_t dbus_signature_iter_next(DBusSignatureIter*) -->
    <function-decl name='dbus_signature_iter_next' mangled-name='dbus_signature_iter_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_next'>
      <!-- parameter of type 'DBusSignatureIter*' -->
      <parameter type-id='type-id-180' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='164' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- int dbus_signature_iter_get_current_type(const DBusSignatureIter*) -->
    <function-decl name='dbus_signature_iter_get_current_type' mangled-name='dbus_signature_iter_get_current_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_get_current_type'>
      <!-- parameter of type 'const DBusSignatureIter*' -->
      <parameter type-id='type-id-182' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='92' column='1'/>
      <!-- int -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- dbus_bool_t dbus_signature_validate_single(const char*, DBusError*) -->
    <function-decl name='dbus_signature_validate_single' mangled-name='dbus_signature_validate_single' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_validate_single'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-15' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='264' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='265' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- void dbus_signature_iter_recurse(const DBusSignatureIter*, DBusSignatureIter*) -->
    <function-decl name='dbus_signature_iter_recurse' mangled-name='dbus_signature_iter_recurse' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_recurse'>
      <!-- parameter of type 'const DBusSignatureIter*' -->
