{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA12_i",
   "name" : "int [12]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA12_i",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA14_i",
   "name" : "int [14]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA14_i",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_c",
   "name" : "char [16]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA16_c",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,

   "linker_set_key" : "_ZTIKSt16nested_exception",
   "name" : "const std::nested_exception",
   "referenced_type" : "_ZTISt16nested_exception",
   "self_type" : "_ZTIKSt16nested_exception",
   "size" : 16,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "_ZTISt9nothrow_t",
   "self_type" : "_ZTIKSt9nothrow_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "self_type" : "_ZTIKSt9type_info",
   "size" : 16,
   "source_file" : "external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTIVNSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_mPKvE",
   "name" : "void *(*volatile)(void *, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvS_mPKvE",
   "self_type" : "_ZTIVPFPvS_mPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmPKvE",
   "name" : "void *(*volatile)(unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmPKvE",
   "self_type" : "_ZTIVPFPvmPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmmPKvE",
   "name" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmmPKvE",
   "self_type" : "_ZTIVPFPvmmPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA31_y"
    },
    {
     "field_name" : "sp",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIA4096_h"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 4384,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "esr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI11esr_context",
   "name" : "esr_context",
   "referenced_type" : "_ZTI11esr_context",
   "self_type" : "_ZTI11esr_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "vl",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA3_t"
    }
   ],
   "linker_set_key" : "_ZTI11sve_context",
   "name" : "sve_context",
   "referenced_type" : "_ZTI11sve_context",
   "self_type" : "_ZTI11sve_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12_aarch64_ctx",
   "name" : "_aarch64_ctx",
   "referenced_type" : "_ZTI12_aarch64_ctx",
   "self_type" : "_ZTI12_aarch64_ctx",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "datap",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI13extra_context",
   "name" : "extra_context",
   "referenced_type" : "_ZTI13extra_context",
   "self_type" : "_ZTI13extra_context",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vregs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA32_o"
    }
   ],
   "linker_set_key" : "_ZTI14fpsimd_context",
   "name" : "fpsimd_context",
   "referenced_type" : "_ZTI14fpsimd_context",
   "self_type" : "_ZTI14fpsimd_context",
   "size" : 528,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA12_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA14_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTIA31_m"
    },
    {
     "field_name" : "sp",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI16user_regs_struct",
   "name" : "user_regs_struct",
   "referenced_type" : "_ZTI16user_regs_struct",
   "self_type" : "_ZTI16user_regs_struct",
   "size" : 272,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA4_l"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "vregs",
     "referenced_type" : "_ZTIA32_o"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18user_fpsimd_struct",
   "name" : "user_fpsimd_struct",
   "referenced_type" : "_ZTI18user_fpsimd_struct",
   "self_type" : "_ZTI18user_fpsimd_struct",
   "size" : 528,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/select.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI8sigset_t",
   "name" : "sigset_t",
   "referenced_type" : "_ZTI8sigset_t",
   "self_type" : "_ZTI8sigset_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_offset" : 320,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI10sigcontext"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 4560,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI9imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "_ZTI9imaxdiv_t",
   "self_type" : "_ZTI9imaxdiv_t",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/inttypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt0_E",
   "self_type" : "_ZTIN10__sifieldsUt0_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt1_E",
   "self_type" : "_ZTIN10__sifieldsUt1_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt2_E",
   "self_type" : "_ZTIN10__sifieldsUt2_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_E",
   "self_type" : "_ZTIN10__sifieldsUt3_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt4_E",
   "self_type" : "_ZTIN10__sifieldsUt4_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt5_E",
   "self_type" : "_ZTIN10__sifieldsUt5_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h:79:22)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplINS_15IntervalMapImpl4Path5EntryEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINS_15IntervalMapImpl4Path5EntryELj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorINS_15IntervalMapImpl4Path5EntryELj4EEE",
   "name" : "llvm::SmallVector<llvm::IntervalMapImpl::Path::Entry, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorINS_15IntervalMapImpl4Path5EntryELj4EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorINS_15IntervalMapImpl4Path5EntryELj4EEE",
   "size" : 88,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplINS_15IntervalMapImpl7NodeRefEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINS_15IntervalMapImpl7NodeRefELj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorINS_15IntervalMapImpl7NodeRefELj4EEE",
   "name" : "llvm::SmallVector<llvm::IntervalMapImpl::NodeRef, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorINS_15IntervalMapImpl7NodeRefELj4EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorINS_15IntervalMapImpl7NodeRefELj4EEE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl7NodeRefE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "name" : "llvm::SmallVector<std::pair<void *, unsigned long>, 0>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPvEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "name" : "llvm::SmallVector<void *, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "name" : "llvm::AllocatorBase<llvm::MallocAllocator>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "self_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" : [ "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "name" : "llvm::AllocatorBase<llvm::BumpPtrAllocatorImpl<llvm::MallocAllocator, 4096, 4096>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "self_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" :
   [
    "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14PointerIntPairIPvLj6EjNS_15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsENS_18PointerIntPairInfoIS1_Lj6ES4_EEEE",
   "name" : "llvm::PointerIntPair<void *, 6, unsigned int, llvm::IntervalMapImpl::NodeRef::CacheAlignedPointerTraits, llvm::PointerIntPairInfo<void *, 6, llvm::IntervalMapImpl::NodeRef::CacheAlignedPointerTraits>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14PointerIntPairIPvLj6EjNS_15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsENS_18PointerIntPairInfoIS1_Lj6ES4_EEEE",
   "self_type" : "_ZTIN4llvm14PointerIntPairIPvLj6EjNS_15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsENS_18PointerIntPairInfoIS1_Lj6ES4_EEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/PointerIntPair.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIj",
    "_ZTIN4llvm15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsE",
    "_ZTIN4llvm18PointerIntPairInfoIPvLj6ENS_15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsEEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "node",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15IntervalMapImpl4Path5EntryE",
   "name" : "llvm::IntervalMapImpl::Path::Entry",
   "referenced_type" : "_ZTIN4llvm15IntervalMapImpl4Path5EntryE",
   "self_type" : "_ZTIN4llvm15IntervalMapImpl4Path5EntryE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/IntervalMap.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "path",
     "referenced_type" : "_ZTIN4llvm11SmallVectorINS_15IntervalMapImpl4Path5EntryELj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15IntervalMapImpl4PathE",
   "name" : "llvm::IntervalMapImpl::Path",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15IntervalMapImpl4PathE",
   "self_type" : "_ZTIN4llvm15IntervalMapImpl4PathE",
   "size" : 88,
   "source_file" : "external/llvm/include/llvm/ADT/IntervalMap.h"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsE",
   "name" : "llvm::IntervalMapImpl::NodeRef::CacheAlignedPointerTraits",
   "referenced_type" : "_ZTIN4llvm15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsE",
   "self_type" : "_ZTIN4llvm15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/IntervalMap.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pip",
     "referenced_type" : "_ZTIN4llvm14PointerIntPairIPvLj6EjNS_15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsENS_18PointerIntPairInfoIS1_Lj6ES4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15IntervalMapImpl7NodeRefE",
   "name" : "llvm::IntervalMapImpl::NodeRef",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15IntervalMapImpl7NodeRefE",
   "self_type" : "_ZTIN4llvm15IntervalMapImpl7NodeRefE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/IntervalMap.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15MallocAllocatorE",
   "name" : "llvm::MallocAllocator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15MallocAllocatorE",
   "self_type" : "_ZTIN4llvm15MallocAllocatorE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "BeginX",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "EndX",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "CapacityX",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorBaseE",
   "name" : "llvm::SmallVectorBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE",
   "self_type" : "_ZTIN4llvm15SmallVectorBaseE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_15IntervalMapImpl4Path5EntryELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplINS_15IntervalMapImpl4Path5EntryEEE",
   "name" : "llvm::SmallVectorImpl<llvm::IntervalMapImpl::Path::Entry>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplINS_15IntervalMapImpl4Path5EntryEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplINS_15IntervalMapImpl4Path5EntryEEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_15IntervalMapImpl7NodeRefELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplINS_15IntervalMapImpl7NodeRefEEE",
   "name" : "llvm::SmallVectorImpl<llvm::IntervalMapImpl::NodeRef>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplINS_15IntervalMapImpl7NodeRefEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplINS_15IntervalMapImpl7NodeRefEEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl7NodeRefE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "name" : "llvm::SmallVectorImpl<std::pair<void *, unsigned long>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "name" : "llvm::SmallVectorImpl<void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "name" : "llvm::AlignedCharArray<8, 16>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA8_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "name" : "llvm::AlignedCharArray<8, 8>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm18PointerIntPairInfoIPvLj6ENS_15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsEEE",
   "name" : "llvm::PointerIntPairInfo<void *, 6, llvm::IntervalMapImpl::NodeRef::CacheAlignedPointerTraits>",
   "referenced_type" : "_ZTIN4llvm18PointerIntPairInfoIPvLj6ENS_15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsEEE",
   "self_type" : "_ZTIN4llvm18PointerIntPairInfoIPvLj6ENS_15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/PointerIntPair.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIN4llvm15IntervalMapImpl7NodeRef25CacheAlignedPointerTraitsE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionINS_15IntervalMapImpl4Path5EntryEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageINS_15IntervalMapImpl4Path5EntryELj4EEE",
   "name" : "llvm::SmallVectorStorage<llvm::IntervalMapImpl::Path::Entry, 4>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINS_15IntervalMapImpl4Path5EntryELj4EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageINS_15IntervalMapImpl4Path5EntryELj4EEE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionINS_15IntervalMapImpl7NodeRefEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageINS_15IntervalMapImpl7NodeRefELj4EEE",
   "name" : "llvm::SmallVectorStorage<llvm::IntervalMapImpl::NodeRef, 4>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINS_15IntervalMapImpl7NodeRefELj4EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageINS_15IntervalMapImpl7NodeRefELj4EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl7NodeRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "name" : "llvm::SmallVectorStorage<std::pair<void *, unsigned long>, 0>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "name" : "llvm::SmallVectorStorage<void *, 4>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "CurPtr",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "End",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "Slabs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE"
    },
    {
     "access" : "private",
     "field_name" : "CustomSizedSlabs",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE"
    },
    {
     "access" : "private",
     "field_name" : "BytesAllocated",
     "field_offset" : 960,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "Allocator",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIN4llvm15MallocAllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "name" : "llvm::BumpPtrAllocatorImpl<llvm::MallocAllocator, 4096, 4096>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "self_type" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "size" : 136,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" : [ "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINS_15IntervalMapImpl4Path5EntryEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<llvm::IntervalMapImpl::Path::Entry, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_15IntervalMapImpl4Path5EntryEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_15IntervalMapImpl4Path5EntryEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm15IntervalMapImpl4Path5EntryE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINS_15IntervalMapImpl7NodeRefEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<llvm::IntervalMapImpl::NodeRef, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_15IntervalMapImpl7NodeRefEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_15IntervalMapImpl7NodeRefEcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm15IntervalMapImpl7NodeRefE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<void *, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "name" : "llvm::PointerLikeTypeTraits<void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "name" : "llvm::PointerLikeTypeTraits<uintptr_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "name" : "llvm::ScopedFatalErrorHandler",
   "referenced_type" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "self_type" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/ErrorHandling.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_15IntervalMapImpl4Path5EntryEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_15IntervalMapImpl4Path5EntryELb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<llvm::IntervalMapImpl::Path::Entry, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_15IntervalMapImpl4Path5EntryELb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_15IntervalMapImpl4Path5EntryELb1EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_15IntervalMapImpl7NodeRefEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_15IntervalMapImpl7NodeRefELb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<llvm::IntervalMapImpl::NodeRef, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_15IntervalMapImpl7NodeRefELb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_15IntervalMapImpl7NodeRefELb1EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl7NodeRefE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<std::pair<void *, unsigned long>, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<void *, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_15IntervalMapImpl4Path5EntryEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_15IntervalMapImpl4Path5EntryEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<llvm::IntervalMapImpl::Path::Entry, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_15IntervalMapImpl4Path5EntryEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_15IntervalMapImpl4Path5EntryEvEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_15IntervalMapImpl7NodeRefEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_15IntervalMapImpl7NodeRefEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<llvm::IntervalMapImpl::NodeRef, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_15IntervalMapImpl7NodeRefEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_15IntervalMapImpl7NodeRefEvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl7NodeRefE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<std::pair<void *, unsigned long>, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "name" : "llvm::SmallVectorTemplateCommon<void *, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Address",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "Size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys11MemoryBlockE",
   "name" : "llvm::sys::MemoryBlock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys11MemoryBlockE",
   "self_type" : "_ZTIN4llvm3sys11MemoryBlockE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "M",
     "referenced_type" : "_ZTIN4llvm3sys11MemoryBlockE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "name" : "llvm::sys::OwningMemoryBlock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "self_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm3sys6MemoryE",
   "name" : "llvm::sys::Memory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys6MemoryE",
   "self_type" : "_ZTIN4llvm3sys6MemoryE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIN4llvm15IntervalMapImpl4Path5EntryE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 136,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 144,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 152,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 160,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 168,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 176,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 184,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<llvm::IntervalMapImpl::Path::Entry, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm15IntervalMapImpl4Path5EntryE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIN4llvm15IntervalMapImpl7NodeRefE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 80,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 88,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 120,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<llvm::IntervalMapImpl::NodeRef, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm15IntervalMapImpl7NodeRefE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTINSt3__14pairIPvmEE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 136,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 144,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 152,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 160,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 168,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 176,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 184,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 80,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 88,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 120,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "name" : "llvm::detail::ConstantLog2<1>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<llvm::IntervalMapImpl::Path::Entry, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEELb0EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<llvm::IntervalMapImpl::NodeRef, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEELb0EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "name" : "llvm::detail::LeadingZerosCounter<unsigned int, 4>",
   "referenced_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "self_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "name" : "llvm::detail::LeadingZerosCounter<unsigned long, 8>",
   "referenced_type" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "self_type" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "name" : "llvm::detail::AlignmentCalcImplBase",
   "referenced_type" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "self_type" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE"
    },
    {
     "is_pure" : true,
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm6detail21AlignmentCalcImplBaseD1Ev"
    },
    {
     "is_pure" : true,
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm6detail21AlignmentCalcImplBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<llvm::IntervalMapImpl::Path::Entry, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm15IntervalMapImpl4Path5EntryE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINS_15IntervalMapImpl7NodeRefEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<llvm::IntervalMapImpl::NodeRef, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINS_15IntervalMapImpl7NodeRefEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINS_15IntervalMapImpl7NodeRefEcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm15IntervalMapImpl7NodeRefE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "name" : "llvm::detail::SizerImpl<void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<llvm::IntervalMapImpl::Path::Entry, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<llvm::IntervalMapImpl::NodeRef, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINS_15IntervalMapImpl4Path5EntryEEE",
   "name" : "llvm::isPodLike<llvm::IntervalMapImpl::Path::Entry>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINS_15IntervalMapImpl4Path5EntryEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINS_15IntervalMapImpl4Path5EntryEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINS_15IntervalMapImpl7NodeRefEEE",
   "name" : "llvm::isPodLike<llvm::IntervalMapImpl::NodeRef>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINS_15IntervalMapImpl7NodeRefEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINS_15IntervalMapImpl7NodeRefEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl7NodeRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "name" : "llvm::isPodLike<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIPvEE",
   "name" : "llvm::isPodLike<void *>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIPvEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIPvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeImEE",
   "name" : "llvm::isPodLike<unsigned long>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeImEE",
   "self_type" : "_ZTIN4llvm9isPodLikeImEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA12_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:232:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h:117:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h:78:20)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__110__function16__policy_storageE",
   "self_type" : "_ZTINSt3__110__function16__policy_storageE",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "referenced_type" : "_ZTINSt3__110__function8__policyE",
   "self_type" : "_ZTINSt3__110__function8__policyE",
   "size" : 32,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm0EEE",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "_ZTINSt3__110__get_pairILm0EEE",
   "self_type" : "_ZTINSt3__110__get_pairILm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm1EEE",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "_ZTINSt3__110__get_pairILm1EEE",
   "self_type" : "_ZTINSt3__110__get_pairILm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "_ZTINSt3__110__ignore_tIhEE",
   "self_type" : "_ZTINSt3__110__ignore_tIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__val_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "__cat_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKNSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110error_codeE",
   "name" : "std::error_code",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110error_codeE",
   "self_type" : "_ZTINSt3__110error_codeE",
   "size" : 16,
   "source_file" : "external/libcxx/include/system_error"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "referenced_type" : "_ZTINSt3__110is_trivialIcEE",
   "self_type" : "_ZTINSt3__110is_trivialIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIwEE",
   "self_type" : "_ZTINSt3__110is_trivialIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairIPvmEEEE",
   "name" : "std::tuple_size<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairIjjEEEE",
   "name" : "std::tuple_size<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "name" : "std::tuple_size<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIN4llvm15IntervalMapImpl4Path5EntryELb0EEE",
   "name" : "std::__add_const<llvm::IntervalMapImpl::Path::Entry, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIN4llvm15IntervalMapImpl4Path5EntryELb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIN4llvm15IntervalMapImpl4Path5EntryELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIPvLb0EEE",
   "name" : "std::__add_const<void *, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIPvLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIPvLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIjLb0EEE",
   "name" : "std::__add_const<unsigned int, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIjLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIjLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constImLb0EEE",
   "name" : "std::__add_const<unsigned long, false>",
   "referenced_type" : "_ZTINSt3__111__add_constImLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constImLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__type_list<__int128, std::__nat>>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__type_list<unsigned __int128, std::__nat>>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_4pairIPvmEEEE",
   "name" : "std::add_pointer<const std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairIPvmEEEE",
   "name" : "std::add_pointer<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairIjjEEEE",
   "name" : "std::add_pointer<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "name" : "std::add_pointer<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIPvEE",
   "name" : "std::add_pointer<void *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIPvEE",
   "self_type" : "_ZTINSt3__111add_pointerIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerImEE",
   "name" : "std::add_pointer<unsigned long>",
   "referenced_type" : "_ZTINSt3__111add_pointerImEE",
   "self_type" : "_ZTINSt3__111add_pointerImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDiEE",
   "name" : "std::char_traits<char32_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDiEE",
   "self_type" : "_ZTINSt3__111char_traitsIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDsEE",
   "name" : "std::char_traits<char16_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDsEE",
   "self_type" : "_ZTINSt3__111char_traitsIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIcEE",
   "name" : "std::char_traits<char>",
   "referenced_type" : "_ZTINSt3__111char_traitsIcEE",
   "self_type" : "_ZTINSt3__111char_traitsIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIwEE",
   "name" : "std::char_traits<wchar_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIwEE",
   "self_type" : "_ZTINSt3__111char_traitsIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "name" : "std::conditional<false, std::pointer_traits<char *>::__nat, char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPcE5__natE", "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "name" : "std::conditional<false, std::pointer_traits<wchar_t *>::__nat, wchar_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPwE5__natE", "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairIPvmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<void *, unsigned long>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIPvmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIPvmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairIjjE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<unsigned int, unsigned int>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIjjE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIjjE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIjjE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_4pairIPvmEES3_EE",
   "name" : "std::conditional<false, const std::pair<void *, unsigned long> *, std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_4pairIPvmEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_4pairIPvmEES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKNSt3__14pairIPvmEE", "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairIPvmEES3_EE",
   "name" : "std::conditional<false, std::pair<void *, unsigned long> *, std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIPvmEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIPvmEES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPNSt3__14pairIPvmEE", "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairIjjEES2_EE",
   "name" : "std::conditional<false, std::pair<unsigned int, unsigned int> *, std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIjjEES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIjjEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPNSt3__14pairIjjEE", "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long> *, std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPNSt3__14pairImmEE", "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPPvS1_EE",
   "name" : "std::conditional<false, void **, void *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPPvS1_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPPvS1_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPPv", "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPmmEE",
   "name" : "std::conditional<false, unsigned long *, unsigned long>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPmmEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPmmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIPvmEENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<void *, unsigned long>, std::__nat>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIPvmEENS_5__natEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIPvmEENS_5__natEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE", "_ZTINSt3__15__natE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::pair<unsigned int, unsigned int>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIjjE10_CheckArgsE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjEENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<unsigned int, unsigned int>, std::__nat>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjEENS_5__natEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjEENS_5__natEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE", "_ZTINSt3__15__natE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmE10_CheckArgsE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>, std::__nat>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE", "_ZTINSt3__15__natE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS1_15IntervalMapImpl4Path5EntryEcccccccccEEEE",
   "name" : "std::is_abstract<llvm::detail::AlignerImpl<llvm::IntervalMapImpl::Path::Entry, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS1_15IntervalMapImpl4Path5EntryEcccccccccEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS1_15IntervalMapImpl4Path5EntryEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl4Path5EntryEcccccccccEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS1_15IntervalMapImpl7NodeRefEcccccccccEEEE",
   "name" : "std::is_abstract<llvm::detail::AlignerImpl<llvm::IntervalMapImpl::NodeRef, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS1_15IntervalMapImpl7NodeRefEcccccccccEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS1_15IntervalMapImpl7NodeRefEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIN4llvm6detail11AlignerImplINS_15IntervalMapImpl7NodeRefEcccccccccEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_4pairIPvmEEcccccccccEEEE",
   "name" : "std::is_abstract<llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_4pairIPvmEEcccccccccEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_4pairIPvmEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplIPvcccccccccEEEE",
   "name" : "std::is_abstract<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplIPvcccccccccEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplIPvcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_18input_iterator_tagEEE",
   "name" : "std::is_abstract<std::input_iterator_tag>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_18input_iterator_tagEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_18input_iterator_tagEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__118input_iterator_tagE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPvEE",
   "name" : "std::is_abstract<void *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPvEE",
   "self_type" : "_ZTINSt3__111is_abstractIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIjEE",
   "name" : "std::is_abstract<unsigned int>",
   "referenced_type" : "_ZTINSt3__111is_abstractIjEE",
   "self_type" : "_ZTINSt3__111is_abstractIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractImEE",
   "name" : "std::is_abstract<unsigned long>",
   "referenced_type" : "_ZTINSt3__111is_abstractImEE",
   "self_type" : "_ZTINSt3__111is_abstractImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_4pairIPvmEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_4pairIPvmEEEE",
   "name" : "std::is_function<const std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIN4llvm15IntervalMapImpl4Path5EntryELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "name" : "std::is_function<llvm::IntervalMapImpl::Path::Entry>",
   "referenced_type" : "_ZTINSt3__111is_functionIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "self_type" : "_ZTINSt3__111is_functionIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_4pairIPvmEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_4pairIPvmEEEE",
   "name" : "std::is_function<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_4pairIjjEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_4pairIjjEEEE",
   "name" : "std::is_function<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_4pairImmEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_4pairImmEEEE",
   "name" : "std::is_function<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIPvLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIPvEE",
   "name" : "std::is_function<void *>",
   "referenced_type" : "_ZTINSt3__111is_functionIPvEE",
   "self_type" : "_ZTINSt3__111is_functionIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIjLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIjEE",
   "name" : "std::is_function<unsigned int>",
   "referenced_type" : "_ZTINSt3__111is_functionIjEE",
   "self_type" : "_ZTINSt3__111is_functionIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionImLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionImEE",
   "name" : "std::is_function<unsigned long>",
   "referenced_type" : "_ZTINSt3__111is_functionImEE",
   "self_type" : "_ZTINSt3__111is_functionImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIdEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIdEE",
   "name" : "std::is_integral<double>",
   "referenced_type" : "_ZTINSt3__111is_integralIdEE",
   "self_type" : "_ZTINSt3__111is_integralIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIjEE",
   "name" : "std::is_integral<unsigned int>",
   "referenced_type" : "_ZTINSt3__111is_integralIjEE",
   "self_type" : "_ZTINSt3__111is_integralIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIlEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIlEE",
   "name" : "std::is_integral<long>",
   "referenced_type" : "_ZTINSt3__111is_integralIlEE",
   "self_type" : "_ZTINSt3__111is_integralIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralImEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralImEE",
   "name" : "std::is_integral<unsigned long>",
   "referenced_type" : "_ZTINSt3__111is_integralImEE",
   "self_type" : "_ZTINSt3__111is_integralImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__115__struct_doubleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__116__struct_double4E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIPiEE",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "_ZTINSt3__112__align_typeIPiEE",
   "self_type" : "_ZTINSt3__112__align_typeIPiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIdEE",
   "name" : "std::__align_type<double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIdEE",
   "self_type" : "_ZTINSt3__112__align_typeIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIeEE",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIeEE",
   "self_type" : "_ZTINSt3__112__align_typeIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIhEE",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "_ZTINSt3__112__align_typeIhEE",
   "self_type" : "_ZTINSt3__112__align_typeIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIjEE",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "_ZTINSt3__112__align_typeIjEE",
   "self_type" : "_ZTINSt3__112__align_typeIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeImEE",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "_ZTINSt3__112__align_typeImEE",
   "self_type" : "_ZTINSt3__112__align_typeImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeItEE",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "_ZTINSt3__112__align_typeItEE",
   "self_type" : "_ZTINSt3__112__align_typeItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIyEE",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112__align_typeIyEE",
   "self_type" : "_ZTINSt3__112__align_typeIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__destruct_nE",
   "name" : "std::__destruct_n",
   "referenced_type" : "_ZTINSt3__112__destruct_nE",
   "self_type" : "_ZTINSt3__112__destruct_nE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__do_messageE",
   "name" : "std::__do_message",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112__do_messageE",
   "self_type" : "_ZTINSt3__112__do_messageE",
   "size" : 8,
   "source_file" : "external/libcxx/include/system_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112__do_messageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112__do_messageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112__do_messageD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__114error_category4nameEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category23default_error_conditionEi"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentEiRKNS_15error_conditionE"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentERKNS_10error_codeEi"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112__do_message7messageEi"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__rs_defaultE",
   "name" : "std::__rs_default",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112__rs_defaultE",
   "self_type" : "_ZTINSt3__112__rs_defaultE",
   "size" : 1,
   "source_file" : "external/libcxx/include/algorithm"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__second_tagE",
   "name" : "std::__second_tag",
   "referenced_type" : "_ZTINSt3__112__second_tagE",
   "self_type" : "_ZTINSt3__112__second_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRPvNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<void *&, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRPvNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRPvNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPv", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRjNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<unsigned int &, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRjNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRjNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRmNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<unsigned long &, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRmNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRmNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__tuple_lessILm0EEE",
   "name" : "std::__tuple_less<0>",
   "referenced_type" : "_ZTINSt3__112__tuple_lessILm0EEE",
   "self_type" : "_ZTINSt3__112__tuple_lessILm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__tuple_likeINS_4pairIPvmEEEE",
   "name" : "std::__tuple_like<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112__tuple_likeINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__112__tuple_likeINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__tuple_likeINS_4pairIjjEEEE",
   "name" : "std::__tuple_like<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__112__tuple_likeINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__112__tuple_likeINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__tuple_likeINS_4pairImmEEEE",
   "name" : "std::__tuple_like<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112__tuple_likeINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__112__tuple_likeINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "name" : "std::alignment_of<std::__struct_double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "self_type" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__115__struct_doubleE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "name" : "std::alignment_of<std::__struct_double4>",
   "referenced_type" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "self_type" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__116__struct_double4E" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIPiEE",
   "name" : "std::alignment_of<int *>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIPiEE",
   "self_type" : "_ZTINSt3__112alignment_ofIPiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIdEE",
   "name" : "std::alignment_of<double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIdEE",
   "self_type" : "_ZTINSt3__112alignment_ofIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIeEE",
   "name" : "std::alignment_of<long double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIeEE",
   "self_type" : "_ZTINSt3__112alignment_ofIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIhEE",
   "name" : "std::alignment_of<unsigned char>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIhEE",
   "self_type" : "_ZTINSt3__112alignment_ofIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm4EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIjEE",
   "name" : "std::alignment_of<unsigned int>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIjEE",
   "self_type" : "_ZTINSt3__112alignment_ofIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofImEE",
   "name" : "std::alignment_of<unsigned long>",
   "referenced_type" : "_ZTINSt3__112alignment_ofImEE",
   "self_type" : "_ZTINSt3__112alignment_ofImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofItEE",
   "name" : "std::alignment_of<unsigned short>",
   "referenced_type" : "_ZTINSt3__112alignment_ofItEE",
   "self_type" : "_ZTINSt3__112alignment_ofItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIyEE",
   "name" : "std::alignment_of<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIyEE",
   "self_type" : "_ZTINSt3__112alignment_ofIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112bad_weak_ptrE",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112bad_weak_ptrE",
   "self_type" : "_ZTINSt3__112bad_weak_ptrE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_m"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "name" : "std::basic_string<char>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "name" : "std::basic_string<char>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "name" : "std::basic_string<char>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "name" : "std::basic_string<char>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "name" : "std::basic_string<char>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA23_c"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "name" : "std::basic_string<char>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIc"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "name" : "std::basic_string<char>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "size" : 1,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string",
   "template_args" : [ "_ZTIc", "_ZTINSt3__111char_traitsIcEE", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_m"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "name" : "std::basic_string<wchar_t>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "name" : "std::basic_string<wchar_t>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "name" : "std::basic_string<wchar_t>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "name" : "std::basic_string<wchar_t>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPw"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "name" : "std::basic_string<wchar_t>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA5_w"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "name" : "std::basic_string<wchar_t>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIw"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "name" : "std::basic_string<wchar_t>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "size" : 4,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string",
   "template_args" : [ "_ZTIw", "_ZTINSt3__111char_traitsIwEE", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_4pairIPvmEEEE",
   "name" : "std::is_reference<const std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "name" : "std::is_reference<llvm::IntervalMapImpl::Path::Entry>",
   "referenced_type" : "_ZTINSt3__112is_referenceIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "self_type" : "_ZTINSt3__112is_referenceIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_4pairIPvmEEEE",
   "name" : "std::is_reference<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_4pairIjjEEEE",
   "name" : "std::is_reference<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_4pairImmEEEE",
   "name" : "std::is_reference<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIPvEE",
   "name" : "std::is_reference<void *>",
   "referenced_type" : "_ZTINSt3__112is_referenceIPvEE",
   "self_type" : "_ZTINSt3__112is_referenceIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIjEE",
   "name" : "std::is_reference<unsigned int>",
   "referenced_type" : "_ZTINSt3__112is_referenceIjEE",
   "self_type" : "_ZTINSt3__112is_referenceIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceImEE",
   "name" : "std::is_reference<unsigned long>",
   "referenced_type" : "_ZTINSt3__112is_referenceImEE",
   "self_type" : "_ZTINSt3__112is_referenceImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "name" : "std::placeholders::__ph<10>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "name" : "std::placeholders::__ph<1>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "name" : "std::placeholders::__ph<2>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "name" : "std::placeholders::__ph<3>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "name" : "std::placeholders::__ph<4>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "name" : "std::placeholders::__ph<5>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "name" : "std::placeholders::__ph<6>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "name" : "std::placeholders::__ph<7>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "name" : "std::placeholders::__ph<8>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "name" : "std::placeholders::__ph<9>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_4pairIPvmEEEE",
   "name" : "std::remove_const<const std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKPvEE",
   "name" : "std::remove_const<void *const>",
   "referenced_type" : "_ZTINSt3__112remove_constIKPvEE",
   "self_type" : "_ZTINSt3__112remove_constIKPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "name" : "std::remove_const<llvm::IntervalMapImpl::Path::Entry>",
   "referenced_type" : "_ZTINSt3__112remove_constIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "self_type" : "_ZTINSt3__112remove_constIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_4pairIPvmEEEE",
   "name" : "std::remove_const<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_4pairIjjEEEE",
   "name" : "std::remove_const<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_4pairImmEEEE",
   "name" : "std::remove_const<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOPvEE",
   "name" : "std::remove_const<void *&&>",
   "referenced_type" : "_ZTINSt3__112remove_constIOPvEE",
   "self_type" : "_ZTINSt3__112remove_constIOPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOjEE",
   "name" : "std::remove_const<unsigned int &&>",
   "referenced_type" : "_ZTINSt3__112remove_constIOjEE",
   "self_type" : "_ZTINSt3__112remove_constIOjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOmEE",
   "name" : "std::remove_const<unsigned long &&>",
   "referenced_type" : "_ZTINSt3__112remove_constIOmEE",
   "self_type" : "_ZTINSt3__112remove_constIOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIPvEE",
   "name" : "std::remove_const<void *>",
   "referenced_type" : "_ZTINSt3__112remove_constIPvEE",
   "self_type" : "_ZTINSt3__112remove_constIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKPvEE",
   "name" : "std::remove_const<void *const &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKPvEE",
   "self_type" : "_ZTINSt3__112remove_constIRKPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKjEE",
   "name" : "std::remove_const<const unsigned int &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKjEE",
   "self_type" : "_ZTINSt3__112remove_constIRKjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKmEE",
   "name" : "std::remove_const<const unsigned long &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKmEE",
   "self_type" : "_ZTINSt3__112remove_constIRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRPvEE",
   "name" : "std::remove_const<void *&>",
   "referenced_type" : "_ZTINSt3__112remove_constIRPvEE",
   "self_type" : "_ZTINSt3__112remove_constIRPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRjEE",
   "name" : "std::remove_const<unsigned int &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRjEE",
   "self_type" : "_ZTINSt3__112remove_constIRjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRmEE",
   "name" : "std::remove_const<unsigned long &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRmEE",
   "self_type" : "_ZTINSt3__112remove_constIRmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIcEE",
   "name" : "std::remove_const<char>",
   "referenced_type" : "_ZTINSt3__112remove_constIcEE",
   "self_type" : "_ZTINSt3__112remove_constIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIdEE",
   "name" : "std::remove_const<double>",
   "referenced_type" : "_ZTINSt3__112remove_constIdEE",
   "self_type" : "_ZTINSt3__112remove_constIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIjEE",
   "name" : "std::remove_const<unsigned int>",
   "referenced_type" : "_ZTINSt3__112remove_constIjEE",
   "self_type" : "_ZTINSt3__112remove_constIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIlEE",
   "name" : "std::remove_const<long>",
   "referenced_type" : "_ZTINSt3__112remove_constIlEE",
   "self_type" : "_ZTINSt3__112remove_constIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constImEE",
   "name" : "std::remove_const<unsigned long>",
   "referenced_type" : "_ZTINSt3__112remove_constImEE",
   "self_type" : "_ZTINSt3__112remove_constImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIwEE",
   "name" : "std::remove_const<wchar_t>",
   "referenced_type" : "_ZTINSt3__112remove_constIwEE",
   "self_type" : "_ZTINSt3__112remove_constIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt13runtime_error"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ec_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__110error_codeE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112system_errorE",
   "name" : "std::system_error",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112system_errorE",
   "self_type" : "_ZTINSt3__112system_errorE",
   "size" : 32,
   "source_file" : "external/libcxx/include/system_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112system_errorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112system_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112system_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "name" : "std::__make_signed<bool, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "name" : "std::__make_signed<int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "name" : "std::__make_signed<unsigned int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "name" : "std::__make_signed<long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedImLb1EEE",
   "name" : "std::__make_signed<unsigned long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedInLb1EEE",
   "name" : "std::__make_signed<__int128_t, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedInLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedInLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIoLb1EEE",
   "name" : "std::__make_signed<__uint128_t, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIoLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIoLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIo" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "name" : "std::__make_signed<short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedItLb1EEE",
   "name" : "std::__make_signed<unsigned short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "name" : "std::__make_signed<long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "name" : "std::__make_signed<unsigned long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashINS_6_PairTELm2EEE",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__16_PairTE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIdmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIdLm1EEE",
   "name" : "std::__scalar_hash<double, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIdLm1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIdLm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIemEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIeLm2EEE",
   "name" : "std::__scalar_hash<long double, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIeLm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIeLm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIfmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIfLm0EEE",
   "name" : "std::__scalar_hash<float, 0>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIfLm0EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIfLm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionInmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashInLm2EEE",
   "name" : "std::__scalar_hash<__int128, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashInLm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashInLm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIn" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIomEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIoLm2EEE",
   "name" : "std::__scalar_hash<unsigned __int128, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIoLm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIoLm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIo" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIxmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIxLm1EEE",
   "name" : "std::__scalar_hash<long long, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIxLm1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIxLm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIymEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIyLm1EEE",
   "name" : "std::__scalar_hash<unsigned long long, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIyLm1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIyLm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_equalILm0EEE",
   "name" : "std::__tuple_equal<0>",
   "referenced_type" : "_ZTINSt3__113__tuple_equalILm0EEE",
   "self_type" : "_ZTINSt3__113__tuple_equalILm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_typesIJEEE",
   "name" : "std::__tuple_types<>",
   "referenced_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "self_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIjEE",
   "name" : "std::is_arithmetic<unsigned int>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIjEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIlEE",
   "name" : "std::is_arithmetic<long>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIlEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticImEE",
   "name" : "std::is_arithmetic<unsigned long>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticImEE",
   "self_type" : "_ZTINSt3__113is_arithmeticImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRPvOS1_Lb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRPvOS1_EE",
   "name" : "std::is_assignable<void *&, void *&&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRPvOS1_EE",
   "self_type" : "_ZTINSt3__113is_assignableIRPvOS1_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPv", "_ZTIOPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRPvRKS1_Lb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRPvRKS1_EE",
   "name" : "std::is_assignable<void *&, void *const &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRPvRKS1_EE",
   "self_type" : "_ZTINSt3__113is_assignableIRPvRKS1_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPv", "_ZTIRKPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRjOjLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRjOjEE",
   "name" : "std::is_assignable<unsigned int &, unsigned int &&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRjOjEE",
   "self_type" : "_ZTINSt3__113is_assignableIRjOjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj", "_ZTIOj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRjRKjLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRjRKjEE",
   "name" : "std::is_assignable<unsigned int &, const unsigned int &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRjRKjEE",
   "self_type" : "_ZTINSt3__113is_assignableIRjRKjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj", "_ZTIRKj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRmOmLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRmOmEE",
   "name" : "std::is_assignable<unsigned long &, unsigned long &&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRmOmEE",
   "self_type" : "_ZTINSt3__113is_assignableIRmOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRmRKmLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRmRKmEE",
   "name" : "std::is_assignable<unsigned long &, const unsigned long &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRmRKmEE",
   "self_type" : "_ZTINSt3__113is_assignableIRmRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_4pairIPvmEEEE",
   "name" : "std::remove_extent<const std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_4pairIPvmEEEE",
   "name" : "std::remove_extent<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_4pairIjjEEEE",
   "name" : "std::remove_extent<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_4pairImmEEEE",
   "name" : "std::remove_extent<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIPvEE",
   "name" : "std::remove_extent<void *>",
   "referenced_type" : "_ZTINSt3__113remove_extentIPvEE",
   "self_type" : "_ZTINSt3__113remove_extentIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentImEE",
   "name" : "std::remove_extent<unsigned long>",
   "referenced_type" : "_ZTINSt3__113remove_extentImEE",
   "self_type" : "_ZTINSt3__113remove_extentImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__is_construct5__natE",
   "name" : "std::__is_construct::__nat",
   "referenced_type" : "_ZTINSt3__114__is_construct5__natE",
   "self_type" : "_ZTINSt3__114__is_construct5__natE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_4pairIPvmEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_4pairIPvmEEEE",
   "name" : "std::__is_nullptr_t<const std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implIN4llvm15IntervalMapImpl4Path5EntryEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "name" : "std::__is_nullptr_t<llvm::IntervalMapImpl::Path::Entry>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_4pairIPvmEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_4pairIPvmEEEE",
   "name" : "std::__is_nullptr_t<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_4pairIjjEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_4pairIjjEEEE",
   "name" : "std::__is_nullptr_t<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_4pairImmEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_4pairImmEEEE",
   "name" : "std::__is_nullptr_t<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implIPvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIPvEE",
   "name" : "std::__is_nullptr_t<void *>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIPvEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implIjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIjEE",
   "name" : "std::__is_nullptr_t<unsigned int>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIjEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implImEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tImEE",
   "name" : "std::__is_nullptr_t<unsigned long>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tImEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "name" : "std::__lazy_or_impl<false>",
   "referenced_type" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "self_type" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__numeric_typeIvEE",
   "name" : "std::__numeric_type<void>",
   "referenced_type" : "_ZTINSt3__114__numeric_typeIvEE",
   "self_type" : "_ZTINSt3__114__numeric_typeIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIcNS_9allocatorIcEEEE",
   "name" : "std::__pointer_type<char, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIcNS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIcNS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIc", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIwNS_9allocatorIwEEEE",
   "name" : "std::__pointer_type<wchar_t, std::allocator<wchar_t>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIwNS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIwNS_9allocatorIwEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIw", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm16ELm16EEE",
   "name" : "std::__select_align<24, 16, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm16ELm8EEE",
   "name" : "std::__select_align<24, 16, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm1ELm16EEE",
   "name" : "std::__select_align<24, 1, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm1ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm1ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm2ELm16EEE",
   "name" : "std::__select_align<24, 2, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm2ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm2ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm4ELm16EEE",
   "name" : "std::__select_align<24, 4, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm4ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm4ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm8ELm16EEE",
   "name" : "std::__select_align<24, 8, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm8ELm8EEE",
   "name" : "std::__select_align<24, 8, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm16ELm16EEE",
   "name" : "std::__select_align<32, 16, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm16ELm8EEE",
   "name" : "std::__select_align<32, 16, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm1ELm16EEE",
   "name" : "std::__select_align<32, 1, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm1ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm1ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm2ELm16EEE",
   "name" : "std::__select_align<32, 2, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm2ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm2ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm4ELm16EEE",
   "name" : "std::__select_align<32, 4, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm4ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm4ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm8ELm16EEE",
   "name" : "std::__select_align<32, 8, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm8ELm8EEE",
   "name" : "std::__select_align<32, 8, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__shared_owners_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__shared_countE",
   "name" : "std::__shared_count",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114__shared_countE",
   "self_type" : "_ZTINSt3__114__shared_countE",
   "size" : 16,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114__shared_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPcNS_9allocatorIcEELb0EEE",
   "name" : "std::__void_pointer<char *, std::allocator<char>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPcNS_9allocatorIcEELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPcNS_9allocatorIcEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPc", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPwNS_9allocatorIwEELb0EEE",
   "name" : "std::__void_pointer<wchar_t *, std::allocator<wchar_t>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPwNS_9allocatorIwEELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPwNS_9allocatorIwEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPw", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTINSt3__114error_categoryE",
   "name" : "std::error_category",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114error_categoryE",
   "self_type" : "_ZTINSt3__114error_categoryE",
   "size" : 8,
   "source_file" : "external/libcxx/include/system_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114error_categoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114error_categoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114error_categoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__114error_category4nameEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category23default_error_conditionEi"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentEiRKNS_15error_conditionE"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentERKNS_10error_codeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__114error_category7messageEi"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleINS_26random_access_iterator_tagENS_18input_iterator_tagEEE",
   "name" : "std::is_convertible<std::random_access_iterator_tag, std::input_iterator_tag>",
   "referenced_type" : "_ZTINSt3__114is_convertibleINS_26random_access_iterator_tagENS_18input_iterator_tagEEE",
   "self_type" : "_ZTINSt3__114is_convertibleINS_26random_access_iterator_tagENS_18input_iterator_tagEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__126random_access_iterator_tagE",
    "_ZTINSt3__118input_iterator_tagE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIPvS1_EE",
   "name" : "std::is_convertible<void *, void *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIPvS1_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIPvS1_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv", "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPvS1_EE",
   "name" : "std::is_convertible<void *const &, void *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPvS1_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPvS1_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPv", "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKjjEE",
   "name" : "std::is_convertible<const unsigned int &, unsigned int>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKjjEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKjjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKj", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKmmEE",
   "name" : "std::is_convertible<const unsigned long &, unsigned long>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKmmEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKmmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRjjEE",
   "name" : "std::is_convertible<unsigned int &, unsigned int>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRjjEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRjjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIijEE",
   "name" : "std::is_convertible<int, unsigned int>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIijEE",
   "self_type" : "_ZTINSt3__114is_convertibleIijEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIjjEE",
   "name" : "std::is_convertible<unsigned int, unsigned int>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIjjEE",
   "self_type" : "_ZTINSt3__114is_convertibleIjjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleImmEE",
   "name" : "std::is_convertible<unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114is_convertibleImmEE",
   "self_type" : "_ZTINSt3__114is_convertibleImmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIjLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIjEE",
   "name" : "std::numeric_limits<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114numeric_limitsIjEE",
   "self_type" : "_ZTINSt3__114numeric_limitsIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIlLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIlEE",
   "name" : "std::numeric_limits<long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114numeric_limitsIlEE",
   "self_type" : "_ZTINSt3__114numeric_limitsIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsImLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsImEE",
   "name" : "std::numeric_limits<unsigned long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114numeric_limitsImEE",
   "self_type" : "_ZTINSt3__114numeric_limitsImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__v_",
     "referenced_type" : "_ZTINSt3__114pointer_safety4__lxE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114pointer_safetyE",
   "name" : "std::pointer_safety",
   "referenced_type" : "_ZTINSt3__114pointer_safetyE",
   "self_type" : "_ZTINSt3__114pointer_safetyE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPcEE",
   "name" : "std::pointer_traits<char *>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPcEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPwEE",
   "name" : "std::pointer_traits<wchar_t *>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPwEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIDimEE",
   "name" : "std::unary_function<char32_t, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIDimEE",
   "self_type" : "_ZTINSt3__114unary_functionIDimEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDi", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIDsmEE",
   "name" : "std::unary_function<char16_t, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIDsmEE",
   "self_type" : "_ZTINSt3__114unary_functionIDsmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDs", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionINS_10error_codeEmEE",
   "name" : "std::unary_function<std::error_code, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionINS_10error_codeEmEE",
   "self_type" : "_ZTINSt3__114unary_functionINS_10error_codeEmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__110error_codeE", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionINS_15error_conditionEmEE",
   "name" : "std::unary_function<std::error_condition, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionINS_15error_conditionEmEE",
   "self_type" : "_ZTINSt3__114unary_functionINS_15error_conditionEmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__115error_conditionE", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE",
   "name" : "std::unary_function<std::_PairT, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE",
   "self_type" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__16_PairTE", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIamEE",
   "name" : "std::unary_function<signed char, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIamEE",
   "self_type" : "_ZTINSt3__114unary_functionIamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIa", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIbmEE",
   "name" : "std::unary_function<bool, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIbmEE",
   "self_type" : "_ZTINSt3__114unary_functionIbmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIb", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIcmEE",
   "name" : "std::unary_function<char, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIcmEE",
   "self_type" : "_ZTINSt3__114unary_functionIcmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIc", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIdmEE",
   "name" : "std::unary_function<double, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIdmEE",
   "self_type" : "_ZTINSt3__114unary_functionIdmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTId", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIemEE",
   "name" : "std::unary_function<long double, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIemEE",
   "self_type" : "_ZTINSt3__114unary_functionIemEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIe", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIfmEE",
   "name" : "std::unary_function<float, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIfmEE",
   "self_type" : "_ZTINSt3__114unary_functionIfmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIf", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIhmEE",
   "name" : "std::unary_function<unsigned char, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIhmEE",
   "self_type" : "_ZTINSt3__114unary_functionIhmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIh", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIimEE",
   "name" : "std::unary_function<int, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIimEE",
   "self_type" : "_ZTINSt3__114unary_functionIimEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIi", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIjmEE",
   "name" : "std::unary_function<unsigned int, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIjmEE",
   "self_type" : "_ZTINSt3__114unary_functionIjmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIj", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIlmEE",
   "name" : "std::unary_function<long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIlmEE",
   "self_type" : "_ZTINSt3__114unary_functionIlmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIl", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionImmEE",
   "name" : "std::unary_function<unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionImmEE",
   "self_type" : "_ZTINSt3__114unary_functionImmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionInmEE",
   "name" : "std::unary_function<__int128, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionInmEE",
   "self_type" : "_ZTINSt3__114unary_functionInmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIn", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIomEE",
   "name" : "std::unary_function<unsigned __int128, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIomEE",
   "self_type" : "_ZTINSt3__114unary_functionIomEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIo", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIsmEE",
   "name" : "std::unary_function<short, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIsmEE",
   "self_type" : "_ZTINSt3__114unary_functionIsmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIs", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionItmEE",
   "name" : "std::unary_function<unsigned short, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionItmEE",
   "self_type" : "_ZTINSt3__114unary_functionItmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIt", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIwmEE",
   "name" : "std::unary_function<wchar_t, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIwmEE",
   "self_type" : "_ZTINSt3__114unary_functionIwmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIw", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIxmEE",
   "name" : "std::unary_function<long long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIxmEE",
   "self_type" : "_ZTINSt3__114unary_functionIxmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIx", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIymEE",
   "name" : "std::unary_function<unsigned long long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIymEE",
   "self_type" : "_ZTINSt3__114unary_functionIymEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIy", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__const_pointerIcPcNS_9allocatorIcEELb1EEE",
   "name" : "std::__const_pointer<char, char *, std::allocator<char>, true>",
   "referenced_type" : "_ZTINSt3__115__const_pointerIcPcNS_9allocatorIcEELb1EEE",
   "self_type" : "_ZTINSt3__115__const_pointerIcPcNS_9allocatorIcEELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIc", "_ZTIPc", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__const_pointerIwPwNS_9allocatorIwEELb1EEE",
   "name" : "std::__const_pointer<wchar_t, wchar_t *, std::allocator<wchar_t>, true>",
   "referenced_type" : "_ZTINSt3__115__const_pointerIwPwNS_9allocatorIwEELb1EEE",
   "self_type" : "_ZTINSt3__115__const_pointerIwPwNS_9allocatorIwEELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIw", "_ZTIPw", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__has_size_typeINS_9allocatorIcEEvEE",
   "name" : "std::__has_size_type<std::allocator<char>, void>",
   "referenced_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIcEEvEE",
   "self_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIcEEvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__has_size_typeINS_9allocatorIwEEvEE",
   "name" : "std::__has_size_type<std::allocator<wchar_t>, void>",
   "referenced_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIwEEvEE",
   "self_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIwEEvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__lazy_and_implILb1EJEEE",
   "name" : "std::__lazy_and_impl<true>",
   "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJEEE",
   "self_type" : "_ZTINSt3__115__lazy_and_implILb1EJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIbLb1EEE",
   "name" : "std::__make_unsigned<bool, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIbLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIbLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIiLb1EEE",
   "name" : "std::__make_unsigned<int, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIiLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIjLb1EEE",
   "name" : "std::__make_unsigned<unsigned int, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIjLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIjLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIlLb1EEE",
   "name" : "std::__make_unsigned<long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIlLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIlLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedImLb1EEE",
   "name" : "std::__make_unsigned<unsigned long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedImLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedImLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedInLb1EEE",
   "name" : "std::__make_unsigned<__int128_t, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedInLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedInLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIoLb1EEE",
   "name" : "std::__make_unsigned<__uint128_t, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIoLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIoLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIo" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIsLb1EEE",
   "name" : "std::__make_unsigned<short, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIsLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIsLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedItLb1EEE",
   "name" : "std::__make_unsigned<unsigned short, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedItLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedItLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIxLb1EEE",
   "name" : "std::__make_unsigned<long long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIxLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIxLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIyLb1EEE",
   "name" : "std::__make_unsigned<unsigned long long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIyLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIyLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__struct_doubleE",
   "name" : "std::__struct_double",
   "referenced_type" : "_ZTINSt3__115__struct_doubleE",
   "self_type" : "_ZTINSt3__115__struct_doubleE",
   "size" : 16,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__tuple_indicesIJEEE",
   "name" : "std::__tuple_indices<>",
   "referenced_type" : "_ZTINSt3__115__tuple_indicesIJEEE",
   "self_type" : "_ZTINSt3__115__tuple_indicesIJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIA32_h"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE",
   "name" : "std::aligned_storage<24, 16>::type",
   "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE",
   "self_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE",
   "size" : 32,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115aligned_storageILm24ELm16EEE",
   "name" : "std::aligned_storage<24, 16>",
   "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EEE",
   "self_type" : "_ZTINSt3__115aligned_storageILm24ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIA32_h"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115aligned_storageILm32ELm16EE4typeE",
   "name" : "std::aligned_storage<32, 16>::type",
   "referenced_type" : "_ZTINSt3__115aligned_storageILm32ELm16EE4typeE",
   "self_type" : "_ZTINSt3__115aligned_storageILm32ELm16EE4typeE",
   "size" : 32,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115aligned_storageILm32ELm16EEE",
   "name" : "std::aligned_storage<32, 16>",
   "referenced_type" : "_ZTINSt3__115aligned_storageILm32ELm16EEE",
   "self_type" : "_ZTINSt3__115aligned_storageILm32ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115allocator_arg_tE",
   "name" : "std::allocator_arg_t",
   "referenced_type" : "_ZTINSt3__115allocator_arg_tE",
   "self_type" : "_ZTINSt3__115allocator_arg_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__functional_base"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__val_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "__cat_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKNSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115error_conditionE",
   "name" : "std::error_condition",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__115error_conditionE",
   "self_type" : "_ZTINSt3__115error_conditionE",
   "size" : 16,
   "source_file" : "external/libcxx/include/system_error"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115is_destructibleIvEE",
   "name" : "std::is_destructible<void>",
   "referenced_type" : "_ZTINSt3__115is_destructibleIvEE",
   "self_type" : "_ZTINSt3__115is_destructibleIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115iterator_traitsIPKPvEE",
   "name" : "std::iterator_traits<void *const *>",
   "referenced_type" : "_ZTINSt3__115iterator_traitsIPKPvEE",
   "self_type" : "_ZTINSt3__115iterator_traitsIPKPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPKPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115iterator_traitsIPN4llvm15IntervalMapImpl4Path5EntryEEE",
   "name" : "std::iterator_traits<llvm::IntervalMapImpl::Path::Entry *>",
   "referenced_type" : "_ZTINSt3__115iterator_traitsIPN4llvm15IntervalMapImpl4Path5EntryEEE",
   "self_type" : "_ZTINSt3__115iterator_traitsIPN4llvm15IntervalMapImpl4Path5EntryEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115iterator_traitsIPPvEE",
   "name" : "std::iterator_traits<void **>",
   "referenced_type" : "_ZTINSt3__115iterator_traitsIPPvEE",
   "self_type" : "_ZTINSt3__115iterator_traitsIPPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "name" : "std::remove_volatile<llvm::IntervalMapImpl::Path::Entry>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "self_type" : "_ZTINSt3__115remove_volatileIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileINS_4pairIPvmEEEE",
   "name" : "std::remove_volatile<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__115remove_volatileINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__115remove_volatileINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileINS_4pairIjjEEEE",
   "name" : "std::remove_volatile<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__115remove_volatileINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__115remove_volatileINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileINS_4pairImmEEEE",
   "name" : "std::remove_volatile<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__115remove_volatileINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__115remove_volatileINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIOPvEE",
   "name" : "std::remove_volatile<void *&&>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIOPvEE",
   "self_type" : "_ZTINSt3__115remove_volatileIOPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIOjEE",
   "name" : "std::remove_volatile<unsigned int &&>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIOjEE",
   "self_type" : "_ZTINSt3__115remove_volatileIOjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIOmEE",
   "name" : "std::remove_volatile<unsigned long &&>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIOmEE",
   "self_type" : "_ZTINSt3__115remove_volatileIOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIPvEE",
   "name" : "std::remove_volatile<void *>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIPvEE",
   "self_type" : "_ZTINSt3__115remove_volatileIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIRKPvEE",
   "name" : "std::remove_volatile<void *const &>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIRKPvEE",
   "self_type" : "_ZTINSt3__115remove_volatileIRKPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIRKjEE",
   "name" : "std::remove_volatile<const unsigned int &>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIRKjEE",
   "self_type" : "_ZTINSt3__115remove_volatileIRKjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIRKmEE",
   "name" : "std::remove_volatile<const unsigned long &>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIRKmEE",
   "self_type" : "_ZTINSt3__115remove_volatileIRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIRPvEE",
   "name" : "std::remove_volatile<void *&>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIRPvEE",
   "self_type" : "_ZTINSt3__115remove_volatileIRPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIRjEE",
   "name" : "std::remove_volatile<unsigned int &>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIRjEE",
   "self_type" : "_ZTINSt3__115remove_volatileIRjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIRmEE",
   "name" : "std::remove_volatile<unsigned long &>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIRmEE",
   "self_type" : "_ZTINSt3__115remove_volatileIRmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIcEE",
   "name" : "std::remove_volatile<char>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIcEE",
   "self_type" : "_ZTINSt3__115remove_volatileIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIdEE",
   "name" : "std::remove_volatile<double>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIdEE",
   "self_type" : "_ZTINSt3__115remove_volatileIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIjEE",
   "name" : "std::remove_volatile<unsigned int>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIjEE",
   "self_type" : "_ZTINSt3__115remove_volatileIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIlEE",
   "name" : "std::remove_volatile<long>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIlEE",
   "self_type" : "_ZTINSt3__115remove_volatileIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileImEE",
   "name" : "std::remove_volatile<unsigned long>",
   "referenced_type" : "_ZTINSt3__115remove_volatileImEE",
   "self_type" : "_ZTINSt3__115remove_volatileImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIwEE",
   "name" : "std::remove_volatile<wchar_t>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIwEE",
   "self_type" : "_ZTINSt3__115remove_volatileIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeINS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeINS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeINS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeINS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__111__type_listINS_12__align_typeIPiEENS_5__natEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__111__type_listINS_12__align_typeIPiEENS_5__natEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIhEENS0_INS1_ItEENS0_INS1_IjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIhEENS0_INS1_ItEENS0_INS1_IjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeItEENS0_INS1_IjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeItEENS0_INS1_IjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "name" : "std::__libcpp_is_void<llvm::IntervalMapImpl::Path::Entry>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIN4llvm15IntervalMapImpl4Path5EntryEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidINS_4pairIPvmEEEE",
   "name" : "std::__libcpp_is_void<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidINS_4pairIjjEEEE",
   "name" : "std::__libcpp_is_void<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidINS_4pairImmEEEE",
   "name" : "std::__libcpp_is_void<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIOPvEE",
   "name" : "std::__libcpp_is_void<void *&&>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIOPvEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIOPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIOjEE",
   "name" : "std::__libcpp_is_void<unsigned int &&>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIOjEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIOjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIOmEE",
   "name" : "std::__libcpp_is_void<unsigned long &&>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIOmEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIPvEE",
   "name" : "std::__libcpp_is_void<void *>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIPvEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIRKPvEE",
   "name" : "std::__libcpp_is_void<void *const &>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIRKPvEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIRKPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIRKjEE",
   "name" : "std::__libcpp_is_void<const unsigned int &>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIRKjEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIRKjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIRKmEE",
   "name" : "std::__libcpp_is_void<const unsigned long &>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIRKmEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIRPvEE",
   "name" : "std::__libcpp_is_void<void *&>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIRPvEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIRPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIRjEE",
   "name" : "std::__libcpp_is_void<unsigned int &>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIRjEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIRjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIRmEE",
   "name" : "std::__libcpp_is_void<unsigned long &>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIRmEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIRmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIcEE",
   "name" : "std::__libcpp_is_void<char>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIcEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIjEE",
   "name" : "std::__libcpp_is_void<unsigned int>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIjEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidImEE",
   "name" : "std::__libcpp_is_void<unsigned long>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidImEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIvEE",
   "name" : "std::__libcpp_is_void<void>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIvEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIwEE",
   "name" : "std::__libcpp_is_void<wchar_t>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIwEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIA4_d"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__struct_double4E",
   "name" : "std::__struct_double4",
   "referenced_type" : "_ZTINSt3__116__struct_double4E",
   "self_type" : "_ZTINSt3__116__struct_double4E",
   "size" : 32,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116allocator_traitsINS_9allocatorIcEEEE",
   "name" : "std::allocator_traits<std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__116allocator_traitsINS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__116allocator_traitsINS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116allocator_traitsINS_9allocatorIwEEEE",
   "name" : "std::allocator_traits<std::allocator<wchar_t>>",
   "referenced_type" : "_ZTINSt3__116allocator_traitsINS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__116allocator_traitsINS_9allocatorIwEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleIPvJRKS1_EEE",
   "name" : "std::is_constructible<void *, void *const &>",
   "referenced_type" : "_ZTINSt3__116is_constructibleIPvJRKS1_EEE",
   "self_type" : "_ZTINSt3__116is_constructibleIPvJRKS1_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleIPvJS1_EEE",
   "name" : "std::is_constructible<void *, void *>",
   "referenced_type" : "_ZTINSt3__116is_constructibleIPvJS1_EEE",
   "self_type" : "_ZTINSt3__116is_constructibleIPvJS1_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleIjJEEE",
   "name" : "std::is_constructible<unsigned int>",
   "referenced_type" : "_ZTINSt3__116is_constructibleIjJEEE",
   "self_type" : "_ZTINSt3__116is_constructibleIjJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleIjJRKjEEE",
   "name" : "std::is_constructible<unsigned int, const unsigned int &>",
   "referenced_type" : "_ZTINSt3__116is_constructibleIjJRKjEEE",
   "self_type" : "_ZTINSt3__116is_constructibleIjJRKjEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleIjJRjEEE",
   "name" : "std::is_constructible<unsigned int, unsigned int &>",
   "referenced_type" : "_ZTINSt3__116is_constructibleIjJRjEEE",
   "self_type" : "_ZTINSt3__116is_constructibleIjJRjEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleIjJiEEE",
   "name" : "std::is_constructible<unsigned int, int>",
   "referenced_type" : "_ZTINSt3__116is_constructibleIjJiEEE",
   "self_type" : "_ZTINSt3__116is_constructibleIjJiEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleIjJjEEE",
   "name" : "std::is_constructible<unsigned int, unsigned int>",
   "referenced_type" : "_ZTINSt3__116is_constructibleIjJjEEE",
   "self_type" : "_ZTINSt3__116is_constructibleIjJjEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleImJOmEEE",
   "name" : "std::is_constructible<unsigned long, unsigned long &&>",
   "referenced_type" : "_ZTINSt3__116is_constructibleImJOmEEE",
   "self_type" : "_ZTINSt3__116is_constructibleImJOmEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleImJRKmEEE",
   "name" : "std::is_constructible<unsigned long, const unsigned long &>",
   "referenced_type" : "_ZTINSt3__116is_constructibleImJRKmEEE",
   "self_type" : "_ZTINSt3__116is_constructibleImJRKmEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleImJmEEE",
   "name" : "std::is_constructible<unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__116is_constructibleImJmEEE",
   "self_type" : "_ZTINSt3__116is_constructibleImJmEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceIKNS_4pairIPvmEEEE",
   "name" : "std::remove_reference<const std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__116remove_referenceIKNS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__116remove_referenceIKNS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceINS_4pairIPvmEEEE",
   "name" : "std::remove_reference<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__116remove_referenceINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__116remove_referenceINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceINS_4pairIjjEEEE",
   "name" : "std::remove_reference<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__116remove_referenceINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__116remove_referenceINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceINS_4pairImmEEEE",
   "name" : "std::remove_reference<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__116remove_referenceINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__116remove_referenceINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceINS_9allocatorIcEEEE",
   "name" : "std::remove_reference<std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__116remove_referenceINS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__116remove_referenceINS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceINS_9allocatorIwEEEE",
   "name" : "std::remove_reference<std::allocator<wchar_t>>",
   "referenced_type" : "_ZTINSt3__116remove_referenceINS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__116remove_referenceINS_9allocatorIwEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceIPvEE",
   "name" : "std::remove_reference<void *>",
   "referenced_type" : "_ZTINSt3__116remove_referenceIPvEE",
   "self_type" : "_ZTINSt3__116remove_referenceIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceIRKNS_4pairIPvmEEEE",
   "name" : "std::remove_reference<const std::pair<void *, unsigned long> &>",
   "referenced_type" : "_ZTINSt3__116remove_referenceIRKNS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__116remove_referenceIRKNS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKNSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceIRN4llvm15IntervalMapImpl4Path5EntryEEE",
   "name" : "std::remove_reference<llvm::IntervalMapImpl::Path::Entry &>",
   "referenced_type" : "_ZTINSt3__116remove_referenceIRN4llvm15IntervalMapImpl4Path5EntryEEE",
   "self_type" : "_ZTINSt3__116remove_referenceIRN4llvm15IntervalMapImpl4Path5EntryEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRN4llvm15IntervalMapImpl4Path5EntryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceIRPvEE",
   "name" : "std::remove_reference<void *&>",
   "referenced_type" : "_ZTINSt3__116remove_referenceIRPvEE",
   "self_type" : "_ZTINSt3__116remove_referenceIRPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceIRjEE",
   "name" : "std::remove_reference<unsigned int &>",
   "referenced_type" : "_ZTINSt3__116remove_referenceIRjEE",
   "self_type" : "_ZTINSt3__116remove_referenceIRjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceIRmEE",
   "name" : "std::remove_reference<unsigned long &>",
   "referenced_type" : "_ZTINSt3__116remove_referenceIRmEE",
   "self_type" : "_ZTINSt3__116remove_referenceIRmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceIiEE",
   "name" : "std::remove_reference<int>",
   "referenced_type" : "_ZTINSt3__116remove_referenceIiEE",
   "self_type" : "_ZTINSt3__116remove_referenceIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceIjEE",
   "name" : "std::remove_reference<unsigned int>",
   "referenced_type" : "_ZTINSt3__116remove_referenceIjEE",
   "self_type" : "_ZTINSt3__116remove_referenceIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceImEE",
   "name" : "std::remove_reference<unsigned long>",
   "referenced_type" : "_ZTINSt3__116remove_referenceImEE",
   "self_type" : "_ZTINSt3__116remove_referenceImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117_DeallocateCallerE",
   "name" : "std::_DeallocateCaller",
   "referenced_type" : "_ZTINSt3__117_DeallocateCallerE",
   "self_type" : "_ZTINSt3__117_DeallocateCallerE",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
    },
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE",
   "name" : "std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE",
   "self_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE",
   "size" : 24,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
    "_ZTINSt3__19allocatorIcEE"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
    },
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repES5_EE",
   "name" : "std::__compressed_pair<std::basic_string<wchar_t>::__rep, std::allocator<wchar_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repES5_EE",
   "self_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repES5_EE",
   "size" : 24,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
    "_ZTINSt3__19allocatorIwEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117__is_always_equalINS_9allocatorIcEELb1EEE",
   "name" : "std::__is_always_equal<std::allocator<char>, true>",
   "referenced_type" : "_ZTINSt3__117__is_always_equalINS_9allocatorIcEELb1EEE",
   "self_type" : "_ZTINSt3__117__is_always_equalINS_9allocatorIcEELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117__is_always_equalINS_9allocatorIwEELb1EEE",
   "name" : "std::__is_always_equal<std::allocator<wchar_t>, true>",
   "referenced_type" : "_ZTINSt3__117__is_always_equalINS_9allocatorIwEELb1EEE",
   "self_type" : "_ZTINSt3__117__is_always_equalINS_9allocatorIwEELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117__libcpp_is_finalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repEEE",
   "name" : "std::__libcpp_is_final<std::basic_string<char>::__rep>",
   "referenced_type" : "_ZTINSt3__117__libcpp_is_finalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repEEE",
   "self_type" : "_ZTINSt3__117__libcpp_is_finalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117__libcpp_is_finalINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repEEE",
   "name" : "std::__libcpp_is_final<std::basic_string<wchar_t>::__rep>",
   "referenced_type" : "_ZTINSt3__117__libcpp_is_finalINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repEEE",
   "self_type" : "_ZTINSt3__117__libcpp_is_finalINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117__libcpp_is_finalINS_9allocatorIcEEEE",
   "name" : "std::__libcpp_is_final<std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__117__libcpp_is_finalINS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__117__libcpp_is_finalINS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117__libcpp_is_finalINS_9allocatorIwEEEE",
   "name" : "std::__libcpp_is_final<std::allocator<wchar_t>>",
   "referenced_type" : "_ZTINSt3__117__libcpp_is_finalINS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__117__libcpp_is_finalINS_9allocatorIwEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117bad_function_callE",
   "name" : "std::bad_function_call",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__117bad_function_callE",
   "self_type" : "_ZTINSt3__117bad_function_callE",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__117bad_function_callE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD0Ev"
    },
    {
