{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA12_i",
   "name" : "int [12]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA12_i",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA14_i",
   "name" : "int [14]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA14_i",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_c",
   "name" : "char [16]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA16_c",
   "size" : 16,

   "source_file" : "external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/Twine.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/Twine.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTIVNSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_mPKvE",
   "name" : "void *(*volatile)(void *, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvS_mPKvE",
   "self_type" : "_ZTIVPFPvS_mPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmPKvE",
   "name" : "void *(*volatile)(unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmPKvE",
   "self_type" : "_ZTIVPFPvmPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmmPKvE",
   "name" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmmPKvE",
   "self_type" : "_ZTIVPFPvmmPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA31_y"
    },
    {
     "field_name" : "sp",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIA4096_h"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 4384,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "esr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI11esr_context",
   "name" : "esr_context",
   "referenced_type" : "_ZTI11esr_context",
   "self_type" : "_ZTI11esr_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "vl",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA3_t"
    }
   ],
   "linker_set_key" : "_ZTI11sve_context",
   "name" : "sve_context",
   "referenced_type" : "_ZTI11sve_context",
   "self_type" : "_ZTI11sve_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12_aarch64_ctx",
   "name" : "_aarch64_ctx",
   "referenced_type" : "_ZTI12_aarch64_ctx",
   "self_type" : "_ZTI12_aarch64_ctx",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "datap",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI13extra_context",
   "name" : "extra_context",
   "referenced_type" : "_ZTI13extra_context",
   "self_type" : "_ZTI13extra_context",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vregs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA32_o"
    }
   ],
   "linker_set_key" : "_ZTI14fpsimd_context",
   "name" : "fpsimd_context",
   "referenced_type" : "_ZTI14fpsimd_context",
   "self_type" : "_ZTI14fpsimd_context",
   "size" : 528,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA12_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA14_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTIA31_m"
    },
    {
     "field_name" : "sp",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI16user_regs_struct",
   "name" : "user_regs_struct",
   "referenced_type" : "_ZTI16user_regs_struct",
   "self_type" : "_ZTI16user_regs_struct",
   "size" : 272,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA4_l"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "vregs",
     "referenced_type" : "_ZTIA32_o"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18user_fpsimd_struct",
   "name" : "user_fpsimd_struct",
   "referenced_type" : "_ZTI18user_fpsimd_struct",
   "self_type" : "_ZTI18user_fpsimd_struct",
   "size" : 528,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/select.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI8sigset_t",
   "name" : "sigset_t",
   "referenced_type" : "_ZTI8sigset_t",
   "self_type" : "_ZTI8sigset_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_offset" : 320,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI10sigcontext"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 4560,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI9imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "_ZTI9imaxdiv_t",
   "self_type" : "_ZTI9imaxdiv_t",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/inttypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt0_E",
   "self_type" : "_ZTIN10__sifieldsUt0_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt1_E",
   "self_type" : "_ZTIN10__sifieldsUt1_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt2_E",
   "self_type" : "_ZTIN10__sifieldsUt2_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_E",
   "self_type" : "_ZTIN10__sifieldsUt3_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt4_E",
   "self_type" : "_ZTIN10__sifieldsUt4_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt5_E",
   "self_type" : "_ZTIN10__sifieldsUt5_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h:79:22)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplINS_7SMFixItEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINS_7SMFixItELj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorINS_7SMFixItELj4EEE",
   "name" : "llvm::SmallVector<llvm::SMFixIt, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorINS_7SMFixItELj4EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorINS_7SMFixItELj4EEE",
   "size" : 184,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm7SMFixItE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "name" : "llvm::SmallVector<std::pair<void *, unsigned long>, 0>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIjjEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIjjEELj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorINSt3__14pairIjjEELj4EEE",
   "name" : "llvm::SmallVector<std::pair<unsigned int, unsigned int>, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIjjEELj4EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIjjEELj4EEE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPvEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "name" : "llvm::SmallVector<void *, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 200,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIcLj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIcLj0EEE",
   "name" : "llvm::SmallVector<char, 0>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIcLj0EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIcLj0EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "OutBufStart",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "OutBufEnd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "OutBufCur",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "BufferMode",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4llvm11raw_ostream10BufferKindE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11raw_ostreamE",
   "name" : "llvm::raw_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11raw_ostreamE",
   "self_type" : "_ZTIN4llvm11raw_ostreamE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm11raw_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm11raw_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm11raw_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm11raw_ostream10write_implEPKcm"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm11raw_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "BufferStart",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "BufferEnd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm12MemoryBufferE",
   "name" : "llvm::MemoryBuffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm12MemoryBufferE",
   "self_type" : "_ZTIN4llvm12MemoryBufferE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/MemoryBuffer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm12MemoryBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm12MemoryBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm12MemoryBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK4llvm12MemoryBuffer19getBufferIdentifierEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm12MemoryBuffer13getBufferKindEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "SM",
     "referenced_type" : "_ZTIPKN4llvm9SourceMgrE"
    },
    {
     "access" : "private",
     "field_name" : "Loc",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm5SMLocE"
    },
    {
     "access" : "private",
     "field_name" : "Filename",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "LineNo",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "ColumnNo",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "Kind",
     "field_offset" : 384,
     "referenced_type" : "_ZTIN4llvm9SourceMgr8DiagKindE"
    },
    {
     "access" : "private",
     "field_name" : "Message",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "LineContents",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "Ranges",
     "field_offset" : 832,
     "referenced_type" : "_ZTINSt3__16vectorINS_4pairIjjEENS_9allocatorIS2_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "FixIts",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIN4llvm11SmallVectorINS_7SMFixItELj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm12SMDiagnosticE",
   "name" : "llvm::SMDiagnostic",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm12SMDiagnosticE",
   "self_type" : "_ZTIN4llvm12SMDiagnosticE",
   "size" : 312,
   "source_file" : "external/llvm/include/llvm/Support/SourceMgr.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "name" : "llvm::AllocatorBase<llvm::MallocAllocator>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "self_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" : [ "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "name" : "llvm::AllocatorBase<llvm::BumpPtrAllocatorImpl<llvm::MallocAllocator, 4096, 4096>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "self_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" :
   [
    "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "TheTable",
     "referenced_type" : "_ZTIPPN4llvm18StringMapEntryBaseE"
    },
    {
     "access" : "protected",
     "field_name" : "NumBuckets",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumItems",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumTombstones",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "ItemSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm13StringMapImplE",
   "name" : "llvm::StringMapImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13StringMapImplE",
   "self_type" : "_ZTIN4llvm13StringMapImplE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm19raw_svector_ostreamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "OS",
     "field_offset" : 384,
     "referenced_type" : "_ZTIRN4llvm11raw_ostreamE"
    },
    {
     "access" : "private",
     "field_name" : "Buffer",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIcLj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14buffer_ostreamE",
   "name" : "llvm::buffer_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14buffer_ostreamE",
   "self_type" : "_ZTIN4llvm14buffer_ostreamE",
   "size" : 88,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm14buffer_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm14buffer_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm14buffer_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostream10write_implEPKcm"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm19raw_svector_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostream11pwrite_implEPKcmm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "name" : "llvm::iterator_range<const unsigned char *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIPKh" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm17raw_pwrite_streamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FD",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "ShouldClose",
     "field_offset" : 320,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "Error",
     "field_offset" : 328,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "pos",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "SupportsSeeking",
     "field_offset" : 448,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14raw_fd_ostreamE",
   "name" : "llvm::raw_fd_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14raw_fd_ostreamE",
   "self_type" : "_ZTIN4llvm14raw_fd_ostreamE",
   "size" : 64,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm14raw_fd_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostream11changeColorENS_11raw_ostream6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm14raw_fd_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm14raw_fd_ostream10has_colorsEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostream10write_implEPKcm"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm14raw_fd_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm14raw_fd_ostream21preferred_buffer_sizeEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostream11pwrite_implEPKcmm"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15MallocAllocatorE",
   "name" : "llvm::MallocAllocator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15MallocAllocatorE",
   "self_type" : "_ZTIN4llvm15MallocAllocatorE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Buffer",
     "referenced_type" : "_ZTIN4llvm9StringRefE"
    },
    {
     "access" : "private",
     "field_name" : "Identifier",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm9StringRefE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15MemoryBufferRefE",
   "name" : "llvm::MemoryBufferRef",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15MemoryBufferRefE",
   "self_type" : "_ZTIN4llvm15MemoryBufferRefE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/MemoryBuffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "BeginX",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "EndX",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "CapacityX",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorBaseE",
   "name" : "llvm::SmallVectorBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE",
   "self_type" : "_ZTIN4llvm15SmallVectorBaseE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_7SMFixItELb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplINS_7SMFixItEEE",
   "name" : "llvm::SmallVectorImpl<llvm::SMFixIt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplINS_7SMFixItEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplINS_7SMFixItEEE",
   "size" : 64,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm7SMFixItE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "name" : "llvm::SmallVectorImpl<std::pair<void *, unsigned long>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvmEEEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIjjEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIjjEEEE",
   "name" : "llvm::SmallVectorImpl<std::pair<unsigned int, unsigned int>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIjjEEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIjjEEEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "name" : "llvm::SmallVectorImpl<void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplIcEE",
   "name" : "llvm::SmallVectorImpl<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplIcEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplIcEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm1ELm1EEE",
   "name" : "llvm::AlignedCharArray<1, 1>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm1ELm1EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm1ELm1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA8_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm4ELm8EEE",
   "name" : "llvm::AlignedCharArray<4, 8>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm4ELm8EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm4ELm8EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "name" : "llvm::AlignedCharArray<8, 16>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA40_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm8ELm40EEE",
   "name" : "llvm::AlignedCharArray<8, 40>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm40EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm40EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA8_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "name" : "llvm::AlignedCharArray<8, 8>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm17raw_pwrite_streamE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16raw_null_ostreamE",
   "name" : "llvm::raw_null_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm16raw_null_ostreamE",
   "self_type" : "_ZTIN4llvm16raw_null_ostreamE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm16raw_null_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm16raw_null_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm16raw_null_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm16raw_null_ostream10write_implEPKcm"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm16raw_null_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm16raw_null_ostream11pwrite_implEPKcmm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm11raw_ostreamE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm17raw_pwrite_streamE",
   "name" : "llvm::raw_pwrite_stream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm17raw_pwrite_streamE",
   "self_type" : "_ZTIN4llvm17raw_pwrite_streamE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm17raw_pwrite_streamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm17raw_pwrite_streamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm17raw_pwrite_streamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm11raw_ostream10write_implEPKcm"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm11raw_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm17raw_pwrite_stream11pwrite_implEPKcmm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionINS_7SMFixItEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageINS_7SMFixItELj4EEE",
   "name" : "llvm::SmallVectorStorage<llvm::SMFixIt, 4>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINS_7SMFixItELj4EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageINS_7SMFixItELj4EEE",
   "size" : 120,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm7SMFixItE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "name" : "llvm::SmallVectorStorage<std::pair<void *, unsigned long>, 0>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvmEELj0EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionINSt3__14pairIjjEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIjjEELj4EEE",
   "name" : "llvm::SmallVectorStorage<std::pair<unsigned int, unsigned int>, 4>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIjjEELj4EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIjjEELj4EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "name" : "llvm::SmallVectorStorage<void *, 4>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIcLj0EEE",
   "name" : "llvm::SmallVectorStorage<char, 0>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIcLj0EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIcLj0EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "StrLen",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18StringMapEntryBaseE",
   "name" : "llvm::StringMapEntryBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm18StringMapEntryBaseE",
   "self_type" : "_ZTIN4llvm18StringMapEntryBaseE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm11raw_ostreamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "OS",
     "field_offset" : 320,
     "referenced_type" : "_ZTIRNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18raw_string_ostreamE",
   "name" : "llvm::raw_string_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm18raw_string_ostreamE",
   "self_type" : "_ZTIN4llvm18raw_string_ostreamE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm18raw_string_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm18raw_string_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm18raw_string_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm18raw_string_ostream10write_implEPKcm"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm18raw_string_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm17raw_pwrite_streamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "OS",
     "field_offset" : 320,
     "referenced_type" : "_ZTIRN4llvm15SmallVectorImplIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm19raw_svector_ostreamE",
   "name" : "llvm::raw_svector_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm19raw_svector_ostreamE",
   "self_type" : "_ZTIN4llvm19raw_svector_ostreamE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm19raw_svector_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostream10write_implEPKcm"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm19raw_svector_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostream11pwrite_implEPKcmm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "CurPtr",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "End",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "Slabs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE"
    },
    {
     "access" : "private",
     "field_name" : "CustomSizedSlabs",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvmEELj0EEE"
    },
    {
     "access" : "private",
     "field_name" : "BytesAllocated",
     "field_offset" : 960,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "Allocator",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIN4llvm15MallocAllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "name" : "llvm::BumpPtrAllocatorImpl<llvm::MallocAllocator, 4096, 4096>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "self_type" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELm4096ELm4096EEE",
   "size" : 136,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" : [ "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm40EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINS_7SMFixItEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<llvm::SMFixIt, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_7SMFixItEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_7SMFixItEcccccccccEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm7SMFixItE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__110error_codeEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<std::error_code, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__110error_codeEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__110error_codeEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__110error_codeE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>>, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm4ELm8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIjjEEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<std::pair<unsigned int, unsigned int>, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIjjEEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIjjEEcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIjjEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm8ELm8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<void *, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILm1ELm1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<char, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "name" : "llvm::PointerLikeTypeTraits<llvm::StringMapEntryBase *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIPN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "name" : "llvm::PointerLikeTypeTraits<void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "name" : "llvm::PointerLikeTypeTraits<uintptr_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsImEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "name" : "llvm::ScopedFatalErrorHandler",
   "referenced_type" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "self_type" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/ErrorHandling.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_7SMFixItEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_7SMFixItELb0EEE",
   "name" : "llvm::SmallVectorTemplateBase<llvm::SMFixIt, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_7SMFixItELb0EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINS_7SMFixItELb0EEE",
   "size" : 64,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm7SMFixItE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<std::pair<void *, unsigned long>, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvmEELb1EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIjjEEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIjjEELb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<std::pair<unsigned int, unsigned int>, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIjjEELb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIjjEELb1EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<void *, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<char, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINS_7SMFixItEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_7SMFixItEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<llvm::SMFixIt, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_7SMFixItEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINS_7SMFixItEvEE",
   "size" : 64,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIN4llvm7SMFixItE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvmEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<std::pair<void *, unsigned long>, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvmEEvEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIjjEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIjjEEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<std::pair<unsigned int, unsigned int>, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIjjEEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIjjEEvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIjjEE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "name" : "llvm::SmallVectorTemplateCommon<void *, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE",
   "name" : "llvm::SmallVectorTemplateCommon<char, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Address",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "Size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys11MemoryBlockE",
   "name" : "llvm::sys::MemoryBlock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys11MemoryBlockE",
   "self_type" : "_ZTIN4llvm3sys11MemoryBlockE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "M",
     "referenced_type" : "_ZTIN4llvm3sys11MemoryBlockE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "name" : "llvm::sys::OwningMemoryBlock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "self_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_18input_iterator_tagEKN4llvm9StringRefElPS4_RS4_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Path",
     "referenced_type" : "_ZTIN4llvm9StringRefE"
    },
    {
     "access" : "private",
     "field_name" : "Component",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm9StringRefE"
    },
    {
     "access" : "private",
     "field_name" : "Position",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys4path14const_iteratorE",
   "name" : "llvm::sys::path::const_iterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys4path14const_iteratorE",
   "self_type" : "_ZTIN4llvm3sys4path14const_iteratorE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/Path.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_18input_iterator_tagEKN4llvm9StringRefElPS4_RS4_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Path",
     "referenced_type" : "_ZTIN4llvm9StringRefE"
    },
    {
     "access" : "private",
     "field_name" : "Component",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm9StringRefE"
    },
    {
     "access" : "private",
     "field_name" : "Position",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys4path16reverse_iteratorE",
   "name" : "llvm::sys::path::reverse_iterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys4path16reverse_iteratorE",
   "self_type" : "_ZTIN4llvm3sys4path16reverse_iteratorE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/Path.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm3sys6MemoryE",
   "name" : "llvm::sys::Memory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys6MemoryE",
   "self_type" : "_ZTIN4llvm3sys6MemoryE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Ptr",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5SMLocE",
   "name" : "llvm::SMLoc",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm5SMLocE",
   "self_type" : "_ZTIN4llvm5SMLocE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/SMLoc.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "twine",
     "referenced_type" : "_ZTIPKN4llvm5TwineE"
    },
    {
     "field_name" : "cString",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "stdString",
     "referenced_type" : "_ZTIPKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "stringRef",
     "referenced_type" : "_ZTIPKN4llvm9StringRefE"
    },
    {
     "field_name" : "smallString",
     "referenced_type" : "_ZTIPKN4llvm15SmallVectorImplIcEE"
    },
    {
     "field_name" : "character",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "decUI",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "decI",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "decUL",
     "referenced_type" : "_ZTIPKm"
    },
    {
     "field_name" : "decL",
     "referenced_type" : "_ZTIPKl"
    },
    {
     "field_name" : "decULL",
     "referenced_type" : "_ZTIPKy"
    },
    {
     "field_name" : "decLL",
     "referenced_type" : "_ZTIPKx"
    },
    {
     "field_name" : "uHex",
     "referenced_type" : "_ZTIPKm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5Twine5ChildE",
   "name" : "llvm::Twine::Child",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm5Twine5ChildE",
   "self_type" : "_ZTIN4llvm5Twine5ChildE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/Twine.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "LHS",
     "referenced_type" : "_ZTIN4llvm5Twine5ChildE"
    },
    {
     "access" : "private",
     "field_name" : "RHS",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm5Twine5ChildE"
    },
    {
     "access" : "private",
     "field_name" : "LHSKind",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm5Twine8NodeKindE"
    },
    {
     "access" : "private",
     "field_name" : "RHSKind",
     "field_offset" : 136,
     "referenced_type" : "_ZTIN4llvm5Twine8NodeKindE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5TwineE",
   "name" : "llvm::Twine",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm5TwineE",
   "self_type" : "_ZTIN4llvm5TwineE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/Twine.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIN4llvm7SMFixItE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 320,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 328,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 336,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 344,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 352,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 360,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 368,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 376,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 384,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINS_7SMFixItEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<llvm::SMFixIt, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINS_7SMFixItEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINS_7SMFixItEcccccccccEE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm7SMFixItE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTINSt3__110error_codeE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 136,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 144,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 152,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 160,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 168,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 176,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 184,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINSt3__110error_codeEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<std::error_code, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__110error_codeEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__110error_codeEcccccccccEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__110error_codeE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTINSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 80,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 88,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 120,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS2_14default_deleteIS4_EEEEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS2_14default_deleteIS4_EEEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS2_14default_deleteIS4_EEEEcccccccccEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTINSt3__14pairIPvmEE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 136,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 144,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 152,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 160,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 168,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 176,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 184,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTINSt3__14pairIjjEE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 80,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 88,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 120,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIjjEEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<std::pair<unsigned int, unsigned int>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIjjEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIjjEEcccccccccEE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIjjEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 80,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 88,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 120,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 8,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 16,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 24,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 32,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 40,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 48,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 56,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE",
   "name" : "llvm::detail::AlignerImpl<char, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE",
   "size" : 10,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "name" : "llvm::detail::ConstantLog2<1>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILm1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILm2EEE",
   "name" : "llvm::detail::ConstantLog2<2>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILm2EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILm2EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILm4EEE",
   "name" : "llvm::detail::ConstantLog2<4>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILm4EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILm4EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINS_7SMFixItEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_7SMFixItEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<llvm::SMFixIt, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_7SMFixItEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINS_7SMFixItEcccccccccEELb0EEE",
   "size" : 64,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINS_7SMFixItEcccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__110error_codeEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__110error_codeEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<std::error_code, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__110error_codeEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__110error_codeEcccccccccEELb0EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__110error_codeEcccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS2_14default_deleteIS4_EEEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS3_14default_deleteIS5_EEEEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>>, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS3_14default_deleteIS5_EEEEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS3_14default_deleteIS5_EEEEcccccccccEELb0EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm6detail11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS2_14default_deleteIS4_EEEEcccccccccEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvmEEcccccccccEELb0EEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIjjEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIjjEEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<std::pair<unsigned int, unsigned int>, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIjjEEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIjjEEcccccccccEELb0EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIjjEEcccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIccccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<char, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIccccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIccccccccccEELb0EEE",
   "size" : 11,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIccccccccccEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm18StringMapEntryBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::StringMapEntryBase, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "name" : "llvm::detail::LeadingZerosCounter<unsigned int, 4>",
   "referenced_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "self_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLm4EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "name" : "llvm::detail::LeadingZerosCounter<unsigned long, 8>",
   "referenced_type" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "self_type" : "_ZTIN4llvm6detail19LeadingZerosCounterImLm8EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "name" : "llvm::detail::AlignmentCalcImplBase",
   "referenced_type" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "self_type" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE"
    },
    {
     "is_pure" : true,
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm6detail21AlignmentCalcImplBaseD1Ev"
    },
    {
     "is_pure" : true,
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm6detail21AlignmentCalcImplBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA40_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINS_7SMFixItEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<llvm::SMFixIt, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINS_7SMFixItEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINS_7SMFixItEcccccccccEE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm7SMFixItE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINSt3__110error_codeEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<std::error_code, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINSt3__110error_codeEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINSt3__110error_codeEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__110error_codeE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINSt3__110unique_ptrINS_12MemoryBufferENS2_14default_deleteIS4_EEEEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINSt3__110unique_ptrINS_12MemoryBufferENS2_14default_deleteIS4_EEEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINSt3__110unique_ptrINS_12MemoryBufferENS2_14default_deleteIS4_EEEEcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvmEEcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIjjEEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<std::pair<unsigned int, unsigned int>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIjjEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIjjEEcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIjjEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "name" : "llvm::detail::SizerImpl<void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplIccccccccccEE",
   "name" : "llvm::detail::SizerImpl<char, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplIccccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplIccccccccccEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "name" : "llvm::AlignOf<llvm::StringMapEntryBase>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_7SMFixItEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<llvm::SMFixIt, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_7SMFixItEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINS_7SMFixItEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINS_7SMFixItEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__110error_codeEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<std::error_code, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__110error_codeEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__110error_codeEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__110error_codeEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS3_14default_deleteIS5_EEEEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS3_14default_deleteIS5_EEEEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS3_14default_deleteIS5_EEEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIN4llvm6detail11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS2_14default_deleteIS4_EEEEcccccccccEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIjjEEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<std::pair<unsigned int, unsigned int>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIjjEEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIjjEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIjjEEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIccccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<char, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIccccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIccccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIccccccccccEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN4llvm7ErrorOrINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEEUt_E"
    },
    {
     "access" : "private",
     "field_name" : "HasError",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7ErrorOrINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEEE",
   "name" : "llvm::ErrorOr<std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm7ErrorOrINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEEE",
   "self_type" : "_ZTIN4llvm7ErrorOrINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/ErrorOr.h",
   "template_args" :
   [
    "_ZTINSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "TStorage",
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEcccccccccEE"
    },
    {
     "field_name" : "ErrorStorage",
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__110error_codeEcccccccccEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN4llvm7ErrorOrINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEEUt_E",
   "name" : "llvm::ErrorOr<unique_ptr<MemoryBuffer, default_delete<MemoryBuffer>>>::(anonymous union at external/llvm/include/llvm/Support/ErrorOr.h:271:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm7ErrorOrINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEEUt_E",
   "self_type" : "_ZTIN4llvm7ErrorOrINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEEUt_E",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/ErrorOr.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Range",
     "referenced_type" : "_ZTIN4llvm7SMRangeE"
    },
    {
     "access" : "private",
     "field_name" : "Text",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7SMFixItE",
   "name" : "llvm::SMFixIt",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm7SMFixItE",
   "self_type" : "_ZTIN4llvm7SMFixItE",
   "size" : 40,
   "source_file" : "external/llvm/include/llvm/Support/SourceMgr.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Start",
     "referenced_type" : "_ZTIN4llvm5SMLocE"
    },
    {
     "field_name" : "End",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm5SMLocE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7SMRangeE",
   "name" : "llvm::SMRange",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm7SMRangeE",
   "self_type" : "_ZTIN4llvm7SMRangeE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/SMLoc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "h0",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h4",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h5",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "h6",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "name" : "llvm::hashing::detail::hash_state",
   "referenced_type" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "self_type" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA64_c"
    },
    {
     "field_name" : "state",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN4llvm7hashing6detail10hash_stateE"
    },
    {
     "field_name" : "seed",
     "field_offset" : 960,
     "referenced_type" : "_ZTIKm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "name" : "llvm::hashing::detail::hash_combine_recursive_helper",
   "referenced_type" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "self_type" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "size" : 128,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKN4llvm7SMFixItE"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm8ArrayRefINS_7SMFixItEEE",
   "name" : "llvm::ArrayRef<llvm::SMFixIt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm8ArrayRefINS_7SMFixItEEE",
   "self_type" : "_ZTIN4llvm8ArrayRefINS_7SMFixItEEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/ArrayRef.h",
   "template_args" : [ "_ZTIN4llvm7SMFixItE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKN4llvm7SMRangeE"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm8ArrayRefINS_7SMRangeEEE",
   "name" : "llvm::ArrayRef<llvm::SMRange>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm8ArrayRefINS_7SMRangeEEE",
   "self_type" : "_ZTIN4llvm8ArrayRefINS_7SMRangeEEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/ArrayRef.h",
   "template_args" : [ "_ZTIN4llvm7SMRangeE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKNSt3__14pairIjjEE"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm8ArrayRefINSt3__14pairIjjEEEE",
   "name" : "llvm::ArrayRef<std::pair<unsigned int, unsigned int>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm8ArrayRefINSt3__14pairIjjEEEE",
   "self_type" : "_ZTIN4llvm8ArrayRefINSt3__14pairIjjEEEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/ArrayRef.h",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm8ArrayRefIcEE",
   "name" : "llvm::ArrayRef<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm8ArrayRefIcEE",
   "self_type" : "_ZTIN4llvm8ArrayRefIcEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/ArrayRef.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Buffer",
     "referenced_type" : "_ZTINSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE"
    },
    {
     "field_name" : "IncludeLoc",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm5SMLocE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9SourceMgr9SrcBufferE",
   "name" : "llvm::SourceMgr::SrcBuffer",
   "referenced_type" : "_ZTIN4llvm9SourceMgr9SrcBufferE",
   "self_type" : "_ZTIN4llvm9SourceMgr9SrcBufferE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/SourceMgr.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Buffers",
     "referenced_type" : "_ZTINSt3__16vectorIN4llvm9SourceMgr9SrcBufferENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "IncludeDirectories",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "LineNoCache",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "DiagHandler",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFvRKN4llvm12SMDiagnosticEPvE"
    },
    {
     "access" : "private",
     "field_name" : "DiagContext",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9SourceMgrE",
   "name" : "llvm::SourceMgr",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9SourceMgrE",
   "self_type" : "_ZTIN4llvm9SourceMgrE",
   "size" : 72,
   "source_file" : "external/llvm/include/llvm/Support/SourceMgr.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9StringRefE",
   "name" : "llvm::StringRef",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9StringRefE",
   "self_type" : "_ZTIN4llvm9StringRefE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9hash_codeE",
   "name" : "llvm::hash_code",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9hash_codeE",
   "self_type" : "_ZTIN4llvm9hash_codeE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINS_7SMFixItEEE",
   "name" : "llvm::isPodLike<llvm::SMFixIt>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINS_7SMFixItEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINS_7SMFixItEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIN4llvm7SMFixItE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "name" : "llvm::isPodLike<llvm::StringRef>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "name" : "llvm::isPodLike<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINSt3__14pairIjjEEEE",
   "name" : "llvm::isPodLike<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIjjEEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIPvEE",
   "name" : "llvm::isPodLike<void *>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIPvEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIPvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIcEE",
   "name" : "llvm::isPodLike<char>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIcEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIcEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIjEE",
   "name" : "llvm::isPodLike<unsigned int>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIjEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIjEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeImEE",
   "name" : "llvm::isPodLike<unsigned long>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeImEE",
   "self_type" : "_ZTIN4llvm9isPodLikeImEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA12_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:232:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h:117:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h:78:20)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__110__function16__policy_storageE",
   "self_type" : "_ZTINSt3__110__function16__policy_storageE",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "referenced_type" : "_ZTINSt3__110__function8__policyE",
   "self_type" : "_ZTINSt3__110__function8__policyE",
   "size" : 32,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm0EEE",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "_ZTINSt3__110__get_pairILm0EEE",
   "self_type" : "_ZTINSt3__110__get_pairILm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm1EEE",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "_ZTINSt3__110__get_pairILm1EEE",
   "self_type" : "_ZTINSt3__110__get_pairILm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "name" : "std::__identity<std::default_delete<llvm::MemoryBuffer>>",
   "referenced_type" : "_ZTINSt3__110__identityINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "self_type" : "_ZTINSt3__110__identityINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteIN4llvm12MemoryBufferEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "_ZTINSt3__110__ignore_tIhEE",
   "self_type" : "_ZTINSt3__110__ignore_tIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__val_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "__cat_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKNSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110error_codeE",
   "name" : "std::error_code",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110error_codeE",
   "self_type" : "_ZTINSt3__110error_codeE",
   "size" : 16,
   "source_file" : "external/libcxx/include/system_error"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteIN4llvm12MemoryBufferEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "name" : "std::is_pointer<std::default_delete<llvm::MemoryBuffer>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteIN4llvm12MemoryBufferEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "referenced_type" : "_ZTINSt3__110is_trivialIcEE",
   "self_type" : "_ZTINSt3__110is_trivialIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIwEE",
   "self_type" : "_ZTINSt3__110is_trivialIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairIN4llvm9StringRefES3_EEEE",
   "name" : "std::tuple_size<std::pair<llvm::StringRef, llvm::StringRef>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairIN4llvm9StringRefES3_EEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairIN4llvm9StringRefES3_EEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairIN4llvm9StringRefES2_EE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairIPvmEEEE",
   "name" : "std::tuple_size<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairIjjEEEE",
   "name" : "std::tuple_size<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairIjmEEEE",
   "name" : "std::tuple_size<std::pair<unsigned int, unsigned long>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairIjmEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairIjmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairIjmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairIllEEEE",
   "name" : "std::tuple_size<std::pair<long, long>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairIllEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairIllEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairIllEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "name" : "std::tuple_size<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE",
   "name" : "std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIN4llvm12MemoryBufferE",
    "_ZTINSt3__114default_deleteIN4llvm12MemoryBufferEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIN4llvm7SMFixItELb0EEE",
   "name" : "std::__add_const<llvm::SMFixIt, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIN4llvm7SMFixItELb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIN4llvm7SMFixItELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm7SMFixItE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIN4llvm9SourceMgr9SrcBufferELb0EEE",
   "name" : "std::__add_const<llvm::SourceMgr::SrcBuffer, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIN4llvm9SourceMgr9SrcBufferELb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIN4llvm9SourceMgr9SrcBufferELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm9SourceMgr9SrcBufferE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIN4llvm9StringRefELb0EEE",
   "name" : "std::__add_const<llvm::StringRef, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIN4llvm9StringRefELb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIN4llvm9StringRefELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELb0EEE",
   "name" : "std::__add_const<std::basic_string<char, std::char_traits<char>, std::allocator<char>>, false>",
   "referenced_type" : "_ZTINSt3__111__add_constINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELb0EEE",
   "self_type" : "_ZTINSt3__111__add_constINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_9allocatorIcEELb0EEE",
   "name" : "std::__add_const<std::allocator<char>, false>",
   "referenced_type" : "_ZTINSt3__111__add_constINS_9allocatorIcEELb0EEE",
   "self_type" : "_ZTINSt3__111__add_constINS_9allocatorIcEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIPvLb0EEE",
   "name" : "std::__add_const<void *, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIPvLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIPvLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIcLb0EEE",
   "name" : "std::__add_const<char, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIcLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIcLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIjLb0EEE",
   "name" : "std::__add_const<unsigned int, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIjLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIjLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIlLb0EEE",
   "name" : "std::__add_const<long, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIlLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIlLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constImLb0EEE",
   "name" : "std::__add_const<unsigned long, false>",
   "referenced_type" : "_ZTINSt3__111__add_constImLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constImLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIN4llvm7SMFixItEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<llvm::SMFixIt>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIN4llvm7SMFixItEEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIN4llvm7SMFixItEEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIN4llvm7SMFixItEEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIN4llvm7SMRangeEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<llvm::SMRange>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIN4llvm7SMRangeEEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIN4llvm7SMRangeEEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIN4llvm7SMRangeEEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<llvm::SourceMgr::SrcBuffer>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIN4llvm9SourceMgr9SrcBufferEEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS1_IcEEEEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS1_IcEEEEEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS1_IcEEEEEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorINS_12basic_stringIcNS_11char_traitsIcEENS0_IcEEEEEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorINS_4pairIjjEEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<std::pair<unsigned int, unsigned int>>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorINS_4pairIjjEEEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorINS_4pairIjjEEEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorINS_4pairIjjEEEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__type_list<__int128, std::__nat>>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__type_list<unsigned __int128, std::__nat>>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__i",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__wrap_iterIPKcEE",
   "name" : "std::__wrap_iter<const char *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__wrap_iterIPKcEE",
   "self_type" : "_ZTINSt3__111__wrap_iterIPKcEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__i",
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__wrap_iterIPcEE",
   "name" : "std::__wrap_iter<char *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__wrap_iterIPcEE",
   "self_type" : "_ZTINSt3__111__wrap_iterIPcEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIDnEE",
   "name" : "std::add_pointer<nullptr_t>",
   "referenced_type" : "_ZTINSt3__111add_pointerIDnEE",
   "self_type" : "_ZTINSt3__111add_pointerIDnEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKN4llvm9StringRefEEE",
   "name" : "std::add_pointer<const llvm::StringRef>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKN4llvm9StringRefEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKN4llvm9StringRefEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<llvm::MemoryBuffer *, std::default_delete<llvm::MemoryBuffer>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS4_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<llvm::SourceMgr::SrcBuffer *, std::allocator<llvm::SourceMgr::SrcBuffer>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS4_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS4_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS5_IS7_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS5_IS7_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS5_IS7_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPNS_4pairIjjEENS_9allocatorIS3_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<std::pair<unsigned int, unsigned int> *, std::allocator<std::pair<unsigned int, unsigned int>>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPNS_4pairIjjEENS_9allocatorIS3_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPNS_4pairIjjEENS_9allocatorIS3_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPNS_4pairIjjEENS_9allocatorIS2_EEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<llvm::MemoryBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS1_IcEEEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<std::pair<unsigned int, unsigned int>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<llvm::MemoryBuffer *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<llvm::SourceMgr::SrcBuffer *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::pair<unsigned int, unsigned int> *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer> &, 1, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_4pairIPvmEEEE",
   "name" : "std::add_pointer<const std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_4pairIjjEEEE",
   "name" : "std::add_pointer<const std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_9allocatorIcEEEE",
   "name" : "std::add_pointer<const std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIN4llvm9StringRefEEE",
   "name" : "std::add_pointer<llvm::StringRef>",
   "referenced_type" : "_ZTINSt3__111add_pointerIN4llvm9StringRefEEE",
   "self_type" : "_ZTINSt3__111add_pointerIN4llvm9StringRefEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "name" : "std::add_pointer<std::default_delete<llvm::MemoryBuffer>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteIN4llvm12MemoryBufferEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "name" : "std::add_pointer<std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<llvm::MemoryBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS1_IcEEEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<std::pair<unsigned int, unsigned int>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<llvm::MemoryBuffer *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<llvm::SourceMgr::SrcBuffer *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::pair<unsigned int, unsigned int> *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer> &, 1, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairIN4llvm9StringRefES3_EEEE",
   "name" : "std::add_pointer<std::pair<llvm::StringRef, llvm::StringRef>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_4pairIN4llvm9StringRefES3_EEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_4pairIN4llvm9StringRefES3_EEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIN4llvm9StringRefES2_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairIPvmEEEE",
   "name" : "std::add_pointer<std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairIjjEEEE",
   "name" : "std::add_pointer<std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairIjmEEEE",
   "name" : "std::add_pointer<std::pair<unsigned int, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_4pairIjmEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_4pairIjmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairIllEEEE",
   "name" : "std::add_pointer<std::pair<long, long>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_4pairIllEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_4pairIllEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIllEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "name" : "std::add_pointer<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEEEE",
   "name" : "std::add_pointer<std::allocator<llvm::SourceMgr::SrcBuffer>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__19allocatorIN4llvm9SourceMgr9SrcBufferEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_9allocatorINS_4pairIjjEEEEEE",
   "name" : "std::add_pointer<std::allocator<std::pair<unsigned int, unsigned int>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_9allocatorINS_4pairIjjEEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_9allocatorINS_4pairIjjEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__19allocatorINS_4pairIjjEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIPN4llvm12MemoryBufferEEE",
   "name" : "std::add_pointer<llvm::MemoryBuffer *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIPN4llvm12MemoryBufferEEE",
   "self_type" : "_ZTINSt3__111add_pointerIPN4llvm12MemoryBufferEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPN4llvm12MemoryBufferE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIPvEE",
   "name" : "std::add_pointer<void *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIPvEE",
   "self_type" : "_ZTINSt3__111add_pointerIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIjEE",
   "name" : "std::add_pointer<unsigned int>",
   "referenced_type" : "_ZTINSt3__111add_pointerIjEE",
   "self_type" : "_ZTINSt3__111add_pointerIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIlEE",
   "name" : "std::add_pointer<long>",
   "referenced_type" : "_ZTINSt3__111add_pointerIlEE",
   "self_type" : "_ZTINSt3__111add_pointerIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerImEE",
   "name" : "std::add_pointer<unsigned long>",
   "referenced_type" : "_ZTINSt3__111add_pointerImEE",
   "self_type" : "_ZTINSt3__111add_pointerImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDiEE",
   "name" : "std::char_traits<char32_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDiEE",
   "self_type" : "_ZTINSt3__111char_traitsIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDsEE",
   "name" : "std::char_traits<char16_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDsEE",
   "self_type" : "_ZTINSt3__111char_traitsIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIcEE",
   "name" : "std::char_traits<char>",
   "referenced_type" : "_ZTINSt3__111char_traitsIcEE",
   "self_type" : "_ZTINSt3__111char_traitsIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIwEE",
   "name" : "std::char_traits<wchar_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIwEE",
   "self_type" : "_ZTINSt3__111char_traitsIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EN4llvm16ReferenceStorageINS_10unique_ptrINS1_12MemoryBufferENS_14default_deleteIS4_EEEEEES7_EE",
   "name" : "std::conditional<false, llvm::ReferenceStorage<std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>>>, std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EN4llvm16ReferenceStorageINS_10unique_ptrINS1_12MemoryBufferENS_14default_deleteIS4_EEEEEES7_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EN4llvm16ReferenceStorageINS_10unique_ptrINS1_12MemoryBufferENS_14default_deleteIS4_EEEEEES7_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIN4llvm16ReferenceStorageINSt3__110unique_ptrINS_12MemoryBufferENS1_14default_deleteIS3_EEEEEE",
    "_ZTINSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "name" : "std::conditional<false, std::pointer_traits<const char *>::__nat, const char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPKcE5__natE", "_ZTIKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN4llvm7SMFixItEE5__natES3_EE",
   "name" : "std::conditional<false, std::pointer_traits<SMFixIt *>::__nat, llvm::SMFixIt>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN4llvm7SMFixItEE5__natES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN4llvm7SMFixItEE5__natES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPN4llvm7SMFixItEE5__natE",
    "_ZTIN4llvm7SMFixItE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN4llvm7SMRangeEE5__natES3_EE",
   "name" : "std::conditional<false, std::pointer_traits<SMRange *>::__nat, llvm::SMRange>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN4llvm7SMRangeEE5__natES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN4llvm7SMRangeEE5__natES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPN4llvm7SMRangeEE5__natE",
    "_ZTIN4llvm7SMRangeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN4llvm9SourceMgr9SrcBufferEE5__natES4_EE",
   "name" : "std::conditional<false, std::pointer_traits<SrcBuffer *>::__nat, llvm::SourceMgr::SrcBuffer>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN4llvm9SourceMgr9SrcBufferEE5__natES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN4llvm9SourceMgr9SrcBufferEE5__natES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPN4llvm9SourceMgr9SrcBufferEE5__natE",
    "_ZTIN4llvm9SourceMgr9SrcBufferE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE5__natES7_EE",
   "name" : "std::conditional<false, std::pointer_traits<basic_string<char> *>::__nat, std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE5__natES7_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE5__natES7_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE5__natE",
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPNS_4pairIjjEEE5__natES3_EE",
   "name" : "std::conditional<false, std::pointer_traits<pair<unsigned int, unsigned int> *>::__nat, std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPNS_4pairIjjEEE5__natES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPNS_4pairIjjEEE5__natES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPNS_4pairIjjEEE5__natE",
    "_ZTINSt3__14pairIjjEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "name" : "std::conditional<false, std::pointer_traits<char *>::__nat, char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPcE5__natE", "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "name" : "std::conditional<false, std::pointer_traits<wchar_t *>::__nat, wchar_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPwE5__natE", "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairIN4llvm9StringRefES3_E26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<StringRef, StringRef>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIN4llvm9StringRefES3_E26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIN4llvm9StringRefES3_E26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIN4llvm9StringRefES2_E26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairIPvmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<void *, unsigned long>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIPvmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIPvmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvmE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairIjjE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<unsigned int, unsigned int>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIjjE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIjjE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIjjE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairIjmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<unsigned int, unsigned long>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIjmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIjmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIjmE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairIllE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<long, long>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIllE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_4pairIllE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIllE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPDnDnEE",
   "name" : "std::conditional<false, nullptr_t *, nullptr_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPDnDnEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPDnDnEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPDn", "_ZTIDn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKN4llvm9StringRefES2_EE",
   "name" : "std::conditional<false, const llvm::StringRef *, llvm::StringRef>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKN4llvm9StringRefES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKN4llvm9StringRefES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKN4llvm9StringRefE", "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS3_EEEES7_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<llvm::MemoryBuffer *, std::default_delete<llvm::MemoryBuffer>> *, std::__compressed_pair<llvm::MemoryBuffer *, std::default_delete<llvm::MemoryBuffer>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS3_EEEES7_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS3_EEEES7_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE",
    "_ZTINSt3__117__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS4_EEEES8_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<llvm::SourceMgr::SrcBuffer *, std::allocator<llvm::SourceMgr::SrcBuffer>> *, std::__compressed_pair<llvm::SourceMgr::SrcBuffer *, std::allocator<llvm::SourceMgr::SrcBuffer>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS4_EEEES8_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS4_EEEES8_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS3_EEEE",
    "_ZTINSt3__117__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS5_IS7_EEEESA_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>> *, std::__compressed_pair<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS5_IS7_EEEESA_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS5_IS7_EEEESA_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE",
    "_ZTINSt3__117__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPNS_4pairIjjEENS_9allocatorIS3_EEEES7_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<std::pair<unsigned int, unsigned int> *, std::allocator<std::pair<unsigned int, unsigned int>>> *, std::__compressed_pair<std::pair<unsigned int, unsigned int> *, std::allocator<std::pair<unsigned int, unsigned int>>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPNS_4pairIjjEENS_9allocatorIS3_EEEES7_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPNS_4pairIjjEENS_9allocatorIS3_EEEES7_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPNS_4pairIjjEENS_9allocatorIS2_EEEE",
    "_ZTINSt3__117__compressed_pairIPNS_4pairIjjEENS_9allocatorIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<llvm::MemoryBuffer>, 1, true> *, std::__compressed_pair_elem<std::default_delete<llvm::MemoryBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEES7_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer>, 1, true> *, std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEES7_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEES7_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, 1, true> *, std::__compressed_pair_elem<std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS1_IcEEEEEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS1_IcEEEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<std::pair<unsigned int, unsigned int>>, 1, true> *, std::__compressed_pair_elem<std::allocator<std::pair<unsigned int, unsigned int>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<llvm::MemoryBuffer *, 0, false> *, std::__compressed_pair_elem<llvm::MemoryBuffer *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<llvm::SourceMgr::SrcBuffer *, 0, false> *, std::__compressed_pair_elem<llvm::SourceMgr::SrcBuffer *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, 0, false> *, std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::pair<unsigned int, unsigned int> *, 0, false> *, std::__compressed_pair_elem<std::pair<unsigned int, unsigned int> *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEES8_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer> &, 1, false> *, std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer> &, 1, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEES8_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEES8_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_4pairIPvmEES3_EE",
   "name" : "std::conditional<false, const std::pair<void *, unsigned long> *, std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_4pairIPvmEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_4pairIPvmEES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKNSt3__14pairIPvmEE", "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_4pairIjjEES2_EE",
   "name" : "std::conditional<false, const std::pair<unsigned int, unsigned int> *, std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_4pairIjjEES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_4pairIjjEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKNSt3__14pairIjjEE", "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_9allocatorIcEES2_EE",
   "name" : "std::conditional<false, const std::allocator<char> *, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_9allocatorIcEES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_9allocatorIcEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKNSt3__19allocatorIcEE", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPN4llvm9StringRefES2_EE",
   "name" : "std::conditional<false, llvm::StringRef *, llvm::StringRef>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPN4llvm9StringRefES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPN4llvm9StringRefES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPN4llvm9StringRefE", "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteIN4llvm12MemoryBufferEEES4_EE",
   "name" : "std::conditional<false, std::default_delete<llvm::MemoryBuffer> *, std::default_delete<llvm::MemoryBuffer>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteIN4llvm12MemoryBufferEEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteIN4llvm12MemoryBufferEEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__114default_deleteIN4llvm12MemoryBufferEEE",
    "_ZTINSt3__114default_deleteIN4llvm12MemoryBufferEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char>> *, std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE",
    "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEES6_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<llvm::MemoryBuffer>, 1, true> *, std::__compressed_pair_elem<std::default_delete<llvm::MemoryBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEES7_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer>, 1, true> *, std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEES7_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEES7_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, 1, true> *, std::__compressed_pair_elem<std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS1_IcEEEEEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS1_IcEEEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEES6_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<std::pair<unsigned int, unsigned int>>, 1, true> *, std::__compressed_pair_elem<std::allocator<std::pair<unsigned int, unsigned int>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<llvm::MemoryBuffer *, 0, false> *, std::__compressed_pair_elem<llvm::MemoryBuffer *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEES6_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<llvm::SourceMgr::SrcBuffer *, 0, false> *, std::__compressed_pair_elem<llvm::SourceMgr::SrcBuffer *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, 0, false> *, std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::pair<unsigned int, unsigned int> *, 0, false> *, std::__compressed_pair_elem<std::pair<unsigned int, unsigned int> *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEES8_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer> &, 1, false> *, std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer> &, 1, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEES8_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEES8_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairIN4llvm9StringRefES3_EES4_EE",
   "name" : "std::conditional<false, std::pair<llvm::StringRef, llvm::StringRef> *, std::pair<llvm::StringRef, llvm::StringRef>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIN4llvm9StringRefES3_EES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIN4llvm9StringRefES3_EES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__14pairIN4llvm9StringRefES2_EE",
    "_ZTINSt3__14pairIN4llvm9StringRefES2_EE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairIPvmEES3_EE",
   "name" : "std::conditional<false, std::pair<void *, unsigned long> *, std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIPvmEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIPvmEES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPNSt3__14pairIPvmEE", "_ZTINSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairIjjEES2_EE",
   "name" : "std::conditional<false, std::pair<unsigned int, unsigned int> *, std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIjjEES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIjjEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPNSt3__14pairIjjEE", "_ZTINSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairIjmEES2_EE",
   "name" : "std::conditional<false, std::pair<unsigned int, unsigned long> *, std::pair<unsigned int, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIjmEES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIjmEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPNSt3__14pairIjmEE", "_ZTINSt3__14pairIjmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairIllEES2_EE",
   "name" : "std::conditional<false, std::pair<long, long> *, std::pair<long, long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIllEES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairIllEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPNSt3__14pairIllEE", "_ZTINSt3__14pairIllEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long> *, std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPNSt3__14pairImmEE", "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEES5_EE",
   "name" : "std::conditional<false, std::allocator<llvm::SourceMgr::SrcBuffer> *, std::allocator<llvm::SourceMgr::SrcBuffer>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__19allocatorIN4llvm9SourceMgr9SrcBufferEEE",
    "_ZTINSt3__19allocatorIN4llvm9SourceMgr9SrcBufferEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_9allocatorINS_4pairIjjEEEES4_EE",
   "name" : "std::conditional<false, std::allocator<std::pair<unsigned int, unsigned int>> *, std::allocator<std::pair<unsigned int, unsigned int>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_9allocatorINS_4pairIjjEEEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_9allocatorINS_4pairIjjEEEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__19allocatorINS_4pairIjjEEEE",
    "_ZTINSt3__19allocatorINS_4pairIjjEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPPN4llvm12MemoryBufferES3_EE",
   "name" : "std::conditional<false, llvm::MemoryBuffer **, llvm::MemoryBuffer *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPPN4llvm12MemoryBufferES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPPN4llvm12MemoryBufferES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPPN4llvm12MemoryBufferE", "_ZTIPN4llvm12MemoryBufferE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPPvS1_EE",
   "name" : "std::conditional<false, void **, void *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPPvS1_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPPvS1_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPPv", "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPjjEE",
   "name" : "std::conditional<false, unsigned int *, unsigned int>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPjjEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPjjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPj", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPllEE",
   "name" : "std::conditional<false, long *, long>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPllEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPllEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPl", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPmmEE",
   "name" : "std::conditional<false, unsigned long *, unsigned long>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPmmEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPmmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ERKN4llvm9SourceMgr9SrcBufferEOS3_EE",
   "name" : "std::conditional<false, const llvm::SourceMgr::SrcBuffer &, llvm::SourceMgr::SrcBuffer &&>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ERKN4llvm9SourceMgr9SrcBufferEOS3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ERKN4llvm9SourceMgr9SrcBufferEOS3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKN4llvm9SourceMgr9SrcBufferE",
    "_ZTION4llvm9SourceMgr9SrcBufferE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIN4llvm9StringRefES3_E10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::pair<StringRef, StringRef>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIN4llvm9StringRefES3_E10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIN4llvm9StringRefES3_E10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIN4llvm9StringRefES2_E10_CheckArgsE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIN4llvm9StringRefES3_EENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<llvm::StringRef, llvm::StringRef>, std::__nat>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIN4llvm9StringRefES3_EENS_5__natEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIN4llvm9StringRefES3_EENS_5__natEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIN4llvm9StringRefES2_EE", "_ZTINSt3__15__natE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIPvmEENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<void *, unsigned long>, std::__nat>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIPvmEENS_5__natEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIPvmEENS_5__natEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIPvmEE", "_ZTINSt3__15__natE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::pair<unsigned int, unsigned int>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIjjE10_CheckArgsE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::pair<unsigned int, unsigned int>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIjjE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjEENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<unsigned int, unsigned int>, std::__nat>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjEENS_5__natEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjjEENS_5__natEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjjEE", "_ZTINSt3__15__natE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIjmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::pair<unsigned int, unsigned long>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIjmE10_CheckArgsE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIjmEENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<unsigned int, unsigned long>, std::__nat>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjmEENS_5__natEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIjmEENS_5__natEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIjmEE", "_ZTINSt3__15__natE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIllE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::pair<long, long>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIllE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIllE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairIllE10_CheckArgsE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairIllEENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<long, long>, std::__nat>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIllEENS_5__natEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairIllEENS_5__natEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairIllEE", "_ZTINSt3__15__natE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmE10_CheckArgsE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>, std::__nat>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE", "_ZTINSt3__15__natE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1EON4llvm7SMFixItERS2_EE",
   "name" : "std::conditional<true, llvm::SMFixIt &&, llvm::SMFixIt &>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1EON4llvm7SMFixItERS2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb1EON4llvm7SMFixItERS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTION4llvm7SMFixItE", "_ZTIRN4llvm7SMFixItE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm18StringMapEntryBaseEEE",
   "name" : "std::is_abstract<llvm::StringMapEntryBase>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm18StringMapEntryBaseEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm18StringMapEntryBaseEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS1_7SMFixItEcccccccccEEEE",
   "name" : "std::is_abstract<llvm::detail::AlignerImpl<llvm::SMFixIt, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS1_7SMFixItEcccccccccEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS1_7SMFixItEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINS_7SMFixItEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_10error_codeEcccccccccEEEE",
   "name" : "std::is_abstract<llvm::detail::AlignerImpl<std::error_code, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_10error_codeEcccccccccEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_10error_codeEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__110error_codeEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_10unique_ptrINS1_12MemoryBufferENS_14default_deleteIS5_EEEEcccccccccEEEE",
   "name" : "std::is_abstract<llvm::detail::AlignerImpl<std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_10unique_ptrINS1_12MemoryBufferENS_14default_deleteIS5_EEEEcccccccccEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_10unique_ptrINS1_12MemoryBufferENS_14default_deleteIS5_EEEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIN4llvm6detail11AlignerImplINSt3__110unique_ptrINS_12MemoryBufferENS2_14default_deleteIS4_EEEEcccccccccEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_4pairIPvmEEcccccccccEEEE",
   "name" : "std::is_abstract<llvm::detail::AlignerImpl<std::pair<void *, unsigned long>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_4pairIPvmEEcccccccccEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_4pairIPvmEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvmEEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_4pairIjjEEcccccccccEEEE",
   "name" : "std::is_abstract<llvm::detail::AlignerImpl<std::pair<unsigned int, unsigned int>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_4pairIjjEEcccccccccEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplINS_4pairIjjEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIjjEEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplIPvcccccccccEEEE",
   "name" : "std::is_abstract<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplIPvcccccccccEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplIPvcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplIccccccccccEEEE",
   "name" : "std::is_abstract<llvm::detail::AlignerImpl<char, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplIccccccccccEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm6detail11AlignerImplIccccccccccEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIccccccccccEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIN4llvm9StringRefEEE",
   "name" : "std::is_abstract<llvm::StringRef>",
   "referenced_type" : "_ZTINSt3__111is_abstractIN4llvm9StringRefEEE",
   "self_type" : "_ZTINSt3__111is_abstractIN4llvm9StringRefEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_10unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "name" : "std::is_abstract<std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_10unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_10unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "name" : "std::is_abstract<std::default_delete<llvm::MemoryBuffer>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteIN4llvm12MemoryBufferEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char, std::char_traits<char>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_18input_iterator_tagEEE",
   "name" : "std::is_abstract<std::input_iterator_tag>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_18input_iterator_tagEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_18input_iterator_tagEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__118input_iterator_tagE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_20forward_iterator_tagEEE",
   "name" : "std::is_abstract<std::forward_iterator_tag>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_20forward_iterator_tagEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_20forward_iterator_tagEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__120forward_iterator_tagE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_26bidirectional_iterator_tagEEE",
   "name" : "std::is_abstract<std::bidirectional_iterator_tag>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_26bidirectional_iterator_tagEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_26bidirectional_iterator_tagEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__126bidirectional_iterator_tagE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKcEE",
   "name" : "std::is_abstract<const char *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPN4llvm12MemoryBufferEEE",
   "name" : "std::is_abstract<llvm::MemoryBuffer *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPN4llvm12MemoryBufferEEE",
   "self_type" : "_ZTINSt3__111is_abstractIPN4llvm12MemoryBufferEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPN4llvm12MemoryBufferE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPcEE",
   "name" : "std::is_abstract<char *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPcEE",
   "self_type" : "_ZTINSt3__111is_abstractIPcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPvEE",
   "name" : "std::is_abstract<void *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPvEE",
   "self_type" : "_ZTINSt3__111is_abstractIPvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIRKNS_10unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "name" : "std::is_abstract<const std::unique_ptr<llvm::MemoryBuffer, std::default_delete<llvm::MemoryBuffer>> &>",
   "referenced_type" : "_ZTINSt3__111is_abstractIRKNS_10unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractIRKNS_10unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKNSt3__110unique_ptrIN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIjEE",
   "name" : "std::is_abstract<unsigned int>",
   "referenced_type" : "_ZTINSt3__111is_abstractIjEE",
   "self_type" : "_ZTINSt3__111is_abstractIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIlEE",
   "name" : "std::is_abstract<long>",
   "referenced_type" : "_ZTINSt3__111is_abstractIlEE",
   "self_type" : "_ZTINSt3__111is_abstractIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractImEE",
   "name" : "std::is_abstract<unsigned long>",
   "referenced_type" : "_ZTINSt3__111is_abstractImEE",
   "self_type" : "_ZTINSt3__111is_abstractImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIDnLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIDnEE",
   "name" : "std::is_function<nullptr_t>",
   "referenced_type" : "_ZTINSt3__111is_functionIDnEE",
   "self_type" : "_ZTINSt3__111is_functionIDnEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDn" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKN4llvm9StringRefELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKN4llvm9StringRefEEE",
   "name" : "std::is_function<const llvm::StringRef>",
   "referenced_type" : "_ZTINSt3__111is_functionIKN4llvm9StringRefEEE",
   "self_type" : "_ZTINSt3__111is_functionIKN4llvm9StringRefEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS3_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<llvm::MemoryBuffer *, std::default_delete<llvm::MemoryBuffer>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS3_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPN4llvm12MemoryBufferENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS4_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS4_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<llvm::SourceMgr::SrcBuffer *, std::allocator<llvm::SourceMgr::SrcBuffer>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS4_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS4_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPN4llvm9SourceMgr9SrcBufferENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS5_IS7_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS5_IS7_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS5_IS7_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS5_IS7_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIPNS_4pairIjjEENS_9allocatorIS3_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPNS_4pairIjjEENS_9allocatorIS3_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<std::pair<unsigned int, unsigned int> *, std::allocator<std::pair<unsigned int, unsigned int>>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPNS_4pairIjjEENS_9allocatorIS3_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPNS_4pairIjjEENS_9allocatorIS3_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPNS_4pairIjjEENS_9allocatorIS2_EEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::default_delete<llvm::MemoryBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS1_IcEEEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<std::pair<unsigned int, unsigned int>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<llvm::MemoryBuffer *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<llvm::SourceMgr::SrcBuffer *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPN4llvm9SourceMgr9SrcBufferELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::pair<unsigned int, unsigned int> *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPNS_4pairIjjEELi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer> &, 1, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIRNS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_4pairIPvmEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_4pairIPvmEEEE",
   "name" : "std::is_function<const std::pair<void *, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_4pairIPvmEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_4pairIPvmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__14pairIPvmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_4pairIjjEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_4pairIjjEEEE",
   "name" : "std::is_function<const std::pair<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_4pairIjjEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_4pairIjjEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__14pairIjjEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_9allocatorIcEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_9allocatorIcEEEE",
   "name" : "std::is_function<const std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIN4llvm12MemoryBufferELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIN4llvm12MemoryBufferEEE",
   "name" : "std::is_function<llvm::MemoryBuffer>",
   "referenced_type" : "_ZTINSt3__111is_functionIN4llvm12MemoryBufferEEE",
   "self_type" : "_ZTINSt3__111is_functionIN4llvm12MemoryBufferEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm12MemoryBufferE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIN4llvm7SMFixItELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIN4llvm7SMFixItEEE",
   "name" : "std::is_function<llvm::SMFixIt>",
   "referenced_type" : "_ZTINSt3__111is_functionIN4llvm7SMFixItEEE",
   "self_type" : "_ZTINSt3__111is_functionIN4llvm7SMFixItEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm7SMFixItE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIN4llvm9SourceMgr9SrcBufferELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIN4llvm9SourceMgr9SrcBufferEEE",
   "name" : "std::is_function<llvm::SourceMgr::SrcBuffer>",
   "referenced_type" : "_ZTINSt3__111is_functionIN4llvm9SourceMgr9SrcBufferEEE",
   "self_type" : "_ZTINSt3__111is_functionIN4llvm9SourceMgr9SrcBufferEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm9SourceMgr9SrcBufferE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIN4llvm9StringRefELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIN4llvm9StringRefEEE",
   "name" : "std::is_function<llvm::StringRef>",
   "referenced_type" : "_ZTINSt3__111is_functionIN4llvm9StringRefEEE",
   "self_type" : "_ZTINSt3__111is_functionIN4llvm9StringRefEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::is_function<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_14default_deleteIN4llvm12MemoryBufferEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "name" : "std::is_function<std::default_delete<llvm::MemoryBuffer>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_14default_deleteIN4llvm12MemoryBufferEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteIN4llvm12MemoryBufferEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "name" : "std::is_function<std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::default_delete<llvm::MemoryBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIN4llvm12MemoryBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<llvm::SourceMgr::SrcBuffer>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIN4llvm9SourceMgr9SrcBufferEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS2_IcEEEEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorINS_12basic_stringIcNS_11char_traitsIcEENS1_IcEEEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<std::pair<unsigned int, unsigned int>>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorINS_4pairIjjEEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<llvm::MemoryBuffer *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPN4llvm12MemoryBufferELi0ELb0EEEEE",
