#ifndef HIDL_GENERATED_ANDROID_HARDWARE_MEDIA_OMX_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_MEDIA_OMX_V1_0_TYPES_H

#include <android/hardware/media/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace media {
namespace omx {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class Status : int32_t;
struct Message;
struct CodecBuffer;
enum class PortMode : int32_t;
struct ColorAspects;

typedef uint32_t BufferId;

/**
 * Ref: system/core/include/utils/Errors.h
 * Ref: bionic/libc/kernel/uapi/asm-generic/errno-base.h
 * Ref: bionic/libc/kernel/uapi/asm-generic/errno.h
 * Ref: frameworks/av/include/media/stagefright/MediaError.h
 * Ref: frameworks/av/media/libstagefright/omx/OMXUtils.cpp: StatusFromOMXError
 */
enum class Status : int32_t {
    OK = 0,
    NO_ERROR = 0,
    NAME_NOT_FOUND = -2 /* -2 */,
    WOULD_BLOCK = -11 /* -11 */,
    NO_MEMORY = -12 /* -12 */,
    ALREADY_EXISTS = -17 /* -17 */,
    NO_INIT = -19 /* -19 */,
    BAD_VALUE = -22 /* -22 */,
    DEAD_OBJECT = -32 /* -32 */,
    INVALID_OPERATION = -38 /* -38 */,
    TIMED_OUT = -110 /* -110 */,
    ERROR_UNSUPPORTED = -1010 /* -1010 */,
    UNKNOWN_ERROR = -2147483648 /* -2147483648 */,
    BUFFER_NEEDS_REALLOCATION = 1 /* 0x1 */,
    RELEASE_ALL_BUFFERS = 2 /* 0x2 */,
};

/**
 * Ref: frameworks/av/include/media/IOMX.h: omx_message
 *
 * Data structure for an OMX message. This is essentially a union of different
 * message types.
 */
struct Message final {
    // Forward declaration for forward reference support:
    enum class Type : uint32_t;
    struct EventData;
    struct BufferData;
    struct ExtendedBufferData;
    struct RenderData;
    union Data;

    /**
     * There are four main types of messages.
     */
    enum class Type : uint32_t {
        EVENT = 0u,
        EMPTY_BUFFER_DONE = 1u /* ::android::hardware::media::omx::V1_0::Message::Type.EVENT implicitly + 1 */,
        FILL_BUFFER_DONE = 2u /* ::android::hardware::media::omx::V1_0::Message::Type.EMPTY_BUFFER_DONE implicitly + 1 */,
        FRAME_RENDERED = 3u /* ::android::hardware::media::omx::V1_0::Message::Type.FILL_BUFFER_DONE implicitly + 1 */,
    };

    /**
     * @see OMX_EVENTTYPE in the OpenMax IL standard.
     */
    struct EventData final {
        uint32_t event __attribute__ ((aligned(4)));
        uint32_t data1 __attribute__ ((aligned(4)));
        uint32_t data2 __attribute__ ((aligned(4)));
        uint32_t data3 __attribute__ ((aligned(4)));
        uint32_t data4 __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::EventData, event) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::EventData, data1) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::EventData, data2) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::EventData, data3) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::EventData, data4) == 16, "wrong offset");
    static_assert(sizeof(::android::hardware::media::omx::V1_0::Message::EventData) == 20, "wrong size");
    static_assert(__alignof(::android::hardware::media::omx::V1_0::Message::EventData) == 4, "wrong alignment");

    struct BufferData final {
        uint32_t buffer __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::BufferData, buffer) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::media::omx::V1_0::Message::BufferData) == 4, "wrong size");
    static_assert(__alignof(::android::hardware::media::omx::V1_0::Message::BufferData) == 4, "wrong alignment");

    struct ExtendedBufferData final {
        uint32_t buffer __attribute__ ((aligned(4)));
        uint32_t rangeOffset __attribute__ ((aligned(4)));
        uint32_t rangeLength __attribute__ ((aligned(4)));
        uint32_t flags __attribute__ ((aligned(4)));
        uint64_t timestampUs __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::ExtendedBufferData, buffer) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::ExtendedBufferData, rangeOffset) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::ExtendedBufferData, rangeLength) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::ExtendedBufferData, flags) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::ExtendedBufferData, timestampUs) == 16, "wrong offset");
    static_assert(sizeof(::android::hardware::media::omx::V1_0::Message::ExtendedBufferData) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::media::omx::V1_0::Message::ExtendedBufferData) == 8, "wrong alignment");

    struct RenderData final {
        uint64_t timestampUs __attribute__ ((aligned(8)));
        int64_t systemTimeNs __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::RenderData, timestampUs) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::RenderData, systemTimeNs) == 8, "wrong offset");
    static_assert(sizeof(::android::hardware::media::omx::V1_0::Message::RenderData) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::media::omx::V1_0::Message::RenderData) == 8, "wrong alignment");

    union Data final {
        ::android::hardware::media::omx::V1_0::Message::EventData eventData __attribute__ ((aligned(4)));
        ::android::hardware::media::omx::V1_0::Message::BufferData bufferData __attribute__ ((aligned(4)));
        ::android::hardware::media::omx::V1_0::Message::ExtendedBufferData extendedBufferData __attribute__ ((aligned(8)));
        ::android::hardware::media::omx::V1_0::Message::RenderData renderData __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::Data, eventData) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::Data, bufferData) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::Data, extendedBufferData) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::Message::Data, renderData) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::media::omx::V1_0::Message::Data) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::media::omx::V1_0::Message::Data) == 8, "wrong alignment");

    /**
     * The type of the message.
     */
    ::android::hardware::media::omx::V1_0::Message::Type type __attribute__ ((aligned(4)));
    /**
     * The fence associated with the message.
     */
    ::android::hardware::hidl_handle fence __attribute__ ((aligned(8)));
    /**
     * The union of data, discriminated by type.
     */
    ::android::hardware::media::omx::V1_0::Message::Data data __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::media::omx::V1_0::Message, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::media::omx::V1_0::Message, fence) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::media::omx::V1_0::Message, data) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::media::omx::V1_0::Message) == 48, "wrong size");
static_assert(__alignof(::android::hardware::media::omx::V1_0::Message) == 8, "wrong alignment");

/**
 * Ref: frameworks/native/include/ui/GraphicBuffer.h
 * Ref: system/core/include/system/window.h
 * Ref: frameworks/native/include/binder/IMemory.h
 * Ref: frameworks/native/libs/binder/IMemory.cpp
 * Ref: frameworks/av/include/media/OMXBuffer.h
 *
 * Data structure for buffer information. This is essentially a union of
 * different buffer types.
 */
struct CodecBuffer final {
    // Forward declaration for forward reference support:
    enum class Type : int32_t;
    struct PresetAttributes;
    union Attributes;

    /**
     * There are four main types of buffers.
     */
    enum class Type : int32_t {
        INVALID = 0,
        PRESET = 1 /* ::android::hardware::media::omx::V1_0::CodecBuffer::Type.INVALID implicitly + 1 */,
        SHARED_MEM = 2 /* ::android::hardware::media::omx::V1_0::CodecBuffer::Type.PRESET implicitly + 1 */,
        ANW_BUFFER = 3 /* ::android::hardware::media::omx::V1_0::CodecBuffer::Type.SHARED_MEM implicitly + 1 */,
        NATIVE_HANDLE = 4 /* ::android::hardware::media::omx::V1_0::CodecBuffer::Type.ANW_BUFFER implicitly + 1 */,
    };

    struct PresetAttributes final {
        uint32_t rangeOffset __attribute__ ((aligned(4)));
        uint32_t rangeLength __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::media::omx::V1_0::CodecBuffer::PresetAttributes, rangeOffset) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::CodecBuffer::PresetAttributes, rangeLength) == 4, "wrong offset");
    static_assert(sizeof(::android::hardware::media::omx::V1_0::CodecBuffer::PresetAttributes) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::media::omx::V1_0::CodecBuffer::PresetAttributes) == 4, "wrong alignment");

    union Attributes final {
        ::android::hardware::media::omx::V1_0::CodecBuffer::PresetAttributes preset __attribute__ ((aligned(4)));
        ::android::hardware::media::V1_0::AnwBufferAttributes anwBuffer __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::media::omx::V1_0::CodecBuffer::Attributes, preset) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::media::omx::V1_0::CodecBuffer::Attributes, anwBuffer) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::media::omx::V1_0::CodecBuffer::Attributes) == 40, "wrong size");
    static_assert(__alignof(::android::hardware::media::omx::V1_0::CodecBuffer::Attributes) == 8, "wrong alignment");

    /**
     * Type of the buffer.
     */
    ::android::hardware::media::omx::V1_0::CodecBuffer::Type type __attribute__ ((aligned(4)));
    /**
     * Attributes that can be put into a union.
     */
    ::android::hardware::media::omx::V1_0::CodecBuffer::Attributes attr __attribute__ ((aligned(8)));
    /**
     * Used only for types ANW_BUFFER and NATIVE_HANDLE.
     *
     * (A native handle cannot be put into a union as HIDL currently does not
     * support discriminated unions.)
     */
    ::android::hardware::hidl_handle nativeHandle __attribute__ ((aligned(8)));
    /**
     * Used only for type SHARED_MEM.
     */
    ::android::hardware::hidl_memory sharedMemory __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::media::omx::V1_0::CodecBuffer, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::media::omx::V1_0::CodecBuffer, attr) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::media::omx::V1_0::CodecBuffer, nativeHandle) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::media::omx::V1_0::CodecBuffer, sharedMemory) == 64, "wrong offset");
static_assert(sizeof(::android::hardware::media::omx::V1_0::CodecBuffer) == 104, "wrong size");
static_assert(__alignof(::android::hardware::media::omx::V1_0::CodecBuffer) == 8, "wrong alignment");

/**
 * Ref: frameworks/av/include/media/IOMX.h
 *
 * Enumeration of port modes.
 */
enum class PortMode : int32_t {
    PRESET_START = 0,
    PRESET_BYTE_BUFFER = 1 /* ::android::hardware::media::omx::V1_0::PortMode.PRESET_START implicitly + 1 */,
    PRESET_ANW_BUFFER = 2 /* ::android::hardware::media::omx::V1_0::PortMode.PRESET_BYTE_BUFFER implicitly + 1 */,
    PRESET_SECURE_BUFFER = 3 /* ::android::hardware::media::omx::V1_0::PortMode.PRESET_ANW_BUFFER implicitly + 1 */,
    PRESET_END = 4 /* ::android::hardware::media::omx::V1_0::PortMode.PRESET_SECURE_BUFFER implicitly + 1 */,
    DYNAMIC_START = 100,
    DYNAMIC_ANW_BUFFER = 101 /* ::android::hardware::media::omx::V1_0::PortMode.DYNAMIC_START implicitly + 1 */,
    DYNAMIC_NATIVE_HANDLE = 102 /* ::android::hardware::media::omx::V1_0::PortMode.DYNAMIC_ANW_BUFFER implicitly + 1 */,
    DYNAMIC_END = 103 /* ::android::hardware::media::omx::V1_0::PortMode.DYNAMIC_NATIVE_HANDLE implicitly + 1 */,
};

/**
 * Ref: frameworks/native/include/media/hardware/VideoAPI.h
 *
 * Framework defined color aspects. These are based mainly on ISO 23001-8 spec. As this standard
 * continues to evolve, new values may be defined in the future. Use OTHER for these future values
 * as well as for values not listed here, as those are not supported by the framework.
 */
struct ColorAspects final {
    // Forward declaration for forward reference support:
    enum class Range : uint32_t;
    enum class Primaries : uint32_t;
    enum class Transfer : uint32_t;
    enum class MatrixCoeffs : uint32_t;

    enum class Range : uint32_t {
        UNSPECIFIED = 0u,
        FULL = 1u /* ::android::hardware::media::omx::V1_0::ColorAspects::Range.UNSPECIFIED implicitly + 1 */,
        LIMITED = 2u /* ::android::hardware::media::omx::V1_0::ColorAspects::Range.FULL implicitly + 1 */,
        OTHER = 255u /* 0xff */,
    };

    enum class Primaries : uint32_t {
        UNSPECIFIED = 0u,
        BT709_5 = 1u /* ::android::hardware::media::omx::V1_0::ColorAspects::Primaries.UNSPECIFIED implicitly + 1 */,
        BT470_6M = 2u /* ::android::hardware::media::omx::V1_0::ColorAspects::Primaries.BT709_5 implicitly + 1 */,
        BT601_6_625 = 3u /* ::android::hardware::media::omx::V1_0::ColorAspects::Primaries.BT470_6M implicitly + 1 */,
        BT601_6_525 = 4u /* ::android::hardware::media::omx::V1_0::ColorAspects::Primaries.BT601_6_625 implicitly + 1 */,
        GENERIC_FILM = 5u /* ::android::hardware::media::omx::V1_0::ColorAspects::Primaries.BT601_6_525 implicitly + 1 */,
        BT2020 = 6u /* ::android::hardware::media::omx::V1_0::ColorAspects::Primaries.GENERIC_FILM implicitly + 1 */,
        OTHER = 255u /* 0xff */,
    };

    enum class Transfer : uint32_t {
        UNSPECIFIED = 0u,
        LINEAR = 1u /* ::android::hardware::media::omx::V1_0::ColorAspects::Transfer.UNSPECIFIED implicitly + 1 */,
        SRGB = 2u /* ::android::hardware::media::omx::V1_0::ColorAspects::Transfer.LINEAR implicitly + 1 */,
        SMPTE170M = 3u /* ::android::hardware::media::omx::V1_0::ColorAspects::Transfer.SRGB implicitly + 1 */,
        GAMMA22 = 4u /* ::android::hardware::media::omx::V1_0::ColorAspects::Transfer.SMPTE170M implicitly + 1 */,
        GAMMA28 = 5u /* ::android::hardware::media::omx::V1_0::ColorAspects::Transfer.GAMMA22 implicitly + 1 */,
        ST2084 = 6u /* ::android::hardware::media::omx::V1_0::ColorAspects::Transfer.GAMMA28 implicitly + 1 */,
        HLG = 7u /* ::android::hardware::media::omx::V1_0::ColorAspects::Transfer.ST2084 implicitly + 1 */,
        SMPTE240M = 64u /* 0x40 */,
        XVYCC = 65u /* ::android::hardware::media::omx::V1_0::ColorAspects::Transfer.SMPTE240M implicitly + 1 */,
        BT1361 = 66u /* ::android::hardware::media::omx::V1_0::ColorAspects::Transfer.XVYCC implicitly + 1 */,
        ST428 = 67u /* ::android::hardware::media::omx::V1_0::ColorAspects::Transfer.BT1361 implicitly + 1 */,
        OTHER = 255u /* 0xff */,
    };

    enum class MatrixCoeffs : uint32_t {
        UNSPECIFIED = 0u,
        BT709_5 = 1u /* ::android::hardware::media::omx::V1_0::ColorAspects::MatrixCoeffs.UNSPECIFIED implicitly + 1 */,
        BT470_6M = 2u /* ::android::hardware::media::omx::V1_0::ColorAspects::MatrixCoeffs.BT709_5 implicitly + 1 */,
        BT601_6 = 3u /* ::android::hardware::media::omx::V1_0::ColorAspects::MatrixCoeffs.BT470_6M implicitly + 1 */,
        SMPTE240M = 4u /* ::android::hardware::media::omx::V1_0::ColorAspects::MatrixCoeffs.BT601_6 implicitly + 1 */,
        BT2020 = 5u /* ::android::hardware::media::omx::V1_0::ColorAspects::MatrixCoeffs.SMPTE240M implicitly + 1 */,
        BT2020CONSTANT = 6u /* ::android::hardware::media::omx::V1_0::ColorAspects::MatrixCoeffs.BT2020 implicitly + 1 */,
        OTHER = 255u /* 0xff */,
    };

    ::android::hardware::media::omx::V1_0::ColorAspects::Range range __attribute__ ((aligned(4)));
    ::android::hardware::media::omx::V1_0::ColorAspects::Primaries primaries __attribute__ ((aligned(4)));
    ::android::hardware::media::omx::V1_0::ColorAspects::Transfer transfer __attribute__ ((aligned(4)));
    ::android::hardware::media::omx::V1_0::ColorAspects::MatrixCoeffs matrixCoeffs __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::media::omx::V1_0::ColorAspects, range) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::media::omx::V1_0::ColorAspects, primaries) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::media::omx::V1_0::ColorAspects, transfer) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::media::omx::V1_0::ColorAspects, matrixCoeffs) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::media::omx::V1_0::ColorAspects) == 16, "wrong size");
static_assert(__alignof(::android::hardware::media::omx::V1_0::ColorAspects) == 4, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::media::omx::V1_0::Status o);
static inline void PrintTo(::android::hardware::media::omx::V1_0::Status o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::media::omx::V1_0::Status lhs, const ::android::hardware::media::omx::V1_0::Status rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::media::omx::V1_0::Status rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::media::omx::V1_0::Status lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
