#ifndef HIDL_GENERATED_ANDROID_HARDWARE_USB_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_USB_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace usb {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class Status : uint32_t;
enum class PortRoleType : uint32_t;
enum class PortDataRole : uint32_t;
enum class PortPowerRole : uint32_t;
enum class PortMode : uint32_t;
struct PortRole;
struct PortStatus;

enum class Status : uint32_t {
    SUCCESS = 0u,
    /**
     * error value when the HAL operation fails for reasons not listed here.
     */
    ERROR = 1u,
    /**
     * error value returned when input argument is invalid.
     */
    INVALID_ARGUMENT = 2u,
    /**
     * error value returned when role string is unrecognized.
     */
    UNRECOGNIZED_ROLE = 3u,
};

/**
 * Denotes the Port role type.
 * Passed as an argument for functions used to query or change port roles.
 */
enum class PortRoleType : uint32_t {
    /**
     * Denotes the data role of the port.
     * The port can either be a "host" or a "device" for data.
     * This maps to the PortDataRole enum.
     */
    DATA_ROLE = 0u,
    /**
     * Denotes the power role of the port.
     * The port can either be a "source" or "sink" for power.
     * This maps to PortPowerRole enum.
     */
    POWER_ROLE = 1u,
    /**
     * USB ports can be a pure DFP port which can only act
     * as a host. A UFP port which can only act as a device.
     * Or a dual role ports which can either can as a host or
     * a device. This property is used to mention them.
     */
    MODE = 2u,
};

enum class PortDataRole : uint32_t {
    /**
     * Indicates that the port does not have a data role.
     * In case of DRP, the current data role of the port is only resolved
     * when the type-c handshake happens.
     */
    NONE = 0u,
    /**
     * Indicates that the port is acting as a host for data.
     */
    HOST = 1u,
    /**
     * Indicated that the port is acting as a device for data.
     */
    DEVICE = 2u,
    NUM_DATA_ROLES = 3u,
};

enum class PortPowerRole : uint32_t {
    /**
     * Indicates that the port does not have a power role.
     * In case of DRP, the current power role of the port is only resolved
     * when the type-c handshake happens.
     */
    NONE = 0u,
    /**
     * Indicates that the port is supplying power to the other port.
     */
    SOURCE = 1u,
    /**
     * Indicates that the port is sinking power from the other port.
     */
    SINK = 2u,
    NUM_POWER_ROLES = 3u,
};

enum class PortMode : uint32_t {
    /**
     * Indicates that the port does not have a mode.
     * In case of DRP, the current mode of the port is only resolved
     * when the type-c handshake happens.
     */
    NONE = 0u,
    /**
     * Indicates that port can only act as device for data and sink for power.
     */
    UFP = 1u,
    /**
     * Indicates the port can only act as host for data and source for power.
     */
    DFP = 2u,
    /**
     * Indicates can either act as UFP or DFP at a given point of time.
     */
    DRP = 3u,
    NUM_MODES = 4u,
};

/**
 * Used as a container to send port role information.
 */
struct PortRole final {
    /**
     * Indicates the type of Port Role.
     * Maps to the PortRoleType enum.
     */
    ::android::hardware::usb::V1_0::PortRoleType type __attribute__ ((aligned(4)));
    /**
     * when type is HAL_USB_DATA_ROLE pass values from enum PortDataRole.
     * when type is HAL_USB_POWER_ROLE pass values from enum PortPowerRole.
     * when type is HAL_USB_MODE pass values from enum PortMode.
     */
    uint32_t role __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::usb::V1_0::PortRole, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_0::PortRole, role) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::usb::V1_0::PortRole) == 8, "wrong size");
static_assert(__alignof(::android::hardware::usb::V1_0::PortRole) == 4, "wrong alignment");

/**
 * Used as the container to report data back to the caller.
 * Represents the current connection status of a single USB port.
 */
struct PortStatus final {
    /**
     * Name of the port.
     * Used as the port's id by the caller.
     */
    ::android::hardware::hidl_string portName __attribute__ ((aligned(8)));
    /**
     * Data role of the port.
     */
    ::android::hardware::usb::V1_0::PortDataRole currentDataRole __attribute__ ((aligned(4)));
    /**
     * Power Role of thte port.
     */
    ::android::hardware::usb::V1_0::PortPowerRole currentPowerRole __attribute__ ((aligned(4)));
    /**
     * Mode in which the port is connected.
     * Can be UFP or DFP.
     */
    ::android::hardware::usb::V1_0::PortMode currentMode __attribute__ ((aligned(4)));
    /**
     * True indicates that the port's mode can
     * be changed. False otherwise.
     */
    bool canChangeMode __attribute__ ((aligned(1)));
    /**
     * True indicates that the port's data role
     * can be changed. False otherwise.
     * For example, true if Type-C PD PD_SWAP
     * is supported.
     */
    bool canChangeDataRole __attribute__ ((aligned(1)));
    /**
     * True indicates that the port's power role
     * can be changed. False otherwise.
     * For example, true if Type-C PD PR_SWAP
     * is supported.
     */
    bool canChangePowerRole __attribute__ ((aligned(1)));
    /**
     * Identifies the type of the local port.
     *
     * UFP - Indicates that port can only act as device for
     *       data and sink for power.
     * DFP - Indicates the port can only act as host for data
     *       and source for power.
     * DRP - Indicates can either act as UFP or DFP at a
     *       given point of time.
     */
    ::android::hardware::usb::V1_0::PortMode supportedModes __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::usb::V1_0::PortStatus, portName) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_0::PortStatus, currentDataRole) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_0::PortStatus, currentPowerRole) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_0::PortStatus, currentMode) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_0::PortStatus, canChangeMode) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_0::PortStatus, canChangeDataRole) == 29, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_0::PortStatus, canChangePowerRole) == 30, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_0::PortStatus, supportedModes) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::usb::V1_0::PortStatus) == 40, "wrong size");
static_assert(__alignof(::android::hardware::usb::V1_0::PortStatus) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint32_t o);
static inline std::string toString(::android::hardware::usb::V1_0::Status o);
static inline void PrintTo(::android::hardware::usb::V1_0::Status o, ::std::ostream* os);
constexpr uint32_t operator|(const ::android::hardware::usb::V1_0::Status lhs, const ::android::hardware::usb::V1_0::Status rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const uint32_t lhs, const ::android::hardware::usb::V1_0::Status rhs) {
    return static_cast<uint32_t>(lhs | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const ::android::hardware::usb::V1_0::Status lhs, const uint32_t rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | rhs);
}
