{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA21_c",
   "name" : "char [21]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA21_c",
   "size" : 21,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA24_c",
   "name" : "char [24]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA24_c",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA25_c",
   "name" : "char [25]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA25_c",
   "size" : 25,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA26_c",
   "name" : "char [26]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA26_c",
   "size" : 26,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA2_c",
   "name" : "char [2]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA2_c",
   "size" : 2,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {

   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIKN7android7RefBaseE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6MemoryEEE",
   "name" : "const std::shared_ptr<const android::nn::Memory>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIKN7android2nn6MemoryEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6MemoryEEE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/SharedMemory.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE",
   "name" : "const std::unique_ptr<android::base::LogMessageData, std::default_delete<android::base::LogMessageData>>",
   "referenced_type" : "_ZTINSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE",
   "self_type" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16chrono8durationIxNS_5ratioILl1ELl1EEEEE",
   "name" : "const std::chrono::duration<long long, std::ratio<1, 1>>",
   "referenced_type" : "_ZTINSt3__16chrono8durationIxNS_5ratioILl1ELl1EEEEE",
   "self_type" : "_ZTIKNSt3__16chrono8durationIxNS_5ratioILl1ELl1EEEEE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/errno_restorer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/SharedMemory.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android12NativeHandleE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android19VirtualLightRefBaseE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12NativeHandleE",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12NativeHandleE",
   "self_type" : "_ZTIN7android12NativeHandleE",
   "size" : 24,
   "source_file" : "system/core/libutils/include/utils/NativeHandle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14ReferenceMoverE",
   "self_type" : "_ZTIN7android14ReferenceMoverE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16ReferenceRenamerE",
   "self_type" : "_ZTIN7android16ReferenceRenamerE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEm"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "self_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dimensions",
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn10BufferDescE",
   "name" : "android::nn::BufferDesc",
   "referenced_type" : "_ZTIN7android2nn10BufferDescE",
   "self_type" : "_ZTIN7android2nn10BufferDescE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "modelIndex",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ioIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "probability",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn10BufferRoleE",
   "name" : "android::nn::BufferRole",
   "referenced_type" : "_ZTIN7android2nn10BufferRoleE",
   "self_type" : "_ZTIN7android2nn10BufferRoleE",
   "size" : 12,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dimensions",
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    },
    {
     "field_name" : "isSufficient",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn11OutputShapeE",
   "name" : "android::nn::OutputShape",
   "referenced_type" : "_ZTIN7android2nn11OutputShapeE",
   "self_type" : "_ZTIN7android2nn11OutputShapeE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "execTime",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "powerUsage",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE",
   "name" : "android::nn::Capabilities::PerformanceInfo",
   "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE",
   "self_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN7android2nn11OperandTypeE"
    },
    {
     "field_name" : "info",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12Capabilities18OperandPerformanceE",
   "name" : "android::nn::Capabilities::OperandPerformance",
   "referenced_type" : "_ZTIN7android2nn12Capabilities18OperandPerformanceE",
   "self_type" : "_ZTIN7android2nn12Capabilities18OperandPerformanceE",
   "size" : 12,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSorted",
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn12Capabilities18OperandPerformanceENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12Capabilities23OperandPerformanceTableE",
   "name" : "android::nn::Capabilities::OperandPerformanceTable",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn12Capabilities23OperandPerformanceTableE",
   "self_type" : "_ZTIN7android2nn12Capabilities23OperandPerformanceTableE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "relaxedFloat32toFloat16PerformanceScalar",
     "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE"
    },
    {
     "field_name" : "relaxedFloat32toFloat16PerformanceTensor",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE"
    },
    {
     "field_name" : "operandPerformance",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android2nn12Capabilities23OperandPerformanceTableE"
    },
    {
     "field_name" : "ifPerformance",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE"
    },
    {
     "field_name" : "whilePerformance",
     "field_offset" : 384,
     "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12CapabilitiesE",
   "name" : "android::nn::Capabilities",
   "referenced_type" : "_ZTIN7android2nn12CapabilitiesE",
   "self_type" : "_ZTIN7android2nn12CapabilitiesE",
   "size" : 56,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pointer",
     "referenced_type" : "_ZTINSt3__17variantIJPKvPvEEE"
    },
    {
     "field_name" : "poolIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "length",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "padding",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12DataLocationE",
   "name" : "android::nn::DataLocation",
   "referenced_type" : "_ZTIN7android2nn12DataLocationE",
   "self_type" : "_ZTIN7android2nn12DataLocationE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "message",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "code",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android2nn11ErrorStatusE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12GeneralErrorE",
   "name" : "android::nn::GeneralError",
   "referenced_type" : "_ZTIN7android2nn12GeneralErrorE",
   "self_type" : "_ZTIN7android2nn12GeneralErrorE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "message",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "code",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android2nn11ErrorStatusE"
    },
    {
     "field_name" : "outputShapes",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn11OutputShapeENS_9allocatorIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn14ExecutionErrorE",
   "name" : "android::nn::ExecutionError",
   "referenced_type" : "_ZTIN7android2nn14ExecutionErrorE",
   "self_type" : "_ZTIN7android2nn14ExecutionErrorE",
   "size" : 56,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "padding",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn16MemoryPreferenceE",
   "name" : "android::nn::MemoryPreference",
   "referenced_type" : "_ZTIN7android2nn16MemoryPreferenceE",
   "self_type" : "_ZTIN7android2nn16MemoryPreferenceE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPoolIndex",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn20MutableMemoryBuilderE",
   "name" : "android::nn::MutableMemoryBuilder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn20MutableMemoryBuilderE",
   "self_type" : "_ZTIN7android2nn20MutableMemoryBuilderE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/SharedMemory.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn21ConstantMemoryBuilder8LazyCopyE",
   "name" : "android::nn::ConstantMemoryBuilder::LazyCopy",
   "referenced_type" : "_ZTIN7android2nn21ConstantMemoryBuilder8LazyCopyE",
   "self_type" : "_ZTIN7android2nn21ConstantMemoryBuilder8LazyCopyE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/SharedMemory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuilder",
     "referenced_type" : "_ZTIN7android2nn20MutableMemoryBuilderE"
    },
    {
     "access" : "private",
     "field_name" : "mSlices",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn21ConstantMemoryBuilder8LazyCopyENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn21ConstantMemoryBuilderE",
   "name" : "android::nn::ConstantMemoryBuilder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn21ConstantMemoryBuilderE",
   "self_type" : "_ZTIN7android2nn21ConstantMemoryBuilderE",
   "size" : 40,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/SharedMemory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn5Model13OperandValuesE",
   "name" : "android::nn::Model::OperandValues",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn5Model13OperandValuesE",
   "self_type" : "_ZTIN7android2nn5Model13OperandValuesE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn5Model22ExtensionNameAndPrefixE",
   "name" : "android::nn::Model::ExtensionNameAndPrefix",
   "referenced_type" : "_ZTIN7android2nn5Model22ExtensionNameAndPrefixE",
   "self_type" : "_ZTIN7android2nn5Model22ExtensionNameAndPrefixE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "operands",
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn7OperandENS_9allocatorIS3_EEEE"
    },
    {
     "field_name" : "operations",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn9OperationENS_9allocatorIS3_EEEE"
    },
    {
     "field_name" : "inputIndexes",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    },
    {
     "field_name" : "outputIndexes",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn5Model8SubgraphE",
   "name" : "android::nn::Model::Subgraph",
   "referenced_type" : "_ZTIN7android2nn5Model8SubgraphE",
   "self_type" : "_ZTIN7android2nn5Model8SubgraphE",
   "size" : 96,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "main",
     "referenced_type" : "_ZTIN7android2nn5Model8SubgraphE"
    },
    {
     "field_name" : "referenced",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn5Model8SubgraphENS_9allocatorIS4_EEEE"
    },
    {
     "field_name" : "operandValues",
     "field_offset" : 960,
     "referenced_type" : "_ZTIN7android2nn5Model13OperandValuesE"
    },
    {
     "field_name" : "pools",
     "field_offset" : 1152,
     "referenced_type" : "_ZTINSt3__16vectorINS_10shared_ptrIKN7android2nn6MemoryEEENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "relaxComputationFloat32toFloat16",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "extensionNameToPrefix",
     "field_offset" : 1408,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn5Model22ExtensionNameAndPrefixENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn5ModelE",
   "name" : "android::nn::Model",
   "referenced_type" : "_ZTIN7android2nn5ModelE",
   "self_type" : "_ZTIN7android2nn5ModelE",
   "size" : 200,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds",
     "referenced_type" : "_ZTINSt3__16vectorIN7android4base14unique_fd_implINS2_13DefaultCloserEEENS_9allocatorIS5_EEEE"
    },
    {
     "field_name" : "ints",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6HandleE",
   "name" : "android::nn::Handle",
   "referenced_type" : "_ZTIN7android2nn6HandleE",
   "self_type" : "_ZTIN7android2nn6HandleE",
   "size" : 48,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handle",
     "referenced_type" : "_ZTINSt3__110unique_ptrI15AHardwareBufferPFvPS1_EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6Memory14HardwareBufferE",
   "name" : "android::nn::Memory::HardwareBuffer",
   "referenced_type" : "_ZTIN7android2nn6Memory14HardwareBufferE",
   "self_type" : "_ZTIN7android2nn6Memory14HardwareBufferE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "prot",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fd",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6Memory2FdE",
   "name" : "android::nn::Memory::Fd",
   "referenced_type" : "_ZTIN7android2nn6Memory2FdE",
   "self_type" : "_ZTIN7android2nn6Memory2FdE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6Memory6AshmemE",
   "name" : "android::nn::Memory::Ashmem",
   "referenced_type" : "_ZTIN7android2nn6Memory6AshmemE",
   "self_type" : "_ZTIN7android2nn6Memory6AshmemE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handle",
     "referenced_type" : "_ZTIN7android2nn6HandleE"
    },
    {
     "field_name" : "size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "name",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6Memory7UnknownE",
   "name" : "android::nn::Memory::Unknown",
   "referenced_type" : "_ZTIN7android2nn6Memory7UnknownE",
   "self_type" : "_ZTIN7android2nn6Memory7UnknownE",
   "size" : 80,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handle",
     "referenced_type" : "_ZTINSt3__17variantIJN7android2nn6Memory6AshmemENS3_2FdENS3_14HardwareBufferENS3_7UnknownEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6MemoryE",
   "name" : "android::nn::Memory",
   "referenced_type" : "_ZTIN7android2nn6MemoryE",
   "self_type" : "_ZTIN7android2nn6MemoryE",
   "size" : 88,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timeOnDevice",
     "referenced_type" : "_ZTINSt3__18optionalINS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEEEE"
    },
    {
     "field_name" : "timeInDriver",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18optionalINS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6TimingE",
   "name" : "android::nn::Timing",
   "referenced_type" : "_ZTIN7android2nn6TimingE",
   "self_type" : "_ZTIN7android2nn6TimingE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mArgs",
     "referenced_type" : "_ZTINSt3__15tupleIJEEE"
    },
    {
     "access" : "private",
     "field_name" : "mStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__119basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6detail12ErrorBuilderIJEEE",
   "name" : "android::nn::detail::ErrorBuilder<>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn6detail12ErrorBuilderIJEEE",
   "self_type" : "_ZTIN7android2nn6detail12ErrorBuilderIJEEE",
   "size" : 272,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mArgs",
     "referenced_type" : "_ZTINSt3__15tupleIJN7android2nn11ErrorStatusEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__119basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6detail12ErrorBuilderIJNS0_11ErrorStatusEEEE",
   "name" : "android::nn::detail::ErrorBuilder<ErrorStatus>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn6detail12ErrorBuilderIJNS0_11ErrorStatusEEEE",
   "self_type" : "_ZTIN7android2nn6detail12ErrorBuilderIJNS0_11ErrorStatusEEEE",
   "size" : 272,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pointer",
     "referenced_type" : "_ZTINSt3__17variantIJPKvPvEEE"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "context",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__13anyE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn7MappingE",
   "name" : "android::nn::Mapping",
   "referenced_type" : "_ZTIN7android2nn7MappingE",
   "self_type" : "_ZTIN7android2nn7MappingE",
   "size" : 56,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/SharedMemory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "scales",
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "field_name" : "channelDim",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn7Operand25SymmPerChannelQuantParamsE",
   "name" : "android::nn::Operand::SymmPerChannelQuantParams",
   "referenced_type" : "_ZTIN7android2nn7Operand25SymmPerChannelQuantParamsE",
   "self_type" : "_ZTIN7android2nn7Operand25SymmPerChannelQuantParamsE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN7android2nn11OperandTypeE"
    },
    {
     "field_name" : "dimensions",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    },
    {
     "field_name" : "scale",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "zeroPoint",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lifetime",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android2nn7Operand8LifeTimeE"
    },
    {
     "field_name" : "location",
     "field_offset" : 384,
     "referenced_type" : "_ZTIN7android2nn12DataLocationE"
    },
    {
     "field_name" : "extraParams",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn7OperandE",
   "name" : "android::nn::Operand",
   "referenced_type" : "_ZTIN7android2nn7OperandE",
   "self_type" : "_ZTIN7android2nn7OperandE",
   "size" : 120,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lifetime",
     "referenced_type" : "_ZTIN7android2nn7Request8Argument8LifeTimeE"
    },
    {
     "field_name" : "location",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2nn12DataLocationE"
    },
    {
     "field_name" : "dimensions",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn7Request8ArgumentE",
   "name" : "android::nn::Request::Argument",
   "referenced_type" : "_ZTIN7android2nn7Request8ArgumentE",
   "self_type" : "_ZTIN7android2nn7Request8ArgumentE",
   "size" : 64,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "inputs",
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn7Request8ArgumentENS_9allocatorIS4_EEEE"
    },
    {
     "field_name" : "outputs",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn7Request8ArgumentENS_9allocatorIS4_EEEE"
    },
    {
     "field_name" : "pools",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorINS_7variantIJNS_10shared_ptrIKN7android2nn6MemoryEEENS4_7Request17MemoryDomainTokenENS2_IKNS4_7IBufferEEEEEENS_9allocatorISD_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn7RequestE",
   "name" : "android::nn::Request",
   "referenced_type" : "_ZTIN7android2nn7RequestE",
   "self_type" : "_ZTIN7android2nn7RequestE",
   "size" : 72,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "isTensor",
     "field_offset" : 16,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "byteSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn9Extension22OperandTypeInformationE",
   "name" : "android::nn::Extension::OperandTypeInformation",
   "referenced_type" : "_ZTIN7android2nn9Extension22OperandTypeInformationE",
   "self_type" : "_ZTIN7android2nn9Extension22OperandTypeInformationE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "operandTypes",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn9Extension22OperandTypeInformationENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn9ExtensionE",
   "name" : "android::nn::Extension",
   "referenced_type" : "_ZTIN7android2nn9ExtensionE",
   "self_type" : "_ZTIN7android2nn9ExtensionE",
   "size" : 48,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN7android2nn13OperationTypeE"
    },
    {
     "field_name" : "inputs",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    },
    {
     "field_name" : "outputs",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn9OperationE",
   "name" : "android::nn::Operation",
   "referenced_type" : "_ZTIN7android2nn9OperationE",
   "self_type" : "_ZTIN7android2nn9OperationE",
   "size" : 56,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSyncFence",
     "referenced_type" : "_ZTINSt3__110shared_ptrIKN7android2nn6HandleEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn9SyncFenceE",
   "name" : "android::nn::SyncFence",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn9SyncFenceE",
   "self_type" : "_ZTIN7android2nn9SyncFenceE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl4base4V1_05IBaseE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl6memory4V1_07IMemoryE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "name" : "android::sp<android::hidl::memory::V1_0::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl6memory4V1_07IMemoryE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl7manager4V1_020IServiceNotificationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl9allocator4V1_010IAllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl9allocator4V1_010IAllocatorEEE",
   "name" : "android::sp<android::hidl::allocator::V1_0::IAllocator>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl9allocator4V1_010IAllocatorEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl9allocator4V1_010IAllocatorEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl9allocator4V1_010IAllocatorE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware20hidl_death_recipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware20hidl_death_recipientE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogMessageE",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogMessageE",
   "self_type" : "_ZTIN7android4base10LogMessageE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "_ZTIN7android4base5LogIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogdLoggerE",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogdLoggerE",
   "self_type" : "_ZTIN7android4base10LogdLoggerE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "base_",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "offset_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10MappedFileE",
   "name" : "android::base::MappedFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10MappedFileE",
   "self_type" : "_ZTIN7android4base10MappedFileE",
   "size" : 24,
   "source_file" : "system/libbase/include/android-base/mapped_file.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10boot_clockE",
   "name" : "android::base::boot_clock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10boot_clockE",
   "self_type" : "_ZTIN7android4base10boot_clockE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/chrono_utils.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned long, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned long, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned long, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned long, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIjEE",
   "name" : "android::base::log_detail::Storage<unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIjEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIjEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageImEE",
   "name" : "android::base::log_detail::Storage<unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageImEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageImEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10unexpect_tE",
   "name" : "android::base::unexpect_t",
   "referenced_type" : "_ZTIN7android4base10unexpect_tE",
   "self_type" : "_ZTIN7android4base10unexpect_tE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/expected.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "val_",
     "referenced_type" : "_ZTIN7android2nn12GeneralErrorE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10unexpectedINS_2nn12GeneralErrorEEE",
   "name" : "android::base::unexpected<android::nn::GeneralError>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10unexpectedINS_2nn12GeneralErrorEEE",
   "self_type" : "_ZTIN7android4base10unexpectedINS_2nn12GeneralErrorEEE",
   "size" : 32,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" : [ "_ZTIN7android2nn12GeneralErrorE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "val_",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10unexpectedINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "android::base::unexpected<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10unexpectedINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN7android4base10unexpectedINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 24,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base11borrowed_fdE",
   "name" : "android::base::borrowed_fd",
   "referenced_type" : "_ZTIN7android4base11borrowed_fdE",
   "self_type" : "_ZTIN7android4base11borrowed_fdE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "name" : "android::base::LogNullGuard<std::nullptr_t>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIDn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "name" : "android::base::LogNullGuard<const char *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "name" : "android::base::LogNullGuard<char *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIjEE",
   "name" : "android::base::LogNullGuard<unsigned int>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIjEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardImEE",
   "name" : "android::base::LogNullGuard<unsigned long>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardImEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardImEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base13DefaultCloserE",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "_ZTIN7android4base13DefaultCloserE",
   "self_type" : "_ZTIN7android4base13DefaultCloserE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "_ZTIKi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base13ErrnoRestorerE",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base13ErrnoRestorerE",
   "self_type" : "_ZTIN7android4base13ErrnoRestorerE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/errno_restorer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h",
   "template_args" : [ "_ZTIN7android4base13DefaultCloserE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "_ZTIN7android4base11LogSeverityE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base17ScopedLogSeverityE",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base17ScopedLogSeverityE",
   "self_type" : "_ZTIN7android4base17ScopedLogSeverityE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "start_",
     "referenced_type" : "_ZTINSt3__16chrono10time_pointIN7android4base10boot_clockENS0_8durationIxNS_5ratioILl1ELl1000000000EEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base5TimerE",
   "name" : "android::base::Timer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base5TimerE",
   "self_type" : "_ZTIN7android4base5TimerE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/chrono_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "var_",
     "referenced_type" : "_ZTINSt3__17variantIJN7android4base14unique_fd_implINS2_13DefaultCloserEEENS2_10unexpectedINS1_2nn12GeneralErrorEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base8expectedINS0_14unique_fd_implINS0_13DefaultCloserEEENS_2nn12GeneralErrorEEE",
   "name" : "android::base::expected<android::base::unique_fd_impl<android::base::DefaultCloser>, android::nn::GeneralError>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base8expectedINS0_14unique_fd_implINS0_13DefaultCloserEEENS_2nn12GeneralErrorEEE",
   "self_type" : "_ZTIN7android4base8expectedINS0_14unique_fd_implINS0_13DefaultCloserEEENS_2nn12GeneralErrorEEE",
   "size" : 40,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" :
   [
    "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
    "_ZTIN7android2nn12GeneralErrorE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "var_",
     "referenced_type" : "_ZTINSt3__17variantIJN7android2nn7MappingENS1_4base10unexpectedINS2_12GeneralErrorEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base8expectedINS_2nn7MappingENS2_12GeneralErrorEEE",
   "name" : "android::base::expected<android::nn::Mapping, android::nn::GeneralError>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base8expectedINS_2nn7MappingENS2_12GeneralErrorEEE",
   "self_type" : "_ZTIN7android4base8expectedINS_2nn7MappingENS2_12GeneralErrorEEE",
   "size" : 72,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" : [ "_ZTIN7android2nn7MappingE", "_ZTIN7android2nn12GeneralErrorE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "var_",
     "referenced_type" : "_ZTINSt3__17variantIJN7android2nn7VersionENS1_4base10unexpectedINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base8expectedINS_2nn7VersionENSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEE",
   "name" : "android::base::expected<android::nn::Version, std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base8expectedINS_2nn7VersionENSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN7android4base8expectedINS_2nn7VersionENSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEE",
   "size" : 32,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" :
   [
    "_ZTIN7android2nn7VersionE",
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "var_",
     "referenced_type" : "_ZTINSt3__17variantIJN7android8hardware11hidl_handleENS1_4base10unexpectedINS1_2nn12GeneralErrorEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base8expectedINS_8hardware11hidl_handleENS_2nn12GeneralErrorEEE",
   "name" : "android::base::expected<android::hardware::hidl_handle, android::nn::GeneralError>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base8expectedINS_8hardware11hidl_handleENS_2nn12GeneralErrorEEE",
   "self_type" : "_ZTIN7android4base8expectedINS_8hardware11hidl_handleENS_2nn12GeneralErrorEEE",
   "size" : 40,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" :
   [
    "_ZTIN7android8hardware11hidl_handleE",
    "_ZTIN7android2nn12GeneralErrorE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "var_",
     "referenced_type" : "_ZTINSt3__17variantIJNS_10shared_ptrIKN7android2nn6MemoryEEENS2_4base10unexpectedINS3_12GeneralErrorEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base8expectedINSt3__110shared_ptrIKNS_2nn6MemoryEEENS4_12GeneralErrorEEE",
   "name" : "android::base::expected<std::shared_ptr<const android::nn::Memory>, android::nn::GeneralError>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base8expectedINSt3__110shared_ptrIKNS_2nn6MemoryEEENS4_12GeneralErrorEEE",
   "self_type" : "_ZTIN7android4base8expectedINSt3__110shared_ptrIKNS_2nn6MemoryEEENS4_12GeneralErrorEEE",
   "size" : 40,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" :
   [
    "_ZTINSt3__110shared_ptrIKN7android2nn6MemoryEEE",
    "_ZTIN7android2nn12GeneralErrorE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "var_",
     "referenced_type" : "_ZTINSt3__17variantIJNS_6vectorIN7android4base14unique_fd_implINS3_13DefaultCloserEEENS_9allocatorIS6_EEEENS3_10unexpectedINS2_2nn12GeneralErrorEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base8expectedINSt3__16vectorINS0_14unique_fd_implINS0_13DefaultCloserEEENS2_9allocatorIS6_EEEENS_2nn12GeneralErrorEEE",
   "name" : "android::base::expected<std::vector<android::base::unique_fd_impl<android::base::DefaultCloser>, std::allocator<android::base::unique_fd_impl<android::base::DefaultCloser>>>, android::nn::GeneralError>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base8expectedINSt3__16vectorINS0_14unique_fd_implINS0_13DefaultCloserEEENS2_9allocatorIS6_EEEENS_2nn12GeneralErrorEEE",
   "self_type" : "_ZTIN7android4base8expectedINSt3__16vectorINS0_14unique_fd_implINS0_13DefaultCloserEEENS2_9allocatorIS6_EEEENS_2nn12GeneralErrorEEE",
   "size" : 40,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android4base14unique_fd_implINS2_13DefaultCloserEEENS_9allocatorIS5_EEEE",
    "_ZTIN7android2nn12GeneralErrorE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIN7android7RefBaseE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android2nn11ErrorStatusE",
   "name" : "android::nn::ErrorStatus &&",
   "referenced_type" : "_ZTIN7android2nn11ErrorStatusE",
   "self_type" : "_ZTION7android2nn11ErrorStatusE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android2nn12GeneralErrorE",
   "name" : "android::nn::GeneralError &&",
   "referenced_type" : "_ZTIN7android2nn12GeneralErrorE",
   "self_type" : "_ZTION7android2nn12GeneralErrorE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/expected.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android2nn7MappingE",
   "name" : "android::nn::Mapping &&",
   "referenced_type" : "_ZTIN7android2nn7MappingE",
   "self_type" : "_ZTION7android2nn7MappingE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/expected.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "name" : "android::sp<android::hidl::memory::V1_0::IMemory> &&",
   "referenced_type" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "self_type" : "_ZTION7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android4base10unexpectedINS_2nn12GeneralErrorEEE",
   "name" : "android::base::unexpected<android::nn::GeneralError> &&",
   "referenced_type" : "_ZTIN7android4base10unexpectedINS_2nn12GeneralErrorEEE",
   "self_type" : "_ZTION7android4base10unexpectedINS_2nn12GeneralErrorEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/expected.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android4base10unexpectedINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "android::base::unexpected<std::basic_string<char, std::char_traits<char>, std::allocator<char>>> &&",
   "referenced_type" : "_ZTIN7android4base10unexpectedINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTION7android4base10unexpectedINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/expected.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser> &&",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTION7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
