{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA101_c",
   "name" : "char [101]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA101_c",
   "size" : 101,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA102_PKN7android2nn21OperationRegistrationE",
   "name" : "const android::nn::OperationRegistration *[102]",
   "referenced_type" : "_ZTIPKN7android2nn21OperationRegistrationE",
   "self_type" : "_ZTIA102_PKN7android2nn21OperationRegistrationE",
   "size" : 816,
   "source_file" : "packages/modules/NeuralNetworks/common/include/OperationResolver.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA103_c",
   "name" : "char [103]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA103_c",
   "size" : 103,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA10_c",
   "name" : "char [10]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA10_c",
   "size" : 10,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA11_c",
   "name" : "char [11]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA11_c",
   "size" : 11,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA12_c",

   "linker_set_key" : "_ZTIKNSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE",
   "name" : "const std::variant<monostate, SymmPerChannelQuantParams, vector<unsigned char, allocator<unsigned char>>>",
   "referenced_type" : "_ZTINSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE",
   "self_type" : "_ZTIKNSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE",
   "size" : 40,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18functionIFPKN7android2nn5ModelERKNS_10shared_ptrIKNS2_14IPreparedModelEEEEEE",
   "name" : "const std::function<const Model *(const shared_ptr<const IPreparedModel> &)>",
   "referenced_type" : "_ZTINSt3__18functionIFPKN7android2nn5ModelERKNS_10shared_ptrIKNS2_14IPreparedModelEEEEEE",
   "self_type" : "_ZTIKNSt3__18functionIFPKN7android2nn5ModelERKNS_10shared_ptrIKNS2_14IPreparedModelEEEEEE",
   "size" : 48,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Validation.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6chrono10time_pointIN7android4base10boot_clockENS1_8durationIxNS_5ratioILl1ELl1000000000EEEEEEEEE",
   "name" : "const std::optional<std::chrono::time_point<android::base::boot_clock, std::chrono::duration<long long, std::ratio<1, 1000000000>>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6chrono10time_pointIN7android4base10boot_clockENS1_8durationIxNS_5ratioILl1ELl1000000000EEEEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6chrono10time_pointIN7android4base10boot_clockENS1_8durationIxNS_5ratioILl1ELl1000000000EEEEEEEEE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Validation.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEEEE",
   "name" : "const std::optional<std::chrono::duration<long long, std::ratio<1, 1000000000>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEEEE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Validation.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/SharedMemory.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dimensions",
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn10BufferDescE",
   "name" : "android::nn::BufferDesc",
   "referenced_type" : "_ZTIN7android2nn10BufferDescE",
   "self_type" : "_ZTIN7android2nn10BufferDescE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "modelIndex",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ioIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "probability",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn10BufferRoleE",
   "name" : "android::nn::BufferRole",
   "referenced_type" : "_ZTIN7android2nn10BufferRoleE",
   "self_type" : "_ZTIN7android2nn10BufferRoleE",
   "size" : 12,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dimensions",
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    },
    {
     "field_name" : "isSufficient",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn11OutputShapeE",
   "name" : "android::nn::OutputShape",
   "referenced_type" : "_ZTIN7android2nn11OutputShapeE",
   "self_type" : "_ZTIN7android2nn11OutputShapeE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "execTime",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "powerUsage",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE",
   "name" : "android::nn::Capabilities::PerformanceInfo",
   "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE",
   "self_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN7android2nn11OperandTypeE"
    },
    {
     "field_name" : "info",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12Capabilities18OperandPerformanceE",
   "name" : "android::nn::Capabilities::OperandPerformance",
   "referenced_type" : "_ZTIN7android2nn12Capabilities18OperandPerformanceE",
   "self_type" : "_ZTIN7android2nn12Capabilities18OperandPerformanceE",
   "size" : 12,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSorted",
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn12Capabilities18OperandPerformanceENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12Capabilities23OperandPerformanceTableE",
   "name" : "android::nn::Capabilities::OperandPerformanceTable",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn12Capabilities23OperandPerformanceTableE",
   "self_type" : "_ZTIN7android2nn12Capabilities23OperandPerformanceTableE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "relaxedFloat32toFloat16PerformanceScalar",
     "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE"
    },
    {
     "field_name" : "relaxedFloat32toFloat16PerformanceTensor",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE"
    },
    {
     "field_name" : "operandPerformance",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android2nn12Capabilities23OperandPerformanceTableE"
    },
    {
     "field_name" : "ifPerformance",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE"
    },
    {
     "field_name" : "whilePerformance",
     "field_offset" : 384,
     "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12CapabilitiesE",
   "name" : "android::nn::Capabilities",
   "referenced_type" : "_ZTIN7android2nn12CapabilitiesE",
   "self_type" : "_ZTIN7android2nn12CapabilitiesE",
   "size" : 56,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pointer",
     "referenced_type" : "_ZTINSt3__17variantIJPKvPvEEE"
    },
    {
     "field_name" : "poolIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "length",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "padding",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12DataLocationE",
   "name" : "android::nn::DataLocation",
   "referenced_type" : "_ZTIN7android2nn12DataLocationE",
   "self_type" : "_ZTIN7android2nn12DataLocationE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "message",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "code",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android2nn11ErrorStatusE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn12GeneralErrorE",
   "name" : "android::nn::GeneralError",
   "referenced_type" : "_ZTIN7android2nn12GeneralErrorE",
   "self_type" : "_ZTIN7android2nn12GeneralErrorE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "message",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "code",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android2nn11ErrorStatusE"
    },
    {
     "field_name" : "outputShapes",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn11OutputShapeENS_9allocatorIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn14ExecutionErrorE",
   "name" : "android::nn::ExecutionError",
   "referenced_type" : "_ZTIN7android2nn14ExecutionErrorE",
   "self_type" : "_ZTIN7android2nn14ExecutionErrorE",
   "size" : 56,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "padding",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn16MemoryPreferenceE",
   "name" : "android::nn::MemoryPreference",
   "referenced_type" : "_ZTIN7android2nn16MemoryPreferenceE",
   "self_type" : "_ZTIN7android2nn16MemoryPreferenceE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android2nn18IOperationResolverE",
   "name" : "android::nn::IOperationResolver",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn18IOperationResolverE",
   "self_type" : "_ZTIN7android2nn18IOperationResolverE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/OperationResolver.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android2nn18IOperationResolverE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn18IOperationResolver13findOperationENS0_13OperationTypeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android2nn18IOperationResolverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android2nn18IOperationResolverD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPoolIndex",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn20MutableMemoryBuilderE",
   "name" : "android::nn::MutableMemoryBuilder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn20MutableMemoryBuilderE",
   "self_type" : "_ZTIN7android2nn20MutableMemoryBuilderE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/SharedMemory.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn21ConstantMemoryBuilder8LazyCopyE",
   "name" : "android::nn::ConstantMemoryBuilder::LazyCopy",
   "referenced_type" : "_ZTIN7android2nn21ConstantMemoryBuilder8LazyCopyE",
   "self_type" : "_ZTIN7android2nn21ConstantMemoryBuilder8LazyCopyE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/SharedMemory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuilder",
     "referenced_type" : "_ZTIN7android2nn20MutableMemoryBuilderE"
    },
    {
     "access" : "private",
     "field_name" : "mSlices",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn21ConstantMemoryBuilder8LazyCopyENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn21ConstantMemoryBuilderE",
   "name" : "android::nn::ConstantMemoryBuilder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn21ConstantMemoryBuilderE",
   "self_type" : "_ZTIN7android2nn21ConstantMemoryBuilderE",
   "size" : 40,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/SharedMemory.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "allowOmittedOperand",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "allowZeroSizedInput",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn21OperationRegistration4FlagE",
   "name" : "android::nn::OperationRegistration::Flag",
   "referenced_type" : "_ZTIN7android2nn21OperationRegistration4FlagE",
   "self_type" : "_ZTIN7android2nn21OperationRegistration4FlagE",
   "size" : 2,
   "source_file" : "packages/modules/NeuralNetworks/common/include/OperationResolver.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN7android2nn13OperationTypeE"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "validate",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18functionIFN7android4base8expectedINS1_2nn7VersionENS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEPKNS4_27IOperationValidationContextEEEE"
    },
    {
     "field_name" : "prepare",
     "field_offset" : 512,
     "referenced_type" : "_ZTINSt3__18functionIFbPN7android2nn26IOperationExecutionContextEEEE"
    },
    {
     "field_name" : "execute",
     "field_offset" : 896,
     "referenced_type" : "_ZTINSt3__18functionIFbPN7android2nn26IOperationExecutionContextEEEE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIN7android2nn21OperationRegistration4FlagE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn21OperationRegistrationE",
   "name" : "android::nn::OperationRegistration",
   "referenced_type" : "_ZTIN7android2nn21OperationRegistrationE",
   "self_type" : "_ZTIN7android2nn21OperationRegistrationE",
   "size" : 176,
   "source_file" : "packages/modules/NeuralNetworks/common/include/OperationResolver.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn18IOperationResolverE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRegistrations",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA102_PKN7android2nn21OperationRegistrationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn24BuiltinOperationResolverE",
   "name" : "android::nn::BuiltinOperationResolver",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn24BuiltinOperationResolverE",
   "self_type" : "_ZTIN7android2nn24BuiltinOperationResolverE",
   "size" : 824,
   "source_file" : "packages/modules/NeuralNetworks/common/include/OperationResolver.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android2nn24BuiltinOperationResolverE"
    },
    {
     "mangled_component_name" : "_ZNK7android2nn24BuiltinOperationResolver13findOperationENS0_13OperationTypeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android2nn24BuiltinOperationResolverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android2nn24BuiltinOperationResolverD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android2nn26IOperationExecutionContextE",
   "name" : "android::nn::IOperationExecutionContext",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn26IOperationExecutionContextE",
   "self_type" : "_ZTIN7android2nn26IOperationExecutionContextE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/OperationsUtils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android2nn26IOperationExecutionContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android2nn26IOperationExecutionContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android2nn26IOperationExecutionContextD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn26IOperationExecutionContext12getNumInputsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn26IOperationExecutionContext12getInputTypeEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn26IOperationExecutionContext13getInputShapeEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn26IOperationExecutionContext14getInputBufferEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn26IOperationExecutionContext19getInputExtraParamsEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn26IOperationExecutionContext13getNumOutputsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn26IOperationExecutionContext13getOutputTypeEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn26IOperationExecutionContext14getOutputShapeEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2nn26IOperationExecutionContext15getOutputBufferEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2nn26IOperationExecutionContext14setOutputShapeEjRKNS0_5ShapeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn26IOperationExecutionContext14isOmittedInputEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn26IOperationExecutionContext15isOmittedOutputEj"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android2nn27IOperationValidationContextE",
   "name" : "android::nn::IOperationValidationContext",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn27IOperationValidationContextE",
   "self_type" : "_ZTIN7android2nn27IOperationValidationContextE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/OperationsUtils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android2nn27IOperationValidationContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android2nn27IOperationValidationContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android2nn27IOperationValidationContextD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn27IOperationValidationContext16getOperationNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn27IOperationValidationContext12getNumInputsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn27IOperationValidationContext12getInputTypeEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn27IOperationValidationContext13getInputShapeEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn27IOperationValidationContext19getInputExtraParamsEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn27IOperationValidationContext13getNumOutputsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn27IOperationValidationContext13getOutputTypeEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android2nn27IOperationValidationContext14getOutputShapeEj"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn5Model13OperandValuesE",
   "name" : "android::nn::Model::OperandValues",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn5Model13OperandValuesE",
   "self_type" : "_ZTIN7android2nn5Model13OperandValuesE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn5Model22ExtensionNameAndPrefixE",
   "name" : "android::nn::Model::ExtensionNameAndPrefix",
   "referenced_type" : "_ZTIN7android2nn5Model22ExtensionNameAndPrefixE",
   "self_type" : "_ZTIN7android2nn5Model22ExtensionNameAndPrefixE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "operands",
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn7OperandENS_9allocatorIS3_EEEE"
    },
    {
     "field_name" : "operations",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn9OperationENS_9allocatorIS3_EEEE"
    },
    {
     "field_name" : "inputIndexes",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    },
    {
     "field_name" : "outputIndexes",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn5Model8SubgraphE",
   "name" : "android::nn::Model::Subgraph",
   "referenced_type" : "_ZTIN7android2nn5Model8SubgraphE",
   "self_type" : "_ZTIN7android2nn5Model8SubgraphE",
   "size" : 96,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "main",
     "referenced_type" : "_ZTIN7android2nn5Model8SubgraphE"
    },
    {
     "field_name" : "referenced",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn5Model8SubgraphENS_9allocatorIS4_EEEE"
    },
    {
     "field_name" : "operandValues",
     "field_offset" : 960,
     "referenced_type" : "_ZTIN7android2nn5Model13OperandValuesE"
    },
    {
     "field_name" : "pools",
     "field_offset" : 1152,
     "referenced_type" : "_ZTINSt3__16vectorINS_10shared_ptrIKN7android2nn6MemoryEEENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "relaxComputationFloat32toFloat16",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "extensionNameToPrefix",
     "field_offset" : 1408,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn5Model22ExtensionNameAndPrefixENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn5ModelE",
   "name" : "android::nn::Model",
   "referenced_type" : "_ZTIN7android2nn5ModelE",
   "self_type" : "_ZTIN7android2nn5ModelE",
   "size" : 200,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN7android2nn11OperandTypeE"
    },
    {
     "field_name" : "dimensions",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    },
    {
     "field_name" : "scale",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "offset",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "extraParams",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn5ShapeE",
   "name" : "android::nn::Shape",
   "referenced_type" : "_ZTIN7android2nn5ShapeE",
   "self_type" : "_ZTIN7android2nn5ShapeE",
   "size" : 80,
   "source_file" : "packages/modules/NeuralNetworks/common/include/OperationsUtils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds",
     "referenced_type" : "_ZTINSt3__16vectorIN7android4base14unique_fd_implINS2_13DefaultCloserEEENS_9allocatorIS5_EEEE"
    },
    {
     "field_name" : "ints",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6HandleE",
   "name" : "android::nn::Handle",
   "referenced_type" : "_ZTIN7android2nn6HandleE",
   "self_type" : "_ZTIN7android2nn6HandleE",
   "size" : 48,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handle",
     "referenced_type" : "_ZTINSt3__110unique_ptrI15AHardwareBufferPFvPS1_EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6Memory14HardwareBufferE",
   "name" : "android::nn::Memory::HardwareBuffer",
   "referenced_type" : "_ZTIN7android2nn6Memory14HardwareBufferE",
   "self_type" : "_ZTIN7android2nn6Memory14HardwareBufferE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "prot",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fd",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6Memory2FdE",
   "name" : "android::nn::Memory::Fd",
   "referenced_type" : "_ZTIN7android2nn6Memory2FdE",
   "self_type" : "_ZTIN7android2nn6Memory2FdE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6Memory6AshmemE",
   "name" : "android::nn::Memory::Ashmem",
   "referenced_type" : "_ZTIN7android2nn6Memory6AshmemE",
   "self_type" : "_ZTIN7android2nn6Memory6AshmemE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handle",
     "referenced_type" : "_ZTIN7android2nn6HandleE"
    },
    {
     "field_name" : "size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "name",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6Memory7UnknownE",
   "name" : "android::nn::Memory::Unknown",
   "referenced_type" : "_ZTIN7android2nn6Memory7UnknownE",
   "self_type" : "_ZTIN7android2nn6Memory7UnknownE",
   "size" : 80,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handle",
     "referenced_type" : "_ZTINSt3__17variantIJN7android2nn6Memory6AshmemENS3_2FdENS3_14HardwareBufferENS3_7UnknownEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6MemoryE",
   "name" : "android::nn::Memory",
   "referenced_type" : "_ZTIN7android2nn6MemoryE",
   "self_type" : "_ZTIN7android2nn6MemoryE",
   "size" : 88,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timeOnDevice",
     "referenced_type" : "_ZTINSt3__18optionalINS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEEEE"
    },
    {
     "field_name" : "timeInDriver",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18optionalINS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6TimingE",
   "name" : "android::nn::Timing",
   "referenced_type" : "_ZTIN7android2nn6TimingE",
   "self_type" : "_ZTIN7android2nn6TimingE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mArgs",
     "referenced_type" : "_ZTINSt3__15tupleIJEEE"
    },
    {
     "access" : "private",
     "field_name" : "mStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__119basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn6detail12ErrorBuilderIJEEE",
   "name" : "android::nn::detail::ErrorBuilder<>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn6detail12ErrorBuilderIJEEE",
   "self_type" : "_ZTIN7android2nn6detail12ErrorBuilderIJEEE",
   "size" : 272,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Result.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pointer",
     "referenced_type" : "_ZTINSt3__17variantIJPKvPvEEE"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "context",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__13anyE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn7MappingE",
   "name" : "android::nn::Mapping",
   "referenced_type" : "_ZTIN7android2nn7MappingE",
   "self_type" : "_ZTIN7android2nn7MappingE",
   "size" : 56,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/SharedMemory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "scales",
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "field_name" : "channelDim",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn7Operand25SymmPerChannelQuantParamsE",
   "name" : "android::nn::Operand::SymmPerChannelQuantParams",
   "referenced_type" : "_ZTIN7android2nn7Operand25SymmPerChannelQuantParamsE",
   "self_type" : "_ZTIN7android2nn7Operand25SymmPerChannelQuantParamsE",
   "size" : 32,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN7android2nn11OperandTypeE"
    },
    {
     "field_name" : "dimensions",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    },
    {
     "field_name" : "scale",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "zeroPoint",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lifetime",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android2nn7Operand8LifeTimeE"
    },
    {
     "field_name" : "location",
     "field_offset" : 384,
     "referenced_type" : "_ZTIN7android2nn12DataLocationE"
    },
    {
     "field_name" : "extraParams",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn7OperandE",
   "name" : "android::nn::Operand",
   "referenced_type" : "_ZTIN7android2nn7OperandE",
   "self_type" : "_ZTIN7android2nn7OperandE",
   "size" : 120,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lifetime",
     "referenced_type" : "_ZTIN7android2nn7Request8Argument8LifeTimeE"
    },
    {
     "field_name" : "location",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2nn12DataLocationE"
    },
    {
     "field_name" : "dimensions",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn7Request8ArgumentE",
   "name" : "android::nn::Request::Argument",
   "referenced_type" : "_ZTIN7android2nn7Request8ArgumentE",
   "self_type" : "_ZTIN7android2nn7Request8ArgumentE",
   "size" : 64,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "inputs",
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn7Request8ArgumentENS_9allocatorIS4_EEEE"
    },
    {
     "field_name" : "outputs",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn7Request8ArgumentENS_9allocatorIS4_EEEE"
    },
    {
     "field_name" : "pools",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorINS_7variantIJNS_10shared_ptrIKN7android2nn6MemoryEEENS4_7Request17MemoryDomainTokenENS2_IKNS4_7IBufferEEEEEENS_9allocatorISD_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn7RequestE",
   "name" : "android::nn::Request",
   "referenced_type" : "_ZTIN7android2nn7RequestE",
   "self_type" : "_ZTIN7android2nn7RequestE",
   "size" : 72,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "isTensor",
     "field_offset" : 16,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "byteSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn9Extension22OperandTypeInformationE",
   "name" : "android::nn::Extension::OperandTypeInformation",
   "referenced_type" : "_ZTIN7android2nn9Extension22OperandTypeInformationE",
   "self_type" : "_ZTIN7android2nn9Extension22OperandTypeInformationE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "operandTypes",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2nn9Extension22OperandTypeInformationENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn9ExtensionE",
   "name" : "android::nn::Extension",
   "referenced_type" : "_ZTIN7android2nn9ExtensionE",
   "self_type" : "_ZTIN7android2nn9ExtensionE",
   "size" : 48,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN7android2nn13OperationTypeE"
    },
    {
     "field_name" : "inputs",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    },
    {
     "field_name" : "outputs",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn9OperationE",
   "name" : "android::nn::Operation",
   "referenced_type" : "_ZTIN7android2nn9OperationE",
   "self_type" : "_ZTIN7android2nn9OperationE",
   "size" : 56,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSyncFence",
     "referenced_type" : "_ZTINSt3__110shared_ptrIKN7android2nn6HandleEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2nn9SyncFenceE",
   "name" : "android::nn::SyncFence",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2nn9SyncFenceE",
   "self_type" : "_ZTIN7android2nn9SyncFenceE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/include/nnapi/Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogMessageE",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogMessageE",
   "self_type" : "_ZTIN7android4base10LogMessageE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "_ZTIN7android4base5LogIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogdLoggerE",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogdLoggerE",
   "self_type" : "_ZTIN7android4base10LogdLoggerE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "base_",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "offset_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10MappedFileE",
   "name" : "android::base::MappedFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10MappedFileE",
   "self_type" : "_ZTIN7android4base10MappedFileE",
   "size" : 24,
   "source_file" : "system/libbase/include/android-base/mapped_file.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10boot_clockE",
   "name" : "android::base::boot_clock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10boot_clockE",
   "self_type" : "_ZTIN7android4base10boot_clockE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/chrono_utils.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesINS_2nn11OperandTypeES4_EE",
   "name" : "android::base::log_detail::StorageTypes<android::nn::OperandType, android::nn::OperandType>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesINS_2nn11OperandTypeES4_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesINS_2nn11OperandTypeES4_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIN7android2nn11OperandTypeE", "_ZTIN7android2nn11OperandTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesINS_2nn7Operand8LifeTimeES5_EE",
   "name" : "android::base::log_detail::StorageTypes<android::nn::Operand::LifeTime, android::nn::Operand::LifeTime>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesINS_2nn7Operand8LifeTimeES5_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesINS_2nn7Operand8LifeTimeES5_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN7android2nn7Operand8LifeTimeE",
    "_ZTIN7android2nn7Operand8LifeTimeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEESD_EE",
   "name" : "android::base::log_detail::StorageTypes<std::variant<monostate, SymmPerChannelQuantParams, vector<unsigned char, allocator<unsigned char>>>, std::variant<monostate, SymmPerChannelQuantParams, vector<unsigned char, allocator<unsigned char>>>>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEESD_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEESD_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTINSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE",
    "_ZTINSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIbbEE",
   "name" : "android::base::log_detail::StorageTypes<bool, bool>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIbbEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIbbEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIb", "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIffEE",
   "name" : "android::base::log_detail::StorageTypes<float, float>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIffEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIffEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIf", "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIiiEE",
   "name" : "android::base::log_detail::StorageTypes<int, int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIiiEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIiiEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIi", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIjjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned int, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIjjEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIjjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIjmEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned int, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIjmEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIjmEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned long, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned long, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIxiEE",
   "name" : "android::base::log_detail::StorageTypes<long long, int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIxiEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIxiEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIx", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerINS_2nn11OperandTypeEEE",
   "name" : "android::base::log_detail::IsCharPointer<android::nn::OperandType>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerINS_2nn11OperandTypeEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerINS_2nn11OperandTypeEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIN7android2nn11OperandTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerINS_2nn7Operand8LifeTimeEEE",
   "name" : "android::base::log_detail::IsCharPointer<android::nn::Operand::LifeTime>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerINS_2nn7Operand8LifeTimeEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerINS_2nn7Operand8LifeTimeEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIN7android2nn7Operand8LifeTimeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEEEE",
   "name" : "android::base::log_detail::IsCharPointer<std::variant<monostate, SymmPerChannelQuantParams, vector<unsigned char, allocator<unsigned char>>>>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTINSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIbEE",
   "name" : "android::base::log_detail::IsCharPointer<bool>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIbEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIbEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIfEE",
   "name" : "android::base::log_detail::IsCharPointer<float>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIfEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIfEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIiEE",
   "name" : "android::base::log_detail::IsCharPointer<int>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIiEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIiEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIxEE",
   "name" : "android::base::log_detail::IsCharPointer<long long>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIxEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIxEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageINS_2nn11OperandTypeEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageINS_2nn11OperandTypeEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorINS_2nn11OperandTypeES4_EE",
   "name" : "android::base::log_detail::EagerEvaluator<android::nn::OperandType, android::nn::OperandType>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorINS_2nn11OperandTypeES4_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorINS_2nn11OperandTypeES4_EE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIN7android2nn11OperandTypeE", "_ZTIN7android2nn11OperandTypeE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageINS_2nn7Operand8LifeTimeEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageINS_2nn7Operand8LifeTimeEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorINS_2nn7Operand8LifeTimeES5_EE",
   "name" : "android::base::log_detail::EagerEvaluator<android::nn::Operand::LifeTime, android::nn::Operand::LifeTime>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorINS_2nn7Operand8LifeTimeES5_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorINS_2nn7Operand8LifeTimeES5_EE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN7android2nn7Operand8LifeTimeE",
    "_ZTIN7android2nn7Operand8LifeTimeE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 320,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEESD_EE",
   "name" : "android::base::log_detail::EagerEvaluator<std::variant<monostate, SymmPerChannelQuantParams, vector<unsigned char, allocator<unsigned char>>>, std::variant<monostate, SymmPerChannelQuantParams, vector<unsigned char, allocator<unsigned char>>>>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEESD_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEESD_EE",
   "size" : 80,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTINSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE",
    "_ZTINSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIbEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 8,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIbbEE",
   "name" : "android::base::log_detail::EagerEvaluator<bool, bool>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIbbEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIbbEE",
   "size" : 2,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIb", "_ZTIb" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIfEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIfEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIffEE",
   "name" : "android::base::log_detail::EagerEvaluator<float, float>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIffEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIffEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIf", "_ZTIf" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIiEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIiiEE",
   "name" : "android::base::log_detail::EagerEvaluator<int, int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIiiEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIiiEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIi", "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned int, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjjEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjjEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjmEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned int, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjmEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjmEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned long, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned long, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIxEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIxiEE",
   "name" : "android::base::log_detail::EagerEvaluator<long long, int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIxiEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIxiEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIx", "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIN7android2nn11OperandTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageINS_2nn11OperandTypeEEE",
   "name" : "android::base::log_detail::Storage<android::nn::OperandType>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageINS_2nn11OperandTypeEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageINS_2nn11OperandTypeEEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIN7android2nn11OperandTypeE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIN7android2nn7Operand8LifeTimeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageINS_2nn7Operand8LifeTimeEEE",
   "name" : "android::base::log_detail::Storage<android::nn::Operand::LifeTime>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageINS_2nn7Operand8LifeTimeEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageINS_2nn7Operand8LifeTimeEEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIN7android2nn7Operand8LifeTimeE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTINSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEEEE",
   "name" : "android::base::log_detail::Storage<std::variant<monostate, SymmPerChannelQuantParams, vector<unsigned char, allocator<unsigned char>>>>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageINSt3__17variantIJNS3_9monostateENS_2nn7Operand25SymmPerChannelQuantParamsENS3_6vectorIhNS3_9allocatorIhEEEEEEEEE",
   "size" : 40,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTINSt3__17variantIJNS_9monostateEN7android2nn7Operand25SymmPerChannelQuantParamsENS_6vectorIhNS_9allocatorIhEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIbEE",
   "name" : "android::base::log_detail::Storage<bool>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIbEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIbEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIfEE",
   "name" : "android::base::log_detail::Storage<float>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIfEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIfEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
