{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" : [],
 "functions" :
 [
  {
   "function_name" : "android::hardware::neuralnetworks::V1_1::utils::getDevice",
   "linker_set_key" : "_ZN7android8hardware14neuralnetworks4V1_15utils9getDeviceERKNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIRKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "return_type" : "_ZTIN7android4base8expectedINSt3__110shared_ptrIKNS_2nn7IDeviceEEENS4_12GeneralErrorEEE",
   "source_file" : "hardware/interfaces/neuralnetworks/1.1/utils/include/nnapi/hal/1.1/Service.h"
  },
  {
   "function_name" : "android::hardware::neuralnetworks::utils::DeathHandler::DeathHandler",
   "linker_set_key" : "_ZN7android8hardware14neuralnetworks5utils12DeathHandlerC1EOS3_",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPN7android8hardware14neuralnetworks5utils12DeathHandlerE"
    },
    {
     "referenced_type" : "_ZTION7android8hardware14neuralnetworks5utils12DeathHandlerE"
    }

   "source_file" : "hardware/interfaces/neuralnetworks/1.1/utils/include/nnapi/hal/1.1/Service.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIRN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "name" : "android::hardware::neuralnetworks::utils::IProtectedCallback &",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "self_type" : "_ZTIRN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  }
 ],
 "pointer_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "android::hardware::neuralnetworks::utils::DeathHandler *",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIPN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "name" : "android::hardware::neuralnetworks::utils::IProtectedCallback *",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "self_type" : "_ZTIPN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2nn12CapabilitiesE",
   "name" : "const android::nn::Capabilities",
   "referenced_type" : "_ZTIN7android2nn12CapabilitiesE",
   "self_type" : "_ZTIKN7android2nn12CapabilitiesE",
   "size" : 56,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ResilientDevice.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2spINS_8hardware14neuralnetworks4V1_17IDeviceEEE",
   "name" : "const android::sp<android::hardware::neuralnetworks::V1_1::IDevice>",
   "referenced_type" : "_ZTIN7android2spINS_8hardware14neuralnetworks4V1_17IDeviceEEE",
   "self_type" : "_ZTIKN7android2spINS_8hardware14neuralnetworks4V1_17IDeviceEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/1.1/utils/include/nnapi/hal/1.1/Device.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "const android::hardware::neuralnetworks::utils::DeathHandler",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIKN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/1.1/utils/include/nnapi/hal/1.1/Device.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "name" : "const android::hardware::neuralnetworks::utils::IProtectedCallback",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "self_type" : "_ZTIKN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/1.1/utils/include/nnapi/hal/1.1/Service.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE",
   "name" : "const std::vector<android::nn::Extension, std::allocator<android::nn::Extension>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ResilientDevice.h"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18functionIFN7android4base8expectedINS_10shared_ptrIKNS1_2nn7IDeviceEEENS5_12GeneralErrorEEEbEEE",
   "name" : "const std::function<expected<shared_ptr<const IDevice>, GeneralError> (bool)>",
   "referenced_type" : "_ZTINSt3__18functionIFN7android4base8expectedINS_10shared_ptrIKNS1_2nn7IDeviceEEENS5_12GeneralErrorEEEbEEE",
   "self_type" : "_ZTIKNSt3__18functionIFN7android4base8expectedINS_10shared_ptrIKNS1_2nn7IDeviceEEENS5_12GeneralErrorEEEbEEE",
   "size" : 48,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ResilientDevice.h"
  }
 ],
 "record_types" :
 [
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_15utils6Device21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_1::utils::Device::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_15utils6Device21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_15utils6Device21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.1/utils/include/nnapi/hal/1.1/Device.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn7IDeviceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kName",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "kVersionString",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "kExtensions",
     "field_offset" : 448,
     "referenced_type" : "_ZTIKNSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "kCapabilities",
     "field_offset" : 640,
     "referenced_type" : "_ZTIKN7android2nn12CapabilitiesE"
    },
    {
     "access" : "private",
     "field_name" : "kDevice",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIKN7android2spINS_8hardware14neuralnetworks4V1_17IDeviceEEE"
    },
    {
     "access" : "private",
     "field_name" : "kDeathHandler",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIKN7android8hardware14neuralnetworks5utils12DeathHandlerE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_15utils6DeviceE",
   "name" : "android::hardware::neuralnetworks::V1_1::utils::Device",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_15utils6DeviceE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_15utils6DeviceE",
   "size" : 160,
   "source_file" : "hardware/interfaces/neuralnetworks/1.1/utils/include/nnapi/hal/1.1/Device.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_15utils6DeviceE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device7getNameEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device16getVersionStringEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device15getFeatureLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device7getTypeEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device22getSupportedExtensionsEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device15getCapabilitiesEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device27getNumberOfCacheFilesNeededEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device4waitEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device22getSupportedOperationsERKNS_2nn5ModelE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device12prepareModelERKNS_2nn5ModelENS5_19ExecutionPreferenceENS5_8PriorityENSt3__18optionalINSB_6chrono10time_pointINS_4base10boot_clockENSD_8durationIxNSB_5ratioILl1ELl1000000000EEEEEEEEERKNSB_6vectorINSB_10shared_ptrIKNS5_6HandleEEENSB_9allocatorISR_EEEESW_RKNSB_5arrayIhLm32EEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device21prepareModelFromCacheENSt3__18optionalINS5_6chrono10time_pointINS_4base10boot_clockENS7_8durationIxNS5_5ratioILl1ELl1000000000EEEEEEEEERKNS5_6vectorINS5_10shared_ptrIKNS_2nn6HandleEEENS5_9allocatorISM_EEEESR_RKNS5_5arrayIhLm32EEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_15utils6Device8allocateERKNS_2nn10BufferDescERKNSt3__16vectorINS9_10shared_ptrIKNS5_14IPreparedModelEEENS9_9allocatorISE_EEEERKNSA_INS5_10BufferRoleENSF_ISK_EEEESO_"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_15utils6DeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_15utils6DeviceD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mObject",
     "referenced_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "access" : "private",
     "field_name" : "mDeathRecipient",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2spINS_8hardware14neuralnetworks5utils14DeathRecipientEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "android::hardware::neuralnetworks::utils::DeathHandler",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware20hidl_death_recipientE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mIsDeadObject",
     "field_offset" : 384,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__16vectorIPN7android8hardware14neuralnetworks5utils18IProtectedCallbackENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "name" : "android::hardware::neuralnetworks::utils::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "size" : 96,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h",
   "vtable_components" :
   [
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipient11serviceDiedEmRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -80,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -80,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware14neuralnetworks5utils14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware14neuralnetworks5utils14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils15ResilientDevice21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::utils::ResilientDevice::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils15ResilientDevice21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils15ResilientDevice21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ResilientDevice.h"
  },
  {
   "alignment" : 16,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn7IDeviceE"
    },
    {
     "referenced_type" : "_ZTINSt3__123enable_shared_from_thisIN7android8hardware14neuralnetworks5utils15ResilientDeviceEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kMakeDevice",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKNSt3__18functionIFN7android4base8expectedINS_10shared_ptrIKNS1_2nn7IDeviceEEENS5_12GeneralErrorEEEbEEE"
    },
    {
     "access" : "private",
     "field_name" : "kName",
     "field_offset" : 640,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "kVersionString",
     "field_offset" : 832,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "kExtensions",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIKNSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "kCapabilities",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIKN7android2nn12CapabilitiesE"
    },
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 1664,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mDevice",
     "field_offset" : 1984,
     "referenced_type" : "_ZTINSt3__110shared_ptrIKN7android2nn7IDeviceEEE"
    },
    {
     "access" : "private",
     "field_name" : "mIsValid",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils15ResilientDeviceE",
   "name" : "android::hardware::neuralnetworks::utils::ResilientDevice",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils15ResilientDeviceE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils15ResilientDeviceE",
   "size" : 272,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ResilientDevice.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils15ResilientDeviceE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice7getNameEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice16getVersionStringEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice15getFeatureLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice7getTypeEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice22getSupportedExtensionsEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice15getCapabilitiesEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice27getNumberOfCacheFilesNeededEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice4waitEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice22getSupportedOperationsERKNS_2nn5ModelE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice12prepareModelERKNS_2nn5ModelENS4_19ExecutionPreferenceENS4_8PriorityENSt3__18optionalINSA_6chrono10time_pointINS_4base10boot_clockENSC_8durationIxNSA_5ratioILl1ELl1000000000EEEEEEEEERKNSA_6vectorINSA_10shared_ptrIKNS4_6HandleEEENSA_9allocatorISQ_EEEESV_RKNSA_5arrayIhLm32EEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice21prepareModelFromCacheENSt3__18optionalINS4_6chrono10time_pointINS_4base10boot_clockENS6_8durationIxNS4_5ratioILl1ELl1000000000EEEEEEEEERKNS4_6vectorINS4_10shared_ptrIKNS_2nn6HandleEEENS4_9allocatorISL_EEEESQ_RKNS4_5arrayIhLm32EEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks5utils15ResilientDevice8allocateERKNS_2nn10BufferDescERKNSt3__16vectorINS8_10shared_ptrIKNS4_14IPreparedModelEEENS8_9allocatorISD_EEEERKNS9_INS4_10BufferRoleENSE_ISJ_EEEESN_"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils15ResilientDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils15ResilientDeviceD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "input",
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS4_14RelocationInfoIPKvEEEENS_14default_deleteISA_EEEE"
    },
    {
     "field_name" : "output",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS4_14RelocationInfoIPvEEEENS_14default_deleteIS9_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "name" : "android::hardware::neuralnetworks::utils::RequestRelocation",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "name" : "android::hardware::neuralnetworks::utils::IProtectedCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallback18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallbackD0Ev"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "android::hardware::neuralnetworks::utils::DeathHandler &&",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTION7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "name" : "android::hardware::neuralnetworks::utils::IProtectedCallback &&",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "self_type" : "_ZTION7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  }
 ]
}
