#ifndef HIDL_GENERATED_ANDROID_HARDWARE_BROADCASTRADIO_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_BROADCASTRADIO_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace broadcastradio {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class Result : int32_t;
enum class Class : uint32_t;
enum class Band : uint32_t;
enum class Rds : uint32_t;
enum class Deemphasis : uint32_t;
enum class Direction : uint32_t;
struct FmBandConfig;
struct AmBandConfig;
struct BandConfig;
struct Properties;
enum class MetadataType : int32_t;
enum class MetadataKey : int32_t;
struct MetaDataClock;
struct MetaData;
struct ProgramInfo;

enum class Result : int32_t {
    OK = 0,
    NOT_INITIALIZED = 1 /* ::android::hardware::broadcastradio::V1_0::Result.OK implicitly + 1 */,
    INVALID_ARGUMENTS = 2 /* ::android::hardware::broadcastradio::V1_0::Result.NOT_INITIALIZED implicitly + 1 */,
    INVALID_STATE = 3 /* ::android::hardware::broadcastradio::V1_0::Result.INVALID_ARGUMENTS implicitly + 1 */,
    TIMEOUT = 4 /* ::android::hardware::broadcastradio::V1_0::Result.INVALID_STATE implicitly + 1 */,
};

/**
 * Radio hardware module class. A given radio hardware module HAL is of one
 * class only. The platform can not have more than one hardware module of
 * each class. Current version of the framework only supports RADIO_CLASS_AM_FM.
 */
enum class Class : uint32_t {
    /**
     * FM (including HD radio) and AM
     */
    AM_FM = 0u,
    /**
     * Satellite Radio
     */
    SAT = 1u,
    /**
     * Digital Radio (DAB)
     */
    DT = 2u,
};

/**
 * value for field "type" of radio band described in struct radio_hal_band_config
 */
enum class Band : uint32_t {
    /**
     * Amplitude Modulation band: LW, MW, SW
     */
    AM = 0u,
    /**
     * Frequency Modulation band: FM
     */
    FM = 1u,
    /**
     * FM HD Radio / DRM (IBOC)
     */
    FM_HD = 2u,
    /**
     * AM HD Radio / DRM (IBOC)
     */
    AM_HD = 3u,
};

/**
 * RDS variant implemented. A struct FmBandConfig can list none or several.
 */
enum class Rds : uint32_t {
    NONE = 0u,
    WORLD = 1u /* (1 << 0) */,
    US = 2u /* (1 << 1) */,
};

/*
 * FM deemphasis variant implemented.
 * A struct FmBandConfig can list one or more.
 */
enum class Deemphasis : uint32_t {
    D50 = 1u /* (1 << 0) */,
    D75 = 2u /* (1 << 1) */,
};

/**
 * Scanning direction for scan() and step() tuner APIs
 */
enum class Direction : uint32_t {
    UP = 0u,
    DOWN = 1u /* ::android::hardware::broadcastradio::V1_0::Direction.UP implicitly + 1 */,
};

/**
 * Unique handle allocated to a radio module
 */
typedef uint32_t Handle;

/**
 * Additional attributes for an FM band configuration
 */
struct FmBandConfig final {
    /**
     * deemphasis variant
     */
    ::android::hardware::broadcastradio::V1_0::Deemphasis deemphasis __attribute__ ((aligned(4)));
    /**
     * stereo supported
     */
    bool stereo __attribute__ ((aligned(1)));
    /**
     * RDS variants supported
     */
    ::android::hardware::broadcastradio::V1_0::Rds rds __attribute__ ((aligned(4)));
    /**
     * Traffic Announcement supported
     */
    bool ta __attribute__ ((aligned(1)));
    /**
     * Alternate Frequency supported
     */
    bool af __attribute__ ((aligned(1)));
    /**
     * Emergency announcements supported
     */
    bool ea __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::broadcastradio::V1_0::FmBandConfig, deemphasis) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::FmBandConfig, stereo) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::FmBandConfig, rds) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::FmBandConfig, ta) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::FmBandConfig, af) == 13, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::FmBandConfig, ea) == 14, "wrong offset");
static_assert(sizeof(::android::hardware::broadcastradio::V1_0::FmBandConfig) == 16, "wrong size");
static_assert(__alignof(::android::hardware::broadcastradio::V1_0::FmBandConfig) == 4, "wrong alignment");

/**
 * Additional attributes for an AM band configuration
 */
struct AmBandConfig final {
    /**
     * Stereo supported
     */
    bool stereo __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::broadcastradio::V1_0::AmBandConfig, stereo) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::broadcastradio::V1_0::AmBandConfig) == 1, "wrong size");
static_assert(__alignof(::android::hardware::broadcastradio::V1_0::AmBandConfig) == 1, "wrong alignment");

/*
 * Radio band configuration. Describes a given band supported by the radio
 * module. The HAL can expose only one band per type with the the maximum range
 * supported and all options. The framework will derive the actual regions were
 * this module can operate and expose separate band configurations for
 * applications to chose from.
 */
struct BandConfig final {
    // Forward declaration for forward reference support:
    union Ext;

    union Ext final {
        ::android::hardware::broadcastradio::V1_0::FmBandConfig fm __attribute__ ((aligned(4)));
        ::android::hardware::broadcastradio::V1_0::AmBandConfig am __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::broadcastradio::V1_0::BandConfig::Ext, fm) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::broadcastradio::V1_0::BandConfig::Ext, am) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::broadcastradio::V1_0::BandConfig::Ext) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::broadcastradio::V1_0::BandConfig::Ext) == 4, "wrong alignment");

    ::android::hardware::broadcastradio::V1_0::Band type __attribute__ ((aligned(4)));
    bool antennaConnected __attribute__ ((aligned(1)));
    uint32_t lowerLimit __attribute__ ((aligned(4)));
    uint32_t upperLimit __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint32_t> spacings __attribute__ ((aligned(8)));
    ::android::hardware::broadcastradio::V1_0::BandConfig::Ext ext __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::broadcastradio::V1_0::BandConfig, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::BandConfig, antennaConnected) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::BandConfig, lowerLimit) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::BandConfig, upperLimit) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::BandConfig, spacings) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::BandConfig, ext) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::broadcastradio::V1_0::BandConfig) == 48, "wrong size");
static_assert(__alignof(::android::hardware::broadcastradio::V1_0::BandConfig) == 8, "wrong alignment");

/*
 * Exposes properties of a given hardware radio module.
 * NOTE: current framework implementation supports only one audio source
 * (num_audio_sources = 1). The source corresponds to AUDIO_DEVICE_IN_FM_TUNER.
 * If more than one tuner is supported (num_tuners > 1), only one can be
 * connected to the audio source.
 */
struct Properties final {
    /**
     * Class of this module. E.g AM_FM
     */
    ::android::hardware::broadcastradio::V1_0::Class classId __attribute__ ((aligned(4)));
    /**
     * implementor name
     */
    ::android::hardware::hidl_string implementor __attribute__ ((aligned(8)));
    /**
     * product name
     */
    ::android::hardware::hidl_string product __attribute__ ((aligned(8)));
    /**
     * product version
     */
    ::android::hardware::hidl_string version __attribute__ ((aligned(8)));
    /**
     * serial number (for subscription services)
     */
    ::android::hardware::hidl_string serial __attribute__ ((aligned(8)));
    /**
     * number of tuners controllable independently
     */
    uint32_t numTuners __attribute__ ((aligned(4)));
    /**
     * number of audio sources driven simultaneously
     */
    uint32_t numAudioSources __attribute__ ((aligned(4)));
    /**
     * the hardware supports capture of audio source from audio HAL
     */
    bool supportsCapture __attribute__ ((aligned(1)));
    /**
     * band descriptors
     */
    ::android::hardware::hidl_vec<::android::hardware::broadcastradio::V1_0::BandConfig> bands __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::broadcastradio::V1_0::Properties, classId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::Properties, implementor) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::Properties, product) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::Properties, version) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::Properties, serial) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::Properties, numTuners) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::Properties, numAudioSources) == 76, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::Properties, supportsCapture) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::Properties, bands) == 88, "wrong offset");
static_assert(sizeof(::android::hardware::broadcastradio::V1_0::Properties) == 104, "wrong size");
static_assert(__alignof(::android::hardware::broadcastradio::V1_0::Properties) == 8, "wrong alignment");

enum class MetadataType : int32_t {
    INVALID = -1 /* -1 */,
    /**
     * Signed 32 bit integer
     */
    INT = 0,
    /**
     * String
     */
    TEXT = 1,
    /**
     * Raw binary data (icon or art).
     *
     * The data should be a valid PNG, JPEG, GIF or BMP file.
     * Invalid format must be handled gracefully as if the field was missing.
     */
    RAW = 2,
    /**
     * clock data, see MetaDataClock
     */
    CLOCK = 3,
};

enum class MetadataKey : int32_t {
    INVALID = -1 /* -1 */,
    /**
     * RDS PI                 - int32_t
     */
    RDS_PI = 0,
    /**
     * RDS PS                 - string
     */
    RDS_PS = 1,
    /**
     * RDS PTY                - int32_t
     */
    RDS_PTY = 2,
    /**
     * RBDS PTY               - int32_t
     */
    RBDS_PTY = 3,
    /**
     * RDS RT                 - string
     */
    RDS_RT = 4,
    /**
     * Song title             - string
     */
    TITLE = 5,
    /**
     * Artist name            - string
     */
    ARTIST = 6,
    /**
     * Album name             - string
     */
    ALBUM = 7,
    /**
     * Musical genre          - string
     */
    GENRE = 8,
    /**
     * Station icon           - raw (int32_t for HAL 1.1)
     */
    ICON = 9,
    /**
     * Album art              - raw (int32_t for HAL 1.1)
     */
    ART = 10,
    /**
     * Clock                  - MetaDataClock
     */
    CLOCK = 11,
};

struct MetaDataClock final {
    /**
     * Seconds since epoch at GMT + 0.
     */
    uint64_t utcSecondsSinceEpoch __attribute__ ((aligned(8)));
    /**
     * Minutes offset from the GMT.
     */
    int32_t timezoneOffsetInMinutes __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::broadcastradio::V1_0::MetaDataClock, utcSecondsSinceEpoch) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::MetaDataClock, timezoneOffsetInMinutes) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::broadcastradio::V1_0::MetaDataClock) == 16, "wrong size");
static_assert(__alignof(::android::hardware::broadcastradio::V1_0::MetaDataClock) == 8, "wrong alignment");

struct MetaData final {
    ::android::hardware::broadcastradio::V1_0::MetadataType type __attribute__ ((aligned(4)));
    ::android::hardware::broadcastradio::V1_0::MetadataKey key __attribute__ ((aligned(4)));
    /**
     * Value used for type MetadataType.INT
     */
    int32_t intValue __attribute__ ((aligned(4)));
    /**
     * Value used for type MetadataType.CLOCK
     */
    ::android::hardware::broadcastradio::V1_0::MetaDataClock clockValue __attribute__ ((aligned(8)));
    /**
     * Value used for type MetadataType.TEXT
     */
    ::android::hardware::hidl_string stringValue __attribute__ ((aligned(8)));
    /**
     * Value used for type MetadataType.RAW
     */
    ::android::hardware::hidl_vec<uint8_t> rawValue __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::broadcastradio::V1_0::MetaData, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::MetaData, key) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::MetaData, intValue) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::MetaData, clockValue) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::MetaData, stringValue) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::MetaData, rawValue) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::broadcastradio::V1_0::MetaData) == 64, "wrong size");
static_assert(__alignof(::android::hardware::broadcastradio::V1_0::MetaData) == 8, "wrong alignment");

/*
 * Radio program information. Returned by the HAL with event RADIO_EVENT_TUNED.
 * Contains information on currently tuned channel.
 */
struct ProgramInfo final {
    uint32_t channel __attribute__ ((aligned(4)));
    /**
     * current channel. (e.g kHz for band type AM_FM)
     */
    uint32_t subChannel __attribute__ ((aligned(4)));
    /**
     * current sub channel. (FM_HD)
     *
     *
     * Tuned to a program (not a noise). It's the same condition that would
     * stop scan operation.
     */
    bool tuned __attribute__ ((aligned(1)));
    bool stereo __attribute__ ((aligned(1)));
    /**
     * program is stereo or not
     */
    bool digital __attribute__ ((aligned(1)));
    /**
     * digital program or not (e.g HD Radio program)
     *
     *
     * Signal quality measured in 0% to 100% range.
     *
     * Despite the name, this is not a signal strength.
     * The purpose of this field is primarily informative.
     */
    uint32_t signalStrength __attribute__ ((aligned(4)));
    /**
     * Metadata: PTY, song title etc.
     */
    ::android::hardware::hidl_vec<::android::hardware::broadcastradio::V1_0::MetaData> metadata __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::broadcastradio::V1_0::ProgramInfo, channel) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::ProgramInfo, subChannel) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::ProgramInfo, tuned) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::ProgramInfo, stereo) == 9, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::ProgramInfo, digital) == 10, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::ProgramInfo, signalStrength) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::broadcastradio::V1_0::ProgramInfo, metadata) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::broadcastradio::V1_0::ProgramInfo) == 32, "wrong size");
static_assert(__alignof(::android::hardware::broadcastradio::V1_0::ProgramInfo) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::broadcastradio::V1_0::Result o);
static inline void PrintTo(::android::hardware::broadcastradio::V1_0::Result o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::broadcastradio::V1_0::Result lhs, const ::android::hardware::broadcastradio::V1_0::Result rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::broadcastradio::V1_0::Result rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::broadcastradio::V1_0::Result lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
