{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA12_i",
   "name" : "int [12]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA12_i",
   "size" : 48,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA14_i",
   "name" : "int [14]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA14_i",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_c",
   "name" : "char [16]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA16_c",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA16_m",
   "name" : "unsigned long [16]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA16_m",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_m",
   "name" : "unsigned long [1]",

   "source_file" : "external/libcxx/include/initializer_list"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt16nested_exception",
   "name" : "const std::nested_exception",
   "referenced_type" : "_ZTISt16nested_exception",
   "self_type" : "_ZTIKSt16nested_exception",
   "size" : 16,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "_ZTISt9nothrow_t",
   "self_type" : "_ZTIKSt9nothrow_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "self_type" : "_ZTIKSt9type_info",
   "size" : 16,
   "source_file" : "external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/cppmath.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/cppmath.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/libcxx/include/algorithm"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/libcxx/include/wchar.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTIVNSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_mPKvE",
   "name" : "void *(*volatile)(void *, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvS_mPKvE",
   "self_type" : "_ZTIVPFPvS_mPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmPKvE",
   "name" : "void *(*volatile)(unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmPKvE",
   "self_type" : "_ZTIVPFPvmPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmmPKvE",
   "name" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmmPKvE",
   "self_type" : "_ZTIVPFPvmmPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA31_y"
    },
    {
     "field_name" : "sp",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIA4096_h"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 4384,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "esr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI11esr_context",
   "name" : "esr_context",
   "referenced_type" : "_ZTI11esr_context",
   "self_type" : "_ZTI11esr_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "vl",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA3_t"
    }
   ],
   "linker_set_key" : "_ZTI11sve_context",
   "name" : "sve_context",
   "referenced_type" : "_ZTI11sve_context",
   "self_type" : "_ZTI11sve_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12_aarch64_ctx",
   "name" : "_aarch64_ctx",
   "referenced_type" : "_ZTI12_aarch64_ctx",
   "self_type" : "_ZTI12_aarch64_ctx",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "datap",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI13extra_context",
   "name" : "extra_context",
   "referenced_type" : "_ZTI13extra_context",
   "self_type" : "_ZTI13extra_context",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vregs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA32_o"
    }
   ],
   "linker_set_key" : "_ZTI14fpsimd_context",
   "name" : "fpsimd_context",
   "referenced_type" : "_ZTI14fpsimd_context",
   "self_type" : "_ZTI14fpsimd_context",
   "size" : 528,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA12_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 48,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA14_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTIA31_m"
    },
    {
     "field_name" : "sp",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI16user_regs_struct",
   "name" : "user_regs_struct",
   "referenced_type" : "_ZTI16user_regs_struct",
   "self_type" : "_ZTI16user_regs_struct",
   "size" : 272,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA4_l"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "vregs",
     "referenced_type" : "_ZTIA32_o"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18user_fpsimd_struct",
   "name" : "user_fpsimd_struct",
   "referenced_type" : "_ZTI18user_fpsimd_struct",
   "self_type" : "_ZTI18user_fpsimd_struct",
   "size" : 528,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 56,
   "source_file" : "bionic/libc/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 80,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI8sigset_t",
   "name" : "sigset_t",
   "referenced_type" : "_ZTI8sigset_t",
   "self_type" : "_ZTI8sigset_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_offset" : 320,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI10sigcontext"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 4560,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt0_E",
   "self_type" : "_ZTIN10__sifieldsUt0_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt1_E",
   "self_type" : "_ZTIN10__sifieldsUt1_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt2_E",
   "self_type" : "_ZTIN10__sifieldsUt2_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_E",
   "self_type" : "_ZTIN10__sifieldsUt3_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt4_E",
   "self_type" : "_ZTIN10__sifieldsUt4_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt5_E",
   "self_type" : "_ZTIN10__sifieldsUt5_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:79:22)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding_type",
     "referenced_type" : "_ZTIN6tflite11PaddingTypeE"
    },
    {
     "field_name" : "padding_values",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN6tflite13PaddingValuesE"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 80,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 96,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "dilation_width_factor",
     "field_offset" : 112,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "dilation_height_factor",
     "field_offset" : 128,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "input_offset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "weights_offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 384,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 416,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10ConvParamsE",
   "name" : "tflite::ConvParams",
   "referenced_type" : "_ZTIN6tflite10ConvParamsE",
   "self_type" : "_ZTIN6tflite10ConvParamsE",
   "size" : 56,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "axis_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "axis",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA4_s"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10MeanParamsE",
   "name" : "tflite::MeanParams",
   "referenced_type" : "_ZTIN6tflite10MeanParamsE",
   "self_type" : "_ZTIN6tflite10MeanParamsE",
   "size" : 10,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "axis",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "input_zeropoint",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKi"
    },
    {
     "field_name" : "input_scale",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKf"
    },
    {
     "field_name" : "inputs_count",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "output_zeropoint",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_scale",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10PackParamsE",
   "name" : "tflite::PackParams",
   "referenced_type" : "_ZTIN6tflite10PackParamsE",
   "self_type" : "_ZTIN6tflite10PackParamsE",
   "size" : 40,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTIN6tflite27FusedActivationFunctionTypeE"
    },
    {
     "field_name" : "padding_type",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN6tflite11PaddingTypeE"
    },
    {
     "field_name" : "padding_values",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN6tflite13PaddingValuesE"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "filter_height",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "filter_width",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 320,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10PoolParamsE",
   "name" : "tflite::PoolParams",
   "referenced_type" : "_ZTIN6tflite10PoolParamsE",
   "self_type" : "_ZTIN6tflite10PoolParamsE",
   "size" : 44,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6tflite16ActivationParamsE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "input_offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10ReluParamsE",
   "name" : "tflite::ReluParams",
   "referenced_type" : "_ZTIN6tflite10ReluParamsE",
   "self_type" : "_ZTIN6tflite10ReluParamsE",
   "size" : 28,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_zero_point",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_range_radius",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_multiplier",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_left_shift",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10TanhParamsE",
   "name" : "tflite::TanhParams",
   "referenced_type" : "_ZTIN6tflite10TanhParamsE",
   "self_type" : "_ZTIN6tflite10TanhParamsE",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_offset",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "alpha_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier_1",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift_1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier_2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift_2",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite11PreluParamsE",
   "name" : "tflite::PreluParams",
   "referenced_type" : "_ZTIN6tflite11PreluParamsE",
   "self_type" : "_ZTIN6tflite11PreluParamsE",
   "size" : 28,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "begin_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "begin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA5_i"
    },
    {
     "field_name" : "size_count",
     "field_offset" : 192,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "size",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA5_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite11SliceParamsE",
   "name" : "tflite::SliceParams",
   "referenced_type" : "_ZTIN6tflite11SliceParamsE",
   "self_type" : "_ZTIN6tflite11SliceParamsE",
   "size" : 48,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "num_split",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "axis",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite11SplitParamsE",
   "name" : "tflite::SplitParams",
   "referenced_type" : "_ZTIN6tflite11SplitParamsE",
   "self_type" : "_ZTIN6tflite11SplitParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding_values",
     "referenced_type" : "_ZTIN6tflite15Padding3DValuesE"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_depth",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dilation_width",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dilation_height",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dilation_depth",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 320,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite12Conv3DParamsE",
   "name" : "tflite::Conv3DParams",
   "referenced_type" : "_ZTIN6tflite12Conv3DParamsE",
   "self_type" : "_ZTIN6tflite12Conv3DParamsE",
   "size" : 44,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "axis",
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite12GatherParamsE",
   "name" : "tflite::GatherParams",
   "referenced_type" : "_ZTIN6tflite12GatherParamsE",
   "self_type" : "_ZTIN6tflite12GatherParamsE",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "size_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN6tflite12RuntimeShapeUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite12RuntimeShapeE",
   "name" : "tflite::RuntimeShape",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6tflite12RuntimeShapeE",
   "self_type" : "_ZTIN6tflite12RuntimeShapeE",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dims_",
     "referenced_type" : "_ZTIA5_i"
    },
    {
     "field_name" : "dims_pointer_",
     "referenced_type" : "_ZTIPi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN6tflite12RuntimeShapeUt_E",
   "name" : "tflite::RuntimeShape::(anonymous union at external/tensorflow/tensorflow/lite/kernels/internal/types.h:319:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN6tflite12RuntimeShapeUt_E",
   "self_type" : "_ZTIN6tflite12RuntimeShapeUt_E",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "num_split",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "axis",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite12UnpackParamsE",
   "name" : "tflite::UnpackParams",
   "referenced_type" : "_ZTIN6tflite12UnpackParamsE",
   "self_type" : "_ZTIN6tflite12UnpackParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "height",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "width_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "height_offset",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite13PaddingValuesE",
   "name" : "tflite::PaddingValues",
   "referenced_type" : "_ZTIN6tflite13PaddingValuesE",
   "self_type" : "_ZTIN6tflite13PaddingValuesE",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shape_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "shape",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite13ReshapeParamsE",
   "name" : "tflite::ReshapeParams",
   "referenced_type" : "_ZTIN6tflite13ReshapeParamsE",
   "self_type" : "_ZTIN6tflite13ReshapeParamsE",
   "size" : 20,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "beta",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "input_multiplier",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_left_shift",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reverse_scaling_divisor",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reverse_scaling_right_shift",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "diff_min",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zero_point",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "scale",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "table",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPf"
    },
    {
     "field_name" : "exp_lut",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPs"
    },
    {
     "field_name" : "one_over_one_plus_x_lut",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPs"
    },
    {
     "field_name" : "uint8_table1",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "uint8_table2",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPh"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite13SoftmaxParamsE",
   "name" : "tflite::SoftmaxParams",
   "referenced_type" : "_ZTIN6tflite13SoftmaxParamsE",
   "self_type" : "_ZTIN6tflite13SoftmaxParamsE",
   "size" : 80,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "squeeze_dims_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "squeeze_dims",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite13SqueezeParamsE",
   "name" : "tflite::SqueezeParams",
   "referenced_type" : "_ZTIN6tflite13SqueezeParamsE",
   "self_type" : "_ZTIN6tflite13SqueezeParamsE",
   "size" : 20,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_zero_point",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_range_radius",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_multiplier",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_left_shift",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite14LogisticParamsE",
   "name" : "tflite::LogisticParams",
   "referenced_type" : "_ZTIN6tflite14LogisticParamsE",
   "self_type" : "_ZTIN6tflite14LogisticParamsE",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "weights_zero_point",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "accum_multiplier",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "accum_shift",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "state_integer_bits",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite14LstmCellParamsE",
   "name" : "tflite::LstmCellParams",
   "referenced_type" : "_ZTIN6tflite14LstmCellParamsE",
   "self_type" : "_ZTIN6tflite14LstmCellParamsE",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "padding_type",
     "referenced_type" : "_ZTIN6tflite11PaddingTypeE"
    },
    {
     "field_name" : "padding_values",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN6tflite13PaddingValuesE"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 80,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 96,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "dilation_width_factor",
     "field_offset" : 112,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "dilation_height_factor",
     "field_offset" : 128,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "depth_multiplier",
     "field_offset" : 144,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "input_offset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "weights_offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 384,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 416,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "output_multiplier_per_channel",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPKi"
    },
    {
     "field_name" : "output_shift_per_channel",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPKi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15DepthwiseParamsE",
   "name" : "tflite::DepthwiseParams",
   "referenced_type" : "_ZTIN6tflite15DepthwiseParamsE",
   "self_type" : "_ZTIN6tflite15DepthwiseParamsE",
   "size" : 72,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "minmax",
     "referenced_type" : "_ZTIN6tflite6MinMaxE"
    },
    {
     "field_name" : "num_bits",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15FakeQuantParamsE",
   "name" : "tflite::FakeQuantParams",
   "referenced_type" : "_ZTIN6tflite15FakeQuantParamsE",
   "self_type" : "_ZTIN6tflite15FakeQuantParamsE",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_zero_point",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "output_zero_point",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "reluish_multiplier_fixedpoint_int16",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "reluish_multiplier_exponent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier_fixedpoint_int16",
     "field_offset" : 96,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "output_multiplier_exponent",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15HardSwishParamsE",
   "name" : "tflite::HardSwishParams",
   "referenced_type" : "_ZTIN6tflite15HardSwishParamsE",
   "self_type" : "_ZTIN6tflite15HardSwishParamsE",
   "size" : 20,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alpha",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "input_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier_alpha",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift_alpha",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier_identity",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift_identity",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15LeakyReluParamsE",
   "name" : "tflite::LeakyReluParams",
   "referenced_type" : "_ZTIN6tflite15LeakyReluParamsE",
   "self_type" : "_ZTIN6tflite15LeakyReluParamsE",
   "size" : 28,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "height",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "depth",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "width_offset",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "height_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "depth_offset",
     "field_offset" : 80,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15Padding3DValuesE",
   "name" : "tflite::Padding3DValues",
   "referenced_type" : "_ZTIN6tflite15Padding3DValuesE",
   "self_type" : "_ZTIN6tflite15Padding3DValuesE",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "perm_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "perm",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA5_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15TransposeParamsE",
   "name" : "tflite::TransposeParams",
   "referenced_type" : "_ZTIN6tflite15TransposeParamsE",
   "self_type" : "_ZTIN6tflite15TransposeParamsE",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation_type",
     "referenced_type" : "_ZTIN6tflite27FusedActivationFunctionTypeE"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite16ActivationParamsE",
   "name" : "tflite::ActivationParams",
   "referenced_type" : "_ZTIN6tflite16ActivationParamsE",
   "self_type" : "_ZTIN6tflite16ActivationParamsE",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "broadcast_category",
     "referenced_type" : "_ZTIN6tflite23BroadcastableOpCategoryE"
    },
    {
     "field_name" : "input1_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "left_shift",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input1_multiplier",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input1_shift",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_multiplier",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_shift",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 416,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 448,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "int64_activation_min",
     "field_offset" : 512,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "int64_activation_max",
     "field_offset" : 576,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "broadcast_shape",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA5_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite16ArithmeticParamsE",
   "name" : "tflite::ArithmeticParams",
   "referenced_type" : "_ZTIN6tflite16ArithmeticParamsE",
   "self_type" : "_ZTIN6tflite16ArithmeticParamsE",
   "size" : 104,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left_shift",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input1_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input1_multiplier",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input1_shift",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_multiplier",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_shift",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "is_broadcast",
     "field_offset" : 224,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite16ComparisonParamsE",
   "name" : "tflite::ComparisonParams",
   "referenced_type" : "_ZTIN6tflite16ComparisonParamsE",
   "self_type" : "_ZTIN6tflite16ComparisonParamsE",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "block_size",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite18DepthToSpaceParamsE",
   "name" : "tflite::DepthToSpaceParams",
   "referenced_type" : "_ZTIN6tflite18DepthToSpaceParamsE",
   "self_type" : "_ZTIN6tflite18DepthToSpaceParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "zero_point",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "scale",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite18QuantizationParamsE",
   "name" : "tflite::QuantizationParams",
   "referenced_type" : "_ZTIN6tflite18QuantizationParamsE",
   "self_type" : "_ZTIN6tflite18QuantizationParamsE",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "output_offset",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite18SpaceToBatchParamsE",
   "name" : "tflite::SpaceToBatchParams",
   "referenced_type" : "_ZTIN6tflite18SpaceToBatchParamsE",
   "self_type" : "_ZTIN6tflite18SpaceToBatchParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "block_size",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite18SpaceToDepthParamsE",
   "name" : "tflite::SpaceToDepthParams",
   "referenced_type" : "_ZTIN6tflite18SpaceToDepthParamsE",
   "self_type" : "_ZTIN6tflite18SpaceToDepthParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_indices_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "start_indices",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA5_i"
    },
    {
     "field_name" : "stop_indices_count",
     "field_offset" : 192,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "stop_indices",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA5_i"
    },
    {
     "field_name" : "strides_count",
     "field_offset" : 384,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "strides",
     "field_offset" : 416,
     "referenced_type" : "_ZTIA5_i"
    },
    {
     "field_name" : "begin_mask",
     "field_offset" : 576,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "ellipsis_mask",
     "field_offset" : 592,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "end_mask",
     "field_offset" : 608,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "new_axis_mask",
     "field_offset" : 624,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "shrink_axis_mask",
     "field_offset" : 640,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite18StridedSliceParamsE",
   "name" : "tflite::StridedSliceParams",
   "referenced_type" : "_ZTIN6tflite18StridedSliceParamsE",
   "self_type" : "_ZTIN6tflite18StridedSliceParamsE",
   "size" : 84,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "axis",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "input_zeropoint",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKi"
    },
    {
     "field_name" : "input_scale",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKf"
    },
    {
     "field_name" : "inputs_count",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "output_zeropoint",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_scale",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite19ConcatenationParamsE",
   "name" : "tflite::ConcatenationParams",
   "referenced_type" : "_ZTIN6tflite19ConcatenationParamsE",
   "self_type" : "_ZTIN6tflite19ConcatenationParamsE",
   "size" : 40,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "scale",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "zero_point",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite20DequantizationParamsE",
   "name" : "tflite::DequantizationParams",
   "referenced_type" : "_ZTIN6tflite20DequantizationParamsE",
   "self_type" : "_ZTIN6tflite20DequantizationParamsE",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_offset",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "weights_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 224,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "lhs_cacheable",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "rhs_cacheable",
     "field_offset" : 296,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "weights_format",
     "field_offset" : 304,
     "referenced_type" : "_ZTIN6tflite27FullyConnectedWeightsFormatE"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite20FullyConnectedParamsE",
   "name" : "tflite::FullyConnectedParams",
   "referenced_type" : "_ZTIN6tflite20FullyConnectedParamsE",
   "self_type" : "_ZTIN6tflite20FullyConnectedParamsE",
   "size" : 40,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "align_corners",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "half_pixel_centers",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite20ResizeBilinearParamsE",
   "name" : "tflite::ResizeBilinearParams",
   "referenced_type" : "_ZTIN6tflite20ResizeBilinearParamsE",
   "self_type" : "_ZTIN6tflite20ResizeBilinearParamsE",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_zero_point",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite21L2NormalizationParamsE",
   "name" : "tflite::L2NormalizationParams",
   "referenced_type" : "_ZTIN6tflite21L2NormalizationParamsE",
   "self_type" : "_ZTIN6tflite21L2NormalizationParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "align_corners",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "half_pixel_centers",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite27ResizeNearestNeighborParamsE",
   "name" : "tflite::ResizeNearestNeighborParams",
   "referenced_type" : "_ZTIN6tflite27ResizeNearestNeighborParamsE",
   "self_type" : "_ZTIN6tflite27ResizeNearestNeighborParamsE",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "scale",
     "referenced_type" : "_ZTIPKf"
    },
    {
     "field_name" : "zero_point",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKi"
    },
    {
     "field_name" : "quantized_dimension",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite30PerChannelDequantizationParamsE",
   "name" : "tflite::PerChannelDequantizationParams",
   "referenced_type" : "_ZTIN6tflite30PerChannelDequantizationParamsE",
   "self_type" : "_ZTIN6tflite30PerChannelDequantizationParamsE",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "range",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bias",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "alpha",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "beta",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite32LocalResponseNormalizationParamsE",
   "name" : "tflite::LocalResponseNormalizationParams",
   "referenced_type" : "_ZTIN6tflite32LocalResponseNormalizationParamsE",
   "self_type" : "_ZTIN6tflite32LocalResponseNormalizationParamsE",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sizes",
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "strides",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA4_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite4DimsILi4EEE",
   "name" : "tflite::Dims<4>",
   "referenced_type" : "_ZTIN6tflite4DimsILi4EEE",
   "self_type" : "_ZTIN6tflite4DimsILi4EEE",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "min",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "max",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite6MinMaxE",
   "name" : "tflite::MinMax",
   "referenced_type" : "_ZTIN6tflite6MinMaxE",
   "self_type" : "_ZTIN6tflite6MinMaxE",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left_padding_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "left_padding",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "right_padding_count",
     "field_offset" : 160,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "right_padding",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "resizing_category",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN6tflite16ResizingCategoryE"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite9PadParamsE",
   "name" : "tflite::PadParams",
   "referenced_type" : "_ZTIN6tflite9PadParamsE",
   "self_type" : "_ZTIN6tflite9PadParamsE",
   "size" : 44,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA12_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:232:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:117:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:78:20)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__110__function16__policy_storageE",
   "self_type" : "_ZTINSt3__110__function16__policy_storageE",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "referenced_type" : "_ZTINSt3__110__function8__policyE",
   "self_type" : "_ZTINSt3__110__function8__policyE",
   "size" : 32,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm0EEE",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "_ZTINSt3__110__get_pairILm0EEE",
   "self_type" : "_ZTINSt3__110__get_pairILm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm1EEE",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "_ZTINSt3__110__get_pairILm1EEE",
   "self_type" : "_ZTINSt3__110__get_pairILm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "_ZTINSt3__110__ignore_tIhEE",
   "self_type" : "_ZTINSt3__110__ignore_tIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "referenced_type" : "_ZTINSt3__110in_place_tE",
   "self_type" : "_ZTINSt3__110in_place_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110less_equalIvEE",
   "name" : "std::less_equal<void>",
   "referenced_type" : "_ZTINSt3__110less_equalIvEE",
   "self_type" : "_ZTINSt3__110less_equalIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110logical_orIvEE",
   "name" : "std::logical_or<void>",
   "referenced_type" : "_ZTINSt3__110logical_orIvEE",
   "self_type" : "_ZTINSt3__110logical_orIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110multipliesIvEE",
   "name" : "std::multiplies<void>",
   "referenced_type" : "_ZTINSt3__110multipliesIvEE",
   "self_type" : "_ZTINSt3__110multipliesIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "referenced_type" : "_ZTINSt3__110owner_lessIvEE",
   "self_type" : "_ZTINSt3__110owner_lessIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "name" : "std::tuple_size<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constImLb0EEE",
   "name" : "std::__add_const<unsigned long, false>",
   "referenced_type" : "_ZTINSt3__111__add_constImLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constImLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__type_list<__int128, std::__nat>>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__type_list<unsigned __int128, std::__nat>>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "name" : "std::add_pointer<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long> *, std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPNSt3__14pairImmEE", "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmE10_CheckArgsE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>, std::__nat>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE", "_ZTINSt3__15__natE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractImEE",
   "name" : "std::is_abstract<unsigned long>",
   "referenced_type" : "_ZTINSt3__111is_abstractImEE",
   "self_type" : "_ZTINSt3__111is_abstractImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_4pairImmEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_4pairImmEEEE",
   "name" : "std::is_function<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionImLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionImEE",
   "name" : "std::is_function<unsigned long>",
   "referenced_type" : "_ZTINSt3__111is_functionImEE",
   "self_type" : "_ZTINSt3__111is_functionImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIdEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIdEE",
   "name" : "std::is_integral<double>",
   "referenced_type" : "_ZTINSt3__111is_integralIdEE",
   "self_type" : "_ZTINSt3__111is_integralIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIeEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIeEE",
   "name" : "std::is_integral<long double>",
   "referenced_type" : "_ZTINSt3__111is_integralIeEE",
   "self_type" : "_ZTINSt3__111is_integralIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIfEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIfEE",
   "name" : "std::is_integral<float>",
   "referenced_type" : "_ZTINSt3__111is_integralIfEE",
   "self_type" : "_ZTINSt3__111is_integralIfEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIiEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIiEE",
   "name" : "std::is_integral<int>",
   "referenced_type" : "_ZTINSt3__111is_integralIiEE",
   "self_type" : "_ZTINSt3__111is_integralIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIlEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIlEE",
   "name" : "std::is_integral<long>",
   "referenced_type" : "_ZTINSt3__111is_integralIlEE",
   "self_type" : "_ZTINSt3__111is_integralIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_andIvEE",
   "name" : "std::logical_and<void>",
   "referenced_type" : "_ZTINSt3__111logical_andIvEE",
   "self_type" : "_ZTINSt3__111logical_andIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_notIvEE",
   "name" : "std::logical_not<void>",
   "referenced_type" : "_ZTINSt3__111logical_notIvEE",
   "self_type" : "_ZTINSt3__111logical_notIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__115__struct_doubleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__116__struct_double4E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIPiEE",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "_ZTINSt3__112__align_typeIPiEE",
   "self_type" : "_ZTINSt3__112__align_typeIPiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIdEE",
   "name" : "std::__align_type<double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIdEE",
   "self_type" : "_ZTINSt3__112__align_typeIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIeEE",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIeEE",
   "self_type" : "_ZTINSt3__112__align_typeIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIhEE",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "_ZTINSt3__112__align_typeIhEE",
   "self_type" : "_ZTINSt3__112__align_typeIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIjEE",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "_ZTINSt3__112__align_typeIjEE",
   "self_type" : "_ZTINSt3__112__align_typeIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeImEE",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "_ZTINSt3__112__align_typeImEE",
   "self_type" : "_ZTINSt3__112__align_typeImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeItEE",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "_ZTINSt3__112__align_typeItEE",
   "self_type" : "_ZTINSt3__112__align_typeItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIyEE",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112__align_typeIyEE",
   "self_type" : "_ZTINSt3__112__align_typeIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__destruct_nE",
   "name" : "std::__destruct_n",
   "referenced_type" : "_ZTINSt3__112__destruct_nE",
   "self_type" : "_ZTINSt3__112__destruct_nE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__second_tagE",
   "name" : "std::__second_tag",
   "referenced_type" : "_ZTINSt3__112__second_tagE",
   "self_type" : "_ZTINSt3__112__second_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRmNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<unsigned long &, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRmNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRmNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__tuple_lessILm0EEE",
   "name" : "std::__tuple_less<0>",
   "referenced_type" : "_ZTINSt3__112__tuple_lessILm0EEE",
   "self_type" : "_ZTINSt3__112__tuple_lessILm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__tuple_likeINS_4pairImmEEEE",
   "name" : "std::__tuple_like<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112__tuple_likeINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__112__tuple_likeINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "name" : "std::alignment_of<std::__struct_double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "self_type" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__115__struct_doubleE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "name" : "std::alignment_of<std::__struct_double4>",
   "referenced_type" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "self_type" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__116__struct_double4E" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIPiEE",
   "name" : "std::alignment_of<int *>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIPiEE",
   "self_type" : "_ZTINSt3__112alignment_ofIPiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIdEE",
   "name" : "std::alignment_of<double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIdEE",
   "self_type" : "_ZTINSt3__112alignment_ofIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIeEE",
   "name" : "std::alignment_of<long double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIeEE",
   "self_type" : "_ZTINSt3__112alignment_ofIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIhEE",
   "name" : "std::alignment_of<unsigned char>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIhEE",
   "self_type" : "_ZTINSt3__112alignment_ofIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm4EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIjEE",
   "name" : "std::alignment_of<unsigned int>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIjEE",
   "self_type" : "_ZTINSt3__112alignment_ofIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofImEE",
   "name" : "std::alignment_of<unsigned long>",
   "referenced_type" : "_ZTINSt3__112alignment_ofImEE",
   "self_type" : "_ZTINSt3__112alignment_ofImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofItEE",
   "name" : "std::alignment_of<unsigned short>",
   "referenced_type" : "_ZTINSt3__112alignment_ofItEE",
   "self_type" : "_ZTINSt3__112alignment_ofItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIyEE",
   "name" : "std::alignment_of<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIyEE",
   "self_type" : "_ZTINSt3__112alignment_ofIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112bad_weak_ptrE",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112bad_weak_ptrE",
   "self_type" : "_ZTINSt3__112bad_weak_ptrE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_4pairImmEEEE",
   "name" : "std::is_reference<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceImEE",
   "name" : "std::is_reference<unsigned long>",
   "referenced_type" : "_ZTINSt3__112is_referenceImEE",
   "self_type" : "_ZTINSt3__112is_referenceImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112not_equal_toIvEE",
   "name" : "std::not_equal_to<void>",
   "referenced_type" : "_ZTINSt3__112not_equal_toIvEE",
   "self_type" : "_ZTINSt3__112not_equal_toIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "name" : "std::placeholders::__ph<10>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "name" : "std::placeholders::__ph<1>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "name" : "std::placeholders::__ph<2>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "name" : "std::placeholders::__ph<3>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "name" : "std::placeholders::__ph<4>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "name" : "std::placeholders::__ph<5>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "name" : "std::placeholders::__ph<6>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "name" : "std::placeholders::__ph<7>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "name" : "std::placeholders::__ph<8>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "name" : "std::placeholders::__ph<9>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKiEE",
   "name" : "std::remove_const<const int>",
   "referenced_type" : "_ZTINSt3__112remove_constIKiEE",
   "self_type" : "_ZTINSt3__112remove_constIKiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_4pairImmEEEE",
   "name" : "std::remove_const<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOmEE",
   "name" : "std::remove_const<unsigned long &&>",
   "referenced_type" : "_ZTINSt3__112remove_constIOmEE",
   "self_type" : "_ZTINSt3__112remove_constIOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKmEE",
   "name" : "std::remove_const<const unsigned long &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKmEE",
   "self_type" : "_ZTINSt3__112remove_constIRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRmEE",
   "name" : "std::remove_const<unsigned long &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRmEE",
   "self_type" : "_ZTINSt3__112remove_constIRmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIdEE",
   "name" : "std::remove_const<double>",
   "referenced_type" : "_ZTINSt3__112remove_constIdEE",
   "self_type" : "_ZTINSt3__112remove_constIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIeEE",
   "name" : "std::remove_const<long double>",
   "referenced_type" : "_ZTINSt3__112remove_constIeEE",
   "self_type" : "_ZTINSt3__112remove_constIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIfEE",
   "name" : "std::remove_const<float>",
   "referenced_type" : "_ZTINSt3__112remove_constIfEE",
   "self_type" : "_ZTINSt3__112remove_constIfEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIiEE",
   "name" : "std::remove_const<int>",
   "referenced_type" : "_ZTINSt3__112remove_constIiEE",
   "self_type" : "_ZTINSt3__112remove_constIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIlEE",
   "name" : "std::remove_const<long>",
   "referenced_type" : "_ZTINSt3__112remove_constIlEE",
   "self_type" : "_ZTINSt3__112remove_constIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constImEE",
   "name" : "std::remove_const<unsigned long>",
   "referenced_type" : "_ZTINSt3__112remove_constImEE",
   "self_type" : "_ZTINSt3__112remove_constImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "name" : "std::__make_signed<bool, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "name" : "std::__make_signed<int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "name" : "std::__make_signed<unsigned int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "name" : "std::__make_signed<long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedImLb1EEE",
   "name" : "std::__make_signed<unsigned long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedInLb1EEE",
   "name" : "std::__make_signed<__int128_t, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedInLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedInLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIoLb1EEE",
   "name" : "std::__make_signed<__uint128_t, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIoLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIoLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIo" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "name" : "std::__make_signed<short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedItLb1EEE",
   "name" : "std::__make_signed<unsigned short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "name" : "std::__make_signed<long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "name" : "std::__make_signed<unsigned long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashINS_6_PairTELm2EEE",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__16_PairTE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIdmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIdLm1EEE",
   "name" : "std::__scalar_hash<double, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIdLm1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIdLm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIemEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIeLm2EEE",
   "name" : "std::__scalar_hash<long double, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIeLm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIeLm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIfmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIfLm0EEE",
   "name" : "std::__scalar_hash<float, 0>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIfLm0EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIfLm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionInmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashInLm2EEE",
   "name" : "std::__scalar_hash<__int128, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashInLm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashInLm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIn" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIomEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIoLm2EEE",
   "name" : "std::__scalar_hash<unsigned __int128, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIoLm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIoLm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIo" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIxmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIxLm1EEE",
   "name" : "std::__scalar_hash<long long, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIxLm1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIxLm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIymEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIyLm1EEE",
   "name" : "std::__scalar_hash<unsigned long long, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIyLm1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIyLm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_equalILm0EEE",
   "name" : "std::__tuple_equal<0>",
   "referenced_type" : "_ZTINSt3__113__tuple_equalILm0EEE",
   "self_type" : "_ZTINSt3__113__tuple_equalILm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_typesIJEEE",
   "name" : "std::__tuple_types<>",
   "referenced_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "self_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113greater_equalIvEE",
   "name" : "std::greater_equal<void>",
   "referenced_type" : "_ZTINSt3__113greater_equalIvEE",
   "self_type" : "_ZTINSt3__113greater_equalIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIdEE",
   "name" : "std::is_arithmetic<double>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIdEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIiEE",
   "name" : "std::is_arithmetic<int>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIiEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIlEE",
   "name" : "std::is_arithmetic<long>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIlEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRmOmLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRmOmEE",
   "name" : "std::is_assignable<unsigned long &, unsigned long &&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRmOmEE",
   "self_type" : "_ZTINSt3__113is_assignableIRmOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRmRKmLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRmRKmEE",
   "name" : "std::is_assignable<unsigned long &, const unsigned long &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRmRKmEE",
   "self_type" : "_ZTINSt3__113is_assignableIRmRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_4pairImmEEEE",
   "name" : "std::remove_extent<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__is_construct5__natE",
   "name" : "std::__is_construct::__nat",
   "referenced_type" : "_ZTINSt3__114__is_construct5__natE",
   "self_type" : "_ZTINSt3__114__is_construct5__natE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_4pairImmEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_4pairImmEEEE",
   "name" : "std::__is_nullptr_t<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implImEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tImEE",
   "name" : "std::__is_nullptr_t<unsigned long>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tImEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "name" : "std::__lazy_or_impl<false>",
   "referenced_type" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "self_type" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__numeric_typeIvEE",
   "name" : "std::__numeric_type<void>",
   "referenced_type" : "_ZTINSt3__114__numeric_typeIvEE",
   "self_type" : "_ZTINSt3__114__numeric_typeIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm16ELm16EEE",
   "name" : "std::__select_align<24, 16, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm16ELm8EEE",
   "name" : "std::__select_align<24, 16, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm1ELm16EEE",
   "name" : "std::__select_align<24, 1, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm1ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm1ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm2ELm16EEE",
   "name" : "std::__select_align<24, 2, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm2ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm2ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm4ELm16EEE",
   "name" : "std::__select_align<24, 4, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm4ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm4ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm8ELm16EEE",
   "name" : "std::__select_align<24, 8, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm8ELm8EEE",
   "name" : "std::__select_align<24, 8, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm16ELm16EEE",
   "name" : "std::__select_align<32, 16, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm16ELm8EEE",
   "name" : "std::__select_align<32, 16, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm1ELm16EEE",
   "name" : "std::__select_align<32, 1, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm1ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm1ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm2ELm16EEE",
   "name" : "std::__select_align<32, 2, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm2ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm2ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm4ELm16EEE",
   "name" : "std::__select_align<32, 4, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm4ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm4ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm8ELm16EEE",
   "name" : "std::__select_align<32, 8, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm8ELm8EEE",
   "name" : "std::__select_align<32, 8, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__shared_owners_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__shared_countE",
   "name" : "std::__shared_count",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114__shared_countE",
   "self_type" : "_ZTINSt3__114__shared_countE",
   "size" : 16,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114__shared_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKmmEE",
   "name" : "std::is_convertible<const unsigned long &, unsigned long>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKmmEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKmmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleImmEE",
   "name" : "std::is_convertible<unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114is_convertibleImmEE",
   "self_type" : "_ZTINSt3__114is_convertibleImmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIdLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIdEE",
   "name" : "std::numeric_limits<double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114numeric_limitsIdEE",
   "self_type" : "_ZTINSt3__114numeric_limitsIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIiLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIiEE",
   "name" : "std::numeric_limits<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114numeric_limitsIiEE",
   "self_type" : "_ZTINSt3__114numeric_limitsIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIlLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIlEE",
   "name" : "std::numeric_limits<long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114numeric_limitsIlEE",
   "self_type" : "_ZTINSt3__114numeric_limitsIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__v_",
     "referenced_type" : "_ZTINSt3__114pointer_safety4__lxE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114pointer_safetyE",
   "name" : "std::pointer_safety",
   "referenced_type" : "_ZTINSt3__114pointer_safetyE",
   "self_type" : "_ZTINSt3__114pointer_safetyE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIDimEE",
   "name" : "std::unary_function<char32_t, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIDimEE",
   "self_type" : "_ZTINSt3__114unary_functionIDimEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDi", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIDnmEE",
   "name" : "std::unary_function<nullptr_t, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIDnmEE",
   "self_type" : "_ZTINSt3__114unary_functionIDnmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDn", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIDsmEE",
   "name" : "std::unary_function<char16_t, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIDsmEE",
   "self_type" : "_ZTINSt3__114unary_functionIDsmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDs", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE",
   "name" : "std::unary_function<std::_PairT, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE",
   "self_type" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__16_PairTE", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIamEE",
   "name" : "std::unary_function<signed char, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIamEE",
   "self_type" : "_ZTINSt3__114unary_functionIamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIa", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIbmEE",
   "name" : "std::unary_function<bool, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIbmEE",
   "self_type" : "_ZTINSt3__114unary_functionIbmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIb", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIcmEE",
   "name" : "std::unary_function<char, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIcmEE",
   "self_type" : "_ZTINSt3__114unary_functionIcmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIc", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIdmEE",
   "name" : "std::unary_function<double, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIdmEE",
   "self_type" : "_ZTINSt3__114unary_functionIdmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTId", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIemEE",
   "name" : "std::unary_function<long double, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIemEE",
   "self_type" : "_ZTINSt3__114unary_functionIemEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIe", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIfmEE",
   "name" : "std::unary_function<float, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIfmEE",
   "self_type" : "_ZTINSt3__114unary_functionIfmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIf", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIhmEE",
   "name" : "std::unary_function<unsigned char, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIhmEE",
   "self_type" : "_ZTINSt3__114unary_functionIhmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIh", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIimEE",
   "name" : "std::unary_function<int, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIimEE",
   "self_type" : "_ZTINSt3__114unary_functionIimEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIi", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIjmEE",
   "name" : "std::unary_function<unsigned int, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIjmEE",
   "self_type" : "_ZTINSt3__114unary_functionIjmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIj", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIlmEE",
   "name" : "std::unary_function<long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIlmEE",
   "self_type" : "_ZTINSt3__114unary_functionIlmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIl", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionImmEE",
   "name" : "std::unary_function<unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionImmEE",
   "self_type" : "_ZTINSt3__114unary_functionImmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionInmEE",
   "name" : "std::unary_function<__int128, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionInmEE",
   "self_type" : "_ZTINSt3__114unary_functionInmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIn", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIomEE",
   "name" : "std::unary_function<unsigned __int128, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIomEE",
   "self_type" : "_ZTINSt3__114unary_functionIomEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIo", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIsmEE",
   "name" : "std::unary_function<short, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIsmEE",
   "self_type" : "_ZTINSt3__114unary_functionIsmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIs", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionItmEE",
   "name" : "std::unary_function<unsigned short, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionItmEE",
   "self_type" : "_ZTINSt3__114unary_functionItmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIt", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIwmEE",
   "name" : "std::unary_function<wchar_t, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIwmEE",
   "self_type" : "_ZTINSt3__114unary_functionIwmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIw", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIxmEE",
   "name" : "std::unary_function<long long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIxmEE",
   "self_type" : "_ZTINSt3__114unary_functionIxmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIx", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIymEE",
   "name" : "std::unary_function<unsigned long long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIymEE",
   "self_type" : "_ZTINSt3__114unary_functionIymEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIy", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__lazy_and_implILb1EJEEE",
   "name" : "std::__lazy_and_impl<true>",
   "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJEEE",
   "self_type" : "_ZTINSt3__115__lazy_and_implILb1EJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIbLb1EEE",
   "name" : "std::__make_unsigned<bool, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIbLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIbLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIiLb1EEE",
   "name" : "std::__make_unsigned<int, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIiLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIjLb1EEE",
   "name" : "std::__make_unsigned<unsigned int, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIjLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIjLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIlLb1EEE",
   "name" : "std::__make_unsigned<long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIlLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIlLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedImLb1EEE",
   "name" : "std::__make_unsigned<unsigned long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedImLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedImLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedInLb1EEE",
   "name" : "std::__make_unsigned<__int128_t, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedInLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedInLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIoLb1EEE",
   "name" : "std::__make_unsigned<__uint128_t, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIoLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIoLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIo" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIsLb1EEE",
   "name" : "std::__make_unsigned<short, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIsLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIsLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedItLb1EEE",
   "name" : "std::__make_unsigned<unsigned short, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedItLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedItLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIxLb1EEE",
   "name" : "std::__make_unsigned<long long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIxLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIxLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIyLb1EEE",
   "name" : "std::__make_unsigned<unsigned long long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIyLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIyLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__struct_doubleE",
   "name" : "std::__struct_double",
   "referenced_type" : "_ZTINSt3__115__struct_doubleE",
   "self_type" : "_ZTINSt3__115__struct_doubleE",
   "size" : 16,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__tuple_indicesIJEEE",
   "name" : "std::__tuple_indices<>",
   "referenced_type" : "_ZTINSt3__115__tuple_indicesIJEEE",
   "self_type" : "_ZTINSt3__115__tuple_indicesIJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIA32_h"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE",
   "name" : "std::aligned_storage<24, 16>::type",
   "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE",
   "self_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE",
   "size" : 32,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115aligned_storageILm24ELm16EEE",
   "name" : "std::aligned_storage<24, 16>",
   "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EEE",
   "self_type" : "_ZTINSt3__115aligned_storageILm24ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIA32_h"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115aligned_storageILm32ELm16EE4typeE",
   "name" : "std::aligned_storage<32, 16>::type",
   "referenced_type" : "_ZTINSt3__115aligned_storageILm32ELm16EE4typeE",
   "self_type" : "_ZTINSt3__115aligned_storageILm32ELm16EE4typeE",
   "size" : 32,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115aligned_storageILm32ELm16EEE",
   "name" : "std::aligned_storage<32, 16>",
   "referenced_type" : "_ZTINSt3__115aligned_storageILm32ELm16EEE",
   "self_type" : "_ZTINSt3__115aligned_storageILm32ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115allocator_arg_tE",
   "name" : "std::allocator_arg_t",
   "referenced_type" : "_ZTINSt3__115allocator_arg_tE",
   "self_type" : "_ZTINSt3__115allocator_arg_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__functional_base"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115is_destructibleIvEE",
   "name" : "std::is_destructible<void>",
   "referenced_type" : "_ZTINSt3__115is_destructibleIvEE",
   "self_type" : "_ZTINSt3__115is_destructibleIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115iterator_traitsIPKiEE",
   "name" : "std::iterator_traits<const int *>",
   "referenced_type" : "_ZTINSt3__115iterator_traitsIPKiEE",
   "self_type" : "_ZTINSt3__115iterator_traitsIPKiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPKi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileINS_4pairImmEEEE",
   "name" : "std::remove_volatile<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__115remove_volatileINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__115remove_volatileINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIOmEE",
   "name" : "std::remove_volatile<unsigned long &&>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIOmEE",
   "self_type" : "_ZTINSt3__115remove_volatileIOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIRKmEE",
   "name" : "std::remove_volatile<const unsigned long &>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIRKmEE",
   "self_type" : "_ZTINSt3__115remove_volatileIRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIRmEE",
   "name" : "std::remove_volatile<unsigned long &>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIRmEE",
   "self_type" : "_ZTINSt3__115remove_volatileIRmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIdEE",
   "name" : "std::remove_volatile<double>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIdEE",
   "self_type" : "_ZTINSt3__115remove_volatileIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIeEE",
   "name" : "std::remove_volatile<long double>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIeEE",
   "self_type" : "_ZTINSt3__115remove_volatileIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIfEE",
   "name" : "std::remove_volatile<float>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIfEE",
   "self_type" : "_ZTINSt3__115remove_volatileIfEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIiEE",
   "name" : "std::remove_volatile<int>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIiEE",
   "self_type" : "_ZTINSt3__115remove_volatileIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIlEE",
   "name" : "std::remove_volatile<long>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIlEE",
   "self_type" : "_ZTINSt3__115remove_volatileIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileImEE",
   "name" : "std::remove_volatile<unsigned long>",
   "referenced_type" : "_ZTINSt3__115remove_volatileImEE",
   "self_type" : "_ZTINSt3__115remove_volatileImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeINS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeINS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeINS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeINS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__111__type_listINS_12__align_typeIPiEENS_5__natEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__111__type_listINS_12__align_typeIPiEENS_5__natEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIhEENS0_INS1_ItEENS0_INS1_IjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIhEENS0_INS1_ItEENS0_INS1_IjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeItEENS0_INS1_IjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeItEENS0_INS1_IjEENS0_INS1_ImEENS0_INS1_IyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm24EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>, 24>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm24EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm24EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm32EEE",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat>>>>>>, 32>",
   "referenced_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm32EEE",
   "self_type" : "_ZTINSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm32EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__111__type_listINS_12__align_typeIyEENS0_INS1_IdEENS0_INS1_IeEENS0_INS1_INS_15__struct_doubleEEENS0_INS1_INS_16__struct_double4EEENS0_INS1_IPiEENS_5__natEEEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidINS_4pairImmEEEE",
   "name" : "std::__libcpp_is_void<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIOmEE",
   "name" : "std::__libcpp_is_void<unsigned long &&>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIOmEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIRKmEE",
   "name" : "std::__libcpp_is_void<const unsigned long &>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIRKmEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIRmEE",
   "name" : "std::__libcpp_is_void<unsigned long &>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIRmEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIRmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidImEE",
   "name" : "std::__libcpp_is_void<unsigned long>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidImEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__libcpp_is_voidIvEE",
   "name" : "std::__libcpp_is_void<void>",
   "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIvEE",
   "self_type" : "_ZTINSt3__116__libcpp_is_voidIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIA4_d"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116__struct_double4E",
   "name" : "std::__struct_double4",
   "referenced_type" : "_ZTINSt3__116__struct_double4E",
   "self_type" : "_ZTINSt3__116__struct_double4E",
   "size" : 32,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleImJOmEEE",
   "name" : "std::is_constructible<unsigned long, unsigned long &&>",
   "referenced_type" : "_ZTINSt3__116is_constructibleImJOmEEE",
   "self_type" : "_ZTINSt3__116is_constructibleImJOmEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleImJRKmEEE",
   "name" : "std::is_constructible<unsigned long, const unsigned long &>",
   "referenced_type" : "_ZTINSt3__116is_constructibleImJRKmEEE",
   "self_type" : "_ZTINSt3__116is_constructibleImJRKmEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__116is_constructibleImJmEEE",
   "name" : "std::is_constructible<unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__116is_constructibleImJmEEE",
   "self_type" : "_ZTINSt3__116is_constructibleImJmEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceINS_4pairImmEEEE",
   "name" : "std::remove_reference<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__116remove_referenceINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__116remove_referenceINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceIRmEE",
   "name" : "std::remove_reference<unsigned long &>",
   "referenced_type" : "_ZTINSt3__116remove_referenceIRmEE",
   "self_type" : "_ZTINSt3__116remove_referenceIRmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__116remove_referenceImEE",
   "name" : "std::remove_reference<unsigned long>",
   "referenced_type" : "_ZTINSt3__116remove_referenceImEE",
   "self_type" : "_ZTINSt3__116remove_referenceImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117_DeallocateCallerE",
   "name" : "std::_DeallocateCaller",
   "referenced_type" : "_ZTINSt3__117_DeallocateCallerE",
   "self_type" : "_ZTINSt3__117_DeallocateCallerE",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117bad_function_callE",
   "name" : "std::bad_function_call",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__117bad_function_callE",
   "self_type" : "_ZTINSt3__117bad_function_callE",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__117bad_function_callE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117integral_constantIbLb0EEE",
   "name" : "std::integral_constant<bool, false>",
   "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE",
   "self_type" : "_ZTINSt3__117integral_constantIbLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117integral_constantIbLb1EEE",
   "name" : "std::integral_constant<bool, true>",
   "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE",
   "self_type" : "_ZTINSt3__117integral_constantIbLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117integral_constantIiLi0EEE",
   "name" : "std::integral_constant<int, 0>",
   "referenced_type" : "_ZTINSt3__117integral_constantIiLi0EEE",
   "self_type" : "_ZTINSt3__117integral_constantIiLi0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117integral_constantIiLi1EEE",
   "name" : "std::integral_constant<int, 1>",
   "referenced_type" : "_ZTINSt3__117integral_constantIiLi1EEE",
   "self_type" : "_ZTINSt3__117integral_constantIiLi1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117integral_constantIiLi2EEE",
   "name" : "std::integral_constant<int, 2>",
   "referenced_type" : "_ZTINSt3__117integral_constantIiLi2EEE",
   "self_type" : "_ZTINSt3__117integral_constantIiLi2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117integral_constantImLm0EEE",
   "name" : "std::integral_constant<unsigned long, 0>",
   "referenced_type" : "_ZTINSt3__117integral_constantImLm0EEE",
   "self_type" : "_ZTINSt3__117integral_constantImLm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117integral_constantImLm16EEE",
   "name" : "std::integral_constant<unsigned long, 16>",
   "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE",
   "self_type" : "_ZTINSt3__117integral_constantImLm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117integral_constantImLm1EEE",
   "name" : "std::integral_constant<unsigned long, 1>",
   "referenced_type" : "_ZTINSt3__117integral_constantImLm1EEE",
   "self_type" : "_ZTINSt3__117integral_constantImLm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117integral_constantImLm2EEE",
   "name" : "std::integral_constant<unsigned long, 2>",
   "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE",
   "self_type" : "_ZTINSt3__117integral_constantImLm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117integral_constantImLm4EEE",
   "name" : "std::integral_constant<unsigned long, 4>",
   "referenced_type" : "_ZTINSt3__117integral_constantImLm4EEE",
   "self_type" : "_ZTINSt3__117integral_constantImLm4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__117integral_constantImLm8EEE",
   "name" : "std::integral_constant<unsigned long, 8>",
   "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE",
   "self_type" : "_ZTINSt3__117integral_constantImLm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__126__libcpp_is_floating_pointIdEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117is_floating_pointIdEE",
   "name" : "std::is_floating_point<double>",
   "referenced_type" : "_ZTINSt3__117is_floating_pointIdEE",
   "self_type" : "_ZTINSt3__117is_floating_pointIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__126__libcpp_is_floating_pointIiEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117is_floating_pointIiEE",
   "name" : "std::is_floating_point<int>",
   "referenced_type" : "_ZTINSt3__117is_floating_pointIiEE",
   "self_type" : "_ZTINSt3__117is_floating_pointIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__126__libcpp_is_floating_pointIlEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117is_floating_pointIlEE",
   "name" : "std::is_floating_point<long>",
   "referenced_type" : "_ZTINSt3__117is_floating_pointIlEE",
   "self_type" : "_ZTINSt3__117is_floating_pointIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__118__add_pointer_implINS_4pairImmEELb1EEE",
   "name" : "std::__add_pointer_impl<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "_ZTINSt3__118__add_pointer_implINS_4pairImmEELb1EEE",
   "self_type" : "_ZTINSt3__118__add_pointer_implINS_4pairImmEELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__118__integer_sequenceImJEEE",
   "name" : "std::__integer_sequence<unsigned long>",
   "referenced_type" : "_ZTINSt3__118__integer_sequenceImJEEE",
   "self_type" : "_ZTINSt3__118__integer_sequenceImJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__118__is_referenceableIKmEE",
   "name" : "std::__is_referenceable<const unsigned long>",
   "referenced_type" : "_ZTINSt3__118__is_referenceableIKmEE",
   "self_type" : "_ZTINSt3__118__is_referenceableIKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__118__is_referenceableINS_4pairImmEEEE",
   "name" : "std::__is_referenceable<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__118__is_referenceableINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__118__is_referenceableINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__118__is_referenceableImEE",
   "name" : "std::__is_referenceable<unsigned long>",
   "referenced_type" : "_ZTINSt3__118__is_referenceableImEE",
   "self_type" : "_ZTINSt3__118__is_referenceableImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTINSt3__118__libcpp_refstringE",
   "name" : "std::__libcpp_refstring",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__118__libcpp_refstringE",
   "self_type" : "_ZTINSt3__118__libcpp_refstringE",
   "size" : 8,
   "source_file" : "external/libcxx/include/stdexcept"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__118__sfinae_ctor_baseILb0ELb0EEE",
   "name" : "std::__sfinae_ctor_base<false, false>",
   "referenced_type" : "_ZTINSt3__118__sfinae_ctor_baseILb0ELb0EEE",
   "self_type" : "_ZTINSt3__118__sfinae_ctor_baseILb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__118__sfinae_ctor_baseILb0ELb1EEE",
   "name" : "std::__sfinae_ctor_base<false, true>",
   "referenced_type" : "_ZTINSt3__118__sfinae_ctor_baseILb0ELb1EEE",
   "self_type" : "_ZTINSt3__118__sfinae_ctor_baseILb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__118__sfinae_ctor_baseILb1ELb0EEE",
   "name" : "std::__sfinae_ctor_base<true, false>",
   "referenced_type" : "_ZTINSt3__118__sfinae_ctor_baseILb1ELb0EEE",
   "self_type" : "_ZTINSt3__118__sfinae_ctor_baseILb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__118__tuple_cat_returnIJEEE",
   "name" : "std::__tuple_cat_return<>",
   "referenced_type" : "_ZTINSt3__118__tuple_cat_returnIJEEE",
   "self_type" : "_ZTINSt3__118__tuple_cat_returnIJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__118input_iterator_tagE",
   "name" : "std::input_iterator_tag",
   "referenced_type" : "_ZTINSt3__118input_iterator_tagE",
   "self_type" : "_ZTINSt3__118input_iterator_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/iterator"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113is_assignableIRmRKmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__118is_copy_assignableImEE",
   "name" : "std::is_copy_assignable<unsigned long>",
   "referenced_type" : "_ZTINSt3__118is_copy_assignableImEE",
   "self_type" : "_ZTINSt3__118is_copy_assignableImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113is_assignableIRmOmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__118is_move_assignableImEE",
   "name" : "std::is_move_assignable<unsigned long>",
   "referenced_type" : "_ZTINSt3__118is_move_assignableImEE",
   "self_type" : "_ZTINSt3__118is_move_assignableImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__119__is_assignable_impIRmOmLb0EEE",
   "name" : "std::__is_assignable_imp<unsigned long &, unsigned long &&, false>",
   "referenced_type" : "_ZTINSt3__119__is_assignable_impIRmOmLb0EEE",
   "self_type" : "_ZTINSt3__119__is_assignable_impIRmOmLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__119__is_assignable_impIRmRKmLb0EEE",
   "name" : "std::__is_assignable_imp<unsigned long &, const unsigned long &, false>",
   "referenced_type" : "_ZTINSt3__119__is_assignable_impIRmRKmLb0EEE",
   "self_type" : "_ZTINSt3__119__is_assignable_impIRmRKmLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__119__is_nullptr_t_implIDnEE",
   "name" : "std::__is_nullptr_t_impl<nullptr_t>",
   "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implIDnEE",
   "self_type" : "_ZTINSt3__119__is_nullptr_t_implIDnEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDn" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__119__is_nullptr_t_implINS_4pairImmEEEE",
   "name" : "std::__is_nullptr_t_impl<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__119__is_nullptr_t_implINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__119__is_nullptr_t_implImEE",
   "name" : "std::__is_nullptr_t_impl<unsigned long>",
   "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implImEE",
   "self_type" : "_ZTINSt3__119__is_nullptr_t_implImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__file_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "__line_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__pred_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "__msg_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTINSt3__119__libcpp_debug_infoE",
   "name" : "std::__libcpp_debug_info",
   "referenced_type" : "_ZTINSt3__119__libcpp_debug_infoE",
   "self_type" : "_ZTINSt3__119__libcpp_debug_infoE",
   "size" : 32,
   "source_file" : "external/libcxx/include/__debug"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__114__shared_countE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__shared_weak_owners_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTINSt3__119__shared_weak_countE",
   "name" : "std::__shared_weak_count",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__119__shared_weak_countE",
   "self_type" : "_ZTINSt3__119__shared_weak_countE",
   "size" : 24,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__119__shared_weak_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__119__shared_weak_count13__get_deleterERKSt9type_info"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__119__shared_weak_count21__on_zero_shared_weakEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__119__tuple_sfinae_baseE",
   "name" : "std::__tuple_sfinae_base",
   "referenced_type" : "_ZTINSt3__119__tuple_sfinae_baseE",
   "self_type" : "_ZTINSt3__119__tuple_sfinae_baseE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__119output_iterator_tagE",
   "name" : "std::output_iterator_tag",
   "referenced_type" : "_ZTINSt3__119output_iterator_tagE",
   "self_type" : "_ZTINSt3__119output_iterator_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/iterator"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__120__libcpp_compute_minIiLi31ELb1EEE",
   "name" : "std::__libcpp_compute_min<int, 31, true>",
   "referenced_type" : "_ZTINSt3__120__libcpp_compute_minIiLi31ELb1EEE",
   "self_type" : "_ZTINSt3__120__libcpp_compute_minIiLi31ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__120__libcpp_compute_minIlLi63ELb1EEE",
   "name" : "std::__libcpp_compute_min<long, 63, true>",
   "referenced_type" : "_ZTINSt3__120__libcpp_compute_minIlLi63ELb1EEE",
   "self_type" : "_ZTINSt3__120__libcpp_compute_minIlLi63ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_functionINS_4pairImmEELb1EEE",
   "name" : "std::__libcpp_is_function<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_4pairImmEELb1EEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_functionINS_4pairImmEELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_functionImLb0EEE",
   "name" : "std::__libcpp_is_function<unsigned long, false>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_functionImLb0EEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_functionImLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIDiEE",
   "name" : "std::__libcpp_is_integral<char32_t>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIDiEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIDsEE",
   "name" : "std::__libcpp_is_integral<char16_t>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIDsEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIaEE",
   "name" : "std::__libcpp_is_integral<signed char>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIaEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIaEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIbEE",
   "name" : "std::__libcpp_is_integral<bool>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIbEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIcEE",
   "name" : "std::__libcpp_is_integral<char>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIcEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIdEE",
   "name" : "std::__libcpp_is_integral<double>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIdEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIeEE",
   "name" : "std::__libcpp_is_integral<long double>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIeEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIfEE",
   "name" : "std::__libcpp_is_integral<float>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIfEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIfEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIhEE",
   "name" : "std::__libcpp_is_integral<unsigned char>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIhEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIiEE",
   "name" : "std::__libcpp_is_integral<int>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIiEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIjEE",
   "name" : "std::__libcpp_is_integral<unsigned int>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIjEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIlEE",
   "name" : "std::__libcpp_is_integral<long>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIlEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralImEE",
   "name" : "std::__libcpp_is_integral<unsigned long>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralImEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralInEE",
   "name" : "std::__libcpp_is_integral<__int128_t>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralInEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralInEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIn" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIoEE",
   "name" : "std::__libcpp_is_integral<__uint128_t>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIoEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIoEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIo" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIsEE",
   "name" : "std::__libcpp_is_integral<short>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIsEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralItEE",
   "name" : "std::__libcpp_is_integral<unsigned short>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralItEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIwEE",
   "name" : "std::__libcpp_is_integral<wchar_t>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIwEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIxEE",
   "name" : "std::__libcpp_is_integral<long long>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIxEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120__libcpp_is_integralIyEE",
   "name" : "std::__libcpp_is_integral<unsigned long long>",
   "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIyEE",
   "self_type" : "_ZTINSt3__120__libcpp_is_integralIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__120__make_tuple_indicesILm0ELm0EEE",
   "name" : "std::__make_tuple_indices<0, 0>",
   "referenced_type" : "_ZTINSt3__120__make_tuple_indicesILm0ELm0EEE",
   "self_type" : "_ZTINSt3__120__make_tuple_indicesILm0ELm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__120__sfinae_assign_baseILb0ELb0EEE",
   "name" : "std::__sfinae_assign_base<false, false>",
   "referenced_type" : "_ZTINSt3__120__sfinae_assign_baseILb0ELb0EEE",
   "self_type" : "_ZTINSt3__120__sfinae_assign_baseILb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__120__sfinae_assign_baseILb0ELb1EEE",
   "name" : "std::__sfinae_assign_base<false, true>",
   "referenced_type" : "_ZTINSt3__120__sfinae_assign_baseILb0ELb1EEE",
   "self_type" : "_ZTINSt3__120__sfinae_assign_baseILb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__120__sfinae_assign_baseILb1ELb0EEE",
   "name" : "std::__sfinae_assign_base<true, false>",
   "referenced_type" : "_ZTINSt3__120__sfinae_assign_baseILb1ELb0EEE",
   "self_type" : "_ZTINSt3__120__sfinae_assign_baseILb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__120add_lvalue_referenceIKmEE",
   "name" : "std::add_lvalue_reference<const unsigned long>",
   "referenced_type" : "_ZTINSt3__120add_lvalue_referenceIKmEE",
   "self_type" : "_ZTINSt3__120add_lvalue_referenceIKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__120add_lvalue_referenceImEE",
   "name" : "std::add_lvalue_reference<unsigned long>",
   "referenced_type" : "_ZTINSt3__120add_lvalue_referenceImEE",
   "self_type" : "_ZTINSt3__120add_lvalue_referenceImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__120add_rvalue_referenceImEE",
   "name" : "std::add_rvalue_reference<unsigned long>",
   "referenced_type" : "_ZTINSt3__120add_rvalue_referenceImEE",
   "self_type" : "_ZTINSt3__120add_rvalue_referenceImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118input_iterator_tagE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__120forward_iterator_tagE",
   "name" : "std::forward_iterator_tag",
   "referenced_type" : "_ZTINSt3__120forward_iterator_tagE",
   "self_type" : "_ZTINSt3__120forward_iterator_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/iterator"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__121__murmur2_or_cityhashImLm64EEE",
   "name" : "std::__murmur2_or_cityhash<unsigned long, 64>",
   "referenced_type" : "_ZTINSt3__121__murmur2_or_cityhashImLm64EEE",
   "self_type" : "_ZTINSt3__121__murmur2_or_cityhashImLm64EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__116is_constructibleImJOmEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__121is_move_constructibleImEE",
   "name" : "std::is_move_constructible<unsigned long>",
   "referenced_type" : "_ZTINSt3__121is_move_constructibleImEE",
   "self_type" : "_ZTINSt3__121is_move_constructibleImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__130__libcpp_is_nothrow_assignableILb1ERmOmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__121is_nothrow_assignableIRmOmEE",
   "name" : "std::is_nothrow_assignable<unsigned long &, unsigned long &&>",
   "referenced_type" : "_ZTINSt3__121is_nothrow_assignableIRmOmEE",
   "self_type" : "_ZTINSt3__121is_nothrow_assignableIRmOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__121piecewise_construct_tE",
   "name" : "std::piecewise_construct_t",
   "referenced_type" : "_ZTINSt3__121piecewise_construct_tE",
   "self_type" : "_ZTINSt3__121piecewise_construct_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__122__extract_key_fail_tagE",
   "name" : "std::__extract_key_fail_tag",
   "referenced_type" : "_ZTINSt3__122__extract_key_fail_tagE",
   "self_type" : "_ZTINSt3__122__extract_key_fail_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__122__extract_key_self_tagE",
   "name" : "std::__extract_key_self_tag",
   "referenced_type" : "_ZTINSt3__122__extract_key_self_tagE",
   "self_type" : "_ZTINSt3__122__extract_key_self_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__123__extract_key_first_tagE",
   "name" : "std::__extract_key_first_tag",
   "referenced_type" : "_ZTINSt3__123__extract_key_first_tagE",
   "self_type" : "_ZTINSt3__123__extract_key_first_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__123__is_referenceable_implE",
   "name" : "std::__is_referenceable_impl",
   "referenced_type" : "_ZTINSt3__123__is_referenceable_implE",
   "self_type" : "_ZTINSt3__123__is_referenceable_implE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__123__libcpp_numeric_limitsIbLb1EEE",
   "name" : "std::__libcpp_numeric_limits<bool, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIbLb1EEE",
   "self_type" : "_ZTINSt3__123__libcpp_numeric_limitsIbLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__123__libcpp_numeric_limitsIdLb1EEE",
   "name" : "std::__libcpp_numeric_limits<double, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIdLb1EEE",
   "self_type" : "_ZTINSt3__123__libcpp_numeric_limitsIdLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__123__libcpp_numeric_limitsIeLb1EEE",
   "name" : "std::__libcpp_numeric_limits<long double, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIeLb1EEE",
   "self_type" : "_ZTINSt3__123__libcpp_numeric_limitsIeLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__123__libcpp_numeric_limitsIfLb1EEE",
   "name" : "std::__libcpp_numeric_limits<float, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIfLb1EEE",
   "self_type" : "_ZTINSt3__123__libcpp_numeric_limitsIfLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__123__libcpp_numeric_limitsIiLb1EEE",
   "name" : "std::__libcpp_numeric_limits<int, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIiLb1EEE",
   "self_type" : "_ZTINSt3__123__libcpp_numeric_limitsIiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__123__libcpp_numeric_limitsIlLb1EEE",
   "name" : "std::__libcpp_numeric_limits<long, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIlLb1EEE",
   "self_type" : "_ZTINSt3__123__libcpp_numeric_limitsIlLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__124__libcpp_is_function_imp12__dummy_typeE",
   "name" : "std::__libcpp_is_function_imp::__dummy_type",
   "referenced_type" : "_ZTINSt3__124__libcpp_is_function_imp12__dummy_typeE",
   "self_type" : "_ZTINSt3__124__libcpp_is_function_imp12__dummy_typeE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__133__libcpp_is_nothrow_constructibleILb1ELb0EmJOmEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__124is_nothrow_constructibleImJOmEEE",
   "name" : "std::is_nothrow_constructible<unsigned long, unsigned long &&>",
   "referenced_type" : "_ZTINSt3__124is_nothrow_constructibleImJOmEEE",
   "self_type" : "_ZTINSt3__124is_nothrow_constructibleImJOmEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__133__libcpp_is_nothrow_constructibleILb1ELb0EmJmEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__124is_nothrow_constructibleImJmEEE",
   "name" : "std::is_nothrow_constructible<unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__124is_nothrow_constructibleImJmEEE",
   "self_type" : "_ZTINSt3__124is_nothrow_constructibleImJmEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__a_",
     "referenced_type" : "_ZTIl"
    },
    {
     "access" : "private",
     "field_name" : "__b_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTINSt3__124uniform_int_distributionIlE10param_typeE",
   "name" : "std::uniform_int_distribution<long>::param_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__124uniform_int_distributionIlE10param_typeE",
   "self_type" : "_ZTINSt3__124uniform_int_distributionIlE10param_typeE",
   "size" : 16,
   "source_file" : "external/libcxx/include/algorithm"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__p_",
     "referenced_type" : "_ZTINSt3__124uniform_int_distributionIlE10param_typeE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__124uniform_int_distributionIlEE",
   "name" : "std::uniform_int_distribution<long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__124uniform_int_distributionIlEE",
   "self_type" : "_ZTINSt3__124uniform_int_distributionIlEE",
   "size" : 16,
   "source_file" : "external/libcxx/include/algorithm",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__125__return_temporary_bufferE",
   "name" : "std::__return_temporary_buffer",
   "referenced_type" : "_ZTINSt3__125__return_temporary_bufferE",
   "self_type" : "_ZTINSt3__125__return_temporary_bufferE",
   "size" : 1,
   "source_file" : "external/libcxx/include/algorithm"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__126__libcpp_is_floating_pointIdEE",
   "name" : "std::__libcpp_is_floating_point<double>",
   "referenced_type" : "_ZTINSt3__126__libcpp_is_floating_pointIdEE",
   "self_type" : "_ZTINSt3__126__libcpp_is_floating_pointIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__126__libcpp_is_floating_pointIeEE",
   "name" : "std::__libcpp_is_floating_point<long double>",
   "referenced_type" : "_ZTINSt3__126__libcpp_is_floating_pointIeEE",
   "self_type" : "_ZTINSt3__126__libcpp_is_floating_pointIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__126__libcpp_is_floating_pointIfEE",
   "name" : "std::__libcpp_is_floating_point<float>",
   "referenced_type" : "_ZTINSt3__126__libcpp_is_floating_pointIfEE",
   "self_type" : "_ZTINSt3__126__libcpp_is_floating_pointIfEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__126__libcpp_is_floating_pointIiEE",
   "name" : "std::__libcpp_is_floating_point<int>",
   "referenced_type" : "_ZTINSt3__126__libcpp_is_floating_pointIiEE",
   "self_type" : "_ZTINSt3__126__libcpp_is_floating_pointIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__126__libcpp_is_floating_pointIlEE",
   "name" : "std::__libcpp_is_floating_point<long>",
   "referenced_type" : "_ZTINSt3__126__libcpp_is_floating_pointIlEE",
   "self_type" : "_ZTINSt3__126__libcpp_is_floating_pointIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__126__tuple_like_with_size_impILb1ENS_10tuple_sizeINS_4pairImmEEEELm2EEE",
   "name" : "std::__tuple_like_with_size_imp<true, std::tuple_size<std::pair<unsigned long, unsigned long>>, 2>",
   "referenced_type" : "_ZTINSt3__126__tuple_like_with_size_impILb1ENS_10tuple_sizeINS_4pairImmEEEELm2EEE",
   "self_type" : "_ZTINSt3__126__tuple_like_with_size_impILb1ENS_10tuple_sizeINS_4pairImmEEEELm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" : [ "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120forward_iterator_tagE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__126bidirectional_iterator_tagE",
   "name" : "std::bidirectional_iterator_tag",
   "referenced_type" : "_ZTINSt3__126bidirectional_iterator_tagE",
   "self_type" : "_ZTINSt3__126bidirectional_iterator_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/iterator"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__121is_nothrow_assignableIRmOmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__126is_nothrow_move_assignableImEE",
   "name" : "std::is_nothrow_move_assignable<unsigned long>",
   "referenced_type" : "_ZTINSt3__126is_nothrow_move_assignableImEE",
   "self_type" : "_ZTINSt3__126is_nothrow_move_assignableImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__126bidirectional_iterator_tagE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__126random_access_iterator_tagE",
   "name" : "std::random_access_iterator_tag",
   "referenced_type" : "_ZTINSt3__126random_access_iterator_tagE",
   "self_type" : "_ZTINSt3__126random_access_iterator_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/iterator"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__127__add_lvalue_reference_implIKmLb1EEE",
   "name" : "std::__add_lvalue_reference_impl<const unsigned long, true>",
   "referenced_type" : "_ZTINSt3__127__add_lvalue_reference_implIKmLb1EEE",
   "self_type" : "_ZTINSt3__127__add_lvalue_reference_implIKmLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__127__add_lvalue_reference_implImLb1EEE",
   "name" : "std::__add_lvalue_reference_impl<unsigned long, true>",
   "referenced_type" : "_ZTINSt3__127__add_lvalue_reference_implImLb1EEE",
   "self_type" : "_ZTINSt3__127__add_lvalue_reference_implImLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__127__add_rvalue_reference_implImLb1EEE",
   "name" : "std::__add_rvalue_reference_impl<unsigned long, true>",
   "referenced_type" : "_ZTINSt3__127__add_rvalue_reference_implImLb1EEE",
   "self_type" : "_ZTINSt3__127__add_rvalue_reference_implImLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__128__invoke_void_return_wrapperIvEE",
   "name" : "std::__invoke_void_return_wrapper<void>",
   "referenced_type" : "_ZTINSt3__128__invoke_void_return_wrapperIvEE",
   "self_type" : "_ZTINSt3__128__invoke_void_return_wrapperIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__functional_base",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__124is_nothrow_constructibleImJOmEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__129is_nothrow_move_constructibleImEE",
   "name" : "std::is_nothrow_move_constructible<unsigned long>",
   "referenced_type" : "_ZTINSt3__129is_nothrow_move_constructibleImEE",
   "self_type" : "_ZTINSt3__129is_nothrow_move_constructibleImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__130__check_tuple_constructor_failE",
   "name" : "std::__check_tuple_constructor_fail",
   "referenced_type" : "_ZTINSt3__130__check_tuple_constructor_failE",
   "self_type" : "_ZTINSt3__130__check_tuple_constructor_failE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__130__libcpp_is_nothrow_assignableILb1ERmOmEE",
   "name" : "std::__libcpp_is_nothrow_assignable<true, unsigned long &, unsigned long &&>",
   "referenced_type" : "_ZTINSt3__130__libcpp_is_nothrow_assignableILb1ERmOmEE",
   "self_type" : "_ZTINSt3__130__libcpp_is_nothrow_assignableILb1ERmOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__133__libcpp_is_nothrow_constructibleILb1ELb0EmJOmEEE",
   "name" : "std::__libcpp_is_nothrow_constructible<true, false, unsigned long, unsigned long &&>",
   "referenced_type" : "_ZTINSt3__133__libcpp_is_nothrow_constructibleILb1ELb0EmJOmEEE",
   "self_type" : "_ZTINSt3__133__libcpp_is_nothrow_constructibleILb1ELb0EmJOmEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__133__libcpp_is_nothrow_constructibleILb1ELb0EmJmEEE",
   "name" : "std::__libcpp_is_nothrow_constructible<true, false, unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__133__libcpp_is_nothrow_constructibleILb1ELb0EmJmEEE",
   "self_type" : "_ZTINSt3__133__libcpp_is_nothrow_constructibleILb1ELb0EmJmEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIDimEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIDiEE",
   "name" : "std::hash<char32_t>",
   "referenced_type" : "_ZTINSt3__14hashIDiEE",
   "self_type" : "_ZTINSt3__14hashIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIDnmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIDnEE",
   "name" : "std::hash<nullptr_t>",
   "referenced_type" : "_ZTINSt3__14hashIDnEE",
   "self_type" : "_ZTINSt3__14hashIDnEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDn" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIDsmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIDsEE",
   "name" : "std::hash<char16_t>",
   "referenced_type" : "_ZTINSt3__14hashIDsEE",
   "self_type" : "_ZTINSt3__14hashIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIamEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIaEE",
   "name" : "std::hash<signed char>",
   "referenced_type" : "_ZTINSt3__14hashIaEE",
   "self_type" : "_ZTINSt3__14hashIaEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIbmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIbEE",
   "name" : "std::hash<bool>",
   "referenced_type" : "_ZTINSt3__14hashIbEE",
   "self_type" : "_ZTINSt3__14hashIbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIcmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIcEE",
   "name" : "std::hash<char>",
   "referenced_type" : "_ZTINSt3__14hashIcEE",
   "self_type" : "_ZTINSt3__14hashIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113__scalar_hashIdLm1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIdEE",
   "name" : "std::hash<double>",
   "referenced_type" : "_ZTINSt3__14hashIdEE",
   "self_type" : "_ZTINSt3__14hashIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113__scalar_hashIeLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIeEE",
   "name" : "std::hash<long double>",
   "referenced_type" : "_ZTINSt3__14hashIeEE",
   "self_type" : "_ZTINSt3__14hashIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113__scalar_hashIfLm0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIfEE",
   "name" : "std::hash<float>",
   "referenced_type" : "_ZTINSt3__14hashIfEE",
   "self_type" : "_ZTINSt3__14hashIfEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIhmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIhEE",
   "name" : "std::hash<unsigned char>",
   "referenced_type" : "_ZTINSt3__14hashIhEE",
   "self_type" : "_ZTINSt3__14hashIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIimEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIiEE",
   "name" : "std::hash<int>",
   "referenced_type" : "_ZTINSt3__14hashIiEE",
   "self_type" : "_ZTINSt3__14hashIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIjmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIjEE",
   "name" : "std::hash<unsigned int>",
   "referenced_type" : "_ZTINSt3__14hashIjEE",
   "self_type" : "_ZTINSt3__14hashIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIlmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIlEE",
   "name" : "std::hash<long>",
   "referenced_type" : "_ZTINSt3__14hashIlEE",
   "self_type" : "_ZTINSt3__14hashIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionImmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashImEE",
   "name" : "std::hash<unsigned long>",
   "referenced_type" : "_ZTINSt3__14hashImEE",
   "self_type" : "_ZTINSt3__14hashImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113__scalar_hashInLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashInEE",
   "name" : "std::hash<__int128_t>",
   "referenced_type" : "_ZTINSt3__14hashInEE",
   "self_type" : "_ZTINSt3__14hashInEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIn" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113__scalar_hashIoLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIoEE",
   "name" : "std::hash<__uint128_t>",
   "referenced_type" : "_ZTINSt3__14hashIoEE",
   "self_type" : "_ZTINSt3__14hashIoEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIo" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIsmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIsEE",
   "name" : "std::hash<short>",
   "referenced_type" : "_ZTINSt3__14hashIsEE",
   "self_type" : "_ZTINSt3__14hashIsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionItmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashItEE",
   "name" : "std::hash<unsigned short>",
   "referenced_type" : "_ZTINSt3__14hashItEE",
   "self_type" : "_ZTINSt3__14hashItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIwmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIwEE",
   "name" : "std::hash<wchar_t>",
   "referenced_type" : "_ZTINSt3__14hashIwEE",
   "self_type" : "_ZTINSt3__14hashIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113__scalar_hashIxLm1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIxEE",
   "name" : "std::hash<long long>",
   "referenced_type" : "_ZTINSt3__14hashIxEE",
   "self_type" : "_ZTINSt3__14hashIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113__scalar_hashIyLm1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14hashIyEE",
   "name" : "std::hash<unsigned long long>",
   "referenced_type" : "_ZTINSt3__14hashIyEE",
   "self_type" : "_ZTINSt3__14hashIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14lessIvEE",
   "name" : "std::less<void>",
   "referenced_type" : "_ZTINSt3__14lessIvEE",
   "self_type" : "_ZTINSt3__14lessIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__functional_base",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14pairImmE10_CheckArgsE",
   "name" : "std::pair<unsigned long, unsigned long>::_CheckArgs",
   "referenced_type" : "_ZTINSt3__14pairImmE10_CheckArgsE",
   "self_type" : "_ZTINSt3__14pairImmE10_CheckArgsE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "first",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "second",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTINSt3__14pairImmEE",
   "name" : "std::pair<unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__14pairImmEE",
   "self_type" : "_ZTINSt3__14pairImmEE",
   "size" : 16,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14plusIvEE",
   "name" : "std::plus<void>",
   "referenced_type" : "_ZTINSt3__14plusIvEE",
   "self_type" : "_ZTINSt3__14plusIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__15__anyE",
   "name" : "std::__any",
   "referenced_type" : "_ZTINSt3__15__anyE",
   "self_type" : "_ZTINSt3__15__anyE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__15__natE",
   "name" : "std::__nat",
   "referenced_type" : "_ZTINSt3__15__natE",
   "self_type" : "_ZTINSt3__15__natE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__15__or_IJEEE",
   "name" : "std::__or_<>",
   "referenced_type" : "_ZTINSt3__15__or_IJEEE",
   "self_type" : "_ZTINSt3__15__or_IJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIA2_c"
    }
   ],
   "linker_set_key" : "_ZTINSt3__15__twoE",
   "name" : "std::__two",
   "referenced_type" : "_ZTINSt3__15__twoE",
   "self_type" : "_ZTINSt3__15__twoE",
   "size" : 2,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__15decayINS_4pairImmEEEE",
   "name" : "std::decay<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__15decayINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__15decayINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__15minusIvEE",
   "name" : "std::minus<void>",
   "referenced_type" : "_ZTINSt3__15minusIvEE",
   "self_type" : "_ZTINSt3__15minusIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__15tupleIJEEE",
   "name" : "std::tuple<>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__15tupleIJEEE",
   "self_type" : "_ZTINSt3__15tupleIJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "first",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "second",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTINSt3__16_PairTE",
   "name" : "std::_PairT",
   "referenced_type" : "_ZTINSt3__16_PairTE",
   "self_type" : "_ZTINSt3__16_PairTE",
   "size" : 16,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__16__and_IJEEE",
   "name" : "std::__and_<>",
   "referenced_type" : "_ZTINSt3__16__and_IJEEE",
   "self_type" : "_ZTINSt3__16__and_IJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__16__lessIddEE",
   "name" : "std::__less<double, double>",
   "referenced_type" : "_ZTINSt3__16__lessIddEE",
   "self_type" : "_ZTINSt3__16__lessIddEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/algorithm",
   "template_args" : [ "_ZTId", "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__16__lessIffEE",
   "name" : "std::__less<float, float>",
   "referenced_type" : "_ZTINSt3__16__lessIffEE",
   "self_type" : "_ZTINSt3__16__lessIffEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/algorithm",
   "template_args" : [ "_ZTIf", "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__16__lessIiiEE",
   "name" : "std::__less<int, int>",
   "referenced_type" : "_ZTINSt3__16__lessIiiEE",
   "self_type" : "_ZTINSt3__16__lessIiiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/algorithm",
   "template_args" : [ "_ZTIi", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__16__lessImmEE",
   "name" : "std::__less<unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__16__lessImmEE",
   "self_type" : "_ZTINSt3__16__lessImmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/algorithm",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__16bit_orIvEE",
   "name" : "std::bit_or<void>",
   "referenced_type" : "_ZTINSt3__16bit_orIvEE",
   "self_type" : "_ZTINSt3__16bit_orIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__16negateIvEE",
   "name" : "std::negate<void>",
   "referenced_type" : "_ZTINSt3__16negateIvEE",
   "self_type" : "_ZTINSt3__16negateIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__17__decayINS_4pairImmEELb1EEE",
   "name" : "std::__decay<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "_ZTINSt3__17__decayINS_4pairImmEELb1EEE",
   "self_type" : "_ZTINSt3__17__decayINS_4pairImmEELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__17bit_andIvEE",
   "name" : "std::bit_and<void>",
   "referenced_type" : "_ZTINSt3__17bit_andIvEE",
   "self_type" : "_ZTINSt3__17bit_andIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__17bit_notIvEE",
   "name" : "std::bit_not<void>",
   "referenced_type" : "_ZTINSt3__17bit_notIvEE",
   "self_type" : "_ZTINSt3__17bit_notIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__17bit_xorIvEE",
   "name" : "std::bit_xor<void>",
   "referenced_type" : "_ZTINSt3__17bit_xorIvEE",
   "self_type" : "_ZTINSt3__17bit_xorIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__17dividesIvEE",
   "name" : "std::divides<void>",
   "referenced_type" : "_ZTINSt3__17dividesIvEE",
   "self_type" : "_ZTINSt3__17dividesIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__17greaterIvEE",
   "name" : "std::greater<void>",
   "referenced_type" : "_ZTINSt3__17greaterIvEE",
   "self_type" : "_ZTINSt3__17greaterIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__17is_sameINS_4pairImmEES2_EE",
   "name" : "std::is_same<std::pair<unsigned long, unsigned long>, std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__17is_sameINS_4pairImmEES2_EE",
   "self_type" : "_ZTINSt3__17is_sameINS_4pairImmEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE", "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__17is_sameINS_4pairImmEEvEE",
   "name" : "std::is_same<std::pair<unsigned long, unsigned long>, void>",
   "referenced_type" : "_ZTINSt3__17is_sameINS_4pairImmEEvEE",
   "self_type" : "_ZTINSt3__17is_sameINS_4pairImmEEvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__17is_sameIRKmNS_5__twoEEE",
   "name" : "std::is_same<const unsigned long &, std::__two>",
   "referenced_type" : "_ZTINSt3__17is_sameIRKmNS_5__twoEEE",
   "self_type" : "_ZTINSt3__17is_sameIRKmNS_5__twoEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm", "_ZTINSt3__15__twoE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__17is_sameIRNS_4pairImmEENS_5__twoEEE",
   "name" : "std::is_same<std::pair<unsigned long, unsigned long> &, std::__two>",
   "referenced_type" : "_ZTINSt3__17is_sameIRNS_4pairImmEENS_5__twoEEE",
   "self_type" : "_ZTINSt3__17is_sameIRNS_4pairImmEENS_5__twoEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRNSt3__14pairImmEE", "_ZTINSt3__15__twoE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__17is_sameIRmNS_5__twoEEE",
   "name" : "std::is_same<unsigned long &, std::__two>",
   "referenced_type" : "_ZTINSt3__17is_sameIRmNS_5__twoEEE",
   "self_type" : "_ZTINSt3__17is_sameIRmNS_5__twoEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTINSt3__15__twoE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__116__libcpp_is_voidINS_4pairImmEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__17is_voidINS_4pairImmEEEE",
   "name" : "std::is_void<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__17is_voidINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__17is_voidINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIOmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__17is_voidIOmEE",
   "name" : "std::is_void<unsigned long &&>",
   "referenced_type" : "_ZTINSt3__17is_voidIOmEE",
   "self_type" : "_ZTINSt3__17is_voidIOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIRKmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__17is_voidIRKmEE",
   "name" : "std::is_void<const unsigned long &>",
   "referenced_type" : "_ZTINSt3__17is_voidIRKmEE",
   "self_type" : "_ZTINSt3__17is_voidIRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__116__libcpp_is_voidIRmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__17is_voidIRmEE",
   "name" : "std::is_void<unsigned long &>",
   "referenced_type" : "_ZTINSt3__17is_voidIRmEE",
   "self_type" : "_ZTINSt3__17is_voidIRmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__116__libcpp_is_voidImEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__17is_voidImEE",
   "name" : "std::is_void<unsigned long>",
   "referenced_type" : "_ZTINSt3__17is_voidImEE",
   "self_type" : "_ZTINSt3__17is_voidImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__17modulusIvEE",
   "name" : "std::modulus<void>",
   "referenced_type" : "_ZTINSt3__17modulusIvEE",
   "self_type" : "_ZTINSt3__17modulusIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__lx",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__18__sp_mutE",
   "name" : "std::__sp_mut",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__18__sp_mutE",
   "self_type" : "_ZTINSt3__18__sp_mutE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__18equal_toIvEE",
   "name" : "std::equal_to<void>",
   "referenced_type" : "_ZTINSt3__18equal_toIvEE",
   "self_type" : "_ZTINSt3__18equal_toIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__18is_arrayINS_4pairImmEEEE",
   "name" : "std::is_array<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__18is_arrayINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__18is_arrayINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__18is_classINS_4pairImmEEEE",
   "name" : "std::is_class<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__18is_classINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__18is_classINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__18is_classImEE",
   "name" : "std::is_class<unsigned long>",
   "referenced_type" : "_ZTINSt3__18is_classImEE",
   "self_type" : "_ZTINSt3__18is_classImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__18is_constImEE",
   "name" : "std::is_const<unsigned long>",
   "referenced_type" : "_ZTINSt3__18is_constImEE",
   "self_type" : "_ZTINSt3__18is_constImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__18is_unionINS_4pairImmEEEE",
   "name" : "std::is_union<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__18is_unionINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__18is_unionINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__18is_unionImEE",
   "name" : "std::is_union<unsigned long>",
   "referenced_type" : "_ZTINSt3__18is_unionImEE",
   "self_type" : "_ZTINSt3__18is_unionImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__18iteratorINS_19output_iterator_tagEvvvvEE",
   "name" : "std::iterator<std::output_iterator_tag, void, void, void, void>",
   "referenced_type" : "_ZTINSt3__18iteratorINS_19output_iterator_tagEvvvvEE",
   "self_type" : "_ZTINSt3__18iteratorINS_19output_iterator_tagEvvvvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" :
   [
    "_ZTINSt3__119output_iterator_tagE",
    "_ZTIv",
    "_ZTIv",
    "_ZTIv",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19__uncvrefINS_4pairImmEEEE",
   "name" : "std::__uncvref<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__19__uncvrefINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__19__uncvrefINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19add_constImEE",
   "name" : "std::add_const<unsigned long>",
   "referenced_type" : "_ZTINSt3__19add_constImEE",
   "self_type" : "_ZTINSt3__19add_constImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19allocatorIKvEE",
   "name" : "std::allocator<const void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__19allocatorIKvEE",
   "self_type" : "_ZTINSt3__19allocatorIKvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19allocatorINS_40__shared_ptr_dummy_rebind_allocator_typeEEE",
   "name" : "std::allocator<std::__shared_ptr_dummy_rebind_allocator_type>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__19allocatorINS_40__shared_ptr_dummy_rebind_allocator_typeEEE",
   "self_type" : "_ZTINSt3__19allocatorINS_40__shared_ptr_dummy_rebind_allocator_typeEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__140__shared_ptr_dummy_rebind_allocator_typeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19allocatorIvEE",
   "name" : "std::allocator<void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__19allocatorIvEE",
   "self_type" : "_ZTINSt3__19allocatorIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19enable_ifILb0EbEE",
   "name" : "std::enable_if<false, bool>",
   "referenced_type" : "_ZTINSt3__19enable_ifILb0EbEE",
   "self_type" : "_ZTINSt3__19enable_ifILb0EbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19enable_ifILb0EdEE",
   "name" : "std::enable_if<false, double>",
   "referenced_type" : "_ZTINSt3__19enable_ifILb0EdEE",
   "self_type" : "_ZTINSt3__19enable_ifILb0EdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19enable_ifILb0EiEE",
   "name" : "std::enable_if<false, int>",
   "referenced_type" : "_ZTINSt3__19enable_ifILb0EiEE",
   "self_type" : "_ZTINSt3__19enable_ifILb0EiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19enable_ifILb0ElEE",
   "name" : "std::enable_if<false, long>",
   "referenced_type" : "_ZTINSt3__19enable_ifILb0ElEE",
   "self_type" : "_ZTINSt3__19enable_ifILb0ElEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19enable_ifILb0ExEE",
   "name" : "std::enable_if<false, long long>",
   "referenced_type" : "_ZTINSt3__19enable_ifILb0ExEE",
   "self_type" : "_ZTINSt3__19enable_ifILb0ExEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19enable_ifILb1EbEE",
   "name" : "std::enable_if<true, bool>",
   "referenced_type" : "_ZTINSt3__19enable_ifILb1EbEE",
   "self_type" : "_ZTINSt3__19enable_ifILb1EbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19enable_ifILb1EvEE",
   "name" : "std::enable_if<true, void>",
   "referenced_type" : "_ZTINSt3__19enable_ifILb1EvEE",
   "self_type" : "_ZTINSt3__19enable_ifILb1EvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__19is_scalarIDnEE",
   "name" : "std::is_scalar<nullptr_t>",
   "referenced_type" : "_ZTINSt3__19is_scalarIDnEE",
   "self_type" : "_ZTINSt3__19is_scalarIDnEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19remove_cvIKiEE",
   "name" : "std::remove_cv<const int>",
   "referenced_type" : "_ZTINSt3__19remove_cvIKiEE",
   "self_type" : "_ZTINSt3__19remove_cvIKiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19remove_cvINS_4pairImmEEEE",
   "name" : "std::remove_cv<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__19remove_cvINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__19remove_cvINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19remove_cvIOmEE",
   "name" : "std::remove_cv<unsigned long &&>",
   "referenced_type" : "_ZTINSt3__19remove_cvIOmEE",
   "self_type" : "_ZTINSt3__19remove_cvIOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19remove_cvIRKmEE",
   "name" : "std::remove_cv<const unsigned long &>",
   "referenced_type" : "_ZTINSt3__19remove_cvIRKmEE",
   "self_type" : "_ZTINSt3__19remove_cvIRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19remove_cvIRmEE",
   "name" : "std::remove_cv<unsigned long &>",
   "referenced_type" : "_ZTINSt3__19remove_cvIRmEE",
   "self_type" : "_ZTINSt3__19remove_cvIRmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19remove_cvIdEE",
   "name" : "std::remove_cv<double>",
   "referenced_type" : "_ZTINSt3__19remove_cvIdEE",
   "self_type" : "_ZTINSt3__19remove_cvIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19remove_cvIeEE",
   "name" : "std::remove_cv<long double>",
   "referenced_type" : "_ZTINSt3__19remove_cvIeEE",
   "self_type" : "_ZTINSt3__19remove_cvIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19remove_cvIfEE",
   "name" : "std::remove_cv<float>",
   "referenced_type" : "_ZTINSt3__19remove_cvIfEE",
   "self_type" : "_ZTINSt3__19remove_cvIfEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19remove_cvIiEE",
   "name" : "std::remove_cv<int>",
   "referenced_type" : "_ZTINSt3__19remove_cvIiEE",
   "self_type" : "_ZTINSt3__19remove_cvIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19remove_cvIlEE",
   "name" : "std::remove_cv<long>",
   "referenced_type" : "_ZTINSt3__19remove_cvIlEE",
   "self_type" : "_ZTINSt3__19remove_cvIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__19remove_cvImEE",
   "name" : "std::remove_cv<unsigned long>",
   "referenced_type" : "_ZTINSt3__19remove_cvImEE",
   "self_type" : "_ZTINSt3__19remove_cvImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTISt10bad_typeid",
   "name" : "std::bad_typeid",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt10bad_typeid",
   "self_type" : "_ZTISt10bad_typeid",
   "size" : 8,
   "source_file" : "external/libcxx/include/typeinfo",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt10bad_typeid"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt10bad_typeidD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt10bad_typeidD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt10bad_typeid4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__118__libcpp_refstringE"
    }
   ],
   "linker_set_key" : "_ZTISt11logic_error",
   "name" : "std::logic_error",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt11logic_error",
   "self_type" : "_ZTISt11logic_error",
   "size" : 16,
   "source_file" : "external/libcxx/include/stdexcept",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11logic_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt13runtime_error"
    }
   ],
   "linker_set_key" : "_ZTISt11range_error",
   "name" : "std::range_error",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt11range_error",
   "self_type" : "_ZTISt11range_error",
   "size" : 16,
   "source_file" : "external/libcxx/include/stdexcept",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11range_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt11logic_error"
    }
   ],
   "linker_set_key" : "_ZTISt12domain_error",
   "name" : "std::domain_error",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt12domain_error",
   "self_type" : "_ZTISt12domain_error",
   "size" : 16,
   "source_file" : "external/libcxx/include/stdexcept",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12domain_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt11logic_error"
    }
   ],
   "linker_set_key" : "_ZTISt12length_error",
   "name" : "std::length_error",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt12length_error",
   "self_type" : "_ZTISt12length_error",
   "size" : 16,
   "source_file" : "external/libcxx/include/stdexcept",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12length_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt11logic_error"
    }
   ],
   "linker_set_key" : "_ZTISt12out_of_range",
   "name" : "std::out_of_range",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt12out_of_range",
   "self_type" : "_ZTISt12out_of_range",
   "size" : 16,
   "source_file" : "external/libcxx/include/stdexcept",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12out_of_range"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTISt13bad_exception",
   "name" : "std::bad_exception",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt13bad_exception",
   "self_type" : "_ZTISt13bad_exception",
   "size" : 8,
   "source_file" : "external/libcxx/include/exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt13bad_exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt13bad_exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt13bad_exceptionD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13bad_exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTISt13exception_ptr",
   "name" : "std::exception_ptr",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt13exception_ptr",
   "self_type" : "_ZTISt13exception_ptr",
   "size" : 8,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__118__libcpp_refstringE"
    }
   ],
   "linker_set_key" : "_ZTISt13runtime_error",
   "name" : "std::runtime_error",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt13runtime_error",
   "self_type" : "_ZTISt13runtime_error",
   "size" : 16,
   "source_file" : "external/libcxx/include/stdexcept",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt13runtime_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt13runtime_error"
    }
   ],
   "linker_set_key" : "_ZTISt14overflow_error",
   "name" : "std::overflow_error",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt14overflow_error",
   "self_type" : "_ZTISt14overflow_error",
   "size" : 16,
   "source_file" : "external/libcxx/include/stdexcept",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt14overflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt13runtime_error"
    }
   ],
   "linker_set_key" : "_ZTISt15underflow_error",
   "name" : "std::underflow_error",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt15underflow_error",
   "self_type" : "_ZTISt15underflow_error",
   "size" : 16,
   "source_file" : "external/libcxx/include/stdexcept",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt15underflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__begin_",
     "referenced_type" : "_ZTIPKd"
    },
    {
     "access" : "private",
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTISt16initializer_listIdE",
   "name" : "std::initializer_list<double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt16initializer_listIdE",
   "self_type" : "_ZTISt16initializer_listIdE",
   "size" : 16,
   "source_file" : "external/libcxx/include/initializer_list",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__begin_",
     "referenced_type" : "_ZTIPKi"
    },
    {
     "access" : "private",
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTISt16initializer_listIiE",
   "name" : "std::initializer_list<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt16initializer_listIiE",
   "self_type" : "_ZTISt16initializer_listIiE",
   "size" : 16,
   "source_file" : "external/libcxx/include/initializer_list",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt11logic_error"
    }
   ],
   "linker_set_key" : "_ZTISt16invalid_argument",
   "name" : "std::invalid_argument",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt16invalid_argument",
   "self_type" : "_ZTISt16invalid_argument",
   "size" : 16,
   "source_file" : "external/libcxx/include/stdexcept",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16invalid_argument"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "field_offset" : 64,
     "referenced_type" : "_ZTISt13exception_ptr"
    }
   ],
   "linker_set_key" : "_ZTISt16nested_exception",
   "name" : "std::nested_exception",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt16nested_exception",
   "self_type" : "_ZTISt16nested_exception",
   "size" : 16,
   "source_file" : "external/libcxx/include/exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16nested_exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16nested_exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16nested_exceptionD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9bad_alloc"
    }
   ],
   "linker_set_key" : "_ZTISt20bad_array_new_length",
   "name" : "std::bad_array_new_length",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt20bad_array_new_length",
   "self_type" : "_ZTISt20bad_array_new_length",
   "size" : 8,
   "source_file" : "external/libcxx/include/new",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt20bad_array_new_length"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt20bad_array_new_lengthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt20bad_array_new_lengthD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt20bad_array_new_length4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTISt8bad_cast",
   "name" : "std::bad_cast",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt8bad_cast",
   "self_type" : "_ZTISt8bad_cast",
   "size" : 8,
   "source_file" : "external/libcxx/include/typeinfo",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt8bad_cast"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt8bad_castD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt8bad_castD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt8bad_cast4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTISt9bad_alloc",
   "name" : "std::bad_alloc",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt9bad_alloc",
   "self_type" : "_ZTISt9bad_alloc",
   "size" : 8,
   "source_file" : "external/libcxx/include/new",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9bad_alloc"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9bad_allocD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9bad_allocD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9bad_alloc4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTISt9exception",
   "name" : "std::exception",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt9exception",
   "self_type" : "_ZTISt9exception",
   "size" : 8,
   "source_file" : "external/libcxx/include/exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9exceptionD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTISt9nothrow_t",
   "name" : "std::nothrow_t",
   "referenced_type" : "_ZTISt9nothrow_t",
   "self_type" : "_ZTISt9nothrow_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__type_name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTISt9type_info",
   "name" : "std::type_info",
   "record_kind" : "class",
   "referenced_type" : "_ZTISt9type_info",
   "self_type" : "_ZTISt9type_info",
   "size" : 16,
   "source_file" : "external/libcxx/include/typeinfo",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9type_info"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9type_infoD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9type_infoD0Ev"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIONSt3__118__sfinae_ctor_baseILb0ELb0EEE",
   "name" : "std::__sfinae_ctor_base<false, false> &&",
   "referenced_type" : "_ZTINSt3__118__sfinae_ctor_baseILb0ELb0EEE",
   "self_type" : "_ZTIONSt3__118__sfinae_ctor_baseILb0ELb0EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIONSt3__118__sfinae_ctor_baseILb0ELb1EEE",
   "name" : "std::__sfinae_ctor_base<false, true> &&",
   "referenced_type" : "_ZTINSt3__118__sfinae_ctor_baseILb0ELb1EEE",
   "self_type" : "_ZTIONSt3__118__sfinae_ctor_baseILb0ELb1EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIONSt3__118__sfinae_ctor_baseILb1ELb0EEE",
   "name" : "std::__sfinae_ctor_base<true, false> &&",
   "referenced_type" : "_ZTINSt3__118__sfinae_ctor_baseILb1ELb0EEE",
   "self_type" : "_ZTIONSt3__118__sfinae_ctor_baseILb1ELb0EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIONSt3__120__sfinae_assign_baseILb0ELb0EEE",
   "name" : "std::__sfinae_assign_base<false, false> &&",
   "referenced_type" : "_ZTINSt3__120__sfinae_assign_baseILb0ELb0EEE",
   "self_type" : "_ZTIONSt3__120__sfinae_assign_baseILb0ELb0EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIONSt3__120__sfinae_assign_baseILb0ELb1EEE",
   "name" : "std::__sfinae_assign_base<false, true> &&",
   "referenced_type" : "_ZTINSt3__120__sfinae_assign_baseILb0ELb1EEE",
   "self_type" : "_ZTIONSt3__120__sfinae_assign_baseILb0ELb1EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIONSt3__120__sfinae_assign_baseILb1ELb0EEE",
   "name" : "std::__sfinae_assign_base<true, false> &&",
   "referenced_type" : "_ZTINSt3__120__sfinae_assign_baseILb1ELb0EEE",
   "self_type" : "_ZTIONSt3__120__sfinae_assign_baseILb1ELb0EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIONSt3__14pairImmEE",
   "name" : "std::pair<unsigned long, unsigned long> &&",
   "referenced_type" : "_ZTINSt3__14pairImmEE",
   "self_type" : "_ZTIONSt3__14pairImmEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIOm",
   "name" : "unsigned long &&",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIOm",
   "size" : 8,
