{
 "array_types" :
 [
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA16_Ds",
   "name" : "char16_t [16]",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIA16_Ds",
   "size" : 32,
   "source_file" : "external/icu/icu4c/source/common/unicode/parseerr.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA4_h",
   "name" : "unsigned char [4]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA4_h",
   "size" : 4,
   "source_file" : "external/icu/icu4c/source/common/unicode/udata.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA8_t",
   "name" : "unsigned short [8]",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIA8_t",
   "size" : 16,
   "source_file" : "external/icu/icu4c/source/common/unicode/uset.h"
  },
  {
   "linker_set_key" : "_ZTIA_h",
   "name" : "unsigned char []",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA_h",
   "source_file" : "external/icu/icu4c/source/common/unicode/utf_old.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIDs",
   "name" : "char16_t",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIDs",
   "size" : 2
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",

   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 8,
   "source_file" : "external/icu/icu4c/source/common/unicode/urep.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "external/icu/icu4c/source/common/unicode/ucnv_err.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 8,
   "source_file" : "external/icu/libandroidicu/static_shim/shim.cpp"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 8,
   "source_file" : "external/icu/icu4c/source/common/unicode/ucnv_err.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/icu/icu4c/source/common/unicode/utext.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIA_Kh",
   "name" : "unsigned char const[]",
   "referenced_type" : "_ZTIA_h",
   "self_type" : "_ZTIA_Kh",
   "source_file" : "external/icu/icu4c/source/common/unicode/utf_old.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10UTextFuncs",
   "name" : "const UTextFuncs",
   "referenced_type" : "_ZTI10UTextFuncs",
   "self_type" : "_ZTIK10UTextFuncs",
   "size" : 112,
   "source_file" : "external/icu/icu4c/source/common/unicode/utext.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK12UNormalizer2",
   "name" : "const UNormalizer2",
   "referenced_type" : "_ZTI12UNormalizer2",
   "self_type" : "_ZTIK12UNormalizer2",
   "source_file" : "external/icu/libandroidicu/static_shim/shim.cpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13UCharIterator",
   "name" : "const UCharIterator",
   "referenced_type" : "_ZTI13UCharIterator",
   "self_type" : "_ZTIK13UCharIterator",
   "size" : 112,
   "source_file" : "external/icu/icu4c/source/common/unicode/uiter.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK13UCharsetMatch",
   "name" : "const UCharsetMatch",
   "referenced_type" : "_ZTI13UCharsetMatch",
   "self_type" : "_ZTIK13UCharsetMatch",
   "source_file" : "external/icu/libandroidicu/static_shim/shim.cpp"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK14UBreakIterator",
   "name" : "const UBreakIterator",
   "referenced_type" : "_ZTI14UBreakIterator",
   "self_type" : "_ZTIK14UBreakIterator",
   "source_file" : "external/icu/libandroidicu/static_shim/shim.cpp"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK15UResourceBundle",
   "name" : "const UResourceBundle",
   "referenced_type" : "_ZTI15UResourceBundle",
   "self_type" : "_ZTIK15UResourceBundle",
   "source_file" : "external/icu/libandroidicu/static_shim/shim.cpp"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK5UBiDi",
   "name" : "const UBiDi",
   "referenced_type" : "_ZTI5UBiDi",
   "self_type" : "_ZTIK5UBiDi",
   "source_file" : "external/icu/libandroidicu/static_shim/shim.cpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK5UText",
   "name" : "const UText",
   "referenced_type" : "_ZTI5UText",
   "self_type" : "_ZTIK5UText",
   "size" : 144,
   "source_file" : "external/icu/icu4c/source/common/unicode/utext.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK9UCollator",
   "name" : "const UCollator",
   "referenced_type" : "_ZTI9UCollator",
   "self_type" : "_ZTIK9UCollator",
   "source_file" : "external/icu/libandroidicu/static_shim/shim.cpp"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKDs",
   "name" : "const char16_t",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIKDs",
   "size" : 2,
   "source_file" : "external/icu/icu4c/source/common/unicode/utext.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "external/icu/libandroidicu/static_shim/shim.cpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPv",
   "name" : "void *const",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIKPv",
   "size" : 8,
   "source_file" : "external/icu/icu4c/source/common/unicode/urep.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/icu/icu4c/source/common/unicode/ucnv_err.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/icu/icu4c/source/common/unicode/ucptrie.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/icu/icu4c/source/common/unicode/ucptrie.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "external/icu/icu4c/source/common/unicode/uset.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/icu/icu4c/source/common/unicode/utext.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tableSize",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "clone",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFP5UTextS0_PKS_aP10UErrorCodeE"
    },
    {
     "field_name" : "nativeLength",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFlP5UTextE"
    },
    {
     "field_name" : "access",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFaP5UTextlaE"
    },
    {
     "field_name" : "extract",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP5UTextllPDsiP10UErrorCodeE"
    },
    {
     "field_name" : "replace",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFiP5UTextllPKDsiP10UErrorCodeE"
    },
    {
     "field_name" : "copy",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFvP5UTextlllaP10UErrorCodeE"
    },
    {
     "field_name" : "mapOffsetToNative",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFlPK5UTextE"
    },
    {
     "field_name" : "mapNativeIndexToUTF16",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFiPK5UTextlE"
    },
    {
     "field_name" : "close",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFvP5UTextE"
    },
    {
     "field_name" : "spare1",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFvP5UTextE"
    },
    {
     "field_name" : "spare2",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvP5UTextE"
    },
    {
     "field_name" : "spare3",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFvP5UTextE"
    }
   ],
   "linker_set_key" : "_ZTI10UTextFuncs",
   "name" : "UTextFuncs",
   "referenced_type" : "_ZTI10UTextFuncs",
   "self_type" : "_ZTI10UTextFuncs",
   "size" : 112,
   "source_file" : "external/icu/icu4c/source/common/unicode/utext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ptr0",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "ptr16",
     "referenced_type" : "_ZTIPKt"
    },
    {
     "field_name" : "ptr32",
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "ptr8",
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI11UCPTrieData",
   "name" : "UCPTrieData",
   "record_kind" : "union",
   "referenced_type" : "_ZTI11UCPTrieData",
   "self_type" : "_ZTI11UCPTrieData",
   "size" : 8,
   "source_file" : "external/icu/icu4c/source/common/unicode/ucptrie.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "line",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "preContext",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA16_Ds"
    },
    {
     "field_name" : "postContext",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_Ds"
    }
   ],
   "linker_set_key" : "_ZTI11UParseError",
   "name" : "UParseError",
   "referenced_type" : "_ZTI11UParseError",
   "self_type" : "_ZTI11UParseError",
   "size" : 72,
   "source_file" : "external/icu/icu4c/source/common/unicode/parseerr.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "context",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "start",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "index",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "limit",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reservedField",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "getIndex",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP13UCharIterator19UCharIteratorOriginE"
    },
    {
     "field_name" : "move",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP13UCharIteratori19UCharIteratorOriginE"
    },
    {
     "field_name" : "hasNext",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFaP13UCharIteratorE"
    },
    {
     "field_name" : "hasPrevious",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFaP13UCharIteratorE"
    },
    {
     "field_name" : "current",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFiP13UCharIteratorE"
    },
    {
     "field_name" : "next",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFiP13UCharIteratorE"
    },
    {
     "field_name" : "previous",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFiP13UCharIteratorE"
    },
    {
     "field_name" : "reservedFn",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFiP13UCharIteratoriE"
    },
    {
     "field_name" : "getState",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFjPK13UCharIteratorE"
    },
    {
     "field_name" : "setState",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFvP13UCharIteratorjP10UErrorCodeE"
    }
   ],
   "linker_set_key" : "_ZTI13UCharIterator",
   "name" : "UCharIterator",
   "referenced_type" : "_ZTI13UCharIterator",
   "self_type" : "_ZTI13UCharIterator",
   "size" : 112,
   "source_file" : "external/icu/icu4c/source/common/unicode/uiter.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "field",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "beginIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "endIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14UFieldPosition",
   "name" : "UFieldPosition",
   "referenced_type" : "_ZTI14UFieldPosition",
   "self_type" : "_ZTI14UFieldPosition",
   "size" : 12,
   "source_file" : "external/icu/icu4c/source/common/unicode/umisc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "array",
     "referenced_type" : "_ZTIPKt"
    },
    {
     "field_name" : "bmpLength",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "length",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "staticArray",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA8_t"
    }
   ],
   "linker_set_key" : "_ZTI14USerializedSet",
   "name" : "USerializedSet",
   "referenced_type" : "_ZTI14USerializedSet",
   "self_type" : "_ZTI14USerializedSet",
   "size" : 32,
   "source_file" : "external/icu/icu4c/source/common/unicode/uset.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "contextStart",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "contextLimit",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "start",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "limit",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14UTransPosition",
   "name" : "UTransPosition",
   "referenced_type" : "_ZTI14UTransPosition",
   "self_type" : "_ZTI14UTransPosition",
   "size" : 16,
   "source_file" : "external/icu/icu4c/source/i18n/unicode/utrans.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "length",
     "referenced_type" : "_ZTIPFiPKPvE"
    },
    {
     "field_name" : "charAt",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFDsPKPviE"
    },
    {
     "field_name" : "char32At",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPKPviE"
    },
    {
     "field_name" : "replace",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvPPviiPKDsiE"
    },
    {
     "field_name" : "extract",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFvPPviiPDsE"
    },
    {
     "field_name" : "copy",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFvPPviiiE"
    }
   ],
   "linker_set_key" : "_ZTI21UReplaceableCallbacks",
   "name" : "UReplaceableCallbacks",
   "referenced_type" : "_ZTI21UReplaceableCallbacks",
   "self_type" : "_ZTI21UReplaceableCallbacks",
   "size" : 48,
   "source_file" : "external/icu/icu4c/source/common/unicode/urep.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "flush",
     "field_offset" : 16,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "converter",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP10UConverter"
    },
    {
     "field_name" : "source",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "sourceLimit",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "target",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPDs"
    },
    {
     "field_name" : "targetLimit",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKDs"
    },
    {
     "field_name" : "offsets",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPi"
    }
   ],
   "linker_set_key" : "_ZTI23UConverterToUnicodeArgs",
   "name" : "UConverterToUnicodeArgs",
   "referenced_type" : "_ZTI23UConverterToUnicodeArgs",
   "self_type" : "_ZTI23UConverterToUnicodeArgs",
   "size" : 56,
   "source_file" : "external/icu/icu4c/source/common/unicode/ucnv_err.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "flush",
     "field_offset" : 16,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "converter",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP10UConverter"
    },
    {
     "field_name" : "source",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKDs"
    },
    {
     "field_name" : "sourceLimit",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKDs"
    },
    {
     "field_name" : "target",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "targetLimit",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "offsets",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPi"
    }
   ],
   "linker_set_key" : "_ZTI25UConverterFromUnicodeArgs",
   "name" : "UConverterFromUnicodeArgs",
   "referenced_type" : "_ZTI25UConverterFromUnicodeArgs",
   "self_type" : "_ZTI25UConverterFromUnicodeArgs",
   "size" : 56,
   "source_file" : "external/icu/icu4c/source/common/unicode/ucnv_err.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "providerProperties",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sizeOfStruct",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "chunkNativeLimit",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "extraSize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nativeIndexingLimit",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "chunkNativeStart",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "chunkOffset",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "chunkLength",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "chunkContents",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKDs"
    },
    {
     "field_name" : "pFuncs",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPK10UTextFuncs"
    },
    {
     "field_name" : "pExtra",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "context",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "p",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "q",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "r",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "privP",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "a",
     "field_offset" : 896,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "b",
     "field_offset" : 960,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "c",
     "field_offset" : 992,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "privA",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "privB",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "privC",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5UText",
   "name" : "UText",
   "referenced_type" : "_ZTI5UText",
   "self_type" : "_ZTI5UText",
   "size" : 144,
   "source_file" : "external/icu/icu4c/source/common/unicode/utext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "_ZTIPKt"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11UCPTrieData"
    },
    {
     "field_name" : "indexLength",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dataLength",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "highStart",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shifted12HighStart",
     "field_offset" : 224,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "type",
     "field_offset" : 240,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "valueWidth",
     "field_offset" : 248,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "reserved32",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved16",
     "field_offset" : 288,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "index3NullOffset",
     "field_offset" : 304,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "dataNullOffset",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nullValue",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7UCPTrie",
   "name" : "UCPTrie",
   "referenced_type" : "_ZTI7UCPTrie",
   "self_type" : "_ZTI7UCPTrie",
   "size" : 48,
   "source_file" : "external/icu/icu4c/source/common/unicode/ucptrie.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "reservedWord",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "isBigEndian",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "charsetFamily",
     "field_offset" : 40,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "sizeofUChar",
     "field_offset" : 48,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "reservedByte",
     "field_offset" : 56,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "dataFormat",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "formatVersion",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "dataVersion",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9UDataInfo",
   "name" : "UDataInfo",
   "referenced_type" : "_ZTI9UDataInfo",
   "self_type" : "_ZTI9UDataInfo",
   "size" : 20,
   "source_file" : "external/icu/icu4c/source/common/unicode/udata.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "isTransitionalDifferent",
     "field_offset" : 16,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "reservedB3",
     "field_offset" : 24,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "errors",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reservedI2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reservedI3",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI9UIDNAInfo",
   "name" : "UIDNAInfo",
   "referenced_type" : "_ZTI9UIDNAInfo",
   "self_type" : "_ZTI9UIDNAInfo",
   "size" : 16,
   "source_file" : "external/icu/icu4c/source/common/unicode/uidna.h"
  }
 ],
 "rvalue_reference_types" : []
}
