{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA12_i",
   "name" : "int [12]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA12_i",
   "size" : 48,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA14_i",
   "name" : "int [14]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA14_i",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_c",
   "name" : "char [16]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA16_c",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA16_m",
   "name" : "unsigned long [16]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA16_m",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA2_i",
   "name" : "int [2]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA2_i",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA4_l",
   "name" : "long [4]",

   "name" : "scudo::PatternFillByte",
   "referenced_type" : "_ZTIKh",
   "source_file" : "external/scudo/standalone/common.h"
  },
  {
   "linker_set_key" : "_ZZN5scudoL12formatStringEPcmPKcSt9__va_listE17PrintfFormatsHelp",
   "name" : "PrintfFormatsHelp",
   "referenced_type" : "_ZTIPKc",
   "source_file" : "external/scudo/standalone/string_utils.cpp"
  }
 ],
 "lvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIRc",
   "name" : "char &",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIRc",
   "size" : 8,
   "source_file" : "external/scudo/standalone/vector.h"
  }
 ],
 "pointer_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKN5scudo12ScopedStringE",
   "name" : "const scudo::ScopedString *",
   "referenced_type" : "_ZTIKN5scudo12ScopedStringE",
   "self_type" : "_ZTIPKN5scudo12ScopedStringE",
   "size" : 8,
   "source_file" : "external/scudo/standalone/string_utils.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKN5scudo12VectorNoCtorIcEE",
   "name" : "const scudo::VectorNoCtor<char> *",
   "referenced_type" : "_ZTIKN5scudo12VectorNoCtorIcEE",
   "self_type" : "_ZTIPKN5scudo12VectorNoCtorIcEE",
   "size" : 8,
   "source_file" : "external/scudo/standalone/vector.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 8,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 8,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN5scudo12ScopedStringE",
   "name" : "scudo::ScopedString *",
   "referenced_type" : "_ZTIN5scudo12ScopedStringE",
   "self_type" : "_ZTIPN5scudo12ScopedStringE",
   "size" : 8,
   "source_file" : "external/scudo/standalone/string_utils.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN5scudo12VectorNoCtorIcEE",
   "name" : "scudo::VectorNoCtor<char> *",
   "referenced_type" : "_ZTIN5scudo12VectorNoCtorIcEE",
   "self_type" : "_ZTIPN5scudo12VectorNoCtorIcEE",
   "size" : 8,
   "source_file" : "external/scudo/standalone/vector.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN5scudo6VectorIcEE",
   "name" : "scudo::Vector<char> *",
   "referenced_type" : "_ZTIN5scudo6VectorIcEE",
   "self_type" : "_ZTIPN5scudo6VectorIcEE",
   "size" : 8,
   "source_file" : "external/scudo/standalone/vector.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 8,
   "source_file" : "external/scudo/standalone/common.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN5scudo12ScopedStringE",
   "name" : "const scudo::ScopedString",
   "referenced_type" : "_ZTIN5scudo12ScopedStringE",
   "self_type" : "_ZTIKN5scudo12ScopedStringE",
   "size" : 32,
   "source_file" : "external/scudo/standalone/string_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN5scudo12VectorNoCtorIcEE",
   "name" : "const scudo::VectorNoCtor<char>",
   "referenced_type" : "_ZTIN5scudo12VectorNoCtorIcEE",
   "self_type" : "_ZTIKN5scudo12VectorNoCtorIcEE",
   "size" : 24,
   "source_file" : "external/scudo/standalone/vector.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKv",
   "name" : "const void *const",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIKPKv",
   "size" : 8,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPc",
   "name" : "char *const",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIKPc",
   "size" : 8,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPv",
   "name" : "void *const",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIKPv",
   "size" : 8,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/scudo/standalone/common.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "external/scudo/standalone/common.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "bionic/libc/include/string.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA12_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 48,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA14_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA4_l"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "String",
     "referenced_type" : "_ZTIN5scudo6VectorIcEE"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo12ScopedStringE",
   "name" : "scudo::ScopedString",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN5scudo12ScopedStringE",
   "self_type" : "_ZTIN5scudo12ScopedStringE",
   "size" : 32,
   "source_file" : "external/scudo/standalone/string_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "CapacityBytes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "Size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo12VectorNoCtorIcEE",
   "name" : "scudo::VectorNoCtor<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN5scudo12VectorNoCtorIcEE",
   "self_type" : "_ZTIN5scudo12VectorNoCtorIcEE",
   "size" : 24,
   "source_file" : "external/scudo/standalone/vector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5scudo15MapPlatformDataE",
   "name" : "scudo::MapPlatformData",
   "referenced_type" : "_ZTIN5scudo15MapPlatformDataE",
   "self_type" : "_ZTIN5scudo15MapPlatformDataE",
   "size" : 1,
   "source_file" : "external/scudo/standalone/linux.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5scudo12VectorNoCtorIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo6VectorIcEE",
   "name" : "scudo::Vector<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN5scudo6VectorIcEE",
   "self_type" : "_ZTIN5scudo6VectorIcEE",
   "size" : 24,
   "source_file" : "external/scudo/standalone/vector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "BlockBegin",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "BlockSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "RegionBegin",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "RegionEnd",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN5scudo9BlockInfoE",
   "name" : "scudo::BlockInfo",
   "referenced_type" : "_ZTIN5scudo9BlockInfoE",
   "self_type" : "_ZTIN5scudo9BlockInfoE",
   "size" : 32,
   "source_file" : "external/scudo/standalone/common.h"
  }
 ],
 "rvalue_reference_types" : []
}
