#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GNSS_V1_0_IGNSSDEBUG_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GNSS_V1_0_IGNSSDEBUG_H

#include <android/hardware/gnss/1.0/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace gnss {
namespace V1_0 {

/**
 * Extended interface for DEBUG support.
 */
struct IGnssDebug : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.gnss@1.0::IGnssDebug"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class SatelliteEphemerisType : uint8_t;
    enum class SatelliteEphemerisSource : uint8_t;
    enum class SatelliteEphemerisHealth : uint8_t;
    struct PositionDebug;
    struct TimeDebug;
    struct SatelliteData;
    struct DebugData;

    enum class SatelliteEphemerisType : uint8_t {
        /**
         * Ephemeris is known for this satellite.
         */
        EPHEMERIS = 0,
        /**
         * Ephemeris is not known, but Almanac (approximate location) is known.
         */
        ALMANAC_ONLY = 1 /* ::android::hardware::gnss::V1_0::IGnssDebug::SatelliteEphemerisType.EPHEMERIS implicitly + 1 */,
        /**
         * Both ephemeris & almanac are not known (e.g. during a cold start
         * blind search.)
         */
        NOT_AVAILABLE = 2 /* ::android::hardware::gnss::V1_0::IGnssDebug::SatelliteEphemerisType.ALMANAC_ONLY implicitly + 1 */,
    };

    enum class SatelliteEphemerisSource : uint8_t {
        /**
         * The ephemeris (or almanac only) information was demodulated from the
         * signal received on the device
         */
        DEMODULATED = 0,
        /**
         * The ephemeris (or almanac only) information was received from a SUPL
         * server.
         */
        SUPL_PROVIDED = 1 /* ::android::hardware::gnss::V1_0::IGnssDebug::SatelliteEphemerisSource.DEMODULATED implicitly + 1 */,
        /**
         * The ephemeris (or almanac only) information was provided by another
         * server.
         */
        OTHER_SERVER_PROVIDED = 2 /* ::android::hardware::gnss::V1_0::IGnssDebug::SatelliteEphemerisSource.SUPL_PROVIDED implicitly + 1 */,
        /**
         * The ephemeris (or almanac only) information was provided by another
         * method, e.g. injected via a local debug tool, from build defaults
         * (e.g. almanac), or is from a satellite
         * with SatelliteEphemerisType::NOT_AVAILABLE.
         */
        OTHER = 3 /* ::android::hardware::gnss::V1_0::IGnssDebug::SatelliteEphemerisSource.OTHER_SERVER_PROVIDED implicitly + 1 */,
    };

    enum class SatelliteEphemerisHealth : uint8_t {
        /**
         * The ephemeris is known good.
         */
        GOOD = 0,
        /**
         * The ephemeris is known bad.
         */
        BAD = 1 /* ::android::hardware::gnss::V1_0::IGnssDebug::SatelliteEphemerisHealth.GOOD implicitly + 1 */,
        /**
         * The ephemeris is unknown to be good or bad.
         */
        UNKNOWN = 2 /* ::android::hardware::gnss::V1_0::IGnssDebug::SatelliteEphemerisHealth.BAD implicitly + 1 */,
    };

    /**
     * Provides the current best known position from any
     * source (GNSS or injected assistance).
     */
    struct PositionDebug final {
        /**
         * Validity of the data in this struct. False only if no
         * latitude/longitude information is known.
         */
        bool valid __attribute__ ((aligned(1)));
        /**
         * Latitude expressed in degrees
         */
        double latitudeDegrees __attribute__ ((aligned(8)));
        /**
         * Longitude expressed in degrees
         */
        double longitudeDegrees __attribute__ ((aligned(8)));
        /**
         * Altitude above ellipsoid expressed in meters
         */
        float altitudeMeters __attribute__ ((aligned(4)));
        /**
         * Represents horizontal speed in meters per second.
         */
        float speedMetersPerSec __attribute__ ((aligned(4)));
        /**
         * Represents heading in degrees.
         */
        float bearingDegrees __attribute__ ((aligned(4)));
        /**
         * Estimated horizontal accuracy of position expressed in meters,
         * radial, 68% confidence.
         */
        double horizontalAccuracyMeters __attribute__ ((aligned(8)));
        /**
         * Estimated vertical accuracy of position expressed in meters, with
         * 68% confidence.
         */
        double verticalAccuracyMeters __attribute__ ((aligned(8)));
        /**
         * Estimated speed accuracy in meters per second with 68% confidence.
         */
        double speedAccuracyMetersPerSecond __attribute__ ((aligned(8)));
        /**
         * estimated bearing accuracy degrees with 68% confidence.
         */
        double bearingAccuracyDegrees __attribute__ ((aligned(8)));
        /**
         * Time duration before this report that this position information was
         * valid.  This can, for example, be a previous injected location with
         * an age potentially thousands of seconds old, or
         * extrapolated to the current time (with appropriately increased
         * accuracy estimates), with a (near) zero age.
         */
        float ageSeconds __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug, valid) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug, latitudeDegrees) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug, longitudeDegrees) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug, altitudeMeters) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug, speedMetersPerSec) == 28, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug, bearingDegrees) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug, horizontalAccuracyMeters) == 40, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug, verticalAccuracyMeters) == 48, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug, speedAccuracyMetersPerSecond) == 56, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug, bearingAccuracyDegrees) == 64, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug, ageSeconds) == 72, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug) == 80, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug) == 8, "wrong alignment");

    /**
     * Provides the current best known UTC time estimate.
     * If no fresh information is available, e.g. after a delete all,
     * then whatever the effective defaults are on the device must be
     * provided (e.g. Jan. 1, 2017, with an uncertainty of 5 years) expressed
     * in the specified units.
     */
    struct TimeDebug final {
        /**
         * UTC time estimate.
         */
        int64_t timeEstimate __attribute__ ((aligned(8)));
        /**
         * 68% error estimate in time.
         */
        float timeUncertaintyNs __attribute__ ((aligned(4)));
        /**
         * 68% error estimate in local clock drift,
         * in nanoseconds per second (also known as parts per billion - ppb.)
         */
        float frequencyUncertaintyNsPerSec __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::TimeDebug, timeEstimate) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::TimeDebug, timeUncertaintyNs) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::TimeDebug, frequencyUncertaintyNsPerSec) == 12, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V1_0::IGnssDebug::TimeDebug) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V1_0::IGnssDebug::TimeDebug) == 8, "wrong alignment");

    /**
     * Provides a single satellite info that has decoded navigation data.
     */
    struct SatelliteData final {
        /**
         * Satellite vehicle ID number
         */
        int16_t svid __attribute__ ((aligned(2)));
        /**
         * Defines the constellation type of the given SV.
         */
        ::android::hardware::gnss::V1_0::GnssConstellationType constellation __attribute__ ((aligned(1)));
        /**
         * Defines the standard broadcast ephemeris or almanac availability for
         * the satellite.  To report status of predicted orbit and clock
         * information, see the serverPrediction fields below.
         */
        ::android::hardware::gnss::V1_0::IGnssDebug::SatelliteEphemerisType ephemerisType __attribute__ ((aligned(1)));
        /**
         * Defines the ephemeris source of the satellite.
         */
        ::android::hardware::gnss::V1_0::IGnssDebug::SatelliteEphemerisSource ephemerisSource __attribute__ ((aligned(1)));
        /**
         * Defines whether the satellite is known healthy
         * (safe for use in location calculation.)
         */
        ::android::hardware::gnss::V1_0::IGnssDebug::SatelliteEphemerisHealth ephemerisHealth __attribute__ ((aligned(1)));
        /**
         * Time duration from this report (current time), minus the
         * effective time of the ephemeris source (e.g. TOE, TOA.)
         * Set to 0 when ephemerisType is NOT_AVAILABLE.
         */
        float ephemerisAgeSeconds __attribute__ ((aligned(4)));
        /**
         * True if a server has provided a predicted orbit and clock model for
         * this satellite.
         */
        bool serverPredictionIsAvailable __attribute__ ((aligned(1)));
        /**
         * Time duration from this report (current time) minus the time of the
         * start of the server predicted information.  For example, a 1 day
         * old prediction would be reported as 86400 seconds here.
         */
        float serverPredictionAgeSeconds __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::SatelliteData, svid) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::SatelliteData, constellation) == 2, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::SatelliteData, ephemerisType) == 3, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::SatelliteData, ephemerisSource) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::SatelliteData, ephemerisHealth) == 5, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::SatelliteData, ephemerisAgeSeconds) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::SatelliteData, serverPredictionIsAvailable) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::SatelliteData, serverPredictionAgeSeconds) == 16, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V1_0::IGnssDebug::SatelliteData) == 20, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V1_0::IGnssDebug::SatelliteData) == 4, "wrong alignment");

    /**
     * Provides a set of debug information that is filled by the GNSS chipset
     * when the method getDebugData() is invoked.
     */
    struct DebugData final {
        /**
         * Current best known position.
         */
        ::android::hardware::gnss::V1_0::IGnssDebug::PositionDebug position __attribute__ ((aligned(8)));
        /**
         * Current best know time estimate
         */
        ::android::hardware::gnss::V1_0::IGnssDebug::TimeDebug time __attribute__ ((aligned(8)));
        /**
         * Provides a list of the available satellite data, for all
         * satellites and constellations the device can track,
         * including GnssConstellationType UNKNOWN.
         */
        ::android::hardware::hidl_vec<::android::hardware::gnss::V1_0::IGnssDebug::SatelliteData> satelliteDataArray __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::DebugData, position) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::DebugData, time) == 80, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssDebug::DebugData, satelliteDataArray) == 96, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V1_0::IGnssDebug::DebugData) == 112, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V1_0::IGnssDebug::DebugData) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Return callback for getDebugData
     */
    using getDebugData_cb = std::function<void(const ::android::hardware::gnss::V1_0::IGnssDebug::DebugData& debugData)>;
    /**
     * This methods requests position, time and satellite ephemeris debug information
     * from the HAL.
     *
     * @return ret debugData information from GNSS Hal that contains the current best
     * known position, best known time estimate and a complete list of
     * constellations that the device can track.
     */
    virtual ::android::hardware::Return<void> getDebugData(getDebugData_cb _hidl_cb) = 0;

    /**
     * Return callback for interfaceChain
     */
