{
 "array_types" :
 [
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA258_t",
   "name" : "unsigned short [258]",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIA258_t",
   "size" : 516,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA4_PKh",
   "name" : "const unsigned char *[4]",
   "referenced_type" : "_ZTIPKh",
   "self_type" : "_ZTIA4_PKh",
   "size" : 32,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA4_Ph",
   "name" : "unsigned char *[4]",
   "referenced_type" : "_ZTIPh",
   "self_type" : "_ZTIA4_Ph",
   "size" : 32,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA4_h",
   "name" : "unsigned char [4]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA4_h",
   "size" : 4,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA8_h",
   "name" : "unsigned char [8]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA8_h",
   "size" : 8,
   "source_file" : "external/lzma/C/Bcj2.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",

   "referenced_type" : "_ZTIK13ILookInStream",
   "self_type" : "_ZTIPK13ILookInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK13ISeekInStream",
   "name" : "const ISeekInStream *",
   "referenced_type" : "_ZTIK13ISeekInStream",
   "self_type" : "_ZTIPK13ISeekInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK13ISeqOutStream",
   "name" : "const ISeqOutStream *",
   "referenced_type" : "_ZTIK13ISeqOutStream",
   "self_type" : "_ZTIPK13ISeqOutStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK17ICompressProgress",
   "name" : "const ICompressProgress *",
   "referenced_type" : "_ZTIK17ICompressProgress",
   "self_type" : "_ZTIPK17ICompressProgress",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK7IByteIn",
   "name" : "const IByteIn *",
   "referenced_type" : "_ZTIK7IByteIn",
   "self_type" : "_ZTIPK7IByteIn",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK8IByteOut",
   "name" : "const IByteOut *",
   "referenced_type" : "_ZTIK8IByteOut",
   "self_type" : "_ZTIPK8IByteOut",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK8ISzAlloc",
   "name" : "const ISzAlloc *",
   "referenced_type" : "_ZTIK8ISzAlloc",
   "self_type" : "_ZTIPK8ISzAlloc",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 8,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKv",
   "name" : "const void **",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIPPKv",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPx",
   "name" : "long long *",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIPx",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12ISeqInStream",
   "name" : "const ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTIK12ISeqInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ILookInStream",
   "name" : "const ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTIK13ILookInStream",
   "size" : 32,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeekInStream",
   "name" : "const ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTIK13ISeekInStream",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeqOutStream",
   "name" : "const ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTIK13ISeqOutStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK17ICompressProgress",
   "name" : "const ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTIK17ICompressProgress",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7IByteIn",
   "name" : "const IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTIK7IByteIn",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8IByteOut",
   "name" : "const IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTIK8IByteOut",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8ISzAlloc",
   "name" : "const ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTIK8ISzAlloc",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/lzma/C/7zTypes.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToLook",
   "name" : "CSecToLook",
   "referenced_type" : "_ZTI10CSecToLook",
   "self_type" : "_ZTI10CSecToLook",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToRead",
   "name" : "CSecToRead",
   "referenced_type" : "_ZTI10CSecToRead",
   "self_type" : "_ZTI10CSecToRead",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI13ILookInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPK13ISeekInStream"
    },
    {
     "field_name" : "pos",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buf",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "bufSize",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12CLookToRead2",
   "name" : "CLookToRead2",
   "referenced_type" : "_ZTI12CLookToRead2",
   "self_type" : "_ZTI12CLookToRead2",
   "size" : 72,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK12ISeqInStreamPvPmE"
    }
   ],
   "linker_set_key" : "_ZTI12ISeqInStream",
   "name" : "ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTI12ISeqInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Look",
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPPKvPmE"
    },
    {
     "field_name" : "Skip",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPK13ILookInStreammE"
    },
    {
     "field_name" : "Read",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPvPmE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ILookInStream",
   "name" : "ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTI13ILookInStream",
   "size" : 32,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPvPmE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeekInStream",
   "name" : "ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTI13ISeekInStream",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFmPK13ISeqOutStreamPKvmE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeqOutStream",
   "name" : "ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTI13ISeqOutStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Progress",
     "referenced_type" : "_ZTIPFiPK17ICompressProgressyyE"
    }
   ],
   "linker_set_key" : "_ZTI17ICompressProgress",
   "name" : "ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTI17ICompressProgress",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFhPK7IByteInE"
    }
   ],
   "linker_set_key" : "_ZTI7IByteIn",
   "name" : "IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTI7IByteIn",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bufs",
     "referenced_type" : "_ZTIA4_PKh"
    },
    {
     "field_name" : "lims",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA4_PKh"
    },
    {
     "field_name" : "dest",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "destLim",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "state",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ip",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "temp",
     "field_offset" : 704,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "range",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "code",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "probs",
     "field_offset" : 800,
     "referenced_type" : "_ZTIA258_t"
    }
   ],
   "linker_set_key" : "_ZTI8CBcj2Dec",
   "name" : "CBcj2Dec",
   "referenced_type" : "_ZTI8CBcj2Dec",
   "self_type" : "_ZTI8CBcj2Dec",
   "size" : 616,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bufs",
     "referenced_type" : "_ZTIA4_Ph"
    },
    {
     "field_name" : "lims",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA4_PKh"
    },
    {
     "field_name" : "src",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "srcLim",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "state",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "finishMode",
     "field_offset" : 672,
     "referenced_type" : "_ZTI19EBcj2Enc_FinishMode"
    },
    {
     "field_name" : "prevByte",
     "field_offset" : 704,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "cache",
     "field_offset" : 712,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "range",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "low",
     "field_offset" : 768,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cacheSize",
     "field_offset" : 832,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ip",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fileIp",
     "field_offset" : 928,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fileSize",
     "field_offset" : 960,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "relatLimit",
     "field_offset" : 992,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempTarget",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempPos",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "temp",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "flushPos",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "probs",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIA258_t"
    }
   ],
   "linker_set_key" : "_ZTI8CBcj2Enc",
   "name" : "CBcj2Enc",
   "referenced_type" : "_ZTI8CBcj2Enc",
   "self_type" : "_ZTI8CBcj2Enc",
   "size" : 664,
   "source_file" : "external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFvPK8IByteOuthE"
    }
   ],
   "linker_set_key" : "_ZTI8IByteOut",
   "name" : "IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTI8IByteOut",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Alloc",
     "referenced_type" : "_ZTIPFPvPK8ISzAllocmE"
    },
    {
     "field_name" : "Free",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPK8ISzAllocPvE"
    }
   ],
   "linker_set_key" : "_ZTI8ISzAlloc",
   "name" : "ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTI8ISzAlloc",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  }
 ],
 "rvalue_reference_types" : []
}
