{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA256_j",
   "name" : "unsigned int [256]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA256_j",
   "size" : 1024,
   "source_file" : "external/lzma/C/LzFind.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIx",
   "name" : "long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIx",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIy",

   "name" : "const ISeekInStream *",
   "referenced_type" : "_ZTIK13ISeekInStream",
   "self_type" : "_ZTIPK13ISeekInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK13ISeqOutStream",
   "name" : "const ISeqOutStream *",
   "referenced_type" : "_ZTIK13ISeqOutStream",
   "self_type" : "_ZTIPK13ISeqOutStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK17ICompressProgress",
   "name" : "const ICompressProgress *",
   "referenced_type" : "_ZTIK17ICompressProgress",
   "self_type" : "_ZTIPK17ICompressProgress",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK7IByteIn",
   "name" : "const IByteIn *",
   "referenced_type" : "_ZTIK7IByteIn",
   "self_type" : "_ZTIPK7IByteIn",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK8IByteOut",
   "name" : "const IByteOut *",
   "referenced_type" : "_ZTIK8IByteOut",
   "self_type" : "_ZTIPK8IByteOut",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK8ISzAlloc",
   "name" : "const ISzAlloc *",
   "referenced_type" : "_ZTIK8ISzAlloc",
   "self_type" : "_ZTIPK8ISzAlloc",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 8,
   "source_file" : "external/lzma/C/LzFind.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKv",
   "name" : "const void **",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIPPKv",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 8,
   "source_file" : "external/lzma/C/LzFind.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPx",
   "name" : "long long *",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIPx",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12ISeqInStream",
   "name" : "const ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTIK12ISeqInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ILookInStream",
   "name" : "const ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTIK13ILookInStream",
   "size" : 32,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeekInStream",
   "name" : "const ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTIK13ISeekInStream",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeqOutStream",
   "name" : "const ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTIK13ISeqOutStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK17ICompressProgress",
   "name" : "const ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTIK17ICompressProgress",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7IByteIn",
   "name" : "const IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTIK7IByteIn",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8IByteOut",
   "name" : "const IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTIK8IByteOut",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8ISzAlloc",
   "name" : "const ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTIK8ISzAlloc",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/lzma/C/LzFind.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/lzma/C/7zTypes.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToLook",
   "name" : "CSecToLook",
   "referenced_type" : "_ZTI10CSecToLook",
   "self_type" : "_ZTI10CSecToLook",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToRead",
   "name" : "CSecToRead",
   "referenced_type" : "_ZTI10CSecToRead",
   "self_type" : "_ZTI10CSecToRead",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI13ILookInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPK13ISeekInStream"
    },
    {
     "field_name" : "pos",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buf",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "bufSize",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12CLookToRead2",
   "name" : "CLookToRead2",
   "referenced_type" : "_ZTI12CLookToRead2",
   "self_type" : "_ZTI12CLookToRead2",
   "size" : 72,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK12ISeqInStreamPvPmE"
    }
   ],
   "linker_set_key" : "_ZTI12ISeqInStream",
   "name" : "ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTI12ISeqInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Look",
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPPKvPmE"
    },
    {
     "field_name" : "Skip",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPK13ILookInStreammE"
    },
    {
     "field_name" : "Read",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPvPmE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ILookInStream",
   "name" : "ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTI13ILookInStream",
   "size" : 32,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPvPmE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeekInStream",
   "name" : "ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTI13ISeekInStream",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFmPK13ISeqOutStreamPKvmE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeqOutStream",
   "name" : "ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTI13ISeqOutStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "pos",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "posLimit",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "streamPos",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lenLimit",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cyclicBufferPos",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cyclicBufferSize",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "streamEndWasReached",
     "field_offset" : 256,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "btMode",
     "field_offset" : 264,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "bigHash",
     "field_offset" : 272,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "directInput",
     "field_offset" : 280,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "matchMaxLen",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hash",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "son",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "hashMask",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cutValue",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bufferBase",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "stream",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP12ISeqInStream"
    },
    {
     "field_name" : "blockSize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepSizeBefore",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepSizeAfter",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numHashBytes",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "directInputRem",
     "field_offset" : 768,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "historySize",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fixedHashSize",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hashSizeSum",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "result",
     "field_offset" : 928,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "crc",
     "field_offset" : 960,
     "referenced_type" : "_ZTIA256_j"
    },
    {
     "field_name" : "numRefs",
     "field_offset" : 9152,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "expectedDataSize",
     "field_offset" : 9216,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI13_CMatchFinder",
   "name" : "_CMatchFinder",
   "referenced_type" : "_ZTI13_CMatchFinder",
   "self_type" : "_ZTI13_CMatchFinder",
   "size" : 1160,
   "source_file" : "external/lzma/C/LzFind.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Init",
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "GetNumAvailableBytes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPvE"
    },
    {
     "field_name" : "GetPointerToCurrentPos",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFPKhPvE"
    },
    {
     "field_name" : "GetMatches",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPvPjE"
    },
    {
     "field_name" : "Skip",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFvPvjE"
    }
   ],
   "linker_set_key" : "_ZTI13_IMatchFinder",
   "name" : "_IMatchFinder",
   "referenced_type" : "_ZTI13_IMatchFinder",
   "self_type" : "_ZTI13_IMatchFinder",
   "size" : 40,
   "source_file" : "external/lzma/C/LzFind.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Progress",
     "referenced_type" : "_ZTIPFiPK17ICompressProgressyyE"
    }
   ],
   "linker_set_key" : "_ZTI17ICompressProgress",
   "name" : "ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTI17ICompressProgress",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFhPK7IByteInE"
    }
   ],
   "linker_set_key" : "_ZTI7IByteIn",
   "name" : "IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTI7IByteIn",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFvPK8IByteOuthE"
    }
   ],
   "linker_set_key" : "_ZTI8IByteOut",
   "name" : "IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTI8IByteOut",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Alloc",
     "referenced_type" : "_ZTIPFPvPK8ISzAllocmE"
    },
    {
     "field_name" : "Free",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPK8ISzAllocPvE"
    }
   ],
   "linker_set_key" : "_ZTI8ISzAlloc",
   "name" : "ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTI8ISzAlloc",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  }
 ],
 "rvalue_reference_types" : []
}
