{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA20_h",
   "name" : "unsigned char [20]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA20_h",
   "size" : 20,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4_j",
   "name" : "unsigned int [4]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA4_j",
   "size" : 16,
   "source_file" : "external/lzma/C/LzmaDec.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIt",
   "name" : "unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIt",

   "name" : "const ISeekInStream *",
   "referenced_type" : "_ZTIK13ISeekInStream",
   "self_type" : "_ZTIPK13ISeekInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK13ISeqOutStream",
   "name" : "const ISeqOutStream *",
   "referenced_type" : "_ZTIK13ISeqOutStream",
   "self_type" : "_ZTIPK13ISeqOutStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK17ICompressProgress",
   "name" : "const ICompressProgress *",
   "referenced_type" : "_ZTIK17ICompressProgress",
   "self_type" : "_ZTIPK17ICompressProgress",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK7IByteIn",
   "name" : "const IByteIn *",
   "referenced_type" : "_ZTIK7IByteIn",
   "self_type" : "_ZTIPK7IByteIn",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK8IByteOut",
   "name" : "const IByteOut *",
   "referenced_type" : "_ZTIK8IByteOut",
   "self_type" : "_ZTIPK8IByteOut",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK8ISzAlloc",
   "name" : "const ISzAlloc *",
   "referenced_type" : "_ZTIK8ISzAlloc",
   "self_type" : "_ZTIPK8ISzAlloc",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 8,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKv",
   "name" : "const void **",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIPPKv",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPt",
   "name" : "unsigned short *",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIPt",
   "size" : 8,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPx",
   "name" : "long long *",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIPx",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12ISeqInStream",
   "name" : "const ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTIK12ISeqInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ILookInStream",
   "name" : "const ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTIK13ILookInStream",
   "size" : 32,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeekInStream",
   "name" : "const ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTIK13ISeekInStream",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeqOutStream",
   "name" : "const ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTIK13ISeqOutStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK17ICompressProgress",
   "name" : "const ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTIK17ICompressProgress",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7IByteIn",
   "name" : "const IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTIK7IByteIn",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8IByteOut",
   "name" : "const IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTIK8IByteOut",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8ISzAlloc",
   "name" : "const ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTIK8ISzAlloc",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/lzma/C/7zTypes.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToLook",
   "name" : "CSecToLook",
   "referenced_type" : "_ZTI10CSecToLook",
   "self_type" : "_ZTI10CSecToLook",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToRead",
   "name" : "CSecToRead",
   "referenced_type" : "_ZTI10CSecToRead",
   "self_type" : "_ZTI10CSecToRead",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lc",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "lp",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pb",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "_pad_",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "dicSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11_CLzmaProps",
   "name" : "_CLzmaProps",
   "referenced_type" : "_ZTI11_CLzmaProps",
   "self_type" : "_ZTI11_CLzmaProps",
   "size" : 8,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI13ILookInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPK13ISeekInStream"
    },
    {
     "field_name" : "pos",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buf",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "bufSize",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12CLookToRead2",
   "name" : "CLookToRead2",
   "referenced_type" : "_ZTI12CLookToRead2",
   "self_type" : "_ZTI12CLookToRead2",
   "size" : 72,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK12ISeqInStreamPvPmE"
    }
   ],
   "linker_set_key" : "_ZTI12ISeqInStream",
   "name" : "ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTI12ISeqInStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Look",
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPPKvPmE"
    },
    {
     "field_name" : "Skip",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPK13ILookInStreammE"
    },
    {
     "field_name" : "Read",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPvPmE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ILookInStream",
   "name" : "ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTI13ILookInStream",
   "size" : 32,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPvPmE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeekInStream",
   "name" : "ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTI13ISeekInStream",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFmPK13ISeqOutStreamPKvmE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeqOutStream",
   "name" : "ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTI13ISeqOutStream",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "level",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dictSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lc",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lp",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pb",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "algo",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fb",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "btMode",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numHashBytes",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mc",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "writeEndMark",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numThreads",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reduceSize",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI14_CLzmaEncProps",
   "name" : "_CLzmaEncProps",
   "referenced_type" : "_ZTI14_CLzmaEncProps",
   "self_type" : "_ZTI14_CLzmaEncProps",
   "size" : 56,
   "source_file" : "external/lzma/C/LzmaEnc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI8ISzAlloc"
    },
    {
     "field_name" : "baseAlloc",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK8ISzAlloc"
    },
    {
     "field_name" : "numAlignBits",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI17CAlignOffsetAlloc",
   "name" : "CAlignOffsetAlloc",
   "referenced_type" : "_ZTI17CAlignOffsetAlloc",
   "self_type" : "_ZTI17CAlignOffsetAlloc",
   "size" : 40,
   "source_file" : "external/lzma/C/Alloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Progress",
     "referenced_type" : "_ZTIPFiPK17ICompressProgressyyE"
    }
   ],
   "linker_set_key" : "_ZTI17ICompressProgress",
   "name" : "ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTI17ICompressProgress",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFhPK7IByteInE"
    }
   ],
   "linker_set_key" : "_ZTI7IByteIn",
   "name" : "IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTI7IByteIn",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "prop",
     "referenced_type" : "_ZTI11_CLzmaProps"
    },
    {
     "field_name" : "probs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPt"
    },
    {
     "field_name" : "probs_1664",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPt"
    },
    {
     "field_name" : "dic",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "dicBufSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "dicPos",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buf",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "range",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "code",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "processedPos",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "checkDicSize",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reps",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA4_j"
    },
    {
     "field_name" : "state",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "remainLen",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numProbs",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempBufSize",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempBuf",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA20_h"
    }
   ],
   "linker_set_key" : "_ZTI8CLzmaDec",
   "name" : "CLzmaDec",
   "referenced_type" : "_ZTI8CLzmaDec",
   "self_type" : "_ZTI8CLzmaDec",
   "size" : 128,
   "source_file" : "external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFvPK8IByteOuthE"
    }
   ],
   "linker_set_key" : "_ZTI8IByteOut",
   "name" : "IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTI8IByteOut",
   "size" : 8,
   "source_file" : "external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Alloc",
     "referenced_type" : "_ZTIPFPvPK8ISzAllocmE"
    },
    {
     "field_name" : "Free",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPK8ISzAllocPvE"
    }
   ],
   "linker_set_key" : "_ZTI8ISzAlloc",
   "name" : "ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTI8ISzAlloc",
   "size" : 16,
   "source_file" : "external/lzma/C/7zTypes.h"
  }
 ],
 "rvalue_reference_types" : []
}
