{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "linker_set_key" : "_ZTIs",
   "name" : "short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIs",
   "size" : 2
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIt",
   "name" : "unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIt",
   "size" : 2
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIx",
   "name" : "long long",
   "referenced_type" : "_ZTIx",

   "size" : 4,
   "source_file" : "external/libevent/include/event2/http_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP12evrpc_statusPvS1_S1_E",
   "name" : "void (*)(evrpc_status *, void *, void *, void *)",
   "referenced_type" : "_ZTIFvP12evrpc_statusPvS1_S1_E",
   "self_type" : "_ZTIPFvP12evrpc_statusPvS1_S1_E",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/rpc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14event_callbackPvE",
   "name" : "void (*)(event_callback *, void *)",
   "referenced_type" : "_ZTIFvP14event_callbackPvE",
   "self_type" : "_ZTIPFvP14event_callbackPvE",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14evhttp_requestPvE",
   "name" : "void (*)(evhttp_request *, void *)",
   "referenced_type" : "_ZTIFvP14evhttp_requestPvE",
   "self_type" : "_ZTIPFvP14evhttp_requestPvE",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/http_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP17evrpc_req_genericPvE",
   "name" : "void (*)(evrpc_req_generic *, void *)",
   "referenced_type" : "_ZTIFvP17evrpc_req_genericPvE",
   "self_type" : "_ZTIPFvP17evrpc_req_genericPvE",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/rpc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP5eventPvE",
   "name" : "void (*)(event *, void *)",
   "referenced_type" : "_ZTIFvP5eventPvE",
   "self_type" : "_ZTIPFvP5eventPvE",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP8evbufferPvE",
   "name" : "void (*)(evbuffer *, void *)",
   "referenced_type" : "_ZTIFvP8evbufferPvE",
   "self_type" : "_ZTIPFvP8evbufferPvE",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/rpc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvPvE",
   "name" : "void (*)(void *)",
   "referenced_type" : "_ZTIFvPvE",
   "self_type" : "_ZTIPFvPvE",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/rpc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvisPvE",
   "name" : "void (*)(int, short, void *)",
   "referenced_type" : "_ZTIFvisPvE",
   "self_type" : "_ZTIPFvisPvE",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/rpc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/rpc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP14event_callback",
   "name" : "event_callback **",
   "referenced_type" : "_ZTIP14event_callback",
   "self_type" : "_ZTIPP14event_callback",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP14evhttp_request",
   "name" : "evhttp_request **",
   "referenced_type" : "_ZTIP14evhttp_request",
   "self_type" : "_ZTIPP14evhttp_request",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/http_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP5event",
   "name" : "event **",
   "referenced_type" : "_ZTIP5event",
   "self_type" : "_ZTIPP5event",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP5evrpc",
   "name" : "evrpc **",
   "referenced_type" : "_ZTIP5evrpc",
   "self_type" : "_ZTIPP5evrpc",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/rpc_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP8evkeyval",
   "name" : "evkeyval **",
   "referenced_type" : "_ZTIP8evkeyval",
   "self_type" : "_ZTIPP8evkeyval",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/keyvalq_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/rpc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/keyvalq_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/rpc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPs",
   "name" : "short *",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIPs",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libevent/include/event2/rpc.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/libevent/include/event2/rpc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tqh_first",
     "referenced_type" : "_ZTIP5event"
    },
    {
     "field_name" : "tqh_last",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPP5event"
    }
   ],
   "linker_set_key" : "_ZTI10event_list",
   "name" : "event_list",
   "referenced_type" : "_ZTI10event_list",
   "self_type" : "_ZTI10event_list",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lh_first",
     "referenced_type" : "_ZTIP5event"
    }
   ],
   "linker_set_key" : "_ZTI11event_dlist",
   "name" : "event_dlist",
   "referenced_type" : "_ZTI11event_dlist",
   "self_type" : "_ZTI11event_dlist",
   "size" : 4,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pos",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "internal_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN12evbuffer_ptrUt_E"
    }
   ],
   "linker_set_key" : "_ZTI12evbuffer_ptr",
   "name" : "evbuffer_ptr",
   "referenced_type" : "_ZTI12evbuffer_ptr",
   "self_type" : "_ZTI12evbuffer_ptr",
   "size" : 12,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "error",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "http_req",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14evhttp_request"
    }
   ],
   "linker_set_key" : "_ZTI12evrpc_status",
   "name" : "evrpc_status",
   "referenced_type" : "_ZTI12evrpc_status",
   "self_type" : "_ZTI12evrpc_status",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/rpc_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "evcb_active_next",
     "referenced_type" : "_ZTIN14event_callbackUt_E"
    },
    {
     "field_name" : "evcb_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "evcb_pri",
     "field_offset" : 80,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "evcb_closure",
     "field_offset" : 88,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "evcb_cb_union",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN14event_callbackUt_E"
    },
    {
     "field_name" : "evcb_arg",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI14event_callback",
   "name" : "event_callback",
   "referenced_type" : "_ZTI14event_callback",
   "self_type" : "_ZTI14event_callback",
   "size" : 20,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIN14evhttp_requestUt_E"
    },
    {
     "field_name" : "evcon",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP17evhttp_connection"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_headers",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP9evkeyvalq"
    },
    {
     "field_name" : "output_headers",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP9evkeyvalq"
    },
    {
     "field_name" : "remote_host",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "remote_port",
     "field_offset" : 224,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "host_cache",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "kind",
     "field_offset" : 288,
     "referenced_type" : "_ZTI19evhttp_request_kind"
    },
    {
     "field_name" : "type",
     "field_offset" : 320,
     "referenced_type" : "_ZTI15evhttp_cmd_type"
    },
    {
     "field_name" : "headers_size",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "body_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uri",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "uri_elems",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP10evhttp_uri"
    },
    {
     "field_name" : "major",
     "field_offset" : 480,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "minor",
     "field_offset" : 488,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "response_code",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "response_code_line",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "input_buffer",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP8evbuffer"
    },
    {
     "field_name" : "ntoread",
     "field_offset" : 640,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "chunked",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "userdone",
     "field_offset" : 705,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "output_buffer",
     "field_offset" : 736,
     "referenced_type" : "_ZTIP8evbuffer"
    },
    {
     "field_name" : "cb",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvP14evhttp_requestPvE"
    },
    {
     "field_name" : "cb_arg",
     "field_offset" : 800,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "chunk_cb",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFvP14evhttp_requestPvE"
    },
    {
     "field_name" : "header_cb",
     "field_offset" : 864,
     "referenced_type" : "_ZTIPFiP14evhttp_requestPvE"
    },
    {
     "field_name" : "error_cb",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFv20evhttp_request_errorPvE"
    },
    {
     "field_name" : "on_complete_cb",
     "field_offset" : 928,
     "referenced_type" : "_ZTIPFvP14evhttp_requestPvE"
    },
    {
     "field_name" : "on_complete_cb_arg",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI14evhttp_request",
   "name" : "evhttp_request",
   "referenced_type" : "_ZTI14evhttp_request",
   "self_type" : "_ZTI14evhttp_request",
   "size" : 128,
   "source_file" : "external/libevent/include/event2/http_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "orig_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_added",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_deleted",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16evbuffer_cb_info",
   "name" : "evbuffer_cb_info",
   "referenced_type" : "_ZTI16evbuffer_cb_info",
   "self_type" : "_ZTI16evbuffer_cb_info",
   "size" : 12,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ev_evcallback",
     "referenced_type" : "_ZTI14event_callback"
    },
    {
     "field_name" : "ev_timeout_pos",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN5eventUt_E"
    },
    {
     "field_name" : "ev_fd",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ev_base",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP10event_base"
    },
    {
     "field_name" : "ev_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIN5eventUt_E"
    },
    {
     "field_name" : "ev_events",
     "field_offset" : 416,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "ev_res",
     "field_offset" : 432,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "ev_timeout",
     "field_offset" : 448,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI5event",
   "name" : "event",
   "referenced_type" : "_ZTI5event",
   "self_type" : "_ZTI5event",
   "size" : 64,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIN5evrpcUt_E"
    },
    {
     "field_name" : "uri",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "request_new",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFPvS_E"
    },
    {
     "field_name" : "request_new_arg",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "request_free",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "request_unmarshal",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPvP8evbufferE"
    },
    {
     "field_name" : "reply_new",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFPvS_E"
    },
    {
     "field_name" : "reply_new_arg",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reply_free",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "reply_complete",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "reply_marshal",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFvP8evbufferPvE"
    },
    {
     "field_name" : "cb",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFvP17evrpc_req_genericPvE"
    },
    {
     "field_name" : "cb_arg",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "base",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP10evrpc_base"
    }
   ],
   "linker_set_key" : "_ZTI5evrpc",
   "name" : "evrpc",
   "referenced_type" : "_ZTI5evrpc",
   "self_type" : "_ZTI5evrpc",
   "size" : 60,
   "source_file" : "external/libevent/include/event2/rpc_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIN8evkeyvalUt_E"
    },
    {
     "field_name" : "key",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "value",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI8evkeyval",
   "name" : "evkeyval",
   "referenced_type" : "_ZTI8evkeyval",
   "self_type" : "_ZTI8evkeyval",
   "size" : 16,
   "source_file" : "external/libevent/include/event2/keyvalq_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tqh_first",
     "referenced_type" : "_ZTIP8evkeyval"
    },
    {
     "field_name" : "tqh_last",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPP8evkeyval"
    }
   ],
   "linker_set_key" : "_ZTI9evkeyvalq",
   "name" : "evkeyvalq",
   "referenced_type" : "_ZTI9evkeyvalq",
   "self_type" : "_ZTI9evkeyvalq",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/keyvalq_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "chain",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pos_in_chain",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12evbuffer_ptrUt_E",
   "name" : "evbuffer_ptr::(anonymous struct at external/libevent/include/event2/buffer.h:121:2)",
   "referenced_type" : "_ZTIN12evbuffer_ptrUt_E",
   "self_type" : "_ZTIN12evbuffer_ptrUt_E",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tqe_next",
     "referenced_type" : "_ZTIP14event_callback"
    },
    {
     "field_name" : "tqe_prev",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPP14event_callback"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN14event_callbackUt_E",
   "name" : "event_callback::(anonymous struct at external/libevent/include/event2/event_struct.h:108:2)",
   "referenced_type" : "_ZTIN14event_callbackUt_E",
   "self_type" : "_ZTIN14event_callbackUt_E",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tqe_next",
     "referenced_type" : "_ZTIP14evhttp_request"
    },
    {
     "field_name" : "tqe_prev",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPP14evhttp_request"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN14evhttp_requestUt_E",
   "name" : "evhttp_request::(anonymous struct at external/libevent/include/event2/http_struct.h:59:2)",
   "referenced_type" : "_ZTIN14evhttp_requestUt_E",
   "self_type" : "_ZTIN14evhttp_requestUt_E",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/http_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ev_next_with_common_timeout",
     "referenced_type" : "_ZTIN5eventUt_Ut_E"
    },
    {
     "field_name" : "min_heap_idx",
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN5eventUt_E",
   "name" : "event::(anonymous union at external/libevent/include/event2/event_struct.h:127:2)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN5eventUt_E",
   "self_type" : "_ZTIN5eventUt_E",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tqe_next",
     "referenced_type" : "_ZTIP5event"
    },
    {
     "field_name" : "tqe_prev",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPP5event"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN5eventUt_Ut_E",
   "name" : "event::(anonymous union at external/libevent/include/event2/event_struct.h:127:2)::(anonymous struct at external/libevent/include/event2/event_struct.h:128:3)",
   "referenced_type" : "_ZTIN5eventUt_Ut_E",
   "self_type" : "_ZTIN5eventUt_Ut_E",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "le_next",
     "referenced_type" : "_ZTIP5event"
    },
    {
     "field_name" : "le_prev",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPP5event"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN5eventUt_Ut_Ut_E",
   "name" : "event::(anonymous union at external/libevent/include/event2/event_struct.h:135:2)::(anonymous struct at external/libevent/include/event2/event_struct.h:137:3)::(anonymous struct at external/libevent/include/event2/event_struct.h:138:4)",
   "referenced_type" : "_ZTIN5eventUt_Ut_Ut_E",
   "self_type" : "_ZTIN5eventUt_Ut_Ut_E",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tqe_next",
     "referenced_type" : "_ZTIP5evrpc"
    },
    {
     "field_name" : "tqe_prev",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPP5evrpc"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN5evrpcUt_E",
   "name" : "evrpc::(anonymous struct at external/libevent/include/event2/rpc_struct.h:70:2)",
   "referenced_type" : "_ZTIN5evrpcUt_E",
   "self_type" : "_ZTIN5evrpcUt_E",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/rpc_struct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tqe_next",
     "referenced_type" : "_ZTIP8evkeyval"
    },
    {
     "field_name" : "tqe_prev",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPP8evkeyval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8evkeyvalUt_E",
   "name" : "evkeyval::(anonymous struct at external/libevent/include/event2/keyvalq_struct.h:59:2)",
   "referenced_type" : "_ZTIN8evkeyvalUt_E",
   "self_type" : "_ZTIN8evkeyvalUt_E",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/keyvalq_struct.h"
  }
 ],
 "rvalue_reference_types" : []
}
