{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA11_Ds",
   "name" : "char16_t [11]",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIA11_Ds",
   "size" : 22,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA12_i",
   "name" : "int [12]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA12_i",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA14_i",
   "name" : "int [14]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA14_i",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,

   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt13exception_ptr",
   "name" : "const std::exception_ptr",
   "referenced_type" : "_ZTISt13exception_ptr",
   "self_type" : "_ZTIKSt13exception_ptr",
   "size" : 8,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt16initializer_listIbE",
   "name" : "const std::initializer_list<bool>",
   "referenced_type" : "_ZTISt16initializer_listIbE",
   "self_type" : "_ZTIKSt16initializer_listIbE",
   "size" : 16,
   "source_file" : "external/libcxx/include/initializer_list"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt16nested_exception",
   "name" : "const std::nested_exception",
   "referenced_type" : "_ZTISt16nested_exception",
   "self_type" : "_ZTIKSt16nested_exception",
   "size" : 16,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "_ZTISt9nothrow_t",
   "self_type" : "_ZTIKSt9nothrow_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "self_type" : "_ZTIKSt9type_info",
   "size" : 16,
   "source_file" : "external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/signal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "frameworks/rs/rsMatrix2x2.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/rs/rsStream.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/libcxx/include/algorithm"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTIVNSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_mPKvE",
   "name" : "void *(*volatile)(void *, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvS_mPKvE",
   "self_type" : "_ZTIVPFPvS_mPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmPKvE",
   "name" : "void *(*volatile)(unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmPKvE",
   "self_type" : "_ZTIVPFPvmPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmmPKvE",
   "name" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmmPKvE",
   "self_type" : "_ZTIVPFPvmmPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "func",
     "referenced_type" : "_ZTI14RsBlasFunction"
    },
    {
     "field_name" : "transA",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15RsBlasTranspose"
    },
    {
     "field_name" : "transB",
     "field_offset" : 64,
     "referenced_type" : "_ZTI15RsBlasTranspose"
    },
    {
     "field_name" : "uplo",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10RsBlasUplo"
    },
    {
     "field_name" : "diag",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10RsBlasDiag"
    },
    {
     "field_name" : "side",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10RsBlasSide"
    },
    {
     "field_name" : "M",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "N",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "K",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "alpha",
     "field_offset" : 320,
     "referenced_type" : "_ZTI12RsBlasScalar"
    },
    {
     "field_name" : "beta",
     "field_offset" : 448,
     "referenced_type" : "_ZTI12RsBlasScalar"
    },
    {
     "field_name" : "incX",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "incY",
     "field_offset" : 608,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "KL",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "KU",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "a_offset",
     "field_offset" : 704,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "b_offset",
     "field_offset" : 712,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "c_offset",
     "field_offset" : 736,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "c_mult_int",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10RsBlasCall",
   "name" : "RsBlasCall",
   "referenced_type" : "_ZTI10RsBlasCall",
   "self_type" : "_ZTI10RsBlasCall",
   "size" : 104,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cgroup",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "referenced_type" : "_ZTI10clone_args",
   "self_type" : "_ZTI10clone_args",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA31_y"
    },
    {
     "field_name" : "sp",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIA4096_h"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 4384,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "esr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI11esr_context",
   "name" : "esr_context",
   "referenced_type" : "_ZTI11esr_context",
   "self_type" : "_ZTI11esr_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "referenced_type" : "_ZTI11sched_param",
   "self_type" : "_ZTI11sched_param",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "vl",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA3_t"
    }
   ],
   "linker_set_key" : "_ZTI11sve_context",
   "name" : "sve_context",
   "referenced_type" : "_ZTI11sve_context",
   "self_type" : "_ZTI11sve_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "c",
     "referenced_type" : "_ZTI14RsFloatComplex"
    },
    {
     "field_name" : "d",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "z",
     "referenced_type" : "_ZTI15RsDoubleComplex"
    }
   ],
   "linker_set_key" : "_ZTI12RsBlasScalar",
   "name" : "RsBlasScalar",
   "record_kind" : "union",
   "referenced_type" : "_ZTI12RsBlasScalar",
   "self_type" : "_ZTI12RsBlasScalar",
   "size" : 16,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "strategy",
     "referenced_type" : "_ZTI17RsForEachStrategy"
    },
    {
     "field_name" : "xStart",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xEnd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "yStart",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "yEnd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "zStart",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "zEnd",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arrayStart",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arrayEnd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array2Start",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array2End",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array3Start",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array3End",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array4Start",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array4End",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12RsScriptCall",
   "name" : "RsScriptCall",
   "referenced_type" : "_ZTI12RsScriptCall",
   "self_type" : "_ZTI12RsScriptCall",
   "size" : 60,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12_aarch64_ctx",
   "name" : "_aarch64_ctx",
   "referenced_type" : "_ZTI12_aarch64_ctx",
   "self_type" : "_ZTI12_aarch64_ctx",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "_ZTIA4_f"
    }
   ],
   "linker_set_key" : "_ZTI12rs_matrix2x2",
   "name" : "rs_matrix2x2",
   "referenced_type" : "_ZTI12rs_matrix2x2",
   "self_type" : "_ZTI12rs_matrix2x2",
   "size" : 16,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "_ZTIA9_f"
    }
   ],
   "linker_set_key" : "_ZTI12rs_matrix3x3",
   "name" : "rs_matrix3x3",
   "referenced_type" : "_ZTI12rs_matrix3x3",
   "self_type" : "_ZTI12rs_matrix3x3",
   "size" : 36,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "_ZTIA16_f"
    }
   ],
   "linker_set_key" : "_ZTI12rs_matrix4x4",
   "name" : "rs_matrix4x4",
   "referenced_type" : "_ZTI12rs_matrix4x4",
   "self_type" : "_ZTI12rs_matrix4x4",
   "size" : 64,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "datap",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI13extra_context",
   "name" : "extra_context",
   "referenced_type" : "_ZTI13extra_context",
   "self_type" : "_ZTI13extra_context",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "i",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI14RsFloatComplex",
   "name" : "RsFloatComplex",
   "referenced_type" : "_ZTI14RsFloatComplex",
   "self_type" : "_ZTI14RsFloatComplex",
   "size" : 8,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vregs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA32_o"
    }
   ],
   "linker_set_key" : "_ZTI14fpsimd_context",
   "name" : "fpsimd_context",
   "referenced_type" : "_ZTI14fpsimd_context",
   "self_type" : "_ZTI14fpsimd_context",
   "size" : 528,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA12_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "i",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTI15RsDoubleComplex",
   "name" : "RsDoubleComplex",
   "referenced_type" : "_ZTI15RsDoubleComplex",
   "self_type" : "_ZTI15RsDoubleComplex",
   "size" : 16,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "colorMin",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "colorPref",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alphaMin",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alphaPref",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "depthMin",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "depthPref",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stencilMin",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stencilPref",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplesMin",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplesPref",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplesQ",
     "field_offset" : 320,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI15RsSurfaceConfig",
   "name" : "RsSurfaceConfig",
   "referenced_type" : "_ZTI15RsSurfaceConfig",
   "self_type" : "_ZTI15RsSurfaceConfig",
   "size" : 44,
   "source_file" : "frameworks/rs/rsInternalDefines.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "classID",
     "referenced_type" : "_ZTI12RsA3DClassID"
    },
    {
     "field_name" : "objectName",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI16RsFileIndexEntry",
   "name" : "RsFileIndexEntry",
   "referenced_type" : "_ZTI16RsFileIndexEntry",
   "self_type" : "_ZTI16RsFileIndexEntry",
   "size" : 16,
   "source_file" : "frameworks/rs/rsInternalDefines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA14_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTIA31_m"
    },
    {
     "field_name" : "sp",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI16user_regs_struct",
   "name" : "user_regs_struct",
   "referenced_type" : "_ZTI16user_regs_struct",
   "self_type" : "_ZTI16user_regs_struct",
   "size" : 272,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA4_l"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "e",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "dimX",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dimY",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dimZ",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mipmaps",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "faces",
     "field_offset" : 168,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "yuv",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array0",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array1",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array2",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array3",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18RsTypeCreateParams",
   "name" : "RsTypeCreateParams",
   "referenced_type" : "_ZTI18RsTypeCreateParams",
   "self_type" : "_ZTI18RsTypeCreateParams",
   "size" : 48,
   "source_file" : "frameworks/rs/rsInternalDefines.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "vregs",
     "referenced_type" : "_ZTIA32_o"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18user_fpsimd_struct",
   "name" : "user_fpsimd_struct",
   "referenced_type" : "_ZTI18user_fpsimd_struct",
   "self_type" : "_ZTI18user_fpsimd_struct",
   "size" : 528,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "_ZTI19__pthread_cleanup_t",
   "self_type" : "_ZTI19__pthread_cleanup_t",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/pthread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 48,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/select.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI8sigset_t",
   "name" : "sigset_t",
   "referenced_type" : "_ZTI8sigset_t",
   "self_type" : "_ZTI8sigset_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/timespec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_offset" : 320,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI10sigcontext"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 4560,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "_ZTI9cpu_set_t",
   "self_type" : "_ZTI9cpu_set_t",
   "size" : 128,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt0_E",
   "self_type" : "_ZTIN10__sifieldsUt0_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt1_E",
   "self_type" : "_ZTIN10__sifieldsUt1_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt2_E",
   "self_type" : "_ZTIN10__sifieldsUt2_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_E",
   "self_type" : "_ZTIN10__sifieldsUt3_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt4_E",
   "self_type" : "_ZTIN10__sifieldsUt4_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt5_E",
   "self_type" : "_ZTIN10__sifieldsUt5_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h:79:22)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRSC",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android12renderscript7ContextE"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "mSysRefCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mUserRefCount",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mPrev",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKN7android12renderscript10ObjectBaseE"
    },
    {
     "access" : "private",
     "field_name" : "mNext",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKN7android12renderscript10ObjectBaseE"
    },
    {
     "access" : "private",
     "field_name" : "mDH",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPN7android12renderscript11DebugHelperE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript10ObjectBaseE",
   "name" : "android::renderscript::ObjectBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12renderscript10ObjectBaseE",
   "self_type" : "_ZTIN7android12renderscript10ObjectBaseE",
   "size" : 56,
   "source_file" : "frameworks/rs/rsObjectBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript10ObjectBaseE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mElements",
     "referenced_type" : "_ZTINSt3__16vectorIPN7android12renderscript7ElementENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript12ElementStateE",
   "name" : "android::renderscript::ElementState",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12renderscript12ElementStateE",
   "self_type" : "_ZTIN7android12renderscript12ElementStateE",
   "size" : 24,
   "source_file" : "frameworks/rs/rsElement.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "_ZTIPKN7android12renderscript7ElementE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript13ObjectBaseRefIKNS0_7ElementEEE",
   "name" : "android::renderscript::ObjectBaseRef<const android::renderscript::Element>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12renderscript13ObjectBaseRefIKNS0_7ElementEEE",
   "self_type" : "_ZTIN7android12renderscript13ObjectBaseRefIKNS0_7ElementEEE",
   "size" : 8,
   "source_file" : "frameworks/rs/rsObjectBase.h",
   "template_args" : [ "_ZTIKN7android12renderscript7ElementE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "_ZTIPN7android12renderscript4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript13ObjectBaseRefINS0_4TypeEEE",
   "name" : "android::renderscript::ObjectBaseRef<android::renderscript::Type>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12renderscript13ObjectBaseRefINS0_4TypeEEE",
   "self_type" : "_ZTIN7android12renderscript13ObjectBaseRefINS0_4TypeEEE",
   "size" : 8,
   "source_file" : "frameworks/rs/rsObjectBase.h",
   "template_args" : [ "_ZTIN7android12renderscript4TypeE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "element",
     "referenced_type" : "_ZTIPKN7android12renderscript7ElementE"
    },
    {
     "field_name" : "dimX",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dimY",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dimZ",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lodDimX",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "lodDimY",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "lodDimZ",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "arrays",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "lodCount",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dimYuv",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arrayCount",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "faces",
     "field_offset" : 544,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript4Type3Hal5StateE",
   "name" : "android::renderscript::Type::Hal::State",
   "referenced_type" : "_ZTIN7android12renderscript4Type3Hal5StateE",
   "self_type" : "_ZTIN7android12renderscript4Type3Hal5StateE",
   "size" : 72,
   "source_file" : "frameworks/rs/rsType.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "state",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android12renderscript4Type3Hal5StateE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript4Type3HalE",
   "name" : "android::renderscript::Type::Hal",
   "referenced_type" : "_ZTIN7android12renderscript4Type3HalE",
   "self_type" : "_ZTIN7android12renderscript4Type3HalE",
   "size" : 80,
   "source_file" : "frameworks/rs/rsType.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12renderscript10ObjectBaseE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN7android12renderscript4Type3HalE"
    },
    {
     "access" : "protected",
     "field_name" : "mDimLOD",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mElement",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIN7android12renderscript13ObjectBaseRefIKNS0_7ElementEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mCellCount",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript4TypeE",
   "name" : "android::renderscript::Type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12renderscript4TypeE",
   "self_type" : "_ZTIN7android12renderscript4TypeE",
   "size" : 160,
   "source_file" : "frameworks/rs/rsType.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript4TypeE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Type8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Type9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Type10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Type21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Type10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript4TypeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript4TypeD0Ev"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "e",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android12renderscript13ObjectBaseRefIKNS0_7ElementEEE"
    },
    {
     "field_name" : "offsetBits",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offsetBitsUnpadded",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arraySize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript7Element14ElementField_tE",
   "name" : "android::renderscript::Element::ElementField_t",
   "referenced_type" : "_ZTIN7android12renderscript7Element14ElementField_tE",
   "self_type" : "_ZTIN7android12renderscript7Element14ElementField_tE",
   "size" : 32,
   "source_file" : "frameworks/rs/rsElement.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dataType",
     "referenced_type" : "_ZTI10RsDataType"
    },
    {
     "field_name" : "dataKind",
     "field_offset" : 32,
     "referenced_type" : "_ZTI10RsDataKind"
    },
    {
     "field_name" : "vectorSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "elementSizeBytes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fields",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPPKN7android12renderscript7ElementE"
    },
    {
     "field_name" : "fieldArraySizes",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "fieldNames",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "field_name" : "fieldNameLengths",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "fieldOffsetBytes",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "fieldsCount",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript7Element3Hal5StateE",
   "name" : "android::renderscript::Element::Hal::State",
   "referenced_type" : "_ZTIN7android12renderscript7Element3Hal5StateE",
   "self_type" : "_ZTIN7android12renderscript7Element3Hal5StateE",
   "size" : 64,
   "source_file" : "frameworks/rs/rsElement.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "state",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android12renderscript7Element3Hal5StateE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript7Element3HalE",
   "name" : "android::renderscript::Element::Hal",
   "referenced_type" : "_ZTIN7android12renderscript7Element3HalE",
   "self_type" : "_ZTIN7android12renderscript7Element3HalE",
   "size" : 72,
   "source_file" : "frameworks/rs/rsElement.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12renderscript10ObjectBaseE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN7android12renderscript7Element3HalE"
    },
    {
     "access" : "protected",
     "field_name" : "mFields",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPN7android12renderscript7Element14ElementField_tE"
    },
    {
     "access" : "protected",
     "field_name" : "mFieldCount",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "mHasReference",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mComponent",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIN7android12renderscript9ComponentE"
    },
    {
     "access" : "protected",
     "field_name" : "mBitsUnpadded",
     "field_offset" : 1440,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mBits",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript7ElementE",
   "name" : "android::renderscript::Element",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12renderscript7ElementE",
   "self_type" : "_ZTIN7android12renderscript7ElementE",
   "size" : 192,
   "source_file" : "frameworks/rs/rsElement.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript7ElementE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Element8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Element9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Element10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Element21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Element10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript7ElementD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript7ElementD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mData",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "protected",
     "field_name" : "mPos",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "mUse64",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript7IStreamE",
   "name" : "android::renderscript::IStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12renderscript7IStreamE",
   "self_type" : "_ZTIN7android12renderscript7IStreamE",
   "size" : 24,
   "source_file" : "frameworks/rs/rsStream.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mData",
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "protected",
     "field_name" : "mLength",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "mPos",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "mUse64",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript7OStreamE",
   "name" : "android::renderscript::OStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12renderscript7OStreamE",
   "self_type" : "_ZTIN7android12renderscript7OStreamE",
   "size" : 32,
   "source_file" : "frameworks/rs/rsStream.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mType",
     "referenced_type" : "_ZTI10RsDataType"
    },
    {
     "access" : "protected",
     "field_name" : "mKind",
     "field_offset" : 32,
     "referenced_type" : "_ZTI10RsDataKind"
    },
    {
     "access" : "protected",
     "field_name" : "mNormalized",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mVectorSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mBits",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mBitsUnpadded",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mTypeBits",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mIsFloat",
     "field_offset" : 224,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mIsSigned",
     "field_offset" : 232,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mIsPixel",
     "field_offset" : 240,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript9ComponentE",
   "name" : "android::renderscript::Component",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12renderscript9ComponentE",
   "self_type" : "_ZTIN7android12renderscript9ComponentE",
   "size" : 32,
   "source_file" : "frameworks/rs/rsComponent.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI12rs_matrix2x2"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript9Matrix2x2E",
   "name" : "android::renderscript::Matrix2x2",
   "referenced_type" : "_ZTIN7android12renderscript9Matrix2x2E",
   "self_type" : "_ZTIN7android12renderscript9Matrix2x2E",
   "size" : 16,
   "source_file" : "frameworks/rs/rsMatrix2x2.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI12rs_matrix3x3"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript9Matrix3x3E",
   "name" : "android::renderscript::Matrix3x3",
   "referenced_type" : "_ZTIN7android12renderscript9Matrix3x3E",
   "self_type" : "_ZTIN7android12renderscript9Matrix3x3E",
   "size" : 36,
   "source_file" : "frameworks/rs/rsMatrix3x3.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI12rs_matrix4x4"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript9Matrix4x4E",
   "name" : "android::renderscript::Matrix4x4",
   "referenced_type" : "_ZTIN7android12renderscript9Matrix4x4E",
   "self_type" : "_ZTIN7android12renderscript9Matrix4x4E",
   "size" : 64,
   "source_file" : "frameworks/rs/rsMatrix4x4.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mTypes",
     "referenced_type" : "_ZTINSt3__16vectorIPN7android12renderscript4TypeENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12renderscript9TypeStateE",
   "name" : "android::renderscript::TypeState",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12renderscript9TypeStateE",
   "self_type" : "_ZTIN7android12renderscript9TypeStateE",
   "size" : 24,
   "source_file" : "frameworks/rs/rsType.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA12_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:232:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h:117:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h:78:20)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm64_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__110__function16__policy_storageE",
   "self_type" : "_ZTINSt3__110__function16__policy_storageE",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "referenced_type" : "_ZTINSt3__110__function8__policyE",
   "self_type" : "_ZTINSt3__110__function8__policyE",
   "size" : 32,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm0EEE",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "_ZTINSt3__110__get_pairILm0EEE",
   "self_type" : "_ZTINSt3__110__get_pairILm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm1EEE",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "_ZTINSt3__110__get_pairILm1EEE",
   "self_type" : "_ZTINSt3__110__get_pairILm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "_ZTINSt3__110__ignore_tIhEE",
   "self_type" : "_ZTINSt3__110__ignore_tIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "referenced_type" : "_ZTINSt3__110in_place_tE",
   "self_type" : "_ZTINSt3__110in_place_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDiEE",
   "name" : "std::is_trivial<char32_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDiEE",
   "self_type" : "_ZTINSt3__110is_trivialIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDsEE",
   "name" : "std::is_trivial<char16_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDsEE",
   "self_type" : "_ZTINSt3__110is_trivialIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "referenced_type" : "_ZTINSt3__110is_trivialIcEE",
   "self_type" : "_ZTINSt3__110is_trivialIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIwEE",
   "self_type" : "_ZTINSt3__110is_trivialIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110less_equalIvEE",
   "name" : "std::less_equal<void>",
   "referenced_type" : "_ZTINSt3__110less_equalIvEE",
   "self_type" : "_ZTINSt3__110less_equalIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110logical_orIvEE",
   "name" : "std::logical_or<void>",
   "referenced_type" : "_ZTINSt3__110logical_orIvEE",
   "self_type" : "_ZTINSt3__110logical_orIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110multipliesIvEE",
   "name" : "std::multiplies<void>",
   "referenced_type" : "_ZTINSt3__110multipliesIvEE",
   "self_type" : "_ZTINSt3__110multipliesIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "referenced_type" : "_ZTINSt3__110owner_lessIvEE",
   "self_type" : "_ZTINSt3__110owner_lessIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "name" : "std::tuple_size<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constImLb0EEE",
   "name" : "std::__add_const<unsigned long, false>",
   "referenced_type" : "_ZTINSt3__111__add_constImLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constImLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char32_t>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDiEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char16_t>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDsEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIPN7android12renderscript4TypeEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<android::renderscript::Type *>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIPN7android12renderscript4TypeEEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIPN7android12renderscript4TypeEEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIPN7android12renderscript4TypeEEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIPN7android12renderscript7ElementEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<android::renderscript::Element *>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIPN7android12renderscript7ElementEEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIPN7android12renderscript7ElementEEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIPN7android12renderscript7ElementEEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__type_list<__int128, std::__nat>>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__type_list<unsigned __int128, std::__nat>>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "name" : "std::add_pointer<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDiEE",
   "name" : "std::char_traits<char32_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDiEE",
   "self_type" : "_ZTINSt3__111char_traitsIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDsEE",
   "name" : "std::char_traits<char16_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDsEE",
   "self_type" : "_ZTINSt3__111char_traitsIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIcEE",
   "name" : "std::char_traits<char>",
   "referenced_type" : "_ZTINSt3__111char_traitsIcEE",
   "self_type" : "_ZTINSt3__111char_traitsIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIwEE",
   "name" : "std::char_traits<wchar_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIwEE",
   "self_type" : "_ZTINSt3__111char_traitsIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "name" : "std::conditional<false, std::pointer_traits<char32_t *>::__nat, char32_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPDiE5__natE", "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "name" : "std::conditional<false, std::pointer_traits<char16_t *>::__nat, char16_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPDsE5__natE", "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPPN7android12renderscript4TypeEE5__natES5_EE",
   "name" : "std::conditional<false, std::pointer_traits<Type **>::__nat, android::renderscript::Type *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPPN7android12renderscript4TypeEE5__natES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPPN7android12renderscript4TypeEE5__natES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPPN7android12renderscript4TypeEE5__natE",
    "_ZTIPN7android12renderscript4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPPN7android12renderscript7ElementEE5__natES5_EE",
   "name" : "std::conditional<false, std::pointer_traits<Element **>::__nat, android::renderscript::Element *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPPN7android12renderscript7ElementEE5__natES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPPN7android12renderscript7ElementEE5__natES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPPN7android12renderscript7ElementEE5__natE",
    "_ZTIPN7android12renderscript7ElementE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "name" : "std::conditional<false, std::pointer_traits<char *>::__nat, char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPcE5__natE", "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "name" : "std::conditional<false, std::pointer_traits<wchar_t *>::__nat, wchar_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPwE5__natE", "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long> *, std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPNSt3__14pairImmEE", "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmE10_CheckArgsE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>, std::__nat>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE", "_ZTINSt3__15__natE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char32_t, std::char_traits<char32_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIDiNS_11char_traitsIDiEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char16_t, std::char_traits<char16_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIDsNS_11char_traitsIDsEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char, std::char_traits<char>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<wchar_t, std::char_traits<wchar_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIwNS_11char_traitsIwEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDiEE",
   "name" : "std::is_abstract<const char32_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKDiEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDsEE",
   "name" : "std::is_abstract<const char16_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKDsEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKcEE",
   "name" : "std::is_abstract<const char *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKwEE",
   "name" : "std::is_abstract<const wchar_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKwEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractImEE",
   "name" : "std::is_abstract<unsigned long>",
   "referenced_type" : "_ZTINSt3__111is_abstractImEE",
   "self_type" : "_ZTINSt3__111is_abstractImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_4pairImmEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_4pairImmEEEE",
   "name" : "std::is_function<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionImLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionImEE",
   "name" : "std::is_function<unsigned long>",
   "referenced_type" : "_ZTINSt3__111is_functionImEE",
   "self_type" : "_ZTINSt3__111is_functionImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIdEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIdEE",
   "name" : "std::is_integral<double>",
   "referenced_type" : "_ZTINSt3__111is_integralIdEE",
   "self_type" : "_ZTINSt3__111is_integralIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIlEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIlEE",
   "name" : "std::is_integral<long>",
   "referenced_type" : "_ZTINSt3__111is_integralIlEE",
   "self_type" : "_ZTINSt3__111is_integralIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralImEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralImEE",
   "name" : "std::is_integral<unsigned long>",
   "referenced_type" : "_ZTINSt3__111is_integralImEE",
   "self_type" : "_ZTINSt3__111is_integralImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_andIvEE",
   "name" : "std::logical_and<void>",
   "referenced_type" : "_ZTINSt3__111logical_andIvEE",
   "self_type" : "_ZTINSt3__111logical_andIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_notIvEE",
   "name" : "std::logical_not<void>",
   "referenced_type" : "_ZTINSt3__111logical_notIvEE",
   "self_type" : "_ZTINSt3__111logical_notIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__115__struct_doubleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__116__struct_double4E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIPiEE",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "_ZTINSt3__112__align_typeIPiEE",
   "self_type" : "_ZTINSt3__112__align_typeIPiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIdEE",
   "name" : "std::__align_type<double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIdEE",
   "self_type" : "_ZTINSt3__112__align_typeIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIeEE",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIeEE",
   "self_type" : "_ZTINSt3__112__align_typeIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIhEE",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "_ZTINSt3__112__align_typeIhEE",
   "self_type" : "_ZTINSt3__112__align_typeIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIjEE",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "_ZTINSt3__112__align_typeIjEE",
   "self_type" : "_ZTINSt3__112__align_typeIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeImEE",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "_ZTINSt3__112__align_typeImEE",
   "self_type" : "_ZTINSt3__112__align_typeImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeItEE",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "_ZTINSt3__112__align_typeItEE",
   "self_type" : "_ZTINSt3__112__align_typeItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIyEE",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112__align_typeIyEE",
   "self_type" : "_ZTINSt3__112__align_typeIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__destruct_nE",
   "name" : "std::__destruct_n",
   "referenced_type" : "_ZTINSt3__112__destruct_nE",
   "self_type" : "_ZTINSt3__112__destruct_nE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__second_tagE",
   "name" : "std::__second_tag",
   "referenced_type" : "_ZTINSt3__112__second_tagE",
   "self_type" : "_ZTINSt3__112__second_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRmNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<unsigned long &, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRmNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRmNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__tuple_lessILm0EEE",
   "name" : "std::__tuple_less<0>",
   "referenced_type" : "_ZTINSt3__112__tuple_lessILm0EEE",
   "self_type" : "_ZTINSt3__112__tuple_lessILm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__tuple_likeINS_4pairImmEEEE",
   "name" : "std::__tuple_like<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112__tuple_likeINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__112__tuple_likeINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "name" : "std::alignment_of<std::__struct_double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "self_type" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__115__struct_doubleE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "name" : "std::alignment_of<std::__struct_double4>",
   "referenced_type" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "self_type" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__116__struct_double4E" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIPiEE",
   "name" : "std::alignment_of<int *>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIPiEE",
   "self_type" : "_ZTINSt3__112alignment_ofIPiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIdEE",
   "name" : "std::alignment_of<double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIdEE",
   "self_type" : "_ZTINSt3__112alignment_ofIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIeEE",
   "name" : "std::alignment_of<long double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIeEE",
   "self_type" : "_ZTINSt3__112alignment_ofIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIhEE",
   "name" : "std::alignment_of<unsigned char>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIhEE",
   "self_type" : "_ZTINSt3__112alignment_ofIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm4EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIjEE",
   "name" : "std::alignment_of<unsigned int>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIjEE",
   "self_type" : "_ZTINSt3__112alignment_ofIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofImEE",
   "name" : "std::alignment_of<unsigned long>",
   "referenced_type" : "_ZTINSt3__112alignment_ofImEE",
   "self_type" : "_ZTINSt3__112alignment_ofImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofItEE",
   "name" : "std::alignment_of<unsigned short>",
   "referenced_type" : "_ZTINSt3__112alignment_ofItEE",
   "self_type" : "_ZTINSt3__112alignment_ofItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIyEE",
   "name" : "std::alignment_of<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIyEE",
   "self_type" : "_ZTINSt3__112alignment_ofIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112bad_weak_ptrE",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112bad_weak_ptrE",
   "self_type" : "_ZTINSt3__112bad_weak_ptrE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_m"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__ulxE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__ulxE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPDi"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA5_Di"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIDi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E",
   "size" : 4,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEEE",
   "name" : "std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEEE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string",
   "template_args" :
   [
    "_ZTIDi",
    "_ZTINSt3__111char_traitsIDiEE",
    "_ZTINSt3__19allocatorIDiEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_m"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__ulxE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__ulxE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPDs"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 2,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA11_Ds"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIDs"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E",
   "size" : 2,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEEE",
   "name" : "std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEEE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string",
   "template_args" :
   [
    "_ZTIDs",
    "_ZTINSt3__111char_traitsIDsEE",
    "_ZTINSt3__19allocatorIDsEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_m"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "name" : "std::basic_string<char>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "name" : "std::basic_string<char>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "name" : "std::basic_string<char>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "name" : "std::basic_string<char>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "name" : "std::basic_string<char>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA23_c"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "name" : "std::basic_string<char>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIc"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "name" : "std::basic_string<char>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "size" : 1,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string",
   "template_args" : [ "_ZTIc", "_ZTINSt3__111char_traitsIcEE", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_m"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "name" : "std::basic_string<wchar_t>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "name" : "std::basic_string<wchar_t>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "name" : "std::basic_string<wchar_t>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "name" : "std::basic_string<wchar_t>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPw"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "name" : "std::basic_string<wchar_t>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA5_w"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "name" : "std::basic_string<wchar_t>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIw"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "name" : "std::basic_string<wchar_t>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "size" : 4,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "size" : 24,
   "source_file" : "external/libcxx/include/string",
   "template_args" : [ "_ZTIw", "_ZTINSt3__111char_traitsIwEE", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_4pairImmEEEE",
   "name" : "std::is_reference<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceImEE",
   "name" : "std::is_reference<unsigned long>",
   "referenced_type" : "_ZTINSt3__112is_referenceImEE",
   "self_type" : "_ZTINSt3__112is_referenceImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112not_equal_toIvEE",
   "name" : "std::not_equal_to<void>",
   "referenced_type" : "_ZTINSt3__112not_equal_toIvEE",
   "self_type" : "_ZTINSt3__112not_equal_toIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "name" : "std::placeholders::__ph<10>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "name" : "std::placeholders::__ph<1>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "name" : "std::placeholders::__ph<2>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "name" : "std::placeholders::__ph<3>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "name" : "std::placeholders::__ph<4>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "name" : "std::placeholders::__ph<5>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "name" : "std::placeholders::__ph<6>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "name" : "std::placeholders::__ph<7>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "name" : "std::placeholders::__ph<8>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "name" : "std::placeholders::__ph<9>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIDiEE",
   "name" : "std::remove_const<char32_t>",
   "referenced_type" : "_ZTINSt3__112remove_constIDiEE",
   "self_type" : "_ZTINSt3__112remove_constIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIDsEE",
   "name" : "std::remove_const<char16_t>",
   "referenced_type" : "_ZTINSt3__112remove_constIDsEE",
   "self_type" : "_ZTINSt3__112remove_constIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_4pairImmEEEE",
   "name" : "std::remove_const<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOmEE",
   "name" : "std::remove_const<unsigned long &&>",
   "referenced_type" : "_ZTINSt3__112remove_constIOmEE",
   "self_type" : "_ZTINSt3__112remove_constIOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIPN7android12renderscript4TypeEEE",
   "name" : "std::remove_const<android::renderscript::Type *>",
   "referenced_type" : "_ZTINSt3__112remove_constIPN7android12renderscript4TypeEEE",
   "self_type" : "_ZTINSt3__112remove_constIPN7android12renderscript4TypeEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPN7android12renderscript4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIPN7android12renderscript7ElementEEE",
   "name" : "std::remove_const<android::renderscript::Element *>",
   "referenced_type" : "_ZTINSt3__112remove_constIPN7android12renderscript7ElementEEE",
   "self_type" : "_ZTINSt3__112remove_constIPN7android12renderscript7ElementEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPN7android12renderscript7ElementE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKmEE",
   "name" : "std::remove_const<const unsigned long &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKmEE",
   "self_type" : "_ZTINSt3__112remove_constIRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRmEE",
   "name" : "std::remove_const<unsigned long &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRmEE",
   "self_type" : "_ZTINSt3__112remove_constIRmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIcEE",
   "name" : "std::remove_const<char>",
   "referenced_type" : "_ZTINSt3__112remove_constIcEE",
   "self_type" : "_ZTINSt3__112remove_constIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIdEE",
   "name" : "std::remove_const<double>",
   "referenced_type" : "_ZTINSt3__112remove_constIdEE",
   "self_type" : "_ZTINSt3__112remove_constIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIlEE",
   "name" : "std::remove_const<long>",
   "referenced_type" : "_ZTINSt3__112remove_constIlEE",
   "self_type" : "_ZTINSt3__112remove_constIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constImEE",
   "name" : "std::remove_const<unsigned long>",
   "referenced_type" : "_ZTINSt3__112remove_constImEE",
   "self_type" : "_ZTINSt3__112remove_constImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIwEE",
   "name" : "std::remove_const<wchar_t>",
   "referenced_type" : "_ZTINSt3__112remove_constIwEE",
   "self_type" : "_ZTINSt3__112remove_constIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "name" : "std::__make_signed<bool, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "name" : "std::__make_signed<int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "name" : "std::__make_signed<unsigned int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "name" : "std::__make_signed<long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedImLb1EEE",
   "name" : "std::__make_signed<unsigned long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedInLb1EEE",
   "name" : "std::__make_signed<__int128_t, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedInLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedInLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIoLb1EEE",
   "name" : "std::__make_signed<__uint128_t, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIoLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIoLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIo" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "name" : "std::__make_signed<short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedItLb1EEE",
   "name" : "std::__make_signed<unsigned short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "name" : "std::__make_signed<long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "name" : "std::__make_signed<unsigned long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashINS_6_PairTELm2EEE",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__16_PairTE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIdmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIdLm1EEE",
   "name" : "std::__scalar_hash<double, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIdLm1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIdLm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIemEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIeLm2EEE",
   "name" : "std::__scalar_hash<long double, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIeLm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIeLm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIfmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIfLm0EEE",
   "name" : "std::__scalar_hash<float, 0>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIfLm0EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIfLm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionInmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashInLm2EEE",
   "name" : "std::__scalar_hash<__int128, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashInLm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashInLm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIn" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIomEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIoLm2EEE",
   "name" : "std::__scalar_hash<unsigned __int128, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIoLm2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIoLm2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIo" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIxmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIxLm1EEE",
   "name" : "std::__scalar_hash<long long, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIxLm1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIxLm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIymEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIyLm1EEE",
   "name" : "std::__scalar_hash<unsigned long long, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIyLm1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIyLm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_equalILm0EEE",
   "name" : "std::__tuple_equal<0>",
   "referenced_type" : "_ZTINSt3__113__tuple_equalILm0EEE",
   "self_type" : "_ZTINSt3__113__tuple_equalILm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_typesIJEEE",
   "name" : "std::__tuple_types<>",
   "referenced_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "self_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "protected",
     "referenced_type" : "_ZTINSt3__120__vector_base_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__begin_",
     "referenced_type" : "_ZTIPPN7android12renderscript4TypeE"
    },
    {
     "access" : "protected",
     "field_name" : "__end_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPPN7android12renderscript4TypeE"
    },
    {
     "access" : "protected",
     "field_name" : "__end_cap_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPPN7android12renderscript4TypeENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__vector_baseIPN7android12renderscript4TypeENS_9allocatorIS4_EEEE",
   "name" : "std::__vector_base<android::renderscript::Type *, std::allocator<android::renderscript::Type *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__113__vector_baseIPN7android12renderscript4TypeENS_9allocatorIS4_EEEE",
   "self_type" : "_ZTINSt3__113__vector_baseIPN7android12renderscript4TypeENS_9allocatorIS4_EEEE",
   "size" : 24,
   "source_file" : "external/libcxx/include/vector",
   "template_args" :
   [
    "_ZTIPN7android12renderscript4TypeE",
    "_ZTINSt3__19allocatorIPN7android12renderscript4TypeEEE"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "protected",
     "referenced_type" : "_ZTINSt3__120__vector_base_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__begin_",
     "referenced_type" : "_ZTIPPN7android12renderscript7ElementE"
    },
    {
     "access" : "protected",
     "field_name" : "__end_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPPN7android12renderscript7ElementE"
    },
    {
     "access" : "protected",
     "field_name" : "__end_cap_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPPN7android12renderscript7ElementENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__vector_baseIPN7android12renderscript7ElementENS_9allocatorIS4_EEEE",
   "name" : "std::__vector_base<android::renderscript::Element *, std::allocator<android::renderscript::Element *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__113__vector_baseIPN7android12renderscript7ElementENS_9allocatorIS4_EEEE",
   "self_type" : "_ZTINSt3__113__vector_baseIPN7android12renderscript7ElementENS_9allocatorIS4_EEEE",
   "size" : 24,
   "source_file" : "external/libcxx/include/vector",
   "template_args" :
   [
    "_ZTIPN7android12renderscript7ElementE",
    "_ZTINSt3__19allocatorIPN7android12renderscript7ElementEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113greater_equalIvEE",
   "name" : "std::greater_equal<void>",
   "referenced_type" : "_ZTINSt3__113greater_equalIvEE",
   "self_type" : "_ZTINSt3__113greater_equalIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIlEE",
   "name" : "std::is_arithmetic<long>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIlEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticImEE",
   "name" : "std::is_arithmetic<unsigned long>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticImEE",
   "self_type" : "_ZTINSt3__113is_arithmeticImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRmOmLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRmOmEE",
   "name" : "std::is_assignable<unsigned long &, unsigned long &&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRmOmEE",
   "self_type" : "_ZTINSt3__113is_assignableIRmOmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTIOm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRmRKmLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRmRKmEE",
   "name" : "std::is_assignable<unsigned long &, const unsigned long &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRmRKmEE",
   "self_type" : "_ZTINSt3__113is_assignableIRmRKmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRm", "_ZTIRKm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_4pairImmEEEE",
   "name" : "std::remove_extent<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDiEEEE",
   "name" : "std::__has_max_size<const std::allocator<char32_t>>",
   "referenced_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDiEEEE",
   "self_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDiEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKNSt3__19allocatorIDiEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDsEEEE",
   "name" : "std::__has_max_size<const std::allocator<char16_t>>",
   "referenced_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDsEEEE",
   "self_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDsEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKNSt3__19allocatorIDsEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIcEEEE",
   "name" : "std::__has_max_size<const std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKNSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIwEEEE",
   "name" : "std::__has_max_size<const std::allocator<wchar_t>>",
   "referenced_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIwEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKNSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDiEEvvEE",
   "name" : "std::__is_allocator<std::allocator<char32_t>, void, void>",
   "referenced_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDiEEvvEE",
   "self_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDiEEvvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDiEE", "_ZTIv", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDsEEvvEE",
   "name" : "std::__is_allocator<std::allocator<char16_t>, void, void>",
   "referenced_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDsEEvvEE",
   "self_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDsEEvvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDsEE", "_ZTIv", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIcEEvvEE",
   "name" : "std::__is_allocator<std::allocator<char>, void, void>",
   "referenced_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIcEEvvEE",
   "self_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIcEEvvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIv", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIwEEvvEE",
   "name" : "std::__is_allocator<std::allocator<wchar_t>, void, void>",
   "referenced_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIwEEvvEE",
   "self_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIwEEvvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIv", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__is_construct5__natE",
   "name" : "std::__is_construct::__nat",
   "referenced_type" : "_ZTINSt3__114__is_construct5__natE",
   "self_type" : "_ZTINSt3__114__is_construct5__natE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_4pairImmEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_4pairImmEEEE",
   "name" : "std::__is_nullptr_t<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implImEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tImEE",
   "name" : "std::__is_nullptr_t<unsigned long>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tImEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "name" : "std::__lazy_or_impl<false>",
   "referenced_type" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "self_type" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__numeric_typeIvEE",
   "name" : "std::__numeric_type<void>",
   "referenced_type" : "_ZTINSt3__114__numeric_typeIvEE",
   "self_type" : "_ZTINSt3__114__numeric_typeIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIDiNS_9allocatorIDiEEEE",
   "name" : "std::__pointer_type<char32_t, std::allocator<char32_t>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIDiNS_9allocatorIDiEEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIDiNS_9allocatorIDiEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIDi", "_ZTINSt3__19allocatorIDiEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIDsNS_9allocatorIDsEEEE",
   "name" : "std::__pointer_type<char16_t, std::allocator<char16_t>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIDsNS_9allocatorIDsEEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIDsNS_9allocatorIDsEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIDs", "_ZTINSt3__19allocatorIDsEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIPN7android12renderscript4TypeENS_9allocatorIS4_EEEE",
   "name" : "std::__pointer_type<android::renderscript::Type *, std::allocator<android::renderscript::Type *>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIPN7android12renderscript4TypeENS_9allocatorIS4_EEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIPN7android12renderscript4TypeENS_9allocatorIS4_EEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIPN7android12renderscript4TypeE",
    "_ZTINSt3__19allocatorIPN7android12renderscript4TypeEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIPN7android12renderscript7ElementENS_9allocatorIS4_EEEE",
   "name" : "std::__pointer_type<android::renderscript::Element *, std::allocator<android::renderscript::Element *>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIPN7android12renderscript7ElementENS_9allocatorIS4_EEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIPN7android12renderscript7ElementENS_9allocatorIS4_EEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIPN7android12renderscript7ElementE",
    "_ZTINSt3__19allocatorIPN7android12renderscript7ElementEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIcNS_9allocatorIcEEEE",
   "name" : "std::__pointer_type<char, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIcNS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIcNS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIc", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIwNS_9allocatorIwEEEE",
   "name" : "std::__pointer_type<wchar_t, std::allocator<wchar_t>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIwNS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIwNS_9allocatorIwEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIw", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm16ELm16EEE",
   "name" : "std::__select_align<24, 16, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm16ELm8EEE",
   "name" : "std::__select_align<24, 16, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm16ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm1ELm16EEE",
   "name" : "std::__select_align<24, 1, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm1ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm1ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm2ELm16EEE",
   "name" : "std::__select_align<24, 2, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm2ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm2ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm4ELm16EEE",
   "name" : "std::__select_align<24, 4, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm4ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm4ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm8ELm16EEE",
   "name" : "std::__select_align<24, 8, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm8ELm8EEE",
   "name" : "std::__select_align<24, 8, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm24ELm8ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm16ELm16EEE",
   "name" : "std::__select_align<32, 16, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm16ELm8EEE",
   "name" : "std::__select_align<32, 16, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm16ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm1ELm16EEE",
   "name" : "std::__select_align<32, 1, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm1ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm1ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm2ELm16EEE",
   "name" : "std::__select_align<32, 2, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm2ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm2ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm4ELm16EEE",
   "name" : "std::__select_align<32, 4, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm4ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm4ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm8ELm16EEE",
   "name" : "std::__select_align<32, 8, 16>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm16EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm16EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm8ELm8EEE",
   "name" : "std::__select_align<32, 8, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILm32ELm8ELm8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__shared_owners_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__shared_countE",
   "name" : "std::__shared_count",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114__shared_countE",
   "self_type" : "_ZTINSt3__114__shared_countE",
   "size" : 16,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114__shared_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPDiNS_9allocatorIDiEELb0EEE",
   "name" : "std::__void_pointer<char32_t *, std::allocator<char32_t>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPDiNS_9allocatorIDiEELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPDiNS_9allocatorIDiEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPDi", "_ZTINSt3__19allocatorIDiEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPDsNS_9allocatorIDsEELb0EEE",
   "name" : "std::__void_pointer<char16_t *, std::allocator<char16_t>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPDsNS_9allocatorIDsEELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPDsNS_9allocatorIDsEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPDs", "_ZTINSt3__19allocatorIDsEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPPN7android12renderscript4TypeENS_9allocatorIS4_EELb0EEE",
   "name" : "std::__void_pointer<android::renderscript::Type **, std::allocator<android::renderscript::Type *>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPPN7android12renderscript4TypeENS_9allocatorIS4_EELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPPN7android12renderscript4TypeENS_9allocatorIS4_EELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIPPN7android12renderscript4TypeE",
    "_ZTINSt3__19allocatorIPN7android12renderscript4TypeEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPPN7android12renderscript7ElementENS_9allocatorIS4_EELb0EEE",
   "name" : "std::__void_pointer<android::renderscript::Element **, std::allocator<android::renderscript::Element *>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPPN7android12renderscript7ElementENS_9allocatorIS4_EELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPPN7android12renderscript7ElementENS_9allocatorIS4_EELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIPPN7android12renderscript7ElementE",
    "_ZTINSt3__19allocatorIPN7android12renderscript7ElementEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPcNS_9allocatorIcEELb0EEE",
   "name" : "std::__void_pointer<char *, std::allocator<char>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPcNS_9allocatorIcEELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPcNS_9allocatorIcEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPc", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPwNS_9allocatorIwEELb0EEE",
   "name" : "std::__void_pointer<wchar_t *, std::allocator<wchar_t>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPwNS_9allocatorIwEELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPwNS_9allocatorIwEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPw", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDiNS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "name" : "std::is_convertible<const char32_t *const &, std::basic_string_view<char32_t, std::char_traits<char32_t>>>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKDiNS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKDiNS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKDi",
    "_ZTINSt3__117basic_string_viewIDiNS_11char_traitsIDiEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDiS2_EE",
   "name" : "std::is_convertible<const char32_t *const &, const char32_t *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKDiS2_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKDiS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKDi", "_ZTIPKDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDsNS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "name" : "std::is_convertible<const char16_t *const &, std::basic_string_view<char16_t, std::char_traits<char16_t>>>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKDsNS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKDsNS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKDs",
    "_ZTINSt3__117basic_string_viewIDsNS_11char_traitsIDsEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDsS2_EE",
   "name" : "std::is_convertible<const char16_t *const &, const char16_t *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKDsS2_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKDsS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKDs", "_ZTIPKDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKcNS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_convertible<const char *const &, std::basic_string_view<char, std::char_traits<char>>>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKcNS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKcNS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKc", "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKcS2_EE",
   "name" : "std::is_convertible<const char *const &, const char *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKcS2_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKcS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKc", "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKwNS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "name" : "std::is_convertible<const wchar_t *const &, std::basic_string_view<wchar_t, std::char_traits<wchar_t>>>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKwNS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKwNS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKw", "_ZTINSt3__117basic_string_viewIwNS_11char_traitsIwEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKwS2_EE",
   "name" : "std::is_convertible<const wchar_t *const &, const wchar_t *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKwS2_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKwS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKw", "_ZTIPKw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKmmEE",
   "name" : "std::is_convertible<const unsigned long &, unsigned long>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKmmEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKmmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleImmEE",
   "name" : "std::is_convertible<unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114is_convertibleImmEE",
   "self_type" : "_ZTINSt3__114is_convertibleImmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIlLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIlEE",
   "name" : "std::numeric_limits<long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114numeric_limitsIlEE",
   "self_type" : "_ZTINSt3__114numeric_limitsIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsImLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsImEE",
   "name" : "std::numeric_limits<unsigned long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114numeric_limitsImEE",
   "self_type" : "_ZTINSt3__114numeric_limitsImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__v_",
     "referenced_type" : "_ZTINSt3__114pointer_safety4__lxE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114pointer_safetyE",
   "name" : "std::pointer_safety",
   "referenced_type" : "_ZTINSt3__114pointer_safetyE",
   "self_type" : "_ZTINSt3__114pointer_safetyE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPDiEE",
   "name" : "std::pointer_traits<char32_t *>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPDiEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPDsEE",
   "name" : "std::pointer_traits<char16_t *>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPDsEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPPN7android12renderscript4TypeEEE",
   "name" : "std::pointer_traits<android::renderscript::Type **>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPPN7android12renderscript4TypeEEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPPN7android12renderscript4TypeEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPPN7android12renderscript4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPPN7android12renderscript7ElementEEE",
   "name" : "std::pointer_traits<android::renderscript::Element **>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPPN7android12renderscript7ElementEEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPPN7android12renderscript7ElementEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPPN7android12renderscript7ElementE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPcEE",
   "name" : "std::pointer_traits<char *>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPcEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPwEE",
   "name" : "std::pointer_traits<wchar_t *>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPwEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIDimEE",
   "name" : "std::unary_function<char32_t, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIDimEE",
   "self_type" : "_ZTINSt3__114unary_functionIDimEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDi", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIDnmEE",
   "name" : "std::unary_function<nullptr_t, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIDnmEE",
   "self_type" : "_ZTINSt3__114unary_functionIDnmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDn", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIDsmEE",
   "name" : "std::unary_function<char16_t, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIDsmEE",
   "self_type" : "_ZTINSt3__114unary_functionIDsmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDs", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE",
   "name" : "std::unary_function<std::_PairT, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE",
   "self_type" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__16_PairTE", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIamEE",
   "name" : "std::unary_function<signed char, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIamEE",
   "self_type" : "_ZTINSt3__114unary_functionIamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIa", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIbmEE",
   "name" : "std::unary_function<bool, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIbmEE",
   "self_type" : "_ZTINSt3__114unary_functionIbmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIb", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIcmEE",
   "name" : "std::unary_function<char, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIcmEE",
   "self_type" : "_ZTINSt3__114unary_functionIcmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIc", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIdmEE",
   "name" : "std::unary_function<double, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIdmEE",
   "self_type" : "_ZTINSt3__114unary_functionIdmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTId", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIemEE",
   "name" : "std::unary_function<long double, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIemEE",
   "self_type" : "_ZTINSt3__114unary_functionIemEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIe", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIfmEE",
   "name" : "std::unary_function<float, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIfmEE",
   "self_type" : "_ZTINSt3__114unary_functionIfmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIf", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIhmEE",
   "name" : "std::unary_function<unsigned char, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIhmEE",
   "self_type" : "_ZTINSt3__114unary_functionIhmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIh", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIimEE",
   "name" : "std::unary_function<int, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIimEE",
   "self_type" : "_ZTINSt3__114unary_functionIimEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIi", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIjmEE",
   "name" : "std::unary_function<unsigned int, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIjmEE",
   "self_type" : "_ZTINSt3__114unary_functionIjmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIj", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIlmEE",
   "name" : "std::unary_function<long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIlmEE",
   "self_type" : "_ZTINSt3__114unary_functionIlmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIl", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionImmEE",
   "name" : "std::unary_function<unsigned long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionImmEE",
   "self_type" : "_ZTINSt3__114unary_functionImmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionInmEE",
   "name" : "std::unary_function<__int128, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionInmEE",
   "self_type" : "_ZTINSt3__114unary_functionInmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIn", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIomEE",
   "name" : "std::unary_function<unsigned __int128, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIomEE",
   "self_type" : "_ZTINSt3__114unary_functionIomEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIo", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIsmEE",
   "name" : "std::unary_function<short, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIsmEE",
   "self_type" : "_ZTINSt3__114unary_functionIsmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIs", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionItmEE",
   "name" : "std::unary_function<unsigned short, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionItmEE",
   "self_type" : "_ZTINSt3__114unary_functionItmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIt", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIwmEE",
   "name" : "std::unary_function<wchar_t, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIwmEE",
   "self_type" : "_ZTINSt3__114unary_functionIwmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIw", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIxmEE",
   "name" : "std::unary_function<long long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIxmEE",
   "self_type" : "_ZTINSt3__114unary_functionIxmEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIx", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIymEE",
   "name" : "std::unary_function<unsigned long long, unsigned long>",
   "referenced_type" : "_ZTINSt3__114unary_functionIymEE",
   "self_type" : "_ZTINSt3__114unary_functionIymEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIy", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__const_pointerIDiPDiNS_9allocatorIDiEELb1EEE",
   "name" : "std::__const_pointer<char32_t, char32_t *, std::allocator<char32_t>, true>",
