#ifndef HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_1_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_1_TYPES_H

#include <android/hardware/radio/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace radio {
namespace V1_1 {

// Forward declaration for forward reference support:
enum class CardPowerState : int32_t;
enum class RadioAccessNetworks : int32_t;
enum class GeranBands : int32_t;
enum class UtranBands : int32_t;
enum class EutranBands : int32_t;
enum class ScanType : int32_t;
enum class ScanStatus : int32_t;
enum class KeepaliveType : int32_t;
enum class KeepaliveStatusCode : int32_t;
struct RadioAccessSpecifier;
struct NetworkScanRequest;
struct NetworkScanResult;
struct KeepaliveRequest;
struct KeepaliveStatus;
struct ImsiEncryptionInfo;

enum class CardPowerState : int32_t {
    POWER_DOWN = 0,
    POWER_UP = 1 /* ::android::hardware::radio::V1_1::CardPowerState.POWER_DOWN implicitly + 1 */,
    POWER_UP_PASS_THROUGH = 2 /* ::android::hardware::radio::V1_1::CardPowerState.POWER_UP implicitly + 1 */,
};

enum class RadioAccessNetworks : int32_t {
    GERAN = 1,
    UTRAN = 2,
    EUTRAN = 3,
};

enum class GeranBands : int32_t {
    BAND_T380 = 1,
    BAND_T410 = 2,
    BAND_450 = 3,
    BAND_480 = 4,
    BAND_710 = 5,
    BAND_750 = 6,
    BAND_T810 = 7,
    BAND_850 = 8,
    BAND_P900 = 9,
    BAND_E900 = 10,
    BAND_R900 = 11,
    BAND_DCS1800 = 12,
    BAND_PCS1900 = 13,
    BAND_ER900 = 14,
};

enum class UtranBands : int32_t {
    BAND_1 = 1,
    BAND_2 = 2,
    BAND_3 = 3,
    BAND_4 = 4,
    BAND_5 = 5,
    BAND_6 = 6,
    BAND_7 = 7,
    BAND_8 = 8,
    BAND_9 = 9,
    BAND_10 = 10,
    BAND_11 = 11,
    BAND_12 = 12,
    BAND_13 = 13,
    BAND_14 = 14,
    BAND_19 = 19,
    BAND_20 = 20,
    BAND_21 = 21,
    BAND_22 = 22,
    BAND_25 = 25,
    BAND_26 = 26,
};

enum class EutranBands : int32_t {
    BAND_1 = 1,
    BAND_2 = 2,
    BAND_3 = 3,
    BAND_4 = 4,
    BAND_5 = 5,
    BAND_6 = 6,
    BAND_7 = 7,
    BAND_8 = 8,
    BAND_9 = 9,
    BAND_10 = 10,
    BAND_11 = 11,
    BAND_12 = 12,
    BAND_13 = 13,
    BAND_14 = 14,
    BAND_17 = 17,
    BAND_18 = 18,
    BAND_19 = 19,
    BAND_20 = 20,
    BAND_21 = 21,
    BAND_22 = 22,
    BAND_23 = 23,
    BAND_24 = 24,
    BAND_25 = 25,
    BAND_26 = 26,
    BAND_27 = 27,
    BAND_28 = 28,
    BAND_30 = 30,
    BAND_31 = 31,
    BAND_33 = 33,
    BAND_34 = 34,
    BAND_35 = 35,
    BAND_36 = 36,
    BAND_37 = 37,
    BAND_38 = 38,
    BAND_39 = 39,
    BAND_40 = 40,
    BAND_41 = 41,
    BAND_42 = 42,
    BAND_43 = 43,
    BAND_44 = 44,
    BAND_45 = 45,
    BAND_46 = 46,
    BAND_47 = 47,
    BAND_48 = 48,
    BAND_65 = 65,
    BAND_66 = 66,
    BAND_68 = 68,
    BAND_70 = 70,
};

enum class ScanType : int32_t {
    ONE_SHOT = 0,
    PERIODIC = 1,
};

enum class ScanStatus : int32_t {
    PARTIAL = 1,
    COMPLETE = 2,
};

enum class KeepaliveType : int32_t {
    NATT_IPV4 = 0,
    NATT_IPV6 = 1,
};

enum class KeepaliveStatusCode : int32_t {
    ACTIVE = 0,
    INACTIVE = 1 /* ::android::hardware::radio::V1_1::KeepaliveStatusCode.ACTIVE implicitly + 1 */,
    PENDING = 2 /* ::android::hardware::radio::V1_1::KeepaliveStatusCode.INACTIVE implicitly + 1 */,
};

struct RadioAccessSpecifier final {
    ::android::hardware::radio::V1_1::RadioAccessNetworks radioAccessNetwork __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_1::GeranBands> geranBands __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_1::UtranBands> utranBands __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_1::EutranBands> eutranBands __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<int32_t> channels __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_1::RadioAccessSpecifier, radioAccessNetwork) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::RadioAccessSpecifier, geranBands) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::RadioAccessSpecifier, utranBands) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::RadioAccessSpecifier, eutranBands) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::RadioAccessSpecifier, channels) == 56, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_1::RadioAccessSpecifier) == 72, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_1::RadioAccessSpecifier) == 8, "wrong alignment");

struct NetworkScanRequest final {
    ::android::hardware::radio::V1_1::ScanType type __attribute__ ((aligned(4)));
    int32_t interval __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_1::RadioAccessSpecifier> specifiers __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_1::NetworkScanRequest, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::NetworkScanRequest, interval) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::NetworkScanRequest, specifiers) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_1::NetworkScanRequest) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_1::NetworkScanRequest) == 8, "wrong alignment");

struct NetworkScanResult final {
    ::android::hardware::radio::V1_1::ScanStatus status __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::RadioError error __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CellInfo> networkInfos __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_1::NetworkScanResult, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::NetworkScanResult, error) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::NetworkScanResult, networkInfos) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_1::NetworkScanResult) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_1::NetworkScanResult) == 8, "wrong alignment");

struct KeepaliveRequest final {
    ::android::hardware::radio::V1_1::KeepaliveType type __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> sourceAddress __attribute__ ((aligned(8)));
    int32_t sourcePort __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> destinationAddress __attribute__ ((aligned(8)));
    int32_t destinationPort __attribute__ ((aligned(4)));
    int32_t maxKeepaliveIntervalMillis __attribute__ ((aligned(4)));
    int32_t cid __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_1::KeepaliveRequest, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::KeepaliveRequest, sourceAddress) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::KeepaliveRequest, sourcePort) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::KeepaliveRequest, destinationAddress) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::KeepaliveRequest, destinationPort) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::KeepaliveRequest, maxKeepaliveIntervalMillis) == 52, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::KeepaliveRequest, cid) == 56, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_1::KeepaliveRequest) == 64, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_1::KeepaliveRequest) == 8, "wrong alignment");

struct KeepaliveStatus final {
    int32_t sessionHandle __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_1::KeepaliveStatusCode code __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_1::KeepaliveStatus, sessionHandle) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::KeepaliveStatus, code) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_1::KeepaliveStatus) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_1::KeepaliveStatus) == 4, "wrong alignment");

struct ImsiEncryptionInfo final {
    ::android::hardware::hidl_string mcc __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string mnc __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<uint8_t> carrierKey __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string keyIdentifier __attribute__ ((aligned(8)));
    int64_t expirationTime __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_1::ImsiEncryptionInfo, mcc) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::ImsiEncryptionInfo, mnc) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::ImsiEncryptionInfo, carrierKey) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::ImsiEncryptionInfo, keyIdentifier) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_1::ImsiEncryptionInfo, expirationTime) == 64, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_1::ImsiEncryptionInfo) == 72, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_1::ImsiEncryptionInfo) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::radio::V1_1::CardPowerState o);
static inline void PrintTo(::android::hardware::radio::V1_1::CardPowerState o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::radio::V1_1::CardPowerState lhs, const ::android::hardware::radio::V1_1::CardPowerState rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::radio::V1_1::CardPowerState rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::radio::V1_1::CardPowerState lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
