#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_COMPOSER_V2_4_ICOMPOSERCLIENT_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_COMPOSER_V2_4_ICOMPOSERCLIENT_H

#include <android/hardware/graphics/common/1.2/types.h>
#include <android/hardware/graphics/composer/2.1/IComposerClient.h>
#include <android/hardware/graphics/composer/2.1/types.h>
#include <android/hardware/graphics/composer/2.3/IComposerClient.h>
#include <android/hardware/graphics/composer/2.4/IComposerCallback.h>
#include <android/hardware/graphics/composer/2.4/types.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace graphics {
namespace composer {
namespace V2_4 {

struct IComposerClient : public ::android::hardware::graphics::composer::V2_3::IComposerClient {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.graphics.composer@2.4::IComposerClient"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class Attribute : int32_t;
    enum class DisplayCapability : uint32_t;
    enum class Command : int32_t;
    enum class DisplayConnectionType : uint32_t;
    enum class ContentType : uint32_t;
    struct VsyncPeriodChangeConstraints;
    struct ClientTargetProperty;
    struct LayerGenericMetadataKey;

    /**
     * Display attributes queryable through getDisplayAttribute_2_4.
     */
    enum class Attribute : int32_t {
        INVALID = 0,
        /**
         * Dimensions in pixels
         */
        WIDTH = 1,
        HEIGHT = 2,
        /**
         * Vsync period in nanoseconds
         */
        VSYNC_PERIOD = 3,
        /**
         * Dots per thousand inches (DPI * 1000). Scaling by 1000 allows these
         * numbers to be stored in an int32_t without losing too much
         * precision. If the DPI for a configuration is unavailable or is
         * considered unreliable, the device may return UNSUPPORTED instead.
         */
        DPI_X = 4,
        DPI_Y = 5,
        /**
         * The configuration group ID (as int32_t) this config is associated to.
         * Switching between configurations within the same group may be done seamlessly
         * in some conditions via setActiveConfigWithConstraints.
         */
        CONFIG_GROUP = 7,
    };

    /**
     * Required capabilities which are supported by the display. The
     * particular set of supported capabilities for a given display may be
     * retrieved using getDisplayCapabilities.
     */
    enum class DisplayCapability : uint32_t {
        INVALID = 0u,
        /**
         * Indicates that the display must apply a color transform even when
         * either the client or the device has chosen that all layers should
         * be composed by the client. This prevents the client from applying
         * the color transform during its composition step.
         * If getDisplayCapabilities is supported, the global capability
         * SKIP_CLIENT_COLOR_TRANSFORM is ignored.
         * If getDisplayCapabilities is not supported, and the global capability
         * SKIP_CLIENT_COLOR_TRANSFORM is returned by getCapabilities,
         * then all displays must be treated as having
         * SKIP_CLIENT_COLOR_TRANSFORM.
         */
        SKIP_CLIENT_COLOR_TRANSFORM = 1u,
        /**
         * Indicates that the display supports PowerMode::DOZE and
         * PowerMode::DOZE_SUSPEND. DOZE_SUSPEND may not provide any benefit
         * over DOZE (see the definition of PowerMode for more information),
         * but if both DOZE and DOZE_SUSPEND are no different from
         * PowerMode::ON, the device must not claim support.
         * Must be returned by getDisplayCapabilities when getDozeSupport
         * indicates the display supports PowerMode::DOZE and
         * PowerMode::DOZE_SUSPEND.
         */
        DOZE = 2u,
        /**
         * Indicates that the display supports brightness operations.
         */
        BRIGHTNESS = 3u,
        /**
         * Indicates that the display supports protected contents.
         * When returned, hardware composer must be able to accept client target
         * with protected buffers.
         */
        PROTECTED_CONTENTS = 4u,
        /**
         * Indicates that both the composer HAL implementation and the given display
         * support a low latency mode, such as HDMI 2.1 Auto Low Latency Mode.
         */
        AUTO_LOW_LATENCY_MODE = 5u,
    };

    enum class Command : int32_t {
        LENGTH_MASK = 65535 /* 0xffff */,
        OPCODE_SHIFT = 16,
        OPCODE_MASK = -65536 /* 0xffff << OPCODE_SHIFT */,
        /**
         * special commands
         */
        SELECT_DISPLAY = 0 /* 0x000 << OPCODE_SHIFT */,
        SELECT_LAYER = 65536 /* 0x001 << OPCODE_SHIFT */,
        /**
         * value commands (for return values)
         */
        SET_ERROR = 16777216 /* 0x100 << OPCODE_SHIFT */,
        SET_CHANGED_COMPOSITION_TYPES = 16842752 /* 0x101 << OPCODE_SHIFT */,
        SET_DISPLAY_REQUESTS = 16908288 /* 0x102 << OPCODE_SHIFT */,
        SET_PRESENT_FENCE = 16973824 /* 0x103 << OPCODE_SHIFT */,
        SET_RELEASE_FENCES = 17039360 /* 0x104 << OPCODE_SHIFT */,
        /**
         * display commands
         */
        SET_COLOR_TRANSFORM = 33554432 /* 0x200 << OPCODE_SHIFT */,
        SET_CLIENT_TARGET = 33619968 /* 0x201 << OPCODE_SHIFT */,
        SET_OUTPUT_BUFFER = 33685504 /* 0x202 << OPCODE_SHIFT */,
        VALIDATE_DISPLAY = 33751040 /* 0x203 << OPCODE_SHIFT */,
        ACCEPT_DISPLAY_CHANGES = 33816576 /* 0x204 << OPCODE_SHIFT */,
        PRESENT_DISPLAY = 33882112 /* 0x205 << OPCODE_SHIFT */,
        PRESENT_OR_VALIDATE_DISPLAY = 33947648 /* 0x206 << OPCODE_SHIFT */,
        /**
         * layer commands (VALIDATE_DISPLAY not required)
         */
        SET_LAYER_CURSOR_POSITION = 50331648 /* 0x300 << OPCODE_SHIFT */,
        SET_LAYER_BUFFER = 50397184 /* 0x301 << OPCODE_SHIFT */,
        SET_LAYER_SURFACE_DAMAGE = 50462720 /* 0x302 << OPCODE_SHIFT */,
        /**
         * layer state commands (VALIDATE_DISPLAY required)
         */
        SET_LAYER_BLEND_MODE = 67108864 /* 0x400 << OPCODE_SHIFT */,
        SET_LAYER_COLOR = 67174400 /* 0x401 << OPCODE_SHIFT */,
        SET_LAYER_COMPOSITION_TYPE = 67239936 /* 0x402 << OPCODE_SHIFT */,
        SET_LAYER_DATASPACE = 67305472 /* 0x403 << OPCODE_SHIFT */,
        SET_LAYER_DISPLAY_FRAME = 67371008 /* 0x404 << OPCODE_SHIFT */,
        SET_LAYER_PLANE_ALPHA = 67436544 /* 0x405 << OPCODE_SHIFT */,
        SET_LAYER_SIDEBAND_STREAM = 67502080 /* 0x406 << OPCODE_SHIFT */,
        SET_LAYER_SOURCE_CROP = 67567616 /* 0x407 << OPCODE_SHIFT */,
        SET_LAYER_TRANSFORM = 67633152 /* 0x408 << OPCODE_SHIFT */,
        SET_LAYER_VISIBLE_REGION = 67698688 /* 0x409 << OPCODE_SHIFT */,
        SET_LAYER_Z_ORDER = 67764224 /* 0x40a << OPCODE_SHIFT */,
        SET_PRESENT_OR_VALIDATE_DISPLAY_RESULT = 67829760 /* 0x40b << OPCODE_SHIFT */,
        /**
         * SET_LAYER_PER_FRAME_METADATA has this pseudo prototype
         *
         *   setLayerPerFrameMetadata(Display display, Layer layer,
         *                            vec<PerFrameMetadata> data);
         *
         * Sets the PerFrameMetadata for the display. This metadata must be used
         * by the implementation to better tone map content to that display.
         *
         * This is a method that may be called every frame. Thus it's
         * implemented using buffered transport.
         * SET_LAYER_PER_FRAME_METADATA is the command used by the buffered transport
         * mechanism.
         */
        SET_LAYER_PER_FRAME_METADATA = 50528256 /* 0x303 << @2.1::IComposerClient.Command:OPCODE_SHIFT */,
        /**
         * SET_LAYER_COLOR has this pseudo prototype
         *
         *   setLayerColor(FloatColor color);
         *
         * Sets the color of the given layer. If the composition type of the layer
         * is not Composition::SOLID_COLOR, this call must succeed and have no
         * other effect.
         *
         * @param color is the new color using float type.
         */
        SET_LAYER_FLOAT_COLOR = 67895296 /* 0x40c << @2.1::IComposerClient.Command:OPCODE_SHIFT */,
        /**
         * SET_LAYER_COLOR_TRANSFORM has this pseudo prototype
         *
         *   setLayerColorTransform(float[16] matrix);
         *
         * This command has the following binary layout in bytes:
         *
         *     0 - 16 * 4: matrix
         *
         * Sets a matrix for color transform which will be applied on this layer
         * before composition.
         *
         * If the device is not capable of apply the matrix on this layer, it must force
         * this layer to client composition during VALIDATE_DISPLAY.
         *
         * The matrix provided is an affine color transformation of the following
         * form:
         *
         * |r.r r.g r.b 0|
         * |g.r g.g g.b 0|
         * |b.r b.g b.b 0|
         * |Tr  Tg  Tb  1|
         *
         * This matrix must be provided in row-major form:
         *
         * {r.r, r.g, r.b, 0, g.r, ...}.
         *
         * Given a matrix of this form and an input color [R_in, G_in, B_in],
         * the input color must first be converted to linear space
         * [R_linear, G_linear, B_linear], then the output linear color
         * [R_out_linear, G_out_linear, B_out_linear] will be:
         *
         * R_out_linear = R_linear * r.r + G_linear * g.r + B_linear * b.r + Tr
         * G_out_linear = R_linear * r.g + G_linear * g.g + B_linear * b.g + Tg
         * B_out_linear = R_linear * r.b + G_linear * g.b + B_linear * b.b + Tb
         *
         * [R_out_linear, G_out_linear, B_out_linear] must then be converted to
         * gamma space: [R_out, G_out, B_out] before blending.
         *
         * @param matrix is a 4x4 transform matrix (16 floats) as described above.
         */
        SET_LAYER_COLOR_TRANSFORM = 67960832 /* 0x40d << @2.1::IComposerClient.Command:OPCODE_SHIFT */,
        /*
         * SET_LAYER_PER_FRAME_METADATA_BLOBS has this pseudo prototype
         *
         *   setLayerPerFrameMetadataBlobs(Display display, Layer layer,
         *                                   vec<PerFrameMetadataBlob> metadata);
         *
         *   This command sends metadata that may be used for tone-mapping the
         *   associated layer.  The metadata structure follows a {key, blob}
         *   format (see the PerFrameMetadataBlob struct).  All keys must be
         *   returned by a prior call to getPerFrameMetadataKeys and must
         *   be part of the list of keys associated with blob-type metadata
         *   (see PerFrameMetadataKey).
         *
         *   This method may be called every frame.
         */
        SET_LAYER_PER_FRAME_METADATA_BLOBS = 50593792 /* 0x304 << @2.1::IComposerClient.Command:OPCODE_SHIFT */,
        /**
         * SET_CLIENT_TARGET_PROPERTY has this pseudo prototype
         *
         * This command has the following binary layout in bytes:
         *
         *     0 - 3: clientTargetProperty.pixelFormat
         *     4 - 7: clientTargetProperty.dataspace
         *
         *   setClientTargetProperty(ClientTargetProperty clientTargetProperty);
         */
        SET_CLIENT_TARGET_PROPERTY = 17104896 /* 0x105 << @2.1::IComposerClient.Command:OPCODE_SHIFT */,
        /**
         * SET_LAYER_GENERIC_METADATA has this pseudo prototype
         *
         *   setLayerGenericMetadata(string key, bool mandatory, vec<uint8_t> value);
         *
         * Sets a piece of generic metadata for the given layer. If this
         * function is called twice with the same key but different values, the
         * newer value must override the older one. Calling this function with a
         * 0-length value must reset that key's metadata as if it had not been
         * set.
         *
         * A given piece of metadata may either be mandatory or a hint
         * (non-mandatory) as indicated by the second parameter. Mandatory
         * metadata may affect the composition result, which is to say that it
         * may cause a visible change in the final image. By contrast, hints may
         * only affect the composition strategy, such as which layers are
         * composited by the client, but must not cause a visible change in the
         * final image. The value of the mandatory flag shall match the value
         * returned from getLayerGenericMetadataKeys for the given key.
         *
         * Only keys which have been returned from getLayerGenericMetadataKeys()
         * shall be accepted. Any other keys must result in an UNSUPPORTED error.
         *
         * The value passed into this function shall be the binary
         * representation of a HIDL type corresponding to the given key. For
         * example, a key of 'com.example.V1_3.Foo' shall be paired with a
         * value of type com.example@1.3::Foo, which would be defined in a
         * vendor HAL extension.
         *
         * This function will be encoded in the command buffer in this order:
         *   1) The key length, stored as a uint32_t
         *   2) The key itself, padded to a uint32_t boundary if necessary
         *   3) The mandatory flag, stored as a uint32_t
         *   4) The value length in bytes, stored as a uint32_t
         *   5) The value itself, padded to a uint32_t boundary if necessary
         *
         * @param key indicates which metadata value should be set on this layer
         * @param mandatory indicates whether this particular key represents
         *        mandatory metadata or a hint (non-mandatory metadata), as
         *        described above
         * @param value is a binary representation of a HIDL struct
         *        corresponding to the key as described above
         */
        SET_LAYER_GENERIC_METADATA = 68026368 /* 0x40e << @2.1::IComposerClient.Command:OPCODE_SHIFT */,
    };

    /**
     * Supersedes {@link @2.1::IComposerClient.DisplayType}.
     */
    enum class DisplayConnectionType : uint32_t {
        /**
         * Display is connected through internal port, e.g. DSI, eDP.
         */
        INTERNAL = 0u,
        /**
         * Display is connected through external port, e.g. HDMI, DisplayPort.
         */
        EXTERNAL = 1u,
    };

    enum class ContentType : uint32_t {
        NONE = 0u,
        /**
         * These modes correspond to those found in the HDMI 1.4 specification.
         */
        GRAPHICS = 1u,
        PHOTO = 2u,
        CINEMA = 3u,
        GAME = 4u,
    };

    /**
     * Constraints for changing vsync period.
     */
    struct VsyncPeriodChangeConstraints final {
        /**
         * Time in CLOCK_MONOTONIC after which the vsync period may change
         * (i.e., the vsync period must not change before this time).
         */
        int64_t desiredTimeNanos __attribute__ ((aligned(8)));
        /**
         * If true, requires that the vsync period change must happen seamlessly without
         * a noticeable visual artifact.
         */
        bool seamlessRequired __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::graphics::composer::V2_4::IComposerClient::VsyncPeriodChangeConstraints, desiredTimeNanos) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_4::IComposerClient::VsyncPeriodChangeConstraints, seamlessRequired) == 8, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::composer::V2_4::IComposerClient::VsyncPeriodChangeConstraints) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::composer::V2_4::IComposerClient::VsyncPeriodChangeConstraints) == 8, "wrong alignment");

    struct ClientTargetProperty final {
        ::android::hardware::graphics::common::V1_2::PixelFormat pixelFormat __attribute__ ((aligned(4)));
        ::android::hardware::graphics::common::V1_2::Dataspace dataspace __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::graphics::composer::V2_4::IComposerClient::ClientTargetProperty, pixelFormat) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_4::IComposerClient::ClientTargetProperty, dataspace) == 4, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::composer::V2_4::IComposerClient::ClientTargetProperty) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::composer::V2_4::IComposerClient::ClientTargetProperty) == 4, "wrong alignment");

    struct LayerGenericMetadataKey final {
        /**
         * Key names must comply with the requirements specified for
         * getLayerGenericMetadataKeys below
         */
        ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
        /**
         * The mandatory flag is defined in the description of
         * setLayerGenericMetadata above
         */
        bool mandatory __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::graphics::composer::V2_4::IComposerClient::LayerGenericMetadataKey, name) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_4::IComposerClient::LayerGenericMetadataKey, mandatory) == 16, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::composer::V2_4::IComposerClient::LayerGenericMetadataKey) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::composer::V2_4::IComposerClient::LayerGenericMetadataKey) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Provides a IComposerCallback object for the device to call.
     *
     * This function must be called only once.
     *
     * @param callback is the IComposerCallback object.
     */
    virtual ::android::hardware::Return<void> registerCallback(const ::android::sp<::android::hardware::graphics::composer::V2_1::IComposerCallback>& callback) = 0;

    /**
     * Returns the maximum number of virtual displays supported by this device
     * (which may be 0). The client must not attempt to create more than this
     * many virtual displays on this device. This number must not change for
     * the lifetime of the device.
     *
