{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIx",
   "name" : "long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIx",
   "size" : 8
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,

   "name" : "const Json::Value",
   "referenced_type" : "_ZTIN4Json5ValueE",
   "self_type" : "_ZTIKN4Json5ValueE",
   "size" : 24,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4Json6ReaderE",
   "name" : "const Json::Reader",
   "referenced_type" : "_ZTIN4Json6ReaderE",
   "self_type" : "_ZTIKN4Json6ReaderE",
   "size" : 100,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4Json8FeaturesE",
   "name" : "const Json::Features",
   "referenced_type" : "_ZTIN4Json8FeaturesE",
   "self_type" : "_ZTIKN4Json8FeaturesE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 12,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__114__map_iteratorINS_15__tree_iteratorINS_12__value_typeIN4Json5Value8CZStringES4_EEPNS_11__tree_nodeIS6_PvEEiEEEE",
   "name" : "const std::__map_iterator<std::__tree_iterator<std::__value_type<Json::Value::CZString, Json::Value>, std::__tree_node<std::__value_type<Json::Value::CZString, Json::Value>, void *> *, int>>",
   "referenced_type" : "_ZTINSt3__114__map_iteratorINS_15__tree_iteratorINS_12__value_typeIN4Json5Value8CZStringES4_EEPNS_11__tree_nodeIS6_PvEEiEEEE",
   "self_type" : "_ZTIKNSt3__114__map_iteratorINS_15__tree_iteratorINS_12__value_typeIN4Json5Value8CZStringES4_EEPNS_11__tree_nodeIS6_PvEEiEEEE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIPKN4Json12PathArgumentENS_9allocatorIS4_EEEE",
   "name" : "const std::vector<const Json::PathArgument *, std::allocator<const Json::PathArgument *>>",
   "referenced_type" : "_ZTINSt3__16vectorIPKN4Json12PathArgumentENS_9allocatorIS4_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIPKN4Json12PathArgumentENS_9allocatorIS4_EEEE",
   "size" : 12,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN4Json10CharReader7FactoryE",
   "name" : "Json::CharReader::Factory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json10CharReader7FactoryE",
   "self_type" : "_ZTIN4Json10CharReader7FactoryE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/reader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json10CharReader7FactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json10CharReader7FactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json10CharReader7FactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4Json10CharReader7Factory13newCharReaderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN4Json10CharReaderE",
   "name" : "Json::CharReader",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json10CharReaderE",
   "self_type" : "_ZTIN4Json10CharReaderE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/reader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json10CharReaderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json10CharReaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json10CharReaderD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4Json10CharReader5parseEPKcS2_PNS_5ValueEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4Json6WriterE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "document_",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "yamlCompatibilityEnabled_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "dropNullPlaceholders_",
     "field_offset" : 136,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "omitEndingLineFeed_",
     "field_offset" : 144,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4Json10FastWriterE",
   "name" : "Json::FastWriter",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json10FastWriterE",
   "self_type" : "_ZTIN4Json10FastWriterE",
   "size" : 20,
   "source_file" : "external/jsoncpp/include/json/writer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json10FastWriterE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json10FastWriterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json10FastWriterD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4Json10FastWriter5writeERKNS_5ValueE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "key_",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "index_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "kind_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4Json12PathArgument4KindE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json12PathArgumentE",
   "name" : "Json::PathArgument",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json12PathArgumentE",
   "self_type" : "_ZTIN4Json12PathArgumentE",
   "size" : 20,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "c_str_",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4Json12StaticStringE",
   "name" : "Json::StaticString",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json12StaticStringE",
   "self_type" : "_ZTIN4Json12StaticStringE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN4Json12StreamWriter7FactoryE",
   "name" : "Json::StreamWriter::Factory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json12StreamWriter7FactoryE",
   "self_type" : "_ZTIN4Json12StreamWriter7FactoryE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/writer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json12StreamWriter7FactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json12StreamWriter7FactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json12StreamWriter7FactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4Json12StreamWriter7Factory15newStreamWriterEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "sout_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json12StreamWriterE",
   "name" : "Json::StreamWriter",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json12StreamWriterE",
   "self_type" : "_ZTIN4Json12StreamWriterE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/writer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json12StreamWriterE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json12StreamWriterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json12StreamWriterD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4Json12StreamWriter5writeERKNS_5ValueEPNSt3__113basic_ostreamIcNS4_11char_traitsIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4Json6WriterE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "childValues_",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "document_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "indentString_",
     "field_offset" : 224,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "rightMargin_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "indentSize_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "addChildValues_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4Json12StyledWriterE",
   "name" : "Json::StyledWriter",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json12StyledWriterE",
   "self_type" : "_ZTIN4Json12StyledWriterE",
   "size" : 52,
   "source_file" : "external/jsoncpp/include/json/writer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json12StyledWriterE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json12StyledWriterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json12StyledWriterD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4Json12StyledWriter5writeERKNS_5ValueE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4Json17ValueIteratorBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json13ValueIteratorE",
   "name" : "Json::ValueIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json13ValueIteratorE",
   "self_type" : "_ZTIN4Json13ValueIteratorE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4Json10CharReader7FactoryE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "settings_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4Json5ValueE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json17CharReaderBuilderE",
   "name" : "Json::CharReaderBuilder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json17CharReaderBuilderE",
   "self_type" : "_ZTIN4Json17CharReaderBuilderE",
   "size" : 28,
   "source_file" : "external/jsoncpp/include/json/reader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json17CharReaderBuilderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json17CharReaderBuilderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json17CharReaderBuilderD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK4Json17CharReaderBuilder13newCharReaderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_",
     "referenced_type" : "_ZTINSt3__114__map_iteratorINS_15__tree_iteratorINS_12__value_typeIN4Json5Value8CZStringES4_EEPNS_11__tree_nodeIS6_PvEEiEEEE"
    },
    {
     "access" : "private",
     "field_name" : "isNull_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4Json17ValueIteratorBaseE",
   "name" : "Json::ValueIteratorBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json17ValueIteratorBaseE",
   "self_type" : "_ZTIN4Json17ValueIteratorBaseE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "childValues_",
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "document_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "indentString_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "rightMargin_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "indentation_",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "addChildValues_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "indented_",
     "field_offset" : 353,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4Json18StyledStreamWriterE",
   "name" : "Json::StyledStreamWriter",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json18StyledStreamWriterE",
   "self_type" : "_ZTIN4Json18StyledStreamWriterE",
   "size" : 48,
   "source_file" : "external/jsoncpp/include/json/writer.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4Json17ValueIteratorBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json18ValueConstIteratorE",
   "name" : "Json::ValueConstIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json18ValueConstIteratorE",
   "self_type" : "_ZTIN4Json18ValueConstIteratorE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4Json12StreamWriter7FactoryE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "settings_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4Json5ValueE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json19StreamWriterBuilderE",
   "name" : "Json::StreamWriterBuilder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json19StreamWriterBuilderE",
   "self_type" : "_ZTIN4Json19StreamWriterBuilderE",
   "size" : 28,
   "source_file" : "external/jsoncpp/include/json/writer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json19StreamWriterBuilderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json19StreamWriterBuilderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json19StreamWriterBuilderD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK4Json19StreamWriterBuilder15newStreamWriterEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "args_",
     "referenced_type" : "_ZTINSt3__16vectorIN4Json12PathArgumentENS_9allocatorIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json4PathE",
   "name" : "Json::Path",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json4PathE",
   "self_type" : "_ZTIN4Json4PathE",
   "size" : 12,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "int_",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "uint_",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "real_",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "bool_",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "string_",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "map_",
     "referenced_type" : "_ZTIPNSt3__13mapIN4Json5Value8CZStringES2_NS_4lessIS3_EENS_9allocatorINS_4pairIKS3_S2_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json5Value11ValueHolderE",
   "name" : "Json::Value::ValueHolder",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4Json5Value11ValueHolderE",
   "self_type" : "_ZTIN4Json5Value11ValueHolderE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "policy_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "length_",
     "field_offset" : 2,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4Json5Value8CZString13StringStorageE",
   "name" : "Json::Value::CZString::StringStorage",
   "referenced_type" : "_ZTIN4Json5Value8CZString13StringStorageE",
   "self_type" : "_ZTIN4Json5Value8CZString13StringStorageE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "cstr_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4Json5Value8CZStringUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN4Json5Value8CZStringE",
   "name" : "Json::Value::CZString",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json5Value8CZStringE",
   "self_type" : "_ZTIN4Json5Value8CZStringE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "storage_",
     "referenced_type" : "_ZTIN4Json5Value8CZString13StringStorageE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN4Json5Value8CZStringUt_E",
   "name" : "Json::Value::CZString::(anonymous union at external/jsoncpp/include/json/value.h:288:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4Json5Value8CZStringUt_E",
   "self_type" : "_ZTIN4Json5Value8CZStringUt_E",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "referenced_type" : "_ZTINSt3__110unique_ptrINS_5arrayINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELj3EEENS_14default_deleteIS8_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json5Value8CommentsE",
   "name" : "Json::Value::Comments",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json5Value8CommentsE",
   "self_type" : "_ZTIN4Json5Value8CommentsE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value_",
     "referenced_type" : "_ZTIN4Json5Value11ValueHolderE"
    },
    {
     "access" : "private",
     "field_name" : "bits_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4Json5ValueUt_E"
    },
    {
     "access" : "private",
     "field_name" : "comments_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4Json5Value8CommentsE"
    },
    {
     "access" : "private",
     "field_name" : "start_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "limit_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4Json5ValueE",
   "name" : "Json::Value",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json5ValueE",
   "self_type" : "_ZTIN4Json5ValueE",
   "size" : 24,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value_type_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "allocated_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN4Json5ValueUt_E",
   "name" : "Json::Value::(anonymous struct at external/jsoncpp/include/json/value.h:627:3)",
   "referenced_type" : "_ZTIN4Json5ValueUt_E",
   "self_type" : "_ZTIN4Json5ValueUt_E",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "offset_start",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "offset_limit",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "message",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json6Reader15StructuredErrorE",
   "name" : "Json::Reader::StructuredError",
   "referenced_type" : "_ZTIN4Json6Reader15StructuredErrorE",
   "self_type" : "_ZTIN4Json6Reader15StructuredErrorE",
   "size" : 20,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type_",
     "referenced_type" : "_ZTIN4Json6Reader9TokenTypeE"
    },
    {
     "field_name" : "start_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "end_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4Json6Reader5TokenE",
   "name" : "Json::Reader::Token",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json6Reader5TokenE",
   "self_type" : "_ZTIN4Json6Reader5TokenE",
   "size" : 12,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "token_",
     "referenced_type" : "_ZTIN4Json6Reader5TokenE"
    },
    {
     "field_name" : "message_",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "extra_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4Json6Reader9ErrorInfoE",
   "name" : "Json::Reader::ErrorInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json6Reader9ErrorInfoE",
   "self_type" : "_ZTIN4Json6Reader9ErrorInfoE",
   "size" : 28,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "nodes_",
     "referenced_type" : "_ZTINSt3__15stackIPN4Json5ValueENS_5dequeIS3_NS_9allocatorIS3_EEEEEE"
    },
    {
     "access" : "private",
     "field_name" : "errors_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__15dequeIN4Json6Reader9ErrorInfoENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "document_",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "begin_",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "end_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "current_",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "lastValueEnd_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "lastValue_",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPN4Json5ValueE"
    },
    {
     "access" : "private",
     "field_name" : "commentsBefore_",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "features_",
     "field_offset" : 736,
     "referenced_type" : "_ZTIN4Json8FeaturesE"
    },
    {
     "access" : "private",
     "field_name" : "collectComments_",
     "field_offset" : 768,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4Json6ReaderE",
   "name" : "Json::Reader",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json6ReaderE",
   "self_type" : "_ZTIN4Json6ReaderE",
   "size" : 100,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN4Json6WriterE",
   "name" : "Json::Writer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json6WriterE",
   "self_type" : "_ZTIN4Json6WriterE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/writer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json6WriterE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json6WriterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json6WriterD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4Json6Writer5writeERKNS_5ValueE"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "allowComments_",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "strictRoot_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "allowDroppedNullPlaceholders_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "allowNumericKeys_",
     "field_offset" : 24,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4Json8FeaturesE",
   "name" : "Json::Features",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json8FeaturesE",
   "self_type" : "_ZTIN4Json8FeaturesE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/json_features.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION4Json5Value8CZStringE",
   "name" : "Json::Value::CZString &&",
   "referenced_type" : "_ZTIN4Json5Value8CZStringE",
   "self_type" : "_ZTION4Json5Value8CZStringE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION4Json5Value8CommentsE",
   "name" : "Json::Value::Comments &&",
   "referenced_type" : "_ZTIN4Json5Value8CommentsE",
   "self_type" : "_ZTION4Json5Value8CommentsE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION4Json5ValueE",
   "name" : "Json::Value &&",
   "referenced_type" : "_ZTIN4Json5ValueE",
   "self_type" : "_ZTION4Json5ValueE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  }
 ]
}
