#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUTOMOTIVE_CAN_V1_0_ICANCONTROLLER_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUTOMOTIVE_CAN_V1_0_ICANCONTROLLER_H

#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace automotive {
namespace can {
namespace V1_0 {

/**
 * Represents a CAN controller that's capable of configuring CAN bus interfaces.
 *
 * The goal of this service is to configure CAN interfaces and bring up HIDL
 * server instances of ICanBus for each one that's up.
 *
 * Providing an ICanController interface to configure CAN buses is optional.
 * A system can elect to publish only ICanBus if the hardware is hardcoded
 * for a specific application.
 */
struct ICanController : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.automotive.can@1.0::ICanController"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class InterfaceType : uint8_t;
    enum class Result : uint8_t;
    struct BusConfig;

    /**
     * Type of an interface, an equivalent to BusConfig::InterfaceId
     * union discriminator. Defines a number of specific standard hardware
     * families and a generic catch-all type of {@see INDEXED}.
     */
    enum class InterfaceType : uint8_t {
        /**
         * Virtual SocketCAN interface.
         */
        VIRTUAL = 0,
        /**
         * Native SocketCAN interface.
         */
        SOCKETCAN = 1 /* ::android::hardware::automotive::can::V1_0::ICanController::InterfaceType.VIRTUAL implicitly + 1 */,
        /**
         * Serial line CAN interface.
         */
        SLCAN = 2 /* ::android::hardware::automotive::can::V1_0::ICanController::InterfaceType.SOCKETCAN implicitly + 1 */,
        /**
         * Proprietary, device-specific interface.
         */
        INDEXED = 3 /* ::android::hardware::automotive::can::V1_0::ICanController::InterfaceType.SLCAN implicitly + 1 */,
    };

    enum class Result : uint8_t {
        OK = 0,
        /**
         * General error class, if others are not applicable.
         */
        UNKNOWN_ERROR = 1 /* ::android::hardware::automotive::can::V1_0::ICanController::Result.OK implicitly + 1 */,
        /**
         * Up request was called out of order (i.e. trying to up the
         * interface twice).
         */
        INVALID_STATE = 2 /* ::android::hardware::automotive::can::V1_0::ICanController::Result.UNKNOWN_ERROR implicitly + 1 */,
        /**
         * Interface type is not supported.
         */
        NOT_SUPPORTED = 3 /* ::android::hardware::automotive::can::V1_0::ICanController::Result.INVALID_STATE implicitly + 1 */,
        /**
         * Provided interface ID (index, name, device path) doesn't exist or
         * there is no device with a given serial number.
         */
        BAD_INTERFACE_ID = 4 /* ::android::hardware::automotive::can::V1_0::ICanController::Result.NOT_SUPPORTED implicitly + 1 */,
        /**
         * Provided bit rate is not supported by the hardware.
         */
        BAD_BITRATE = 5 /* ::android::hardware::automotive::can::V1_0::ICanController::Result.BAD_INTERFACE_ID implicitly + 1 */,
        /**
         * Provided service name ({@see BusConfig#name}) either has invalid
         * format or is not listed in device manifest file.
         */
        BAD_SERVICE_NAME = 6 /* ::android::hardware::automotive::can::V1_0::ICanController::Result.BAD_BITRATE implicitly + 1 */,
    };

    /**
     * Configuration of the (physical or virtual) CAN bus.
     *
     * ISO TP and CAN FD are currently not supported.
     */
    struct BusConfig final {
        // Forward declaration for forward reference support:
        struct InterfaceId;

        struct InterfaceId final {
            // Forward declaration for forward reference support:
            struct Virtual;
            struct Socketcan;
            struct Slcan;
            struct Indexed;

            struct Virtual final {
                /**
                 * Interface name, such as vcan0. If the interface doesn't
                 * exist, HAL server must create it.
                 */
                ::android::hardware::hidl_string ifname __attribute__ ((aligned(8)));
            };

            static_assert(offsetof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Virtual, ifname) == 0, "wrong offset");
            static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Virtual) == 16, "wrong size");
            static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Virtual) == 8, "wrong alignment");

            struct Socketcan final {
                enum class hidl_discriminator : uint8_t {
                    /**
                     * Interface name, such as can0.
                     */
                    ifname = 0,  // ::android::hardware::hidl_string
                    /**
                     * Alternatively to providing {@see ifname}, one may provide a
                     * list of interface serial number suffixes. If there happens to
                     * be a device (like USB2CAN) with a matching serial number
                     * suffix, the HAL service will have to select it.
                     *
                     * Client may utilize this in two ways: by matching against the
                     * entire serial number, or the last few characters (usually
                     * one). The former is better for small-scale test deployments
                     * (with just a handful of vehicles), the latter is good for
                     * larger scale (where a small suffix list may support large
                     * test fleet).
                     */
                    serialno = 1,  // ::android::hardware::hidl_vec<::android::hardware::hidl_string>
                };

                Socketcan();
                ~Socketcan();
                Socketcan(Socketcan&&);
                Socketcan(const Socketcan&);
                Socketcan& operator=(Socketcan&&);
                Socketcan& operator=(const Socketcan&);

                void ifname(const ::android::hardware::hidl_string&);
                void ifname(::android::hardware::hidl_string&&);
                ::android::hardware::hidl_string& ifname();
                const ::android::hardware::hidl_string& ifname() const;

                void serialno(const ::android::hardware::hidl_vec<::android::hardware::hidl_string>&);
                void serialno(::android::hardware::hidl_vec<::android::hardware::hidl_string>&&);
                ::android::hardware::hidl_vec<::android::hardware::hidl_string>& serialno();
                const ::android::hardware::hidl_vec<::android::hardware::hidl_string>& serialno() const;

                // Utility methods
                hidl_discriminator getDiscriminator() const;

                constexpr size_t hidl_getUnionOffset() const {
                    return offsetof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan, hidl_u);
                }

            private:
                void hidl_destructUnion();

                hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
                union hidl_union final {
                    ::android::hardware::hidl_string ifname __attribute__ ((aligned(8)));
                    ::android::hardware::hidl_vec<::android::hardware::hidl_string> serialno __attribute__ ((aligned(8)));

                    hidl_union();
                    ~hidl_union();
                } hidl_u;

                static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan::hidl_union) == 16, "wrong size");
                static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan::hidl_union) == 8, "wrong alignment");
                static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan::hidl_discriminator) == 1, "wrong size");
                static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan::hidl_discriminator) == 1, "wrong alignment");
            };

            static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan) == 24, "wrong size");
            static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan) == 8, "wrong alignment");

            struct Slcan final {
                enum class hidl_discriminator : uint8_t {
                    /**
                     * Path to a device, such as /dev/ttyUSB0.
                     */
                    ttyname = 0,  // ::android::hardware::hidl_string
                    /**
                     * List of interface serial number suffixes.
                     * {@see Socketcan::serialno}
                     */
                    serialno = 1,  // ::android::hardware::hidl_vec<::android::hardware::hidl_string>
                };

                Slcan();
                ~Slcan();
                Slcan(Slcan&&);
                Slcan(const Slcan&);
                Slcan& operator=(Slcan&&);
                Slcan& operator=(const Slcan&);

                void ttyname(const ::android::hardware::hidl_string&);
                void ttyname(::android::hardware::hidl_string&&);
                ::android::hardware::hidl_string& ttyname();
                const ::android::hardware::hidl_string& ttyname() const;

                void serialno(const ::android::hardware::hidl_vec<::android::hardware::hidl_string>&);
                void serialno(::android::hardware::hidl_vec<::android::hardware::hidl_string>&&);
                ::android::hardware::hidl_vec<::android::hardware::hidl_string>& serialno();
                const ::android::hardware::hidl_vec<::android::hardware::hidl_string>& serialno() const;

                // Utility methods
                hidl_discriminator getDiscriminator() const;

                constexpr size_t hidl_getUnionOffset() const {
                    return offsetof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan, hidl_u);
                }

            private:
                void hidl_destructUnion();

                hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
                union hidl_union final {
                    ::android::hardware::hidl_string ttyname __attribute__ ((aligned(8)));
                    ::android::hardware::hidl_vec<::android::hardware::hidl_string> serialno __attribute__ ((aligned(8)));

                    hidl_union();
                    ~hidl_union();
                } hidl_u;

                static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan::hidl_union) == 16, "wrong size");
                static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan::hidl_union) == 8, "wrong alignment");
                static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan::hidl_discriminator) == 1, "wrong size");
                static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan::hidl_discriminator) == 1, "wrong alignment");
            };

            static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan) == 24, "wrong size");
            static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan) == 8, "wrong alignment");

            struct Indexed final {
                /**
                 * Interface number, 0-based.
                 */
                uint8_t index __attribute__ ((aligned(1)));
            };

            static_assert(offsetof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Indexed, index) == 0, "wrong offset");
            static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Indexed) == 1, "wrong size");
            static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Indexed) == 1, "wrong alignment");

            enum class hidl_discriminator : uint8_t {
                /**
                 * Virtual SocketCAN interface.
                 */
                virtualif = 0,  // ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Virtual
                /**
                 * Native SocketCAN interface.
                 */
                socketcan = 1,  // ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan
                /**
                 * Serial line CAN interface.
                 */
                slcan = 2,  // ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan
                /**
                 * Proprietary, device-specific interface.
                 *
                 * Non-SocketCAN interfaces should use this variant.
                 */
                indexed = 3,  // ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Indexed
            };

            InterfaceId();
            ~InterfaceId();
            InterfaceId(InterfaceId&&);
            InterfaceId(const InterfaceId&);
            InterfaceId& operator=(InterfaceId&&);
            InterfaceId& operator=(const InterfaceId&);

            void virtualif(const ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Virtual&);
            void virtualif(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Virtual&&);
            ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Virtual& virtualif();
            const ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Virtual& virtualif() const;

            void socketcan(const ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan&);
            void socketcan(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan&&);
            ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan& socketcan();
            const ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan& socketcan() const;

            void slcan(const ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan&);
            void slcan(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan&&);
            ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan& slcan();
            const ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan& slcan() const;

            void indexed(const ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Indexed&);
            void indexed(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Indexed&&);
            ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Indexed& indexed();
            const ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Indexed& indexed() const;

            // Utility methods
            hidl_discriminator getDiscriminator() const;

            constexpr size_t hidl_getUnionOffset() const {
                return offsetof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId, hidl_u);
            }

        private:
            void hidl_destructUnion();

            hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
            union hidl_union final {
                ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Virtual virtualif __attribute__ ((aligned(8)));
                ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Socketcan socketcan __attribute__ ((aligned(8)));
                ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Slcan slcan __attribute__ ((aligned(8)));
                ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::Indexed indexed __attribute__ ((aligned(1)));

                hidl_union();
                ~hidl_union();
            } hidl_u;

            static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::hidl_union) == 24, "wrong size");
            static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::hidl_union) == 8, "wrong alignment");
            static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::hidl_discriminator) == 1, "wrong size");
            static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId::hidl_discriminator) == 1, "wrong alignment");
        };

        static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId) == 32, "wrong size");
        static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId) == 8, "wrong alignment");

        /**
         * Name under which ICanBus HIDL service should be published.
         *
         * It must consist of only alphanumeric characters and underscore
         * (a-z, A-Z, 0-9, '_'), at least 1 and at most 32 characters long.
         *
         * This field is *not* meant to distinguish between hardware interfaces
         * nor preselect parameters like bitrate. The only intended side-effect
         * of changing it should be a different ICanBus HIDL service name and
         * the HIDL service should make no assumptions on its contents.
         */
        ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
        /**
         * Hardware interface configuration.
         *
         * This union's discriminator has an equivalent enum
         * {@see InterfaceType} to express compatibility via
         * getSupportedInterfaceTypes().
         */
        ::android::hardware::automotive::can::V1_0::ICanController::BusConfig::InterfaceId interfaceId __attribute__ ((aligned(8)));
        /**
         * Bit rate for CAN communication.
         *
         * Typical bit rates are: 100000, 125000, 250000, 500000.
         *
         * For {@see interfaceId#virtual} and pre-configured
         * {@see interfaceId#indexed} interfaces this value is ignored.
         */
        uint32_t bitrate __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig, name) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig, interfaceId) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig, bitrate) == 48, "wrong offset");
    static_assert(sizeof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig) == 56, "wrong size");
    static_assert(__alignof(::android::hardware::automotive::can::V1_0::ICanController::BusConfig) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Return callback for getSupportedInterfaceTypes
     */
    using getSupportedInterfaceTypes_cb = std::function<void(const ::android::hardware::hidl_vec<::android::hardware::automotive::can::V1_0::ICanController::InterfaceType>& iftypes)>;
    /**
     * Fetches the list of interface types supported by this HAL server.
     *
     * @return iftypes The list of supported interface types.
     */
    virtual ::android::hardware::Return<void> getSupportedInterfaceTypes(getSupportedInterfaceTypes_cb _hidl_cb) = 0;

    /**
     * Bring up the CAN interface and publish ICanBus server instance.
     *
     * @param config Configuration of the CAN interface.
