#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUTOMOTIVE_CAN_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUTOMOTIVE_CAN_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace automotive {
namespace can {
namespace V1_0 {

// Forward declaration for forward reference support:
struct CanMessage;
enum class FilterFlag : uint8_t;
struct CanMessageFilter;
enum class Result : uint8_t;
enum class ErrorEvent : uint8_t;

// Order of inner types was changed for forward reference support.

/**
 * CAN message ID.
 *
 * Does not include any flags like RTR nor ERR, only a plain 11-bit
 * or 29-bit identifier, as defined in CAN 1.x/2.0x.
 *
 * Unused bits must be set to zero.
 */
typedef uint32_t CanMessageId;

/**
 * CAN message being sent or received.
 */
struct CanMessage final {
    uint32_t id __attribute__ ((aligned(4)));
    /**
     * CAN message payload, as defined in CAN 1.x and CAN 2.x standards.
     *
     * The length of the payload vector directly translates to the length
     * of the data frame (i.e. includes any padding bytes), so it may be in
     * a range of:
     *  - 0-8 bytes for standard CAN;
     *  - up to 64 bytes for CAN FD.
     * ISO TP is not supported directly for now.
     */
    ::android::hardware::hidl_vec<uint8_t> payload __attribute__ ((aligned(8)));
    /**
     * Time in nanoseconds since boot.
     *
     * Ignored for outgoing messages.
     */
    uint64_t timestamp __attribute__ ((aligned(8)));
    /**
     * A request to proactively pull certain data from other ECU in CAN network.
     *
     * For details please refer to CAN standard.
     *
     * If this flag is set, payload must be empty.
     */
    bool remoteTransmissionRequest __attribute__ ((aligned(1)));
    /**
     * Flag indicating if the message has an extended ID.
     *
     * Extended ID's are 29 bits long, as opposed to the standard 11 bit ID.
     * It can not simply be inferred from the length of the ID itself, as the
     * message ID 0x00000123 !=  message ID 0x123.
     */
    bool isExtendedId __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::automotive::can::V1_0::CanMessage, id) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::can::V1_0::CanMessage, payload) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::can::V1_0::CanMessage, timestamp) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::can::V1_0::CanMessage, remoteTransmissionRequest) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::can::V1_0::CanMessage, isExtendedId) == 33, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::can::V1_0::CanMessage) == 40, "wrong size");
static_assert(__alignof(::android::hardware::automotive::can::V1_0::CanMessage) == 8, "wrong alignment");

/**
 * Types of filter that can be applied to a CanMessageFilter
 */
enum class FilterFlag : uint8_t {
    /**
     * Default, FilterFlag doesn't effect what messages filtered
     */
    DONT_CARE = 0,
    /**
     * This FilterFlag MUST be present in received messages to pass though the filter
     */
    SET = 1 /* ::android::hardware::automotive::can::V1_0::FilterFlag.DONT_CARE implicitly + 1 */,
    /**
     * This FilterFlag must NOT be present in received messages to pass though the filter
     */
    NOT_SET = 2 /* ::android::hardware::automotive::can::V1_0::FilterFlag.SET implicitly + 1 */,
};

/**
 * Single filter rule for CAN messages.
 *
 * A filter is satisfied if:
 * ((receivedId & mask) == (id & mask)) == !exclude
 *
 * In order for set of filters to match, at least one non-exclude filters must match (if there is
 * one) and all exclude filters must match. In other words:
 *  - a single matching non-exclude filter makes the whole set matching;
 *  - a single non-matching excluded filter makes the whole set non-matching.
 */
struct CanMessageFilter final {
    uint32_t id __attribute__ ((aligned(4)));
    uint32_t mask __attribute__ ((aligned(4)));
    /**
     * Remote Transmission Request; another ECU requests <DLC> bytes of data on this message ID
     */
    ::android::hardware::automotive::can::V1_0::FilterFlag rtr __attribute__ ((aligned(1)));
    /**
     * 29 bit message ID is used instead of 11 bits
     */
    ::android::hardware::automotive::can::V1_0::FilterFlag extendedFormat __attribute__ ((aligned(1)));
    /**
     * 'exclude' *DOES* apply to rtr and extendedFormat!
     */
    bool exclude __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::automotive::can::V1_0::CanMessageFilter, id) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::can::V1_0::CanMessageFilter, mask) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::can::V1_0::CanMessageFilter, rtr) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::can::V1_0::CanMessageFilter, extendedFormat) == 9, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::can::V1_0::CanMessageFilter, exclude) == 10, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::can::V1_0::CanMessageFilter) == 12, "wrong size");
static_assert(__alignof(::android::hardware::automotive::can::V1_0::CanMessageFilter) == 4, "wrong alignment");

enum class Result : uint8_t {
    OK = 0,
    UNKNOWN_ERROR = 1 /* ::android::hardware::automotive::can::V1_0::Result.OK implicitly + 1 */,
    PAYLOAD_TOO_LONG = 2 /* ::android::hardware::automotive::can::V1_0::Result.UNKNOWN_ERROR implicitly + 1 */,
    INTERFACE_DOWN = 3 /* ::android::hardware::automotive::can::V1_0::Result.PAYLOAD_TOO_LONG implicitly + 1 */,
    TRANSMISSION_FAILURE = 4 /* ::android::hardware::automotive::can::V1_0::Result.INTERFACE_DOWN implicitly + 1 */,
    INVALID_ARGUMENTS = 5 /* ::android::hardware::automotive::can::V1_0::Result.TRANSMISSION_FAILURE implicitly + 1 */,
};

/**
 * @see ICanMessageListener#onError
 */
enum class ErrorEvent : uint8_t {
    UNKNOWN_ERROR = 0,
    /**
     * A problem with CAN interface HW.
     */
    HARDWARE_ERROR = 1 /* ::android::hardware::automotive::can::V1_0::ErrorEvent.UNKNOWN_ERROR implicitly + 1 */,
    /**
