{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA0_c",
   "name" : "char [0]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA0_c",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],

   "alignment" : 8,
   "linker_set_key" : "_ZTIPN7android10properties20PropertyInfoAreaFileE",
   "name" : "android::properties::PropertyInfoAreaFile *",
   "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "self_type" : "_ZTIPN7android10properties20PropertyInfoAreaFileE",
   "size" : 8,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN7android10properties8TrieNodeE",
   "name" : "android::properties::TrieNode *",
   "referenced_type" : "_ZTIN7android10properties8TrieNodeE",
   "self_type" : "_ZTIPN7android10properties8TrieNodeE",
   "size" : 8,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKc",
   "name" : "const char **",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIPPKc",
   "size" : 8,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 8,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIA0_Kc",
   "name" : "char const[0]",
   "referenced_type" : "_ZTIA0_c",
   "self_type" : "_ZTIA0_Kc",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties13PropertyEntryE",
   "name" : "const android::properties::PropertyEntry",
   "referenced_type" : "_ZTIN7android10properties13PropertyEntryE",
   "self_type" : "_ZTIKN7android10properties13PropertyEntryE",
   "size" : 16,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties14SerializedDataE",
   "name" : "const android::properties::SerializedData",
   "referenced_type" : "_ZTIN7android10properties14SerializedDataE",
   "self_type" : "_ZTIKN7android10properties14SerializedDataE",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties16PropertyInfoAreaE",
   "name" : "const android::properties::PropertyInfoArea",
   "referenced_type" : "_ZTIN7android10properties16PropertyInfoAreaE",
   "self_type" : "_ZTIKN7android10properties16PropertyInfoAreaE",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties16TrieNodeInternalE",
   "name" : "const android::properties::TrieNodeInternal",
   "referenced_type" : "_ZTIN7android10properties16TrieNodeInternalE",
   "self_type" : "_ZTIKN7android10properties16TrieNodeInternalE",
   "size" : 28,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties20PropertyInfoAreaFileE",
   "name" : "const android::properties::PropertyInfoAreaFile",
   "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "self_type" : "_ZTIKN7android10properties20PropertyInfoAreaFileE",
   "size" : 16,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties22PropertyInfoAreaHeaderE",
   "name" : "const android::properties::PropertyInfoAreaHeader",
   "referenced_type" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "self_type" : "_ZTIKN7android10properties22PropertyInfoAreaHeaderE",
   "size" : 24,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties8TrieNodeE",
   "name" : "const android::properties::TrieNode",
   "referenced_type" : "_ZTIN7android10properties8TrieNodeE",
   "self_type" : "_ZTIKN7android10properties8TrieNodeE",
   "size" : 16,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name_offset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "namelen",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "context_index",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type_index",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties13PropertyEntryE",
   "name" : "android::properties::PropertyEntry",
   "referenced_type" : "_ZTIN7android10properties13PropertyEntryE",
   "self_type" : "_ZTIN7android10properties13PropertyEntryE",
   "size" : 16,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_base_",
     "referenced_type" : "_ZTIA0_Kc"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties14SerializedDataE",
   "name" : "android::properties::SerializedData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties14SerializedDataE",
   "self_type" : "_ZTIN7android10properties14SerializedDataE",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10properties14SerializedDataE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties16PropertyInfoAreaE",
   "name" : "android::properties::PropertyInfoArea",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties16PropertyInfoAreaE",
   "self_type" : "_ZTIN7android10properties16PropertyInfoAreaE",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "property_entry",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_child_nodes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "child_nodes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_prefixes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "prefix_entries",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_exact_matches",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exact_match_entries",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties16TrieNodeInternalE",
   "name" : "android::properties::TrieNodeInternal",
   "referenced_type" : "_ZTIN7android10properties16TrieNodeInternalE",
   "self_type" : "_ZTIN7android10properties16TrieNodeInternalE",
   "size" : 28,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mmap_base_",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mmap_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "name" : "android::properties::PropertyInfoAreaFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "self_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "size" : 16,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "current_version",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minimum_supported_version",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "contexts_offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "types_offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "root_offset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "name" : "android::properties::PropertyInfoAreaHeader",
   "referenced_type" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "self_type" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "size" : 24,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "serialized_data_",
     "referenced_type" : "_ZTIPKN7android10properties14SerializedDataE"
    },
    {
     "access" : "private",
     "field_name" : "trie_node_base_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKN7android10properties16TrieNodeInternalE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties8TrieNodeE",
   "name" : "android::properties::TrieNode",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties8TrieNodeE",
   "self_type" : "_ZTIN7android10properties8TrieNodeE",
   "size" : 16,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android10properties20PropertyInfoAreaFileE",
   "name" : "android::properties::PropertyInfoAreaFile &&",
   "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "self_type" : "_ZTION7android10properties20PropertyInfoAreaFileE",
   "size" : 8,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  }
 ]
}
