{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA128_m",
   "name" : "unsigned long [128]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA128_m",
   "size" : 512,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA13_i",
   "name" : "int [13]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA13_i",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA18_m",
   "name" : "unsigned long [18]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA18_m",
   "size" : 72,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_i",
   "name" : "int [1]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA1_i",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_m",
   "name" : "unsigned long [1]",

   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "bionic/libc/include/signal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "external/skia/include/private/SkFloatingPoint.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/skia/include/private/SkFloatingPoint.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/skia/include/core/SkData.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "external/skia/include/core/SkTypes.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/libcxx/include/wchar.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkTypes.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTIVNSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_jPKvE",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvS_jPKvE",
   "self_type" : "_ZTIVPFPvS_jPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjPKvE",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjPKvE",
   "self_type" : "_ZTIVPFPvjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjjPKvE",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjjPKvE",
   "self_type" : "_ZTIVPFPvjjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fRefCnt",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTI10SkNVRefCntI6SkDataE",
   "name" : "SkNVRefCnt<SkData>",
   "record_kind" : "class",
   "referenced_type" : "_ZTI10SkNVRefCntI6SkDataE",
   "self_type" : "_ZTI10SkNVRefCntI6SkDataE",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "template_args" : [ "_ZTI6SkData" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cgroup",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "referenced_type" : "_ZTI10clone_args",
   "self_type" : "_ZTI10clone_args",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 84,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA2_m"
    }
   ],
   "linker_set_key" : "_ZTI10sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "_ZTI10sigset64_t",
   "self_type" : "_ZTI10sigset64_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "referenced_type" : "_ZTI11sched_param",
   "self_type" : "_ZTI11sched_param",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA8_N11user_fpregs6fp_regE"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "_ZTI11user_fpregs",
   "self_type" : "_ZTI11user_fpregs",
   "size" : 116,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI13SkStreamAsset"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fFILE",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__110shared_ptrI7__sFILEEE"
    },
    {
     "access" : "private",
     "field_name" : "fEnd",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "fStart",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "fCurrent",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12SkFILEStream",
   "name" : "SkFILEStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12SkFILEStream",
   "self_type" : "_ZTI12SkFILEStream",
   "size" : 24,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI12SkFILEStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12SkFILEStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12SkFILEStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN12SkFILEStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "mangled_component_name" : "_ZNK12SkFILEStream7isAtEndEv"
    },
    {
     "mangled_component_name" : "_ZN12SkFILEStream6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK16SkStreamSeekable11hasPositionEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkFILEStream11getPositionEv"
    },
    {
     "mangled_component_name" : "_ZN12SkFILEStream4seekEj"
    },
    {
     "mangled_component_name" : "_ZN12SkFILEStream4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK13SkStreamAsset9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkFILEStream9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkFILEStream11onDuplicateEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkFILEStream6onForkEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fRefCnt",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTI12SkRefCntBase",
   "name" : "SkRefCntBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12SkRefCntBase",
   "self_type" : "_ZTI12SkRefCntBase",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI12SkRefCntBase"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "_ZTI12user_vfp_exc",
   "self_type" : "_ZTI12user_vfp_exc",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI9SkWStream"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fFILE",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7__sFILE"
    }
   ],
   "linker_set_key" : "_ZTI13SkFILEWStream",
   "name" : "SkFILEWStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13SkFILEWStream",
   "self_type" : "_ZTI13SkFILEWStream",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI13SkFILEWStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN13SkFILEWStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN13SkFILEWStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN13SkFILEWStream5writeEPKvj"
    },
    {
     "mangled_component_name" : "_ZN13SkFILEWStream5flushEv"
    },
    {
     "mangled_component_name" : "_ZNK13SkFILEWStream12bytesWrittenEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI9SkWStream"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fBytesWritten",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13SkNullWStream",
   "name" : "SkNullWStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13SkNullWStream",
   "self_type" : "_ZTI13SkNullWStream",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI13SkNullWStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN13SkNullWStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN13SkNullWStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN13SkNullWStream5writeEPKvj"
    },
    {
     "mangled_component_name" : "_ZN13SkNullWStream5flushEv"
    },
    {
     "mangled_component_name" : "_ZNK13SkNullWStream12bytesWrittenEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI16SkStreamSeekable"
    }
   ],
   "linker_set_key" : "_ZTI13SkStreamAsset",
   "name" : "SkStreamAsset",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13SkStreamAsset",
   "self_type" : "_ZTI13SkStreamAsset",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI13SkStreamAsset"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN13SkStreamAssetD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN13SkStreamAssetD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8SkStream7isAtEndEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18SkStreamRewindable6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK16SkStreamSeekable11hasPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16SkStreamSeekable11getPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4seekEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK13SkStreamAsset9hasLengthEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK13SkStreamAsset9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream13getMemoryBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK13SkStreamAsset11onDuplicateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK13SkStreamAsset6onForkEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI14SkStreamMemory"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fData",
     "field_offset" : 32,
     "referenced_type" : "_ZTI5sk_spI6SkDataE"
    },
    {
     "access" : "private",
     "field_name" : "fOffset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14SkMemoryStream",
   "name" : "SkMemoryStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTI14SkMemoryStream",
   "self_type" : "_ZTI14SkMemoryStream",
   "size" : 12,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI14SkMemoryStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN14SkMemoryStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN14SkMemoryStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream4peekEPvj"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream7isAtEndEv"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK16SkStreamSeekable11hasPositionEv"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream11getPositionEv"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream4seekEj"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK13SkStreamAsset9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream11onDuplicateEv"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream6onForkEv"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream9setMemoryEPKvjb"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI13SkStreamAsset"
    }
   ],
   "linker_set_key" : "_ZTI14SkStreamMemory",
   "name" : "SkStreamMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTI14SkStreamMemory",
   "self_type" : "_ZTI14SkStreamMemory",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI14SkStreamMemory"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN14SkStreamMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN14SkStreamMemoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8SkStream7isAtEndEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18SkStreamRewindable6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK16SkStreamSeekable11hasPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16SkStreamSeekable11getPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4seekEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK13SkStreamAsset9hasLengthEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK13SkStreamAsset9getLengthEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN14SkStreamMemory13getMemoryBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK14SkStreamMemory11onDuplicateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK14SkStreamMemory6onForkEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 24,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fFloat",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fSignBitInt",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI15SkFloatIntUnion",
   "name" : "SkFloatIntUnion",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15SkFloatIntUnion",
   "self_type" : "_ZTI15SkFloatIntUnion",
   "size" : 4,
   "source_file" : "external/skia/include/private/SkFloatBits.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI18SkStreamRewindable"
    }
   ],
   "linker_set_key" : "_ZTI16SkStreamSeekable",
   "name" : "SkStreamSeekable",
   "record_kind" : "class",
   "referenced_type" : "_ZTI16SkStreamSeekable",
   "self_type" : "_ZTI16SkStreamSeekable",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16SkStreamSeekable"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16SkStreamSeekableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16SkStreamSeekableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8SkStream7isAtEndEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18SkStreamRewindable6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK16SkStreamSeekable11hasPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16SkStreamSeekable11getPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4seekEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream13getMemoryBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16SkStreamSeekable11onDuplicateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16SkStreamSeekable6onForkEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA8_i"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8SkStream"
    }
   ],
   "linker_set_key" : "_ZTI18SkStreamRewindable",
   "name" : "SkStreamRewindable",
   "record_kind" : "class",
   "referenced_type" : "_ZTI18SkStreamRewindable",
   "self_type" : "_ZTI18SkStreamRewindable",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI18SkStreamRewindable"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN18SkStreamRewindableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN18SkStreamRewindableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8SkStream7isAtEndEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18SkStreamRewindable6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream11hasPositionEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream11getPositionEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream4seekEj"
    },
    {
     "mangled_component_name" : "_ZN8SkStream4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream13getMemoryBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK18SkStreamRewindable11onDuplicateEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream6onForkEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI18SkStreamRewindable"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAAsset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP6AAsset"
    }
   ],
   "linker_set_key" : "_ZTI19AAssetStreamAdaptor",
   "name" : "AAssetStreamAdaptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTI19AAssetStreamAdaptor",
   "self_type" : "_ZTI19AAssetStreamAdaptor",
   "size" : 8,
   "source_file" : "frameworks/base/native/graphics/jni/aassetstreamadaptor.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI19AAssetStreamAdaptor"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN19AAssetStreamAdaptorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN19AAssetStreamAdaptorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN19AAssetStreamAdaptor4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor7isAtEndEv"
    },
    {
     "mangled_component_name" : "_ZN19AAssetStreamAdaptor6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor11hasPositionEv"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor11getPositionEv"
    },
    {
     "mangled_component_name" : "_ZN19AAssetStreamAdaptor4seekEj"
    },
    {
     "mangled_component_name" : "_ZN19AAssetStreamAdaptor4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN19AAssetStreamAdaptor13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor11onDuplicateEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream6onForkEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "_ZTI19__pthread_cleanup_t",
   "self_type" : "_ZTI19__pthread_cleanup_t",
   "size" : 12,
   "source_file" : "bionic/libc/include/pthread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "system/logging/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI9SkWStream"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fHead",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN22SkDynamicMemoryWStream5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "fTail",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN22SkDynamicMemoryWStream5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "fBytesWrittenBeforeTail",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI22SkDynamicMemoryWStream",
   "name" : "SkDynamicMemoryWStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTI22SkDynamicMemoryWStream",
   "self_type" : "_ZTI22SkDynamicMemoryWStream",
   "size" : 16,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI22SkDynamicMemoryWStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN22SkDynamicMemoryWStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN22SkDynamicMemoryWStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN22SkDynamicMemoryWStream5writeEPKvj"
    },
    {
     "mangled_component_name" : "_ZN9SkWStream5flushEv"
    },
    {
     "mangled_component_name" : "_ZNK22SkDynamicMemoryWStream12bytesWrittenEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 44,
   "source_file" : "bionic/libc/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTI9user_regs"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP9user_regs"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI11user_fpregs"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIP11user_fpregs"
    }
   ],
   "linker_set_key" : "_ZTI4user",
   "name" : "user",
   "referenced_type" : "_ZTI4user",
   "self_type" : "_ZTI4user",
   "size" : 296,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "_ZTIP6SkData"
    }
   ],
   "linker_set_key" : "_ZTI5sk_spI6SkDataE",
   "name" : "sk_sp<SkData>",
   "record_kind" : "class",
   "referenced_type" : "_ZTI5sk_spI6SkDataE",
   "self_type" : "_ZTI5sk_spI6SkDataE",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "template_args" : [ "_ZTI6SkData" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI10SkNVRefCntI6SkDataE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fReleaseProc",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPKvPvE"
    },
    {
     "access" : "private",
     "field_name" : "fReleaseProcContext",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "fPtr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "access" : "private",
     "field_name" : "fSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6SkData",
   "name" : "SkData",
   "record_kind" : "class",
   "referenced_type" : "_ZTI6SkData",
   "self_type" : "_ZTI6SkData",
   "size" : 20,
   "source_file" : "external/skia/include/core/SkData.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI12SkRefCntBase"
    }
   ],
   "linker_set_key" : "_ZTI8SkRefCnt",
   "name" : "SkRefCnt",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8SkRefCnt",
   "self_type" : "_ZTI8SkRefCnt",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8SkRefCnt"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTI8SkStream",
   "name" : "SkStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8SkStream",
   "self_type" : "_ZTI8SkStream",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8SkStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8SkStream7isAtEndEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream11hasPositionEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream11getPositionEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream4seekEj"
    },
    {
     "mangled_component_name" : "_ZN8SkStream4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream11onDuplicateEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream6onForkEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 40,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10sigcontext"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIA128_m"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 744,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA32_y"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "_ZTI8user_vfp",
   "self_type" : "_ZTI8user_vfp",
   "size" : 264,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTI9SkWStream",
   "name" : "SkWStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTI9SkWStream",
   "self_type" : "_ZTI9SkWStream",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI9SkWStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9SkWStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9SkWStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9SkWStream5writeEPKvj"
    },
    {
     "mangled_component_name" : "_ZN9SkWStream5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9SkWStream12bytesWrittenEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "_ZTI9cpu_set_t",
   "self_type" : "_ZTI9cpu_set_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "_ZTIA18_m"
    }
   ],
   "linker_set_key" : "_ZTI9user_regs",
   "name" : "user_regs",
   "referenced_type" : "_ZTI9user_regs",
   "self_type" : "_ZTI9user_regs",
   "size" : 72,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt0_E",
   "self_type" : "_ZTIN10__sifieldsUt0_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt1_E",
   "self_type" : "_ZTIN10__sifieldsUt1_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt2_E",
   "self_type" : "_ZTIN10__sifieldsUt2_E",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_E",
   "self_type" : "_ZTIN10__sifieldsUt3_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt4_E",
   "self_type" : "_ZTIN10__sifieldsUt4_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt5_E",
   "self_type" : "_ZTIN10__sifieldsUt5_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:100:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN11user_fpregs6fp_regE",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "_ZTIN11user_fpregs6fp_regE",
   "self_type" : "_ZTIN11user_fpregs6fp_regE",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN18__kernel_sigactionUt_E",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:68:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN18__kernel_sigactionUt_E",
   "self_type" : "_ZTIN18__kernel_sigactionUt_E",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA13_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:232:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN8ucontextUt_Ut_E"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_Ut_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)::(anonymous struct at bionic/libc/include/sys/ucontext.h:91:5)",
   "referenced_type" : "_ZTIN8ucontextUt_Ut_E",
   "self_type" : "_ZTIN8ucontextUt_Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:89:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj0EEE",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj1EEE",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI12SkFILEStreamEEEE",
   "name" : "std::__identity<std::default_delete<SkFILEStream>>",
   "referenced_type" : "_ZTINSt3__110__identityINS_14default_deleteI12SkFILEStreamEEEE",
   "self_type" : "_ZTINSt3__110__identityINS_14default_deleteI12SkFILEStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI12SkFILEStreamEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI13SkStreamAssetEEEE",
   "name" : "std::__identity<std::default_delete<SkStreamAsset>>",
   "referenced_type" : "_ZTINSt3__110__identityINS_14default_deleteI13SkStreamAssetEEEE",
   "self_type" : "_ZTINSt3__110__identityINS_14default_deleteI13SkStreamAssetEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI13SkStreamAssetEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI14SkMemoryStreamEEEE",
   "name" : "std::__identity<std::default_delete<SkMemoryStream>>",
   "referenced_type" : "_ZTINSt3__110__identityINS_14default_deleteI14SkMemoryStreamEEEE",
   "self_type" : "_ZTINSt3__110__identityINS_14default_deleteI14SkMemoryStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI14SkMemoryStreamEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI14SkStreamMemoryEEEE",
   "name" : "std::__identity<std::default_delete<SkStreamMemory>>",
   "referenced_type" : "_ZTINSt3__110__identityINS_14default_deleteI14SkStreamMemoryEEEE",
   "self_type" : "_ZTINSt3__110__identityINS_14default_deleteI14SkStreamMemoryEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI14SkStreamMemoryEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI16SkStreamSeekableEEEE",
   "name" : "std::__identity<std::default_delete<SkStreamSeekable>>",
   "referenced_type" : "_ZTINSt3__110__identityINS_14default_deleteI16SkStreamSeekableEEEE",
   "self_type" : "_ZTINSt3__110__identityINS_14default_deleteI16SkStreamSeekableEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI16SkStreamSeekableEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI18SkStreamRewindableEEEE",
   "name" : "std::__identity<std::default_delete<SkStreamRewindable>>",
   "referenced_type" : "_ZTINSt3__110__identityINS_14default_deleteI18SkStreamRewindableEEEE",
   "self_type" : "_ZTINSt3__110__identityINS_14default_deleteI18SkStreamRewindableEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI18SkStreamRewindableEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI8SkStreamEEEE",
   "name" : "std::__identity<std::default_delete<SkStream>>",
   "referenced_type" : "_ZTINSt3__110__identityINS_14default_deleteI8SkStreamEEEE",
   "self_type" : "_ZTINSt3__110__identityINS_14default_deleteI8SkStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI8SkStreamEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "_ZTINSt3__110__ignore_tIhEE",
   "self_type" : "_ZTINSt3__110__ignore_tIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "referenced_type" : "_ZTINSt3__110in_place_tE",
   "self_type" : "_ZTINSt3__110in_place_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI12SkFILEStreamEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI12SkFILEStreamEEEE",
   "name" : "std::is_pointer<std::default_delete<SkFILEStream>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI12SkFILEStreamEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI12SkFILEStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI12SkFILEStreamEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI13SkStreamAssetEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI13SkStreamAssetEEEE",
   "name" : "std::is_pointer<std::default_delete<SkStreamAsset>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI13SkStreamAssetEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI13SkStreamAssetEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI13SkStreamAssetEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI14SkMemoryStreamEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI14SkMemoryStreamEEEE",
   "name" : "std::is_pointer<std::default_delete<SkMemoryStream>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI14SkMemoryStreamEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI14SkMemoryStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI14SkMemoryStreamEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI14SkStreamMemoryEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI14SkStreamMemoryEEEE",
   "name" : "std::is_pointer<std::default_delete<SkStreamMemory>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI14SkStreamMemoryEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI14SkStreamMemoryEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI14SkStreamMemoryEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI16SkStreamSeekableEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI16SkStreamSeekableEEEE",
   "name" : "std::is_pointer<std::default_delete<SkStreamSeekable>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI16SkStreamSeekableEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI16SkStreamSeekableEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI16SkStreamSeekableEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI18SkStreamRewindableEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI18SkStreamRewindableEEEE",
   "name" : "std::is_pointer<std::default_delete<SkStreamRewindable>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI18SkStreamRewindableEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI18SkStreamRewindableEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI18SkStreamRewindableEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI8SkStreamEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI8SkStreamEEEE",
   "name" : "std::is_pointer<std::default_delete<SkStream>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI8SkStreamEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_14default_deleteI8SkStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI8SkStreamEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "referenced_type" : "_ZTINSt3__110owner_lessIvEE",
   "self_type" : "_ZTINSt3__110owner_lessIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTIP7__sFILE"
    },
    {
     "access" : "private",
     "field_name" : "__cntrl_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPNSt3__119__shared_weak_countE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110shared_ptrI7__sFILEEE",
   "name" : "std::shared_ptr<__sFILE>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110shared_ptrI7__sFILEEE",
   "self_type" : "_ZTINSt3__110shared_ptrI7__sFILEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTI7__sFILE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI12SkFILEStreamNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkFILEStream, std::default_delete<SkFILEStream>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrI12SkFILEStreamNS_14default_deleteIS1_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrI12SkFILEStreamNS_14default_deleteIS1_EEEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTI12SkFILEStream", "_ZTINSt3__114default_deleteI12SkFILEStreamEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI13SkStreamAssetNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkStreamAsset, std::default_delete<SkStreamAsset>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrI13SkStreamAssetNS_14default_deleteIS1_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrI13SkStreamAssetNS_14default_deleteIS1_EEEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI13SkStreamAsset",
    "_ZTINSt3__114default_deleteI13SkStreamAssetEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI14SkMemoryStreamNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkMemoryStream, std::default_delete<SkMemoryStream>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrI14SkMemoryStreamNS_14default_deleteIS1_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrI14SkMemoryStreamNS_14default_deleteIS1_EEEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI14SkMemoryStream",
    "_ZTINSt3__114default_deleteI14SkMemoryStreamEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI14SkStreamMemoryNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkStreamMemory, std::default_delete<SkStreamMemory>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrI14SkStreamMemoryNS_14default_deleteIS1_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrI14SkStreamMemoryNS_14default_deleteIS1_EEEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI14SkStreamMemory",
    "_ZTINSt3__114default_deleteI14SkStreamMemoryEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI16SkStreamSeekableNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkStreamSeekable, std::default_delete<SkStreamSeekable>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrI16SkStreamSeekableNS_14default_deleteIS1_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrI16SkStreamSeekableNS_14default_deleteIS1_EEEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI16SkStreamSeekable",
    "_ZTINSt3__114default_deleteI16SkStreamSeekableEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI18SkStreamRewindableNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkStreamRewindable, std::default_delete<SkStreamRewindable>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrI18SkStreamRewindableNS_14default_deleteIS1_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrI18SkStreamRewindableNS_14default_deleteIS1_EEEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI18SkStreamRewindable",
    "_ZTINSt3__114default_deleteI18SkStreamRewindableEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI8SkStreamNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkStream, std::default_delete<SkStream>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrI8SkStreamNS_14default_deleteIS1_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrI8SkStreamNS_14default_deleteIS1_EEEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTI8SkStream", "_ZTINSt3__114default_deleteI8SkStreamEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__nat>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__nat>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkFILEStream *, std::default_delete<SkFILEStream>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkStreamAsset *, std::default_delete<SkStreamAsset>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkMemoryStream *, std::default_delete<SkMemoryStream>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkStreamMemory *, std::default_delete<SkStreamMemory>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkStreamSeekable *, std::default_delete<SkStreamSeekable>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkStreamRewindable *, std::default_delete<SkStreamRewindable>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkStream *, std::default_delete<SkStream>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_14default_deleteI12SkFILEStreamEEEE",
   "name" : "std::add_pointer<std::default_delete<SkFILEStream>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_14default_deleteI12SkFILEStreamEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_14default_deleteI12SkFILEStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI12SkFILEStreamEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP12SkFILEStreamEE",
   "name" : "std::add_pointer<SkFILEStream *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIP12SkFILEStreamEE",
   "self_type" : "_ZTINSt3__111add_pointerIP12SkFILEStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP12SkFILEStream" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP13SkStreamAssetEE",
   "name" : "std::add_pointer<SkStreamAsset *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIP13SkStreamAssetEE",
   "self_type" : "_ZTINSt3__111add_pointerIP13SkStreamAssetEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP13SkStreamAsset" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP14SkMemoryStreamEE",
   "name" : "std::add_pointer<SkMemoryStream *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIP14SkMemoryStreamEE",
   "self_type" : "_ZTINSt3__111add_pointerIP14SkMemoryStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14SkMemoryStream" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP14SkStreamMemoryEE",
   "name" : "std::add_pointer<SkStreamMemory *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIP14SkStreamMemoryEE",
   "self_type" : "_ZTINSt3__111add_pointerIP14SkStreamMemoryEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14SkStreamMemory" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP16SkStreamSeekableEE",
   "name" : "std::add_pointer<SkStreamSeekable *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIP16SkStreamSeekableEE",
   "self_type" : "_ZTINSt3__111add_pointerIP16SkStreamSeekableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP16SkStreamSeekable" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP18SkStreamRewindableEE",
   "name" : "std::add_pointer<SkStreamRewindable *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIP18SkStreamRewindableEE",
   "self_type" : "_ZTINSt3__111add_pointerIP18SkStreamRewindableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP18SkStreamRewindable" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP8SkStreamEE",
   "name" : "std::add_pointer<SkStream *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIP8SkStreamEE",
   "self_type" : "_ZTINSt3__111add_pointerIP8SkStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP8SkStream" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkFILEStream *, std::default_delete<SkFILEStream>> *, std::__compressed_pair<SkFILEStream *, std::default_delete<SkFILEStream>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkStreamAsset *, std::default_delete<SkStreamAsset>> *, std::__compressed_pair<SkStreamAsset *, std::default_delete<SkStreamAsset>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkMemoryStream *, std::default_delete<SkMemoryStream>> *, std::__compressed_pair<SkMemoryStream *, std::default_delete<SkMemoryStream>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkStreamMemory *, std::default_delete<SkStreamMemory>> *, std::__compressed_pair<SkStreamMemory *, std::default_delete<SkStreamMemory>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkStreamSeekable *, std::default_delete<SkStreamSeekable>> *, std::__compressed_pair<SkStreamSeekable *, std::default_delete<SkStreamSeekable>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkStreamRewindable *, std::default_delete<SkStreamRewindable>> *, std::__compressed_pair<SkStreamRewindable *, std::default_delete<SkStreamRewindable>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkStream *, std::default_delete<SkStream>> *, std::__compressed_pair<SkStream *, std::default_delete<SkStream>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkFILEStream *, 0, false> *, std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkStreamAsset *, 0, false> *, std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkMemoryStream *, 0, false> *, std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkStreamMemory *, 0, false> *, std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkStreamSeekable *, 0, false> *, std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkStreamRewindable *, 0, false> *, std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkStream *, 0, false> *, std::__compressed_pair_elem<SkStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteI12SkFILEStreamEES3_EE",
   "name" : "std::conditional<false, std::default_delete<SkFILEStream> *, std::default_delete<SkFILEStream>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteI12SkFILEStreamEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteI12SkFILEStreamEES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__114default_deleteI12SkFILEStreamEE",
    "_ZTINSt3__114default_deleteI12SkFILEStreamEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkFILEStream *, 0, false> *, std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkStreamAsset *, 0, false> *, std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkMemoryStream *, 0, false> *, std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkStreamMemory *, 0, false> *, std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkStreamSeekable *, 0, false> *, std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkStreamRewindable *, 0, false> *, std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkStream *, 0, false> *, std::__compressed_pair_elem<SkStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP12SkFILEStreamS2_EE",
   "name" : "std::conditional<false, SkFILEStream **, SkFILEStream *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPP12SkFILEStreamS2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPP12SkFILEStreamS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPP12SkFILEStream", "_ZTIP12SkFILEStream" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP13SkStreamAssetS2_EE",
   "name" : "std::conditional<false, SkStreamAsset **, SkStreamAsset *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPP13SkStreamAssetS2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPP13SkStreamAssetS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPP13SkStreamAsset", "_ZTIP13SkStreamAsset" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP14SkMemoryStreamS2_EE",
   "name" : "std::conditional<false, SkMemoryStream **, SkMemoryStream *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPP14SkMemoryStreamS2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPP14SkMemoryStreamS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPP14SkMemoryStream", "_ZTIP14SkMemoryStream" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP14SkStreamMemoryS2_EE",
   "name" : "std::conditional<false, SkStreamMemory **, SkStreamMemory *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPP14SkStreamMemoryS2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPP14SkStreamMemoryS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPP14SkStreamMemory", "_ZTIP14SkStreamMemory" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP16SkStreamSeekableS2_EE",
   "name" : "std::conditional<false, SkStreamSeekable **, SkStreamSeekable *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPP16SkStreamSeekableS2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPP16SkStreamSeekableS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPP16SkStreamSeekable", "_ZTIP16SkStreamSeekable" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP18SkStreamRewindableS2_EE",
   "name" : "std::conditional<false, SkStreamRewindable **, SkStreamRewindable *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPP18SkStreamRewindableS2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPP18SkStreamRewindableS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPP18SkStreamRewindable", "_ZTIP18SkStreamRewindable" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP8SkStreamS2_EE",
   "name" : "std::conditional<false, SkStream **, SkStream *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPP8SkStreamS2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPP8SkStreamS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPP8SkStream", "_ZTIP8SkStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_14default_deleteI12SkFILEStreamEEEE",
   "name" : "std::is_abstract<std::default_delete<SkFILEStream>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_14default_deleteI12SkFILEStreamEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_14default_deleteI12SkFILEStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI12SkFILEStreamEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIP12SkFILEStreamEE",
   "name" : "std::is_abstract<SkFILEStream *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIP12SkFILEStreamEE",
   "self_type" : "_ZTINSt3__111is_abstractIP12SkFILEStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP12SkFILEStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIP13SkStreamAssetEE",
   "name" : "std::is_abstract<SkStreamAsset *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIP13SkStreamAssetEE",
   "self_type" : "_ZTINSt3__111is_abstractIP13SkStreamAssetEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP13SkStreamAsset" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIP14SkMemoryStreamEE",
   "name" : "std::is_abstract<SkMemoryStream *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIP14SkMemoryStreamEE",
   "self_type" : "_ZTINSt3__111is_abstractIP14SkMemoryStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14SkMemoryStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIP14SkStreamMemoryEE",
   "name" : "std::is_abstract<SkStreamMemory *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIP14SkStreamMemoryEE",
   "self_type" : "_ZTINSt3__111is_abstractIP14SkStreamMemoryEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14SkStreamMemory" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIP16SkStreamSeekableEE",
   "name" : "std::is_abstract<SkStreamSeekable *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIP16SkStreamSeekableEE",
   "self_type" : "_ZTINSt3__111is_abstractIP16SkStreamSeekableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP16SkStreamSeekable" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIP18SkStreamRewindableEE",
   "name" : "std::is_abstract<SkStreamRewindable *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIP18SkStreamRewindableEE",
   "self_type" : "_ZTINSt3__111is_abstractIP18SkStreamRewindableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP18SkStreamRewindable" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIP6SkDataEE",
   "name" : "std::is_abstract<SkData *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIP6SkDataEE",
   "self_type" : "_ZTINSt3__111is_abstractIP6SkDataEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP6SkData" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIP8SkStreamEE",
   "name" : "std::is_abstract<SkStream *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIP8SkStreamEE",
   "self_type" : "_ZTINSt3__111is_abstractIP8SkStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP8SkStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionI12SkFILEStreamLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionI12SkFILEStreamEE",
   "name" : "std::is_function<SkFILEStream>",
   "referenced_type" : "_ZTINSt3__111is_functionI12SkFILEStreamEE",
   "self_type" : "_ZTINSt3__111is_functionI12SkFILEStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI12SkFILEStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionI13SkStreamAssetLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionI13SkStreamAssetEE",
   "name" : "std::is_function<SkStreamAsset>",
   "referenced_type" : "_ZTINSt3__111is_functionI13SkStreamAssetEE",
   "self_type" : "_ZTINSt3__111is_functionI13SkStreamAssetEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI13SkStreamAsset" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionI14SkMemoryStreamLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionI14SkMemoryStreamEE",
   "name" : "std::is_function<SkMemoryStream>",
   "referenced_type" : "_ZTINSt3__111is_functionI14SkMemoryStreamEE",
   "self_type" : "_ZTINSt3__111is_functionI14SkMemoryStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI14SkMemoryStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionI14SkStreamMemoryLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionI14SkStreamMemoryEE",
   "name" : "std::is_function<SkStreamMemory>",
   "referenced_type" : "_ZTINSt3__111is_functionI14SkStreamMemoryEE",
   "self_type" : "_ZTINSt3__111is_functionI14SkStreamMemoryEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI14SkStreamMemory" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionI16SkStreamSeekableLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionI16SkStreamSeekableEE",
   "name" : "std::is_function<SkStreamSeekable>",
   "referenced_type" : "_ZTINSt3__111is_functionI16SkStreamSeekableEE",
   "self_type" : "_ZTINSt3__111is_functionI16SkStreamSeekableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI16SkStreamSeekable" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionI18SkStreamRewindableLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionI18SkStreamRewindableEE",
   "name" : "std::is_function<SkStreamRewindable>",
   "referenced_type" : "_ZTINSt3__111is_functionI18SkStreamRewindableEE",
   "self_type" : "_ZTINSt3__111is_functionI18SkStreamRewindableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI18SkStreamRewindable" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionI8SkStreamLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionI8SkStreamEE",
   "name" : "std::is_function<SkStream>",
   "referenced_type" : "_ZTINSt3__111is_functionI8SkStreamEE",
   "self_type" : "_ZTINSt3__111is_functionI8SkStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI8SkStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<SkFILEStream *, std::default_delete<SkFILEStream>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<SkStreamAsset *, std::default_delete<SkStreamAsset>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<SkMemoryStream *, std::default_delete<SkMemoryStream>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<SkStreamMemory *, std::default_delete<SkStreamMemory>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<SkStreamSeekable *, std::default_delete<SkStreamSeekable>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<SkStreamRewindable *, std::default_delete<SkStreamRewindable>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<SkStream *, std::default_delete<SkStream>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<SkStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_14default_deleteI12SkFILEStreamEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_14default_deleteI12SkFILEStreamEEEE",
   "name" : "std::is_function<std::default_delete<SkFILEStream>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_14default_deleteI12SkFILEStreamEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_14default_deleteI12SkFILEStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI12SkFILEStreamEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<SkStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIP12SkFILEStreamLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIP12SkFILEStreamEE",
   "name" : "std::is_function<SkFILEStream *>",
   "referenced_type" : "_ZTINSt3__111is_functionIP12SkFILEStreamEE",
   "self_type" : "_ZTINSt3__111is_functionIP12SkFILEStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP12SkFILEStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIP13SkStreamAssetLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIP13SkStreamAssetEE",
   "name" : "std::is_function<SkStreamAsset *>",
   "referenced_type" : "_ZTINSt3__111is_functionIP13SkStreamAssetEE",
   "self_type" : "_ZTINSt3__111is_functionIP13SkStreamAssetEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP13SkStreamAsset" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIP14SkMemoryStreamLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIP14SkMemoryStreamEE",
   "name" : "std::is_function<SkMemoryStream *>",
   "referenced_type" : "_ZTINSt3__111is_functionIP14SkMemoryStreamEE",
   "self_type" : "_ZTINSt3__111is_functionIP14SkMemoryStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14SkMemoryStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIP14SkStreamMemoryLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIP14SkStreamMemoryEE",
   "name" : "std::is_function<SkStreamMemory *>",
   "referenced_type" : "_ZTINSt3__111is_functionIP14SkStreamMemoryEE",
   "self_type" : "_ZTINSt3__111is_functionIP14SkStreamMemoryEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14SkStreamMemory" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIP16SkStreamSeekableLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIP16SkStreamSeekableEE",
   "name" : "std::is_function<SkStreamSeekable *>",
   "referenced_type" : "_ZTINSt3__111is_functionIP16SkStreamSeekableEE",
   "self_type" : "_ZTINSt3__111is_functionIP16SkStreamSeekableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP16SkStreamSeekable" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIP18SkStreamRewindableLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIP18SkStreamRewindableEE",
   "name" : "std::is_function<SkStreamRewindable *>",
   "referenced_type" : "_ZTINSt3__111is_functionIP18SkStreamRewindableEE",
   "self_type" : "_ZTINSt3__111is_functionIP18SkStreamRewindableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP18SkStreamRewindable" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIP8SkStreamLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIP8SkStreamEE",
   "name" : "std::is_function<SkStream *>",
   "referenced_type" : "_ZTINSt3__111is_functionIP8SkStreamEE",
   "self_type" : "_ZTINSt3__111is_functionIP8SkStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP8SkStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIdEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIdEE",
   "name" : "std::is_integral<double>",
   "referenced_type" : "_ZTINSt3__111is_integralIdEE",
   "self_type" : "_ZTINSt3__111is_integralIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIeEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIeEE",
   "name" : "std::is_integral<long double>",
   "referenced_type" : "_ZTINSt3__111is_integralIeEE",
   "self_type" : "_ZTINSt3__111is_integralIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIfEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIfEE",
   "name" : "std::is_integral<float>",
   "referenced_type" : "_ZTINSt3__111is_integralIfEE",
   "self_type" : "_ZTINSt3__111is_integralIfEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIiEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIiEE",
   "name" : "std::is_integral<int>",
   "referenced_type" : "_ZTINSt3__111is_integralIiEE",
   "self_type" : "_ZTINSt3__111is_integralIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__destruct_nE",
   "name" : "std::__destruct_n",
   "referenced_type" : "_ZTINSt3__112__destruct_nE",
   "self_type" : "_ZTINSt3__112__destruct_nE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__second_tagE",
   "name" : "std::__second_tag",
   "referenced_type" : "_ZTINSt3__112__second_tagE",
   "self_type" : "_ZTINSt3__112__second_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__tuple_lessILj0EEE",
   "name" : "std::__tuple_less<0>",
   "referenced_type" : "_ZTINSt3__112__tuple_lessILj0EEE",
   "self_type" : "_ZTINSt3__112__tuple_lessILj0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112bad_weak_ptrE",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112bad_weak_ptrE",
   "self_type" : "_ZTINSt3__112bad_weak_ptrE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceI12SkFILEStreamEE",
   "name" : "std::is_reference<SkFILEStream>",
   "referenced_type" : "_ZTINSt3__112is_referenceI12SkFILEStreamEE",
   "self_type" : "_ZTINSt3__112is_referenceI12SkFILEStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI12SkFILEStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceI13SkStreamAssetEE",
   "name" : "std::is_reference<SkStreamAsset>",
   "referenced_type" : "_ZTINSt3__112is_referenceI13SkStreamAssetEE",
   "self_type" : "_ZTINSt3__112is_referenceI13SkStreamAssetEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI13SkStreamAsset" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceI14SkMemoryStreamEE",
   "name" : "std::is_reference<SkMemoryStream>",
   "referenced_type" : "_ZTINSt3__112is_referenceI14SkMemoryStreamEE",
   "self_type" : "_ZTINSt3__112is_referenceI14SkMemoryStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI14SkMemoryStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceI14SkStreamMemoryEE",
   "name" : "std::is_reference<SkStreamMemory>",
   "referenced_type" : "_ZTINSt3__112is_referenceI14SkStreamMemoryEE",
   "self_type" : "_ZTINSt3__112is_referenceI14SkStreamMemoryEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI14SkStreamMemory" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceI16SkStreamSeekableEE",
   "name" : "std::is_reference<SkStreamSeekable>",
   "referenced_type" : "_ZTINSt3__112is_referenceI16SkStreamSeekableEE",
   "self_type" : "_ZTINSt3__112is_referenceI16SkStreamSeekableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI16SkStreamSeekable" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceI18SkStreamRewindableEE",
   "name" : "std::is_reference<SkStreamRewindable>",
   "referenced_type" : "_ZTINSt3__112is_referenceI18SkStreamRewindableEE",
   "self_type" : "_ZTINSt3__112is_referenceI18SkStreamRewindableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI18SkStreamRewindable" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceI8SkStreamEE",
   "name" : "std::is_reference<SkStream>",
   "referenced_type" : "_ZTINSt3__112is_referenceI8SkStreamEE",
   "self_type" : "_ZTINSt3__112is_referenceI8SkStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI8SkStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_reference<const std::__compressed_pair<SkFILEStream *, std::default_delete<SkFILEStream>>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_reference<const std::__compressed_pair<SkStreamAsset *, std::default_delete<SkStreamAsset>>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_reference<const std::__compressed_pair<SkMemoryStream *, std::default_delete<SkMemoryStream>>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_reference<const std::__compressed_pair<SkStreamMemory *, std::default_delete<SkStreamMemory>>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_reference<const std::__compressed_pair<SkStreamSeekable *, std::default_delete<SkStreamSeekable>>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_reference<const std::__compressed_pair<SkStreamRewindable *, std::default_delete<SkStreamRewindable>>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_reference<const std::__compressed_pair<SkStream *, std::default_delete<SkStream>>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<SkStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_14default_deleteI12SkFILEStreamEEEE",
   "name" : "std::is_reference<std::default_delete<SkFILEStream>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI12SkFILEStreamEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI12SkFILEStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI12SkFILEStreamEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_14default_deleteI13SkStreamAssetEEEE",
   "name" : "std::is_reference<std::default_delete<SkStreamAsset>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI13SkStreamAssetEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI13SkStreamAssetEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI13SkStreamAssetEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_14default_deleteI14SkMemoryStreamEEEE",
   "name" : "std::is_reference<std::default_delete<SkMemoryStream>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI14SkMemoryStreamEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI14SkMemoryStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI14SkMemoryStreamEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_14default_deleteI14SkStreamMemoryEEEE",
   "name" : "std::is_reference<std::default_delete<SkStreamMemory>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI14SkStreamMemoryEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI14SkStreamMemoryEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI14SkStreamMemoryEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_14default_deleteI16SkStreamSeekableEEEE",
   "name" : "std::is_reference<std::default_delete<SkStreamSeekable>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI16SkStreamSeekableEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI16SkStreamSeekableEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI16SkStreamSeekableEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_14default_deleteI18SkStreamRewindableEEEE",
   "name" : "std::is_reference<std::default_delete<SkStreamRewindable>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI18SkStreamRewindableEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI18SkStreamRewindableEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI18SkStreamRewindableEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_14default_deleteI8SkStreamEEEE",
   "name" : "std::is_reference<std::default_delete<SkStream>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI8SkStreamEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_14default_deleteI8SkStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI8SkStreamEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<SkStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIP12SkFILEStreamEE",
   "name" : "std::is_reference<SkFILEStream *>",
   "referenced_type" : "_ZTINSt3__112is_referenceIP12SkFILEStreamEE",
   "self_type" : "_ZTINSt3__112is_referenceIP12SkFILEStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP12SkFILEStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIP13SkStreamAssetEE",
   "name" : "std::is_reference<SkStreamAsset *>",
   "referenced_type" : "_ZTINSt3__112is_referenceIP13SkStreamAssetEE",
   "self_type" : "_ZTINSt3__112is_referenceIP13SkStreamAssetEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP13SkStreamAsset" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIP14SkMemoryStreamEE",
   "name" : "std::is_reference<SkMemoryStream *>",
   "referenced_type" : "_ZTINSt3__112is_referenceIP14SkMemoryStreamEE",
   "self_type" : "_ZTINSt3__112is_referenceIP14SkMemoryStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14SkMemoryStream" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIP14SkStreamMemoryEE",
   "name" : "std::is_reference<SkStreamMemory *>",
   "referenced_type" : "_ZTINSt3__112is_referenceIP14SkStreamMemoryEE",
   "self_type" : "_ZTINSt3__112is_referenceIP14SkStreamMemoryEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14SkStreamMemory" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIP16SkStreamSeekableEE",
   "name" : "std::is_reference<SkStreamSeekable *>",
   "referenced_type" : "_ZTINSt3__112is_referenceIP16SkStreamSeekableEE",
   "self_type" : "_ZTINSt3__112is_referenceIP16SkStreamSeekableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP16SkStreamSeekable" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIP18SkStreamRewindableEE",
   "name" : "std::is_reference<SkStreamRewindable *>",
   "referenced_type" : "_ZTINSt3__112is_referenceIP18SkStreamRewindableEE",
   "self_type" : "_ZTINSt3__112is_referenceIP18SkStreamRewindableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP18SkStreamRewindable" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIP8SkStreamEE",
   "name" : "std::is_reference<SkStream *>",
   "referenced_type" : "_ZTINSt3__112is_referenceIP8SkStreamEE",
   "self_type" : "_ZTINSt3__112is_referenceIP8SkStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP8SkStream" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constI12SkFILEStreamEE",
   "name" : "std::remove_const<SkFILEStream>",
   "referenced_type" : "_ZTINSt3__112remove_constI12SkFILEStreamEE",
   "self_type" : "_ZTINSt3__112remove_constI12SkFILEStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI12SkFILEStream" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constI13SkStreamAssetEE",
   "name" : "std::remove_const<SkStreamAsset>",
   "referenced_type" : "_ZTINSt3__112remove_constI13SkStreamAssetEE",
   "self_type" : "_ZTINSt3__112remove_constI13SkStreamAssetEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI13SkStreamAsset" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constI14SkMemoryStreamEE",
   "name" : "std::remove_const<SkMemoryStream>",
   "referenced_type" : "_ZTINSt3__112remove_constI14SkMemoryStreamEE",
   "self_type" : "_ZTINSt3__112remove_constI14SkMemoryStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI14SkMemoryStream" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constI14SkStreamMemoryEE",
   "name" : "std::remove_const<SkStreamMemory>",
   "referenced_type" : "_ZTINSt3__112remove_constI14SkStreamMemoryEE",
   "self_type" : "_ZTINSt3__112remove_constI14SkStreamMemoryEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI14SkStreamMemory" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constI16SkStreamSeekableEE",
   "name" : "std::remove_const<SkStreamSeekable>",
   "referenced_type" : "_ZTINSt3__112remove_constI16SkStreamSeekableEE",
   "self_type" : "_ZTINSt3__112remove_constI16SkStreamSeekableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI16SkStreamSeekable" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constI18SkStreamRewindableEE",
   "name" : "std::remove_const<SkStreamRewindable>",
   "referenced_type" : "_ZTINSt3__112remove_constI18SkStreamRewindableEE",
   "self_type" : "_ZTINSt3__112remove_constI18SkStreamRewindableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI18SkStreamRewindable" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constI8SkStreamEE",
   "name" : "std::remove_const<SkStream>",
   "referenced_type" : "_ZTINSt3__112remove_constI8SkStreamEE",
   "self_type" : "_ZTINSt3__112remove_constI8SkStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTI8SkStream" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_const<const std::__compressed_pair<SkFILEStream *, std::default_delete<SkFILEStream>>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_const<const std::__compressed_pair<SkStreamAsset *, std::default_delete<SkStreamAsset>>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_const<const std::__compressed_pair<SkMemoryStream *, std::default_delete<SkMemoryStream>>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_const<const std::__compressed_pair<SkStreamMemory *, std::default_delete<SkStreamMemory>>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_const<const std::__compressed_pair<SkStreamSeekable *, std::default_delete<SkStreamSeekable>>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_const<const std::__compressed_pair<SkStreamRewindable *, std::default_delete<SkStreamRewindable>>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_const<const std::__compressed_pair<SkStream *, std::default_delete<SkStream>>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<SkStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_14default_deleteI12SkFILEStreamEEEE",
   "name" : "std::remove_const<std::default_delete<SkFILEStream>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_14default_deleteI12SkFILEStreamEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_14default_deleteI12SkFILEStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI12SkFILEStreamEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_14default_deleteI13SkStreamAssetEEEE",
   "name" : "std::remove_const<std::default_delete<SkStreamAsset>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_14default_deleteI13SkStreamAssetEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_14default_deleteI13SkStreamAssetEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI13SkStreamAssetEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_14default_deleteI14SkMemoryStreamEEEE",
   "name" : "std::remove_const<std::default_delete<SkMemoryStream>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_14default_deleteI14SkMemoryStreamEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_14default_deleteI14SkMemoryStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI14SkMemoryStreamEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_14default_deleteI14SkStreamMemoryEEEE",
   "name" : "std::remove_const<std::default_delete<SkStreamMemory>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_14default_deleteI14SkStreamMemoryEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_14default_deleteI14SkStreamMemoryEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI14SkStreamMemoryEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_14default_deleteI16SkStreamSeekableEEEE",
   "name" : "std::remove_const<std::default_delete<SkStreamSeekable>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_14default_deleteI16SkStreamSeekableEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_14default_deleteI16SkStreamSeekableEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI16SkStreamSeekableEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_14default_deleteI18SkStreamRewindableEEEE",
   "name" : "std::remove_const<std::default_delete<SkStreamRewindable>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_14default_deleteI18SkStreamRewindableEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_14default_deleteI18SkStreamRewindableEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI18SkStreamRewindableEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_14default_deleteI8SkStreamEEEE",
   "name" : "std::remove_const<std::default_delete<SkStream>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_14default_deleteI8SkStreamEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_14default_deleteI8SkStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI8SkStreamEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<SkStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIP12SkFILEStreamEE",
   "name" : "std::remove_const<SkFILEStream *>",
   "referenced_type" : "_ZTINSt3__112remove_constIP12SkFILEStreamEE",
   "self_type" : "_ZTINSt3__112remove_constIP12SkFILEStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP12SkFILEStream" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIP13SkStreamAssetEE",
   "name" : "std::remove_const<SkStreamAsset *>",
   "referenced_type" : "_ZTINSt3__112remove_constIP13SkStreamAssetEE",
   "self_type" : "_ZTINSt3__112remove_constIP13SkStreamAssetEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP13SkStreamAsset" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIP14SkMemoryStreamEE",
   "name" : "std::remove_const<SkMemoryStream *>",
   "referenced_type" : "_ZTINSt3__112remove_constIP14SkMemoryStreamEE",
   "self_type" : "_ZTINSt3__112remove_constIP14SkMemoryStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14SkMemoryStream" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIP14SkStreamMemoryEE",
   "name" : "std::remove_const<SkStreamMemory *>",
   "referenced_type" : "_ZTINSt3__112remove_constIP14SkStreamMemoryEE",
   "self_type" : "_ZTINSt3__112remove_constIP14SkStreamMemoryEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14SkStreamMemory" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIP16SkStreamSeekableEE",
   "name" : "std::remove_const<SkStreamSeekable *>",
   "referenced_type" : "_ZTINSt3__112remove_constIP16SkStreamSeekableEE",
   "self_type" : "_ZTINSt3__112remove_constIP16SkStreamSeekableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP16SkStreamSeekable" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIP18SkStreamRewindableEE",
   "name" : "std::remove_const<SkStreamRewindable *>",
   "referenced_type" : "_ZTINSt3__112remove_constIP18SkStreamRewindableEE",
   "self_type" : "_ZTINSt3__112remove_constIP18SkStreamRewindableEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP18SkStreamRewindable" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIP8SkStreamEE",
   "name" : "std::remove_const<SkStream *>",
   "referenced_type" : "_ZTINSt3__112remove_constIP8SkStreamEE",
   "self_type" : "_ZTINSt3__112remove_constIP8SkStreamEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP8SkStream" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIdEE",
   "name" : "std::remove_const<double>",
   "referenced_type" : "_ZTINSt3__112remove_constIdEE",
   "self_type" : "_ZTINSt3__112remove_constIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIeEE",
   "name" : "std::remove_const<long double>",
   "referenced_type" : "_ZTINSt3__112remove_constIeEE",
   "self_type" : "_ZTINSt3__112remove_constIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIfEE",
   "name" : "std::remove_const<float>",
   "referenced_type" : "_ZTINSt3__112remove_constIfEE",
   "self_type" : "_ZTINSt3__112remove_constIfEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIiEE",
   "name" : "std::remove_const<int>",
   "referenced_type" : "_ZTINSt3__112remove_constIiEE",
   "self_type" : "_ZTINSt3__112remove_constIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomici"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__atomic_baseIiLb0EEE",
   "name" : "std::__atomic_base<int, false>",
   "referenced_type" : "_ZTINSt3__113__atomic_baseIiLb0EEE",
   "self_type" : "_ZTINSt3__113__atomic_baseIiLb0EEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/atomic",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113__atomic_baseIiLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__atomic_baseIiLb1EEE",
   "name" : "std::__atomic_base<int, true>",
   "referenced_type" : "_ZTINSt3__113__atomic_baseIiLb1EEE",
   "self_type" : "_ZTINSt3__113__atomic_baseIiLb1EEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/atomic",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "name" : "std::__make_signed<bool, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "name" : "std::__make_signed<int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "name" : "std::__make_signed<unsigned int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "name" : "std::__make_signed<long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedImLb1EEE",
   "name" : "std::__make_signed<unsigned long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "name" : "std::__make_signed<short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedItLb1EEE",
   "name" : "std::__make_signed<unsigned short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "name" : "std::__make_signed<long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "name" : "std::__make_signed<unsigned long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionINS_6_PairTEjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashINS_6_PairTELj2EEE",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__16_PairTE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIdjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIdLj2EEE",
   "name" : "std::__scalar_hash<double, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIdLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIdLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIejEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIeLj2EEE",
   "name" : "std::__scalar_hash<long double, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIeLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIeLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIfjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIfLj1EEE",
   "name" : "std::__scalar_hash<float, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIfLj1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIfLj1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIxjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIxLj2EEE",
   "name" : "std::__scalar_hash<long long, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIxLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIxLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIyjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIyLj2EEE",
   "name" : "std::__scalar_hash<unsigned long long, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIyLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIyLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_equalILj0EEE",
   "name" : "std::__tuple_equal<0>",
   "referenced_type" : "_ZTINSt3__113__tuple_equalILj0EEE",
   "self_type" : "_ZTINSt3__113__tuple_equalILj0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_typesIJEEE",
   "name" : "std::__tuple_types<>",
   "referenced_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "self_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair<SkFILEStream *, std::default_delete<SkFILEStream>>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair<SkStreamAsset *, std::default_delete<SkStreamAsset>>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair<SkMemoryStream *, std::default_delete<SkMemoryStream>>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair<SkStreamMemory *, std::default_delete<SkStreamMemory>>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair<SkStreamSeekable *, std::default_delete<SkStreamSeekable>>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair<SkStreamRewindable *, std::default_delete<SkStreamRewindable>>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair<SkStream *, std::default_delete<SkStream>>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<SkStream *, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_14default_deleteI12SkFILEStreamEEEE",
   "name" : "std::remove_extent<std::default_delete<SkFILEStream>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_14default_deleteI12SkFILEStreamEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_14default_deleteI12SkFILEStreamEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteI12SkFILEStreamEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
