#ifndef HIDL_GENERATED_ANDROID_HARDWARE_DRM_V1_1_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_DRM_V1_1_TYPES_H

#include <android/hardware/drm/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace drm {
namespace V1_1 {

// Forward declaration for forward reference support:
struct DrmMetricGroup;
enum class HdcpLevel : uint32_t;
enum class KeyRequestType : uint32_t;
enum class SecurityLevel : uint32_t;
struct SecureStopRelease;

/**
 * This message contains plugin-specific metrics made available to the client.
 * The message is used for making vendor-specific metrics available to an
 * application. The framework is not consuming any of the information.
 *
 * Metrics are grouped in instances of DrmMetricGroup. Each group contains
 * multiple instances of Metric.
 *
 * Example:
 *
 * Capture the timing information of a buffer copy event, "buf_copy", broken
 * out by the "size" of the buffer.
 *
 * DrmMetricGroup {
 *   metrics[0] {
 *     name: "buf_copy"
 *     attributes[0] {
 *       name: "size"
 *       type: INT64_TYPE
 *       int64Value: 1024
 *     }
 *     values[0] {
 *       componentName: "operation_count"
 *       type: INT64_TYPE
 *       int64Value: 75
 *     }
 *     values[1] {
 *       component_name: "average_time_seconds"
 *       type: DOUBLE_TYPE
 *       doubleValue: 0.00000042
 *     }
 *   }
 * }
 */
struct DrmMetricGroup final {
    // Forward declaration for forward reference support:
    enum class ValueType : uint8_t;
    struct Attribute;
    struct Value;
    struct Metric;

    /**
     * Used to discriminate the type of value being stored in the structs
     * below.
     */
    enum class ValueType : uint8_t {
        INT64_TYPE = 0,
        DOUBLE_TYPE = 1 /* ::android::hardware::drm::V1_1::DrmMetricGroup::ValueType.INT64_TYPE implicitly + 1 */,
        STRING_TYPE = 2 /* ::android::hardware::drm::V1_1::DrmMetricGroup::ValueType.DOUBLE_TYPE implicitly + 1 */,
    };

    /**
     * A detail about the metric being captured. The fields of an Attribute
     * are opaque to the framework.
     */
    struct Attribute final {
        ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
        /**
         * The type field indicates which of the following values is used.
         */
        ::android::hardware::drm::V1_1::DrmMetricGroup::ValueType type __attribute__ ((aligned(1)));
        int64_t int64Value __attribute__ ((aligned(8)));
        double doubleValue __attribute__ ((aligned(8)));
        ::android::hardware::hidl_string stringValue __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Attribute, name) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Attribute, type) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Attribute, int64Value) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Attribute, doubleValue) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Attribute, stringValue) == 40, "wrong offset");
    static_assert(sizeof(::android::hardware::drm::V1_1::DrmMetricGroup::Attribute) == 56, "wrong size");
    static_assert(__alignof(::android::hardware::drm::V1_1::DrmMetricGroup::Attribute) == 8, "wrong alignment");

    /**
     * A value of the metric. A metric may have multiple values. The
     * component name may be left empty if there is only supposed to be
     * one value for the given metric. The fields of the Value are
     * opaque to the framework.
     */
    struct Value final {
        ::android::hardware::hidl_string componentName __attribute__ ((aligned(8)));
        /**
         * The type field indicates which of the following values is used.
         */
        ::android::hardware::drm::V1_1::DrmMetricGroup::ValueType type __attribute__ ((aligned(1)));
        int64_t int64Value __attribute__ ((aligned(8)));
        double doubleValue __attribute__ ((aligned(8)));
        ::android::hardware::hidl_string stringValue __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Value, componentName) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Value, type) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Value, int64Value) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Value, doubleValue) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Value, stringValue) == 40, "wrong offset");
    static_assert(sizeof(::android::hardware::drm::V1_1::DrmMetricGroup::Value) == 56, "wrong size");
    static_assert(__alignof(::android::hardware::drm::V1_1::DrmMetricGroup::Value) == 8, "wrong alignment");

    /**
     * The metric being captured. A metric must have a name and at least one
     * value. A metric may have 0 or more attributes. The fields of a Metric
     * are opaque to the framework.
     */
    struct Metric final {
        ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<::android::hardware::drm::V1_1::DrmMetricGroup::Attribute> attributes __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<::android::hardware::drm::V1_1::DrmMetricGroup::Value> values __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Metric, name) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Metric, attributes) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup::Metric, values) == 32, "wrong offset");
    static_assert(sizeof(::android::hardware::drm::V1_1::DrmMetricGroup::Metric) == 48, "wrong size");
    static_assert(__alignof(::android::hardware::drm::V1_1::DrmMetricGroup::Metric) == 8, "wrong alignment");

    /**
     * The list of metrics to be captured.
     */
    ::android::hardware::hidl_vec<::android::hardware::drm::V1_1::DrmMetricGroup::Metric> metrics __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::drm::V1_1::DrmMetricGroup, metrics) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::drm::V1_1::DrmMetricGroup) == 16, "wrong size");
static_assert(__alignof(::android::hardware::drm::V1_1::DrmMetricGroup) == 8, "wrong alignment");

/**
 * HDCP specifications are defined by Digital Content Protection LLC (DCP).
 *   "HDCP Specification Rev. 2.2 Interface Independent Adaptation"
 *   "HDCP 2.2 on HDMI Specification"
 */
enum class HdcpLevel : uint32_t {
    /**
     * Unable to determine the HDCP level
     */
    HDCP_UNKNOWN = 0u,
    /**
     * No HDCP, output is unprotected
     */
    HDCP_NONE = 1u /* ::android::hardware::drm::V1_1::HdcpLevel.HDCP_UNKNOWN implicitly + 1 */,
    /**
     * HDCP version 1.0
     */
    HDCP_V1 = 2u /* ::android::hardware::drm::V1_1::HdcpLevel.HDCP_NONE implicitly + 1 */,
    /**
     * HDCP version 2.0 Type 1.
     */
    HDCP_V2 = 3u /* ::android::hardware::drm::V1_1::HdcpLevel.HDCP_V1 implicitly + 1 */,
    /**
     * HDCP version 2.1 Type 1.
     */
    HDCP_V2_1 = 4u /* ::android::hardware::drm::V1_1::HdcpLevel.HDCP_V2 implicitly + 1 */,
    /**
     *  HDCP version 2.2 Type 1.
     */
    HDCP_V2_2 = 5u /* ::android::hardware::drm::V1_1::HdcpLevel.HDCP_V2_1 implicitly + 1 */,
    /**
     * No digital output, implicitly secure
     */
    HDCP_NO_OUTPUT = 6u /* ::android::hardware::drm::V1_1::HdcpLevel.HDCP_V2_2 implicitly + 1 */,
};

/**
 * KeyRequestTypes (in addition to those from 1.0) which allow an app
 * to determine the type of a key request returned from getKeyRequest.
 */
enum class KeyRequestType : uint32_t {
    /**
     * Key request type is for an initial license request
     */
    INITIAL = 0u,
    /**
     * Key request type is for license renewal. Renewal requests are used
     * to extend the validity period for streaming keys.
     */
    RENEWAL = 1u /* ::android::hardware::drm::V1_0::KeyRequestType.INITIAL implicitly + 1 */,
    /**
     * Key request type is a release. A key release causes offline keys
     * to become available for streaming.
     */
    RELEASE = 2u /* ::android::hardware::drm::V1_0::KeyRequestType.RENEWAL implicitly + 1 */,
    /**
     * Key request type is unknown due to some error condition.
     */
    UNKNOWN = 3u /* ::android::hardware::drm::V1_0::KeyRequestType.RELEASE implicitly + 1 */,
    /**
     * Keys are already loaded. No key request is needed.
     */
    NONE = 4u /* ::android::hardware::drm::V1_0::KeyRequestType.UNKNOWN implicitly + 1 */,
    /**
     * Keys have previously been loaded. An additional (non-renewal) license
     * request is needed.
     */
    UPDATE = 5u /* ::android::hardware::drm::V1_1::KeyRequestType.NONE implicitly + 1 */,
};

enum class SecurityLevel : uint32_t {
    /**
     * Unable to determine the security level
     */
    UNKNOWN = 0u,
    /**
     * Software-based whitebox crypto
     */
    SW_SECURE_CRYPTO = 1u /* ::android::hardware::drm::V1_1::SecurityLevel.UNKNOWN implicitly + 1 */,
    /**
     * Software-based whitebox crypto and an obfuscated decoder
     */
    SW_SECURE_DECODE = 2u /* ::android::hardware::drm::V1_1::SecurityLevel.SW_SECURE_CRYPTO implicitly + 1 */,
    /**
     * DRM key management and crypto operations are performed within a
     * hardware backed trusted execution environment
     */
    HW_SECURE_CRYPTO = 3u /* ::android::hardware::drm::V1_1::SecurityLevel.SW_SECURE_DECODE implicitly + 1 */,
    /**
     * DRM key management, crypto operations and decoding of content
     * are performed within a hardware backed trusted execution environment
     */
    HW_SECURE_DECODE = 4u /* ::android::hardware::drm::V1_1::SecurityLevel.HW_SECURE_CRYPTO implicitly + 1 */,
    /**
     * DRM key management, crypto operations, decoding of content and all
     * handling of the media (compressed and uncompressed) is handled within
     * a hardware backed trusted execution environment.
     */
    HW_SECURE_ALL = 5u /* ::android::hardware::drm::V1_1::SecurityLevel.HW_SECURE_DECODE implicitly + 1 */,
};

/**
 * Encapsulates a secure stop release opaque object
 */
struct SecureStopRelease final {
    ::android::hardware::hidl_vec<uint8_t> opaqueData __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::drm::V1_1::SecureStopRelease, opaqueData) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::drm::V1_1::SecureStopRelease) == 16, "wrong size");
static_assert(__alignof(::android::hardware::drm::V1_1::SecureStopRelease) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint8_t o);
static inline std::string toString(::android::hardware::drm::V1_1::DrmMetricGroup::ValueType o);
static inline void PrintTo(::android::hardware::drm::V1_1::DrmMetricGroup::ValueType o, ::std::ostream* os);
constexpr uint8_t operator|(const ::android::hardware::drm::V1_1::DrmMetricGroup::ValueType lhs, const ::android::hardware::drm::V1_1::DrmMetricGroup::ValueType rhs) {
    return static_cast<uint8_t>(static_cast<uint8_t>(lhs) | static_cast<uint8_t>(rhs));
}
constexpr uint8_t operator|(const uint8_t lhs, const ::android::hardware::drm::V1_1::DrmMetricGroup::ValueType rhs) {
    return static_cast<uint8_t>(lhs | static_cast<uint8_t>(rhs));
}
constexpr uint8_t operator|(const ::android::hardware::drm::V1_1::DrmMetricGroup::ValueType lhs, const uint8_t rhs) {
