#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_COMPOSER_V2_1_ICOMPOSERCLIENT_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_COMPOSER_V2_1_ICOMPOSERCLIENT_H

#include <android/hardware/graphics/common/1.0/types.h>
#include <android/hardware/graphics/composer/2.1/IComposerCallback.h>
#include <android/hardware/graphics/composer/2.1/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace graphics {
namespace composer {
namespace V2_1 {

struct IComposerClient : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.graphics.composer@2.1::IComposerClient"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class Attribute : int32_t;
    enum class DisplayRequest : uint32_t;
    enum class LayerRequest : uint32_t;
    enum class PowerMode : int32_t;
    enum class Vsync : int32_t;
    enum class BlendMode : int32_t;
    enum class Composition : int32_t;
    enum class DisplayType : int32_t;
    enum class HandleIndex : int32_t;
    struct Rect;
    struct FRect;
    struct Color;
    enum class Command : int32_t;

    /**
     * Display attributes queryable through getDisplayAttribute.
     */
    enum class Attribute : int32_t {
        INVALID = 0,
        /**
         * Dimensions in pixels
         */
        WIDTH = 1,
        HEIGHT = 2,
        /**
         * Vsync period in nanoseconds
         */
        VSYNC_PERIOD = 3,
        /**
         * Dots per thousand inches (DPI * 1000). Scaling by 1000 allows these
         * numbers to be stored in an int32_t without losing too much
         * precision. If the DPI for a configuration is unavailable or is
         * considered unreliable, the device may return UNSUPPORTED instead.
         */
        DPI_X = 4,
        DPI_Y = 5,
    };

    /**
     * Display requests returned by getDisplayRequests.
     */
    enum class DisplayRequest : uint32_t {
        /**
         * Instructs the client to provide a new client target buffer, even if
         * no layers are marked for client composition.
         */
        FLIP_CLIENT_TARGET = 1u /* 1 << 0 */,
        /**
         * Instructs the client to write the result of client composition
         * directly into the virtual display output buffer. If any of the
         * layers are not marked as Composition::CLIENT or the given display
         * is not a virtual display, this request has no effect.
         */
        WRITE_CLIENT_TARGET_TO_OUTPUT = 2u /* 1 << 1 */,
    };

    /**
     * Layer requests returned from getDisplayRequests.
     */
    enum class LayerRequest : uint32_t {
        /**
         * The client must clear its target with transparent pixels where
         * this layer would be. The client may ignore this request if the
         * layer must be blended.
         */
        CLEAR_CLIENT_TARGET = 1u /* 1 << 0 */,
    };

    /**
     * Power modes for use with setPowerMode.
     */
    enum class PowerMode : int32_t {
        /**
         * The display is fully off (blanked).
         */
        OFF = 0,
        /**
         * These are optional low power modes. getDozeSupport may be called to
         * determine whether a given display supports these modes.
         *
         *
         * The display is turned on and configured in a low power state that
         * is suitable for presenting ambient information to the user,
         * possibly with lower fidelity than ON, but with greater efficiency.
         */
        DOZE = 1,
        /**
         * The display is configured as in DOZE but may stop applying display
         * updates from the client. This is effectively a hint to the device
         * that drawing to the display has been suspended and that the the
         * device must remain on in a low power state and continue
         * displaying its current contents indefinitely until the power mode
         * changes.
         *
         * This mode may also be used as a signal to enable hardware-based
         * doze functionality. In this case, the device is free to take over
         * the display and manage it autonomously to implement a low power
         * always-on display.
         */
        DOZE_SUSPEND = 3,
        /**
         * The display is fully on.
         */
        ON = 2,
    };

    /**
     * Vsync values passed to setVsyncEnabled.
     */
    enum class Vsync : int32_t {
        INVALID = 0,
        /**
         * Enable vsync.
         */
        ENABLE = 1,
        /**
         * Disable vsync.
         */
        DISABLE = 2,
    };

    /**
     * Blend modes, settable per layer.
     */
    enum class BlendMode : int32_t {
        INVALID = 0,
        /**
         * colorOut = colorSrc
         */
        NONE = 1,
        /**
         * colorOut = colorSrc + colorDst * (1 - alphaSrc)
         */
        PREMULTIPLIED = 2,
        /**
         * colorOut = colorSrc * alphaSrc + colorDst * (1 - alphaSrc)
         */
        COVERAGE = 3,
    };

    /**
     * Possible composition types for a given layer.
     */
    enum class Composition : int32_t {
        INVALID = 0,
        /**
         * The client must composite this layer into the client target buffer
         * (provided to the device through setClientTarget).
         *
         * The device must not request any composition type changes for layers
         * of this type.
         */
        CLIENT = 1,
        /**
         * The device must handle the composition of this layer through a
         * hardware overlay or other similar means.
         *
         * Upon validateDisplay, the device may request a change from this
         * type to CLIENT.
         */
        DEVICE = 2,
        /**
         * The device must render this layer using the color set through
         * setLayerColor. If this functionality is not supported on a layer
         * that the client sets to SOLID_COLOR, the device must request that
         * the composition type of that layer is changed to CLIENT upon the
         * next call to validateDisplay.
         *
         * Upon validateDisplay, the device may request a change from this
         * type to CLIENT.
         */
        SOLID_COLOR = 3,
        /**
         * Similar to DEVICE, but the position of this layer may also be set
         * asynchronously through setCursorPosition. If this functionality is
         * not supported on a layer that the client sets to CURSOR, the device
         * must request that the composition type of that layer is changed to
         * CLIENT upon the next call to validateDisplay.
         *
         * Upon validateDisplay, the device may request a change from this
         * type to either DEVICE or CLIENT.  Changing to DEVICE will prevent
         * the use of setCursorPosition but still permit the device to
         * composite the layer.
         */
        CURSOR = 4,
        /**
         * The device must handle the composition of this layer, as well as
         * its buffer updates and content synchronization. Only supported on
         * devices which provide Capability::SIDEBAND_STREAM.
         *
         * Upon validateDisplay, the device may request a change from this
         * type to either DEVICE or CLIENT, but it is unlikely that content
         * will display correctly in these cases.
         */
        SIDEBAND = 5,
    };

    /**
     * Display types returned by getDisplayType.
     */
    enum class DisplayType : int32_t {
        INVALID = 0,
        /**
         * All physical displays, including both internal displays and
         * hotpluggable external displays.
         */
        PHYSICAL = 1,
        /**
         * Virtual displays created by createVirtualDisplay.
         */
        VIRTUAL = 2,
    };

    /**
     * Special index values (always negative) for command queue commands.
     */
    enum class HandleIndex : int32_t {
        /**
         * No handle
         */
        EMPTY = -1 /* -1 */,
        /**
         * Use cached handle
         */
        CACHED = -2 /* -2 */,
    };

    struct Rect final {
        int32_t left __attribute__ ((aligned(4)));
        int32_t top __attribute__ ((aligned(4)));
        int32_t right __attribute__ ((aligned(4)));
        int32_t bottom __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::Rect, left) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::Rect, top) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::Rect, right) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::Rect, bottom) == 12, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::composer::V2_1::IComposerClient::Rect) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::composer::V2_1::IComposerClient::Rect) == 4, "wrong alignment");

    struct FRect final {
        float left __attribute__ ((aligned(4)));
        float top __attribute__ ((aligned(4)));
        float right __attribute__ ((aligned(4)));
        float bottom __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::FRect, left) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::FRect, top) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::FRect, right) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::FRect, bottom) == 12, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::composer::V2_1::IComposerClient::FRect) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::composer::V2_1::IComposerClient::FRect) == 4, "wrong alignment");

    struct Color final {
        uint8_t r __attribute__ ((aligned(1)));
        uint8_t g __attribute__ ((aligned(1)));
        uint8_t b __attribute__ ((aligned(1)));
        uint8_t a __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::Color, r) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::Color, g) == 1, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::Color, b) == 2, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_1::IComposerClient::Color, a) == 3, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::composer::V2_1::IComposerClient::Color) == 4, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::composer::V2_1::IComposerClient::Color) == 1, "wrong alignment");

    /**
     * SELECT_DISPLAY has this pseudo prototype
     *
     *   selectDisplay(Display display);
     *
     * Selects the current display implied by all other commands.
     *
     * @param display is the newly selected display.
     *
     *
     * SELECT_LAYER has this pseudo prototype
     *
     *   selectLayer(Layer layer);
     *
     * Selects the current layer implied by all implicit layer commands.
     *
     * @param layer is the newly selected layer.
     *
     *
     * SET_ERROR has this pseudo prototype
     *
     *   setError(uint32_t location, Error error);
     *
     * Indicates an error generated by a command.
     *
     * @param location is the offset of the command in the input command
     *        message queue.
     * @param error is the error generated by the command.
     *
     *
