#ifndef HIDL_GENERATED_ANDROID_HARDWARE_SOUNDTRIGGER_V2_0_ISOUNDTRIGGERHW_H
#define HIDL_GENERATED_ANDROID_HARDWARE_SOUNDTRIGGER_V2_0_ISOUNDTRIGGERHW_H

#include <android/hardware/audio/common/2.0/types.h>
#include <android/hardware/soundtrigger/2.0/ISoundTriggerHwCallback.h>
#include <android/hardware/soundtrigger/2.0/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace soundtrigger {
namespace V2_0 {

struct ISoundTriggerHw : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.soundtrigger@2.0::ISoundTriggerHw"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    struct Properties;
    struct SoundModel;
    struct Phrase;
    struct PhraseSoundModel;
    struct RecognitionConfig;

    /**
     * Sound trigger implementation descriptor read by the framework via
     * getProperties(). Used by SoundTrigger service to report to applications
     * and manage concurrency and policy.
     */
    struct Properties final {
        /**
         * Implementor name
         */
        ::android::hardware::hidl_string implementor __attribute__ ((aligned(8)));
        /**
         * Implementation description
         */
        ::android::hardware::hidl_string description __attribute__ ((aligned(8)));
        /**
         * Implementation version
         */
        uint32_t version __attribute__ ((aligned(4)));
        /**
         * Unique implementation ID. The UUID must change with each version of
         * the engine implementation
         */
        ::android::hardware::audio::common::V2_0::Uuid uuid __attribute__ ((aligned(4)));
        /**
         * Maximum number of concurrent sound models loaded
         */
        uint32_t maxSoundModels __attribute__ ((aligned(4)));
        /**
         * Maximum number of key phrases
         */
        uint32_t maxKeyPhrases __attribute__ ((aligned(4)));
        /**
         * Maximum number of concurrent users detected
         */
        uint32_t maxUsers __attribute__ ((aligned(4)));
        /**
         * All supported modes. e.g RecognitionMode.VOICE_TRIGGER
         */
        uint32_t recognitionModes __attribute__ ((aligned(4)));
        /**
         * Supports seamless transition from detection to capture
         */
        bool captureTransition __attribute__ ((aligned(1)));
        /**
         * Maximum buffering capacity in ms if captureTransition is true
         */
        uint32_t maxBufferMs __attribute__ ((aligned(4)));
        /**
         * Supports capture by other use cases while detection is active
         */
        bool concurrentCapture __attribute__ ((aligned(1)));
        /**
         * Returns the trigger capture in event
         */
        bool triggerInEvent __attribute__ ((aligned(1)));
        /**
         * Rated power consumption when detection is active with TDB
         * silence/sound/speech ratio
         */
        uint32_t powerConsumptionMw __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, implementor) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, description) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, version) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, uuid) == 36, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, maxSoundModels) == 52, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, maxKeyPhrases) == 56, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, maxUsers) == 60, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, recognitionModes) == 64, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, captureTransition) == 68, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, maxBufferMs) == 72, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, concurrentCapture) == 76, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, triggerInEvent) == 77, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties, powerConsumptionMw) == 80, "wrong offset");
    static_assert(sizeof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties) == 88, "wrong size");
    static_assert(__alignof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties) == 8, "wrong alignment");

    /**
     * Base sound model descriptor. This struct is the header of a larger block
     * passed to loadSoundModel() and contains the binary data of the
     * sound model.
     */
    struct SoundModel final {
        /**
         * Model type. e.g. SoundModelType.KEYPHRASE
         */
        ::android::hardware::soundtrigger::V2_0::SoundModelType type __attribute__ ((aligned(4)));
        /**
         * Unique sound model ID.
         */
        ::android::hardware::audio::common::V2_0::Uuid uuid __attribute__ ((aligned(4)));
        /**
         * Unique vendor ID. Identifies the engine the sound model
         * was build for
         */
        ::android::hardware::audio::common::V2_0::Uuid vendorUuid __attribute__ ((aligned(4)));
        /**
         * Opaque data transparent to Android framework
         */
        ::android::hardware::hidl_vec<uint8_t> data __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::SoundModel, type) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::SoundModel, uuid) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::SoundModel, vendorUuid) == 20, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::SoundModel, data) == 40, "wrong offset");
    static_assert(sizeof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::SoundModel) == 56, "wrong size");
    static_assert(__alignof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::SoundModel) == 8, "wrong alignment");

    /**
     * Key phrase descriptor
     */
    struct Phrase final {
        /**
         * Unique keyphrase ID assigned at enrollment time
         */
        uint32_t id __attribute__ ((aligned(4)));
        /**
         * Recognition modes supported by this key phrase
         */
        uint32_t recognitionModes __attribute__ ((aligned(4)));
        /**
         * List of users IDs associated with this key phrase
         */
        ::android::hardware::hidl_vec<uint32_t> users __attribute__ ((aligned(8)));
        /**
         * Locale - Java Locale style (e.g. en_US)
         */
        ::android::hardware::hidl_string locale __attribute__ ((aligned(8)));
        /**
         * Phrase text in UTF-8 format.
         */
        ::android::hardware::hidl_string text __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Phrase, id) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Phrase, recognitionModes) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Phrase, users) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Phrase, locale) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Phrase, text) == 40, "wrong offset");
    static_assert(sizeof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Phrase) == 56, "wrong size");
    static_assert(__alignof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Phrase) == 8, "wrong alignment");

    /**
     * Specialized sound model for key phrase detection.
     * Proprietary representation of key phrases in binary data must match
     * information indicated by phrases field
     */
    struct PhraseSoundModel final {
        /**
         * Common part of sound model descriptor
         */
        ::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::SoundModel common __attribute__ ((aligned(8)));
        /**
         * List of descriptors for key phrases supported by this sound model
         */
        ::android::hardware::hidl_vec<::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Phrase> phrases __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::PhraseSoundModel, common) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::PhraseSoundModel, phrases) == 56, "wrong offset");
    static_assert(sizeof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::PhraseSoundModel) == 72, "wrong size");
    static_assert(__alignof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::PhraseSoundModel) == 8, "wrong alignment");

    /**
     * Configuration for sound trigger capture session passed to
     * startRecognition() method
     */
    struct RecognitionConfig final {
        /**
         * IO handle that will be used for capture. N/A if captureRequested
         * is false
         */
        int32_t captureHandle __attribute__ ((aligned(4)));
        /**
         * Input device requested for detection capture
         */
        ::android::hardware::audio::common::V2_0::AudioDevice captureDevice __attribute__ ((aligned(4)));
        /**
         * Capture and buffer audio for this recognition instance
         */
        bool captureRequested __attribute__ ((aligned(1)));
        /**
         * Configuration for each key phrase
         */
        ::android::hardware::hidl_vec<::android::hardware::soundtrigger::V2_0::PhraseRecognitionExtra> phrases __attribute__ ((aligned(8)));
        /**
         * Opaque capture configuration data transparent to the framework
         */
        ::android::hardware::hidl_vec<uint8_t> data __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::RecognitionConfig, captureHandle) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::RecognitionConfig, captureDevice) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::RecognitionConfig, captureRequested) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::RecognitionConfig, phrases) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::RecognitionConfig, data) == 32, "wrong offset");
    static_assert(sizeof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::RecognitionConfig) == 48, "wrong size");
    static_assert(__alignof(::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::RecognitionConfig) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Return callback for getProperties
     */
    using getProperties_cb = std::function<void(int32_t retval, const ::android::hardware::soundtrigger::V2_0::ISoundTriggerHw::Properties& properties)>;
    /**
     * Retrieve implementation properties.
     * @return retval Operation completion status: 0 in case of success,
     *                -ENODEV in case of initialization error.
     * @return properties A Properties structure containing implementation
     *                    description and capabilities.
     */
    virtual ::android::hardware::Return<void> getProperties(getProperties_cb _hidl_cb) = 0;

    /**
     * Return callback for loadSoundModel
     */
