{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA44_h",
   "name" : "unsigned char [44]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA44_h",
   "size" : 44,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA60_h",
   "name" : "unsigned char [60]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA60_h",
   "size" : 60,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA8_j",
   "name" : "unsigned int [8]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA8_j",
   "size" : 32,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",

   "name" : "int (*)(pcm_plugin *, void *, unsigned int)",
   "referenced_type" : "_ZTIFiP10pcm_pluginPvjE",
   "self_type" : "_ZTIPFiP10pcm_pluginPvjE",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/pcm_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiP10pcm_pluginiPvE",
   "name" : "int (*)(pcm_plugin *, int, void *)",
   "referenced_type" : "_ZTIFiP10pcm_pluginiPvE",
   "self_type" : "_ZTIPFiP10pcm_pluginiPvE",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/pcm_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiP12mixer_pluginP11snd_controlP11snd_ctl_tlvE",
   "name" : "int (*)(mixer_plugin *, snd_control *, snd_ctl_tlv *)",
   "referenced_type" : "_ZTIFiP12mixer_pluginP11snd_controlP11snd_ctl_tlvE",
   "self_type" : "_ZTIPFiP12mixer_pluginP11snd_controlP11snd_ctl_tlvE",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiP12mixer_pluginP11snd_controlP18snd_ctl_elem_valueE",
   "name" : "int (*)(mixer_plugin *, snd_control *, snd_ctl_elem_value *)",
   "referenced_type" : "_ZTIFiP12mixer_pluginP11snd_controlP18snd_ctl_elem_valueE",
   "self_type" : "_ZTIPFiP12mixer_pluginP11snd_controlP18snd_ctl_elem_valueE",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiP12mixer_pluginP9ctl_eventjE",
   "name" : "int (*)(mixer_plugin *, ctl_event *, unsigned int)",
   "referenced_type" : "_ZTIFiP12mixer_pluginP9ctl_eventjE",
   "self_type" : "_ZTIPFiP12mixer_pluginP9ctl_eventjE",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiP12mixer_pluginPFvS0_EE",
   "name" : "int (*)(mixer_plugin *, void (*)(mixer_plugin *))",
   "referenced_type" : "_ZTIFiP12mixer_pluginPFvS0_EE",
   "self_type" : "_ZTIPFiP12mixer_pluginPFvS0_EE",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP12mixer_pluginE",
   "name" : "void (*)(mixer_plugin *)",
   "referenced_type" : "_ZTIFvP12mixer_pluginE",
   "self_type" : "_ZTIPFvP12mixer_pluginE",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvPP12mixer_pluginE",
   "name" : "void (*)(mixer_plugin **)",
   "referenced_type" : "_ZTIFvPP12mixer_pluginE",
   "self_type" : "_ZTIPFvPP12mixer_pluginE",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK10pcm_params",
   "name" : "const pcm_params *",
   "referenced_type" : "_ZTIK10pcm_params",
   "self_type" : "_ZTIPK10pcm_params",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP12mixer_plugin",
   "name" : "mixer_plugin **",
   "referenced_type" : "_ZTIP12mixer_plugin",
   "self_type" : "_ZTIPP12mixer_plugin",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPc",
   "name" : "char **",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIPPc",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/pcm_plugin.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK10pcm_params",
   "name" : "const pcm_params",
   "referenced_type" : "_ZTI10pcm_params",
   "self_type" : "_ZTIK10pcm_params",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "channels",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "period_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "period_count",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10pcm_format"
    },
    {
     "field_name" : "start_threshold",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stop_threshold",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "silence_threshold",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "silence_size",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "avail_min",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10pcm_config",
   "name" : "pcm_config",
   "referenced_type" : "_ZTI10pcm_config",
   "self_type" : "_ZTI10pcm_config",
   "size" : 40,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "card",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14pcm_plugin_ops"
    },
    {
     "field_name" : "constraints",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP25pcm_plugin_hw_constraints"
    },
    {
     "field_name" : "node",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "mode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priv",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "state",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10pcm_plugin",
   "name" : "pcm_plugin",
   "referenced_type" : "_ZTI10pcm_plugin",
   "self_type" : "_ZTI10pcm_plugin",
   "size" : 28,
   "source_file" : "external/tinyalsa/include/tinyalsa/pcm_plugin.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "numid",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "iface",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "device",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "subdevice",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA44_h"
    },
    {
     "field_name" : "index",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11ctl_elem_id",
   "name" : "ctl_elem_id",
   "referenced_type" : "_ZTI11ctl_elem_id",
   "self_type" : "_ZTI11ctl_elem_id",
   "size" : 64,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "iface",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "access",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "type",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "value",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "get",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiP12mixer_pluginP11snd_controlP18snd_ctl_elem_valueE"
    },
    {
     "field_name" : "put",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP12mixer_pluginP11snd_controlP18snd_ctl_elem_valueE"
    },
    {
     "field_name" : "private_value",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "private_data",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI11snd_control",
   "name" : "snd_control",
   "referenced_type" : "_ZTI11snd_control",
   "self_type" : "_ZTI11snd_control",
   "size" : 36,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "card",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP16mixer_plugin_ops"
    },
    {
     "field_name" : "priv",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "eventfd",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "subscribed",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "event_cnt",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "controls",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP11snd_control"
    },
    {
     "field_name" : "num_controls",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12mixer_plugin",
   "name" : "mixer_plugin",
   "referenced_type" : "_ZTI12mixer_plugin",
   "self_type" : "_ZTI12mixer_plugin",
   "size" : 32,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "max",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "step",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI13snd_value_int",
   "name" : "snd_value_int",
   "referenced_type" : "_ZTI13snd_value_int",
   "self_type" : "_ZTI13snd_value_int",
   "size" : 16,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "close",
     "referenced_type" : "_ZTIPFiP10pcm_pluginE"
    },
    {
     "field_name" : "hw_params",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiP10pcm_pluginP17snd_pcm_hw_paramsE"
    },
    {
     "field_name" : "sw_params",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiP10pcm_pluginP17snd_pcm_sw_paramsE"
    },
    {
     "field_name" : "sync_ptr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP10pcm_pluginP16snd_pcm_sync_ptrE"
    },
    {
     "field_name" : "writei_frames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP10pcm_pluginP9snd_xferiE"
    },
    {
     "field_name" : "readi_frames",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiP10pcm_pluginP9snd_xferiE"
    },
    {
     "field_name" : "ttstamp",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP10pcm_pluginPiE"
    },
    {
     "field_name" : "prepare",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP10pcm_pluginE"
    },
    {
     "field_name" : "start",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP10pcm_pluginE"
    },
    {
     "field_name" : "drop",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFiP10pcm_pluginE"
    },
    {
     "field_name" : "ioctl",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP10pcm_pluginiPvE"
    },
    {
     "field_name" : "mmap",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFPvP10pcm_pluginS_jiilE"
    },
    {
     "field_name" : "munmap",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFiP10pcm_pluginPvjE"
    },
    {
     "field_name" : "poll",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFiP10pcm_pluginP6pollfdjiE"
    }
   ],
   "linker_set_key" : "_ZTI14pcm_plugin_ops",
   "name" : "pcm_plugin_ops",
   "referenced_type" : "_ZTI14pcm_plugin_ops",
   "self_type" : "_ZTI14pcm_plugin_ops",
   "size" : 56,
   "source_file" : "external/tinyalsa/include/tinyalsa/pcm_plugin.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "items",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "texts",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPc"
    }
   ],
   "linker_set_key" : "_ZTI14snd_value_enum",
   "name" : "snd_value_enum",
   "referenced_type" : "_ZTI14snd_value_enum",
   "self_type" : "_ZTI14snd_value_enum",
   "size" : 8,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15snd_value_bytes",
   "name" : "snd_value_bytes",
   "referenced_type" : "_ZTI15snd_value_bytes",
   "self_type" : "_ZTI15snd_value_bytes",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "close",
     "referenced_type" : "_ZTIPFvPP12mixer_pluginE"
    },
    {
     "field_name" : "subscribe_events",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiP12mixer_pluginPFvS0_EE"
    },
    {
     "field_name" : "read_event",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiP12mixer_pluginP9ctl_eventjE"
    }
   ],
   "linker_set_key" : "_ZTI16mixer_plugin_ops",
   "name" : "mixer_plugin_ops",
   "referenced_type" : "_ZTI16mixer_plugin_ops",
   "self_type" : "_ZTI16mixer_plugin_ops",
   "size" : 12,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "min",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "max",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18pcm_plugin_min_max",
   "name" : "pcm_plugin_min_max",
   "referenced_type" : "_ZTI18pcm_plugin_min_max",
   "self_type" : "_ZTI18pcm_plugin_min_max",
   "size" : 8,
   "source_file" : "external/tinyalsa/include/tinyalsa/pcm_plugin.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "get",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiP12mixer_pluginP11snd_controlP11snd_ctl_tlvE"
    },
    {
     "field_name" : "put",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiP12mixer_pluginP11snd_controlP11snd_ctl_tlvE"
    }
   ],
   "linker_set_key" : "_ZTI19snd_value_tlv_bytes",
   "name" : "snd_value_tlv_bytes",
   "referenced_type" : "_ZTI19snd_value_tlv_bytes",
   "self_type" : "_ZTI19snd_value_tlv_bytes",
   "size" : 12,
   "source_file" : "external/tinyalsa/include/tinyalsa/mixer_plugin.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "access",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "bit_width",
     "field_offset" : 128,
     "referenced_type" : "_ZTI18pcm_plugin_min_max"
    },
    {
     "field_name" : "channels",
     "field_offset" : 192,
     "referenced_type" : "_ZTI18pcm_plugin_min_max"
    },
    {
     "field_name" : "rate",
     "field_offset" : 256,
     "referenced_type" : "_ZTI18pcm_plugin_min_max"
    },
    {
     "field_name" : "periods",
     "field_offset" : 320,
     "referenced_type" : "_ZTI18pcm_plugin_min_max"
    },
    {
     "field_name" : "period_bytes",
     "field_offset" : 384,
     "referenced_type" : "_ZTI18pcm_plugin_min_max"
    }
   ],
   "linker_set_key" : "_ZTI25pcm_plugin_hw_constraints",
   "name" : "pcm_plugin_hw_constraints",
   "referenced_type" : "_ZTI25pcm_plugin_hw_constraints",
   "self_type" : "_ZTI25pcm_plugin_hw_constraints",
   "size" : 56,
   "source_file" : "external/tinyalsa/include/tinyalsa/pcm_plugin.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bits",
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI8pcm_mask",
   "name" : "pcm_mask",
   "referenced_type" : "_ZTI8pcm_mask",
   "self_type" : "_ZTI8pcm_mask",
   "size" : 32,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN9ctl_eventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI9ctl_event",
   "name" : "ctl_event",
   "referenced_type" : "_ZTI9ctl_event",
   "self_type" : "_ZTI9ctl_event",
   "size" : 72,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "elem",
     "referenced_type" : "_ZTIN9ctl_eventUt_Ut_E"
    },
    {
     "field_name" : "data8",
     "referenced_type" : "_ZTIA60_h"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9ctl_eventUt_E",
   "name" : "ctl_event::(anonymous union at external/tinyalsa/include/tinyalsa/asoundlib.h:172:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9ctl_eventUt_E",
   "self_type" : "_ZTIN9ctl_eventUt_E",
   "size" : 68,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mask",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "id",
     "field_offset" : 32,
     "referenced_type" : "_ZTI11ctl_elem_id"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9ctl_eventUt_Ut_E",
   "name" : "ctl_event::(anonymous union at external/tinyalsa/include/tinyalsa/asoundlib.h:172:3)::(anonymous struct at external/tinyalsa/include/tinyalsa/asoundlib.h:173:5)",
   "referenced_type" : "_ZTIN9ctl_eventUt_Ut_E",
   "self_type" : "_ZTIN9ctl_eventUt_Ut_E",
   "size" : 68,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "rvalue_reference_types" : []
}
