{
 "array_types" :
 [
  {
   "linker_set_key" : "_ZTIA_c",
   "name" : "char []",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA_c",
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIt",
   "name" : "unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIt",
   "size" : 2
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" :
 [
  {

   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 4,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/Wrap/BCHeaderField.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKj",
   "name" : "const unsigned int *",
   "referenced_type" : "_ZTIKj",
   "self_type" : "_ZTIPKj",
   "size" : 4,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN6bcinfo17MetadataExtractor6ReduceE",
   "name" : "bcinfo::MetadataExtractor::Reduce *",
   "referenced_type" : "_ZTIN6bcinfo17MetadataExtractor6ReduceE",
   "self_type" : "_ZTIPN6bcinfo17MetadataExtractor6ReduceE",
   "size" : 4,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN6bcinfo17MetadataExtractorE",
   "name" : "bcinfo::MetadataExtractor *",
   "referenced_type" : "_ZTIN6bcinfo17MetadataExtractorE",
   "self_type" : "_ZTIPN6bcinfo17MetadataExtractorE",
   "size" : 4,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPKc",
   "name" : "const char **",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIPPKc",
   "size" : 4,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/Wrap/BCHeaderField.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPt",
   "name" : "unsigned short *",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIPt",
   "size" : 4,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/Wrap/BCHeaderField.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIA_Kc",
   "name" : "char const[]",
   "referenced_type" : "_ZTIA_c",
   "self_type" : "_ZTIA_Kc",
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13BCHeaderField",
   "name" : "const BCHeaderField",
   "referenced_type" : "_ZTI13BCHeaderField",
   "self_type" : "_ZTIK13BCHeaderField",
   "size" : 12,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/Wrap/BCHeaderField.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4llvm11NamedMDNodeE",
   "name" : "const llvm::NamedMDNode",
   "referenced_type" : "_ZTIN4llvm11NamedMDNodeE",
   "self_type" : "_ZTIKN4llvm11NamedMDNodeE",
   "size" : 28,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4llvm6ModuleE",
   "name" : "const llvm::Module",
   "referenced_type" : "_ZTIN4llvm6ModuleE",
   "self_type" : "_ZTIKN4llvm6ModuleE",
   "size" : 476,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4llvm8FunctionE",
   "name" : "const llvm::Function",
   "referenced_type" : "_ZTIN4llvm8FunctionE",
   "self_type" : "_ZTIKN4llvm8FunctionE",
   "size" : 84,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6bcinfo14BitcodeWrapperE",
   "name" : "const bcinfo::BitcodeWrapper",
   "referenced_type" : "_ZTIN6bcinfo14BitcodeWrapperE",
   "self_type" : "_ZTIKN6bcinfo14BitcodeWrapperE",
   "size" : 28,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/BitcodeWrapper.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6bcinfo17MetadataExtractor6ReduceE",
   "name" : "const bcinfo::MetadataExtractor::Reduce",
   "referenced_type" : "_ZTIN6bcinfo17MetadataExtractor6ReduceE",
   "self_type" : "_ZTIKN6bcinfo17MetadataExtractor6ReduceE",
   "size" : 36,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6bcinfo17MetadataExtractorE",
   "name" : "const bcinfo::MetadataExtractor",
   "referenced_type" : "_ZTIN6bcinfo17MetadataExtractorE",
   "self_type" : "_ZTIKN6bcinfo17MetadataExtractorE",
   "size" : 96,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/Wrap/BCHeaderField.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ID_",
     "referenced_type" : "_ZTIN13BCHeaderField3TagE"
    },
    {
     "access" : "private",
     "field_name" : "len_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    }
   ],
   "linker_set_key" : "_ZTI13BCHeaderField",
   "name" : "BCHeaderField",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13BCHeaderField",
   "self_type" : "_ZTI13BCHeaderField",
   "size" : 12,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/Wrap/BCHeaderField.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFileType",
     "referenced_type" : "_ZTIN6bcinfo10BCFileTypeE"
    },
    {
     "access" : "private",
     "field_name" : "mBitcode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "mBitcodeSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mHeaderVersion",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mTargetAPI",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mCompilerVersion",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOptimizationLevel",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN6bcinfo14BitcodeWrapperE",
   "name" : "bcinfo::BitcodeWrapper",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6bcinfo14BitcodeWrapperE",
   "self_type" : "_ZTIN6bcinfo14BitcodeWrapperE",
   "size" : 28,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/BitcodeWrapper.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mReduceName",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "mInitializerName",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "mAccumulatorName",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "mCombinerName",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "mOutConverterName",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "mHalterName",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "mSignature",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mInputCount",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mAccumulatorDataSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN6bcinfo17MetadataExtractor6ReduceE",
   "name" : "bcinfo::MetadataExtractor::Reduce",
   "referenced_type" : "_ZTIN6bcinfo17MetadataExtractor6ReduceE",
   "self_type" : "_ZTIN6bcinfo17MetadataExtractor6ReduceE",
   "size" : 36,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mModule",
     "referenced_type" : "_ZTIPKN4llvm6ModuleE"
    },
    {
     "access" : "private",
     "field_name" : "mBitcode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "mBitcodeSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mExportVarCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mExportFuncCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mExportForEachSignatureCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mExportReduceCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mExportVarNameList",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "access" : "private",
     "field_name" : "mExportFuncNameList",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "access" : "private",
     "field_name" : "mExportForEachNameList",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "access" : "private",
     "field_name" : "mExportForEachSignatureList",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "access" : "private",
     "field_name" : "mExportForEachInputCountList",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "access" : "private",
     "field_name" : "mExportReduceList",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKN6bcinfo17MetadataExtractor6ReduceE"
    },
    {
     "access" : "private",
     "field_name" : "mPragmaCount",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mPragmaKeyList",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "access" : "private",
     "field_name" : "mPragmaValueList",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "access" : "private",
     "field_name" : "mObjectSlotCount",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mObjectSlotList",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "access" : "private",
     "field_name" : "mCompilerVersion",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOptimizationLevel",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mRSFloatPrecision",
     "field_offset" : 640,
     "referenced_type" : "_ZTIN6bcinfo16RSFloatPrecisionE"
    },
    {
     "access" : "private",
     "field_name" : "mIsThreadable",
     "field_offset" : 672,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mBuildChecksum",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "mHasDebugInfo",
     "field_offset" : 736,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6bcinfo17MetadataExtractorE",
   "name" : "bcinfo::MetadataExtractor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6bcinfo17MetadataExtractorE",
   "self_type" : "_ZTIN6bcinfo17MetadataExtractorE",
   "size" : 96,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/MetadataExtractor.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Magic",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Version",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "BitcodeOffset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "BitcodeSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "HeaderVersion",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "TargetAPI",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "PNaClVersion",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "CompilerVersionTag",
     "field_offset" : 224,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "CompilerVersionLen",
     "field_offset" : 240,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "CompilerVersion",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "OptimizationLevelTag",
     "field_offset" : 288,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "OptimizationLevelLen",
     "field_offset" : 304,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "OptimizationLevel",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN6bcinfo21AndroidBitcodeWrapperE",
   "name" : "bcinfo::AndroidBitcodeWrapper",
   "referenced_type" : "_ZTIN6bcinfo21AndroidBitcodeWrapperE",
   "self_type" : "_ZTIN6bcinfo21AndroidBitcodeWrapperE",
   "size" : 44,
   "source_file" : "frameworks/compile/libbcc/bcinfo/include/bcinfo/BitcodeWrapper.h"
  }
 ],
 "rvalue_reference_types" : []
}
