#ifndef HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_2_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_2_TYPES_H

#include <android/hardware/radio/1.0/types.h>
#include <android/hardware/radio/1.1/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace radio {
namespace V1_2 {

// Forward declaration for forward reference support:
enum class RadioConst : int32_t;
enum class ScanIntervalRange : int32_t;
enum class MaxSearchTimeRange : int32_t;
enum class IncrementalResultsPeriodicityRange : int32_t;
enum class CellConnectionStatus : int32_t;
enum class IndicationFilter : int32_t;
enum class AudioQuality : int32_t;
struct NetworkScanRequest;
struct NetworkScanResult;
struct CellIdentityOperatorNames;
struct CellIdentityCdma;
struct CellIdentityGsm;
struct CellIdentityLte;
struct CellIdentityTdscdma;
struct CellIdentityWcdma;
struct CellInfoGsm;
struct WcdmaSignalStrength;
struct CellInfoWcdma;
struct CellInfoCdma;
struct CellInfoLte;
struct TdscdmaSignalStrength;
struct CellInfoTdscdma;
struct CellInfo;
struct CardStatus;
struct LinkCapacityEstimate;
struct PhysicalChannelConfig;
enum class AccessNetwork : int32_t;
enum class DataRequestReason : int32_t;
struct Call;
struct SignalStrength;
struct CellIdentity;
struct VoiceRegStateResult;
struct DataRegStateResult;

// Order of inner types was changed for forward reference support.

enum class RadioConst : int32_t {
    CDMA_ALPHA_INFO_BUFFER_LENGTH = 64,
    CDMA_NUMBER_INFO_BUFFER_LENGTH = 81,
    MAX_RILDS = 3,
    MAX_SOCKET_NAME_LENGTH = 6,
    MAX_CLIENT_ID_LENGTH = 2,
    MAX_DEBUG_SOCKET_NAME_LENGTH = 12,
    MAX_QEMU_PIPE_NAME_LENGTH = 11,
    MAX_UUID_LENGTH = 64,
    CARD_MAX_APPS = 8,
    CDMA_MAX_NUMBER_OF_INFO_RECS = 10,
    SS_INFO_MAX = 4,
    NUM_SERVICE_CLASSES = 7,
    NUM_TX_POWER_LEVELS = 5,
    RADIO_ACCESS_SPECIFIER_MAX_SIZE = 8,
};

/**
 * values are in seconds
 */
enum class ScanIntervalRange : int32_t {
    MIN = 5,
    MAX = 300,
};

/**
 * value are in seconds
 */
enum class MaxSearchTimeRange : int32_t {
    MIN = 60,
    MAX = 3600,
};

/**
 * values are in seconds
 */
enum class IncrementalResultsPeriodicityRange : int32_t {
    MIN = 1,
    MAX = 10,
};

enum class CellConnectionStatus : int32_t {
    /**
     * Cell is not a serving cell.
     */
    NONE = 0,
    /**
     * UE has connection to cell for signalling and possibly data (3GPP 36.331, 25.331).
     */
    PRIMARY_SERVING = 1 /* ::android::hardware::radio::V1_2::CellConnectionStatus.NONE implicitly + 1 */,
    /**
     * UE has connection to cell for data (3GPP 36.331, 25.331).
     */
    SECONDARY_SERVING = 2 /* ::android::hardware::radio::V1_2::CellConnectionStatus.PRIMARY_SERVING implicitly + 1 */,
};

/**
 * Overwritten from @1.0::IndicationFilter in order to redefine ALL. In the future, this should
 * be extended instead of overwritten.
 */
enum class IndicationFilter : int32_t {
    NONE = 0,
    ALL = -1 /* ~0 */,
    /**
     * When this bit is set, modem must send the signal strength update through
     * IRadioIndication.currentSignalStrength() when all criteria specified by
     * IRadio.setSignalStrengthReportingCriteria() are met.
     */
    SIGNAL_STRENGTH = 1 /* 1 << 0 */,
    /**
     * When this bit is set, modem must invoke IRadioIndication.networkStateChanged() when any field
     * in VoiceRegStateResult or DataRegStateResult changes. When this bit is not set, modem must
     * suppress IRadioIndication.networkStateChanged() when there are only changes from
     * insignificant fields. Modem must invoke IRadioIndication.networkStateChanged() when
     * significant fields are updated regardless of whether this bit is set.
     *
     * The following fields are considered significant: VoiceRegStateResult.regState,
     * VoiceRegStateResult.rat, DataRegStateResult.regState, DataRegStateResult.rat.
     */
    FULL_NETWORK_STATE = 2 /* 1 << 1 */,
    /**
     * When this bit is set, modem must send IRadioIndication.dataCallListChanged() whenever any
     * field in ITypes.SetupDataCallResult changes. When this bit is not set, modem must suppress
     * the indication when the only changed field is 'active' (for data dormancy). For all other
     * field changes, the modem must send IRadioIndication.dataCallListChanged() regardless of
     * whether this bit is set.
     */
    DATA_CALL_DORMANCY_CHANGED = 4 /* 1 << 2 */,
    /**
     * When this bit is set, modem must send the link capacity update through
     * IRadioIndication.currentLinkCapacityEstimate() when all criteria specified by
     * IRadio.setLinkCapacityReportingCriteria() are met.
     */
    LINK_CAPACITY_ESTIMATE = 8 /* 1 << 3 */,
    /**
     * When this bit is set, the modem must send the physical channel configuration update through
     * IRadioIndication.currentPhysicalChannelConfigs() when the configuration has changed. It is
     * recommended that this be reported whenever link capacity or signal strength is reported.
     */
    PHYSICAL_CHANNEL_CONFIG = 16 /* 1 << 4 */,
};

/**
 * Audio codec which is used on GSM, UMTS, and CDMA. These values must be opaque
 * to the Android framework. Only for display.
 */
enum class AudioQuality : int32_t {
    /**
     * Unspecified audio codec
     */
    UNSPECIFIED = 0,
    /**
     * AMR (Narrowband) audio codec
     */
    AMR = 1 /* ::android::hardware::radio::V1_2::AudioQuality.UNSPECIFIED implicitly + 1 */,
    /**
     * AMR (Wideband) audio codec
     */
    AMR_WB = 2 /* ::android::hardware::radio::V1_2::AudioQuality.AMR implicitly + 1 */,
    /**
     * GSM Enhanced Full-Rate audio codec
     */
    GSM_EFR = 3 /* ::android::hardware::radio::V1_2::AudioQuality.AMR_WB implicitly + 1 */,
    /**
     * GSM Full-Rate audio codec
     */
    GSM_FR = 4 /* ::android::hardware::radio::V1_2::AudioQuality.GSM_EFR implicitly + 1 */,
    /**
     * GSM Half-Rate audio codec
     */
    GSM_HR = 5 /* ::android::hardware::radio::V1_2::AudioQuality.GSM_FR implicitly + 1 */,
    /**
     * Enhanced Variable rate codec
     */
    EVRC = 6 /* ::android::hardware::radio::V1_2::AudioQuality.GSM_HR implicitly + 1 */,
    /**
     * Enhanced Variable rate codec revision B
     */
    EVRC_B = 7 /* ::android::hardware::radio::V1_2::AudioQuality.EVRC implicitly + 1 */,
    /**
     * Enhanced Variable rate codec (Wideband)
     */
    EVRC_WB = 8 /* ::android::hardware::radio::V1_2::AudioQuality.EVRC_B implicitly + 1 */,
    /**
     * Enhanced Variable rate codec (Narrowband)
     */
    EVRC_NW = 9 /* ::android::hardware::radio::V1_2::AudioQuality.EVRC_WB implicitly + 1 */,
};

struct NetworkScanRequest final {
    ::android::hardware::radio::V1_1::ScanType type __attribute__ ((aligned(4)));
    /**
     * Time interval in seconds between the completion of one scan and the start of a subsequent scan.
     * This field is only valid when 'type' is 'PERIODIC'.
     * Range: ScanIntervalRange:MIN to ScanIntervalRange:MAX
     */
    int32_t interval __attribute__ ((aligned(4)));
    /**
     * Networks with bands/channels to scan
     * Maximum length of the vector is
     * RadioConst:RADIO_ACCESS_SPECIFIER_MAX_SIZE
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_1::RadioAccessSpecifier> specifiers __attribute__ ((aligned(8)));
    /**
     * Maximum duration of the periodic search (in seconds).
     * Expected range for the input is [MaxSearchTimeRange:MIN - MaxSearchTimeRange:MAX]
     * If the search lasts maxSearchTime, it must be terminated.
     */
    int32_t maxSearchTime __attribute__ ((aligned(4)));
    /**
     * Indicates whether the modem must report incremental results of the network scan
     * to the client.
     * FALSE – Incremental results must not be reported.
     * TRUE  – Incremental must be reported.
     */
    bool incrementalResults __attribute__ ((aligned(1)));
    /**
     * Indicates the periodicity with which the modem must report incremental results to
     * the client (in seconds).
     * Expected range for the input is
     * [IncrementalResultsPeriodicityRange:MIN - IncrementalResultsPeriodicityRange:MAX]
     * This value must be less than or equal to maxSearchTime. If incremental results are
     * not requested, implementations may ignore this value.
     */
    int32_t incrementalResultsPeriodicity __attribute__ ((aligned(4)));
    /**
     * Describes the List of PLMN ids (MCC-MNC)
     * If any PLMN of this list is found, search must end at that point and results with all
     * PLMN found until that point should be sent as response.
     * If the list is not sent, search to be completed until end and all PLMNs found to be
     * reported.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> mccMncs __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, interval) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, specifiers) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, maxSearchTime) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, incrementalResults) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, incrementalResultsPeriodicity) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, mccMncs) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::NetworkScanRequest) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::NetworkScanRequest) == 8, "wrong alignment");

struct NetworkScanResult final {
    /**
     * The status of the scan.
     */
    ::android::hardware::radio::V1_1::ScanStatus status __attribute__ ((aligned(4)));
    /**
     * The error code of the incremental result.
     */
    ::android::hardware::radio::V1_0::RadioError error __attribute__ ((aligned(4)));
    /**
     * List of network information as CellInfo.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfo> networkInfos __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanResult, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanResult, error) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanResult, networkInfos) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::NetworkScanResult) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::NetworkScanResult) == 8, "wrong alignment");

struct CellIdentityOperatorNames final {
    /**
     * Long alpha Operator Name String or Enhanced Operator Name String.
     */
    ::android::hardware::hidl_string alphaLong __attribute__ ((aligned(8)));
    /**
     * Short alpha Operator Name String or Enhanced Operator Name String
     */
    ::android::hardware::hidl_string alphaShort __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityOperatorNames, alphaLong) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityOperatorNames, alphaShort) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityOperatorNames) == 32, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityOperatorNames) == 8, "wrong alignment");

struct CellIdentityCdma final {
    ::android::hardware::radio::V1_0::CellIdentityCdma base __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_2::CellIdentityOperatorNames operatorNames __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityCdma, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityCdma, operatorNames) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityCdma) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityCdma) == 8, "wrong alignment");

struct CellIdentityGsm final {
    ::android::hardware::radio::V1_0::CellIdentityGsm base __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::CellIdentityOperatorNames operatorNames __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityGsm, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityGsm, operatorNames) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityGsm) == 80, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityGsm) == 8, "wrong alignment");

struct CellIdentityLte final {
    ::android::hardware::radio::V1_0::CellIdentityLte base __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::CellIdentityOperatorNames operatorNames __attribute__ ((aligned(8)));
    /**
     * Cell bandwidth, in kHz.
     */
    int32_t bandwidth __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityLte, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityLte, operatorNames) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityLte, bandwidth) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityLte) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityLte) == 8, "wrong alignment");

struct CellIdentityTdscdma final {
    ::android::hardware::radio::V1_0::CellIdentityTdscdma base __attribute__ ((aligned(8)));
    /**
     * 16-bit UMTS Absolute RF Channel Number defined in TS 25.102 5.4.4; this value must be valid.
     */
    int32_t uarfcn __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_2::CellIdentityOperatorNames operatorNames __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityTdscdma, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityTdscdma, uarfcn) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityTdscdma, operatorNames) == 56, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityTdscdma) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityTdscdma) == 8, "wrong alignment");

struct CellIdentityWcdma final {
    ::android::hardware::radio::V1_0::CellIdentityWcdma base __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::CellIdentityOperatorNames operatorNames __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityWcdma, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityWcdma, operatorNames) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityWcdma) == 80, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityWcdma) == 8, "wrong alignment");

struct CellInfoGsm final {
    ::android::hardware::radio::V1_2::CellIdentityGsm cellIdentityGsm __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::GsmSignalStrength signalStrengthGsm __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoGsm, cellIdentityGsm) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoGsm, signalStrengthGsm) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfoGsm) == 96, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfoGsm) == 8, "wrong alignment");

struct WcdmaSignalStrength final {
    ::android::hardware::radio::V1_0::WcdmaSignalStrength base __attribute__ ((aligned(4)));
    /**
     * CPICH RSCP as defined in TS 25.215 5.1.1
     * Valid values are (0-96, 255) as defined in TS 27.007 8.69
     * INT_MAX denotes that the value is invalid/unreported.
     */
    uint32_t rscp __attribute__ ((aligned(4)));
    /**
     * Ec/No value as defined in TS 25.215 5.1.5
     * Valid values are (0-49, 255) as defined in TS 27.007 8.69
     * INT_MAX denotes that the value is invalid/unreported.
     */
    uint32_t ecno __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::WcdmaSignalStrength, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::WcdmaSignalStrength, rscp) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::WcdmaSignalStrength, ecno) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::WcdmaSignalStrength) == 16, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::WcdmaSignalStrength) == 4, "wrong alignment");

struct CellInfoWcdma final {
    ::android::hardware::radio::V1_2::CellIdentityWcdma cellIdentityWcdma __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::WcdmaSignalStrength signalStrengthWcdma __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoWcdma, cellIdentityWcdma) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoWcdma, signalStrengthWcdma) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfoWcdma) == 96, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfoWcdma) == 8, "wrong alignment");

struct CellInfoCdma final {
    ::android::hardware::radio::V1_2::CellIdentityCdma cellIdentityCdma __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::CdmaSignalStrength signalStrengthCdma __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::EvdoSignalStrength signalStrengthEvdo __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoCdma, cellIdentityCdma) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoCdma, signalStrengthCdma) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoCdma, signalStrengthEvdo) == 64, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfoCdma) == 80, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfoCdma) == 8, "wrong alignment");

struct CellInfoLte final {
    ::android::hardware::radio::V1_2::CellIdentityLte cellIdentityLte __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::LteSignalStrength signalStrengthLte __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoLte, cellIdentityLte) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoLte, signalStrengthLte) == 88, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfoLte) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfoLte) == 8, "wrong alignment");

struct TdscdmaSignalStrength final {
    /**
     * UTRA carrier RSSI as defined in TS 25.225 5.1.4
     * Valid values are (0-31, 99) as defined in TS 27.007 8.5
     * INT_MAX denotes that the value is invalid/unreported.
     */
    uint32_t signalStrength __attribute__ ((aligned(4)));
    /**
     * Transport Channel BER as defined in TS 25.225 5.2.5
     * Valid values are (0-7, 99) as defined in TS 27.007 8.5
     * INT_MAX denotes that the value is invalid/unreported.
     */
    uint32_t bitErrorRate __attribute__ ((aligned(4)));
    /**
     * P-CCPCH RSCP as defined in TS 25.225 5.1.1
     * Valid values are (0-96, 255) as defined in TS 27.007 8.69
     * INT_MAX denotes that the value is invalid/unreported.
     */
    uint32_t rscp __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::TdscdmaSignalStrength, signalStrength) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::TdscdmaSignalStrength, bitErrorRate) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::TdscdmaSignalStrength, rscp) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::TdscdmaSignalStrength) == 12, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::TdscdmaSignalStrength) == 4, "wrong alignment");

struct CellInfoTdscdma final {
    ::android::hardware::radio::V1_2::CellIdentityTdscdma cellIdentityTdscdma __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::TdscdmaSignalStrength signalStrengthTdscdma __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoTdscdma, cellIdentityTdscdma) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoTdscdma, signalStrengthTdscdma) == 88, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfoTdscdma) == 104, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfoTdscdma) == 8, "wrong alignment");

struct CellInfo final {
    /**
     * Cell type for selecting from union CellInfo.
     */
    ::android::hardware::radio::V1_0::CellInfoType cellInfoType __attribute__ ((aligned(4)));
    /**
     * True if this cell is registered false if not registered.
     */
    bool registered __attribute__ ((aligned(1)));
    /**
     * Type of time stamp represented by timeStamp.
     */
    ::android::hardware::radio::V1_0::TimeStampType timeStampType __attribute__ ((aligned(4)));
    /**
     * Time in nanos as returned by ril_nano_time.
     */
    uint64_t timeStamp __attribute__ ((aligned(8)));
    /**
     * Only one of the below vectors must be of size 1 based on the CellInfoType and others must be
     * of size 0.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfoGsm> gsm __attribute__ ((aligned(8)));
    /**
     * Valid only if type = cdma and size = 1 else must be empty.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfoCdma> cdma __attribute__ ((aligned(8)));
    /**
     * Valid only if type = lte and size = 1 else must be empty.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfoLte> lte __attribute__ ((aligned(8)));
    /**
     * Valid only if type = wcdma and size = 1 else must be empty.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfoWcdma> wcdma __attribute__ ((aligned(8)));
    /**
     * Valid only if type = tdscdma and size = 1 else must be empty.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfoTdscdma> tdscdma __attribute__ ((aligned(8)));
    /**
     * Connection status for the cell.
     */
    ::android::hardware::radio::V1_2::CellConnectionStatus connectionStatus __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, cellInfoType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, registered) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, timeStampType) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, timeStamp) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, gsm) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, cdma) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, lte) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, wcdma) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, tdscdma) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, connectionStatus) == 104, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfo) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfo) == 8, "wrong alignment");

struct CardStatus final {
    ::android::hardware::radio::V1_0::CardStatus base __attribute__ ((aligned(8)));
    uint32_t physicalSlotId __attribute__ ((aligned(4)));
    /**
     * An Answer To Reset (ATR) is a message output by a Smart Card conforming to ISO/IEC 7816
     * standards, following electrical reset of the card's chip. The ATR conveys information about
     * the communication parameters proposed by the card, and the card's nature and state.
     *
     * This data is applicable only when cardState is CardState:PRESENT.
     */
    ::android::hardware::hidl_string atr __attribute__ ((aligned(8)));
    /**
     * Integrated Circuit Card IDentifier (ICCID) is Unique Identifier of the SIM CARD. File is
     * located in the SIM card at EFiccid (0x2FE2) as per ETSI 102.221. The ICCID is defined by
     * the ITU-T recommendation E.118 ISO/IEC 7816.
     *
     * This data is applicable only when cardState is CardState:PRESENT.
     */
    ::android::hardware::hidl_string iccid __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CardStatus, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CardStatus, physicalSlotId) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CardStatus, atr) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CardStatus, iccid) == 64, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CardStatus) == 80, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CardStatus) == 8, "wrong alignment");

struct LinkCapacityEstimate final {
    /**
     * Estimated downlink capacity in kbps. This bandwidth estimate shall be the estimated
     * maximum sustainable link bandwidth (as would be measured at the Upper PDCP or SNDCP SAP).
     * If the DL Aggregate Maximum Bit Rate is known, this value shall not exceed the DL-AMBR
     * for the Internet PDN connection.
     */
    uint32_t downlinkCapacityKbps __attribute__ ((aligned(4)));
    /**
     * Estimated uplink capacity in kbps. This bandwidth estimate shall be the estimated
     * maximum sustainable link bandwidth (as would be measured at the Upper PDCP or SNDCP SAP).
     * If the UL Aggregate Maximum Bit Rate is known, this value shall not exceed the UL-AMBR
     * for the Internet PDN connection.
     */
    uint32_t uplinkCapacityKbps __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::LinkCapacityEstimate, downlinkCapacityKbps) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::LinkCapacityEstimate, uplinkCapacityKbps) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::LinkCapacityEstimate) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::LinkCapacityEstimate) == 4, "wrong alignment");

struct PhysicalChannelConfig final {
    /**
     * Connection status for cell. Valid values are PRIMARY_SERVING and SECONDARY_SERVING.
     */
    ::android::hardware::radio::V1_2::CellConnectionStatus status __attribute__ ((aligned(4)));
    /**
     * Cell bandwidth, in kHz.
     */
    int32_t cellBandwidthDownlink __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::PhysicalChannelConfig, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::PhysicalChannelConfig, cellBandwidthDownlink) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::PhysicalChannelConfig) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::PhysicalChannelConfig) == 4, "wrong alignment");

enum class AccessNetwork : int32_t {
    /**
     * GSM EDGE Radio Access Network
     */
    GERAN = 1,
    /**
     * Universal Terrestrial Radio Access Network
     */
    UTRAN = 2,
    /**
     * Evolved Universal Terrestrial Radio Access Network
     */
    EUTRAN = 3,
    /**
     * CDMA 2000 network
     */
    CDMA2000 = 4,
    /**
     * Interworking Wireless LAN
     */
    IWLAN = 5,
};

enum class DataRequestReason : int32_t {
    /**
     * The reason of the data request is normal
     */
    NORMAL = 1 /* 0x01 */,
    /**
     * The reason of the data request is device shutdown
     */
    SHUTDOWN = 2 /* 0x02 */,
    /**
     * The reason of the data request is IWLAN data handover to another transport
     * (e.g. from cellular to wifi or vise versa)
     */
    HANDOVER = 3 /* 0x03 */,
};

struct Call final {
    ::android::hardware::radio::V1_0::Call base __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::AudioQuality audioQuality __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::Call, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::Call, audioQuality) == 88, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::Call) == 96, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::Call) == 8, "wrong alignment");

struct SignalStrength final {
    /**
     * If GSM measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::GsmSignalStrength gsm __attribute__ ((aligned(4)));
    /**
     * If CDMA measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::CdmaSignalStrength cdma __attribute__ ((aligned(4)));
    /**
     * If EvDO measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::EvdoSignalStrength evdo __attribute__ ((aligned(4)));
    /**
     * If LTE measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::LteSignalStrength lte __attribute__ ((aligned(4)));
    /**
     * If TD-SCDMA measurements are provided, this structure must contain valid measurements;
     * otherwise all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::TdScdmaSignalStrength tdScdma __attribute__ ((aligned(4)));
    /**
     * If WCDMA measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_2::WcdmaSignalStrength wcdma __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, gsm) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, cdma) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, evdo) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, lte) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, tdScdma) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, wcdma) == 60, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::SignalStrength) == 76, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::SignalStrength) == 4, "wrong alignment");

struct CellIdentity final {
    /**
     * Cell type for selecting from union CellInfo.
     * Only one of the below vectors must be of size 1 based on a
     * valid CellInfoType and others must be of size 0.
     * If cell info type is NONE, then all the vectors must be of size 0.
     */
    ::android::hardware::radio::V1_0::CellInfoType cellInfoType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellIdentityGsm> cellIdentityGsm __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellIdentityWcdma> cellIdentityWcdma __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellIdentityCdma> cellIdentityCdma __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellIdentityLte> cellIdentityLte __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellIdentityTdscdma> cellIdentityTdscdma __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellInfoType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellIdentityGsm) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellIdentityWcdma) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellIdentityCdma) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellIdentityLte) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellIdentityTdscdma) == 72, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentity) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentity) == 8, "wrong alignment");

struct VoiceRegStateResult final {
    /**
     * Valid reg states are NOT_REG_MT_NOT_SEARCHING_OP,
     * REG_HOME, NOT_REG_MT_SEARCHING_OP, REG_DENIED,
     * UNKNOWN, REG_ROAMING defined in RegState
     */
    ::android::hardware::radio::V1_0::RegState regState __attribute__ ((aligned(4)));
    /**
     * Indicates the available voice radio technology, valid values as
     * defined by RadioTechnology.
     */
    int32_t rat __attribute__ ((aligned(4)));
    /**
     * concurrent services support indicator. if registered on a CDMA system.
     * false - Concurrent services not supported,
     * true - Concurrent services supported
     */
    bool cssSupported __attribute__ ((aligned(1)));
    /**
     * TSB-58 Roaming Indicator if registered on a CDMA or EVDO system or -1 if not.
     * Valid values are 0-255.
     */
    int32_t roamingIndicator __attribute__ ((aligned(4)));
    /**
     * Indicates whether the current system is in the PRL if registered on a CDMA or EVDO system
     * or -1 if not. 0=not in the PRL, 1=in the PRL
     */
    int32_t systemIsInPrl __attribute__ ((aligned(4)));
    /**
     * Default Roaming Indicator from the PRL if registered on a CDMA or EVDO system or -1 if not.
     * Valid values are 0-255.
     */
    int32_t defaultRoamingIndicator __attribute__ ((aligned(4)));
    /**
     * reasonForDenial if registration state is 3
     * (Registration denied) this is an enumerated reason why
     * registration was denied. See 3GPP TS 24.008,
     * 10.5.3.6 and Annex G.
     * 0 - General
     * 1 - Authentication Failure
     * 2 - IMSI unknown in HLR
     * 3 - Illegal MS
     * 4 - Illegal ME
     * 5 - PLMN not allowed
     * 6 - Location area not allowed
     * 7 - Roaming not allowed
     * 8 - No Suitable Cells in this Location Area
     * 9 - Network failure
     * 10 - Persistent location update reject
     * 11 - PLMN not allowed
     * 12 - Location area not allowed
     * 13 - Roaming not allowed in this Location Area
     * 15 - No Suitable Cells in this Location Area
     * 17 - Network Failure
     * 20 - MAC Failure
     * 21 - Sync Failure
     * 22 - Congestion
     * 23 - GSM Authentication unacceptable
     * 25 - Not Authorized for this CSG
     * 32 - Service option not supported
     * 33 - Requested service option not subscribed
     * 34 - Service option temporarily out of order
     * 38 - Call cannot be identified
     * 48-63 - Retry upon entry into a new cell
     * 95 - Semantically incorrect message
     * 96 - Invalid mandatory information
     * 97 - Message type non-existent or not implemented
     * 98 - Message type not compatible with protocol state
     * 99 - Information element non-existent or not implemented
     * 100 - Conditional IE error
     * 101 - Message not compatible with protocol state
     * 111 - Protocol error, unspecified
     */
    int32_t reasonForDenial __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_2::CellIdentity cellIdentity __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, regState) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, rat) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, cssSupported) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, roamingIndicator) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, systemIsInPrl) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, defaultRoamingIndicator) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, reasonForDenial) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, cellIdentity) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::VoiceRegStateResult) == 120, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::VoiceRegStateResult) == 8, "wrong alignment");

struct DataRegStateResult final {
    /**
     * Valid reg states are NOT_REG_MT_NOT_SEARCHING_OP,
     * REG_HOME, NOT_REG_MT_SEARCHING_OP, REG_DENIED,
     * UNKNOWN, REG_ROAMING defined in RegState
     */
    ::android::hardware::radio::V1_0::RegState regState __attribute__ ((aligned(4)));
    /**
     * Indicates the available data radio technology,
     * valid values as defined by RadioTechnology.
     */
    int32_t rat __attribute__ ((aligned(4)));
    /**
     * If registration state is 3 (Registration
     * denied) this is an enumerated reason why
     * registration was denied. See 3GPP TS 24.008,
     * Annex G.6 "Additional cause codes for GMM".
     * 7 == GPRS services not allowed
     * 8 == GPRS services and non-GPRS services not allowed
     * 9 == MS identity cannot be derived by the network
     * 10 == Implicitly detached
     * 14 == GPRS services not allowed in this PLMN
     * 16 == MSC temporarily not reachable
     * 40 == No PDP context activated
     */
    int32_t reasonDataDenied __attribute__ ((aligned(4)));
    /**
     * The maximum number of simultaneous Data Calls must be established using setupDataCall().
     */
    int32_t maxDataCalls __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_2::CellIdentity cellIdentity __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::DataRegStateResult, regState) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::DataRegStateResult, rat) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::DataRegStateResult, reasonDataDenied) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::DataRegStateResult, maxDataCalls) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::DataRegStateResult, cellIdentity) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::DataRegStateResult) == 104, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::DataRegStateResult) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::radio::V1_2::RadioConst o);
static inline void PrintTo(::android::hardware::radio::V1_2::RadioConst o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::radio::V1_2::RadioConst lhs, const ::android::hardware::radio::V1_2::RadioConst rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::radio::V1_2::RadioConst rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::radio::V1_2::RadioConst lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
