{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",

   "size" : 8,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKi",
   "name" : "const int *",
   "referenced_type" : "_ZTIKi",
   "self_type" : "_ZTIPKi",
   "size" : 8,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKj",
   "name" : "const unsigned int *",
   "referenced_type" : "_ZTIKj",
   "self_type" : "_ZTIPKj",
   "size" : 8,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK16stats_event_list",
   "name" : "const stats_event_list",
   "referenced_type" : "_ZTI16stats_event_list",
   "self_type" : "_ZTIK16stats_event_list",
   "size" : 16,
   "source_file" : "system/core/libstats/push_compat/include/stats_event_list.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "system/core/libstats/push_compat/include/stats_event_list.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__13mapIiPKcNS_4lessIiEENS_9allocatorINS_4pairIKiS2_EEEEEE",
   "name" : "const std::map<int, const char *, std::less<int>, std::allocator<std::pair<const int, const char *>>>",
   "referenced_type" : "_ZTINSt3__13mapIiPKcNS_4lessIiEENS_9allocatorINS_4pairIKiS2_EEEEEE",
   "self_type" : "_ZTIKNSt3__13mapIiPKcNS_4lessIiEENS_9allocatorINS_4pairIKiS2_EEEEEE",
   "size" : 24,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__13mapIifNS_4lessIiEENS_9allocatorINS_4pairIKifEEEEEE",
   "name" : "const std::map<int, float, std::less<int>, std::allocator<std::pair<const int, float>>>",
   "referenced_type" : "_ZTINSt3__13mapIifNS_4lessIiEENS_9allocatorINS_4pairIKifEEEEEE",
   "self_type" : "_ZTIKNSt3__13mapIifNS_4lessIiEENS_9allocatorINS_4pairIKifEEEEEE",
   "size" : 24,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__13mapIiiNS_4lessIiEENS_9allocatorINS_4pairIKiiEEEEEE",
   "name" : "const std::map<int, int, std::less<int>, std::allocator<std::pair<const int, int>>>",
   "referenced_type" : "_ZTINSt3__13mapIiiNS_4lessIiEENS_9allocatorINS_4pairIKiiEEEEEE",
   "self_type" : "_ZTIKNSt3__13mapIiiNS_4lessIiEENS_9allocatorINS_4pairIKiiEEEEEE",
   "size" : 24,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__13mapIilNS_4lessIiEENS_9allocatorINS_4pairIKilEEEEEE",
   "name" : "const std::map<int, long, std::less<int>, std::allocator<std::pair<const int, long>>>",
   "referenced_type" : "_ZTINSt3__13mapIilNS_4lessIiEENS_9allocatorINS_4pairIKilEEEEEE",
   "self_type" : "_ZTIKNSt3__13mapIilNS_4lessIiEENS_9allocatorINS_4pairIKilEEEEEE",
   "size" : 24,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIPKcNS_9allocatorIS2_EEEE",
   "name" : "const std::vector<const char *, std::allocator<const char *>>",
   "referenced_type" : "_ZTINSt3__16vectorIPKcNS_9allocatorIS2_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIPKcNS_9allocatorIS2_EEEE",
   "size" : 24,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/core/libstats/push_compat/include/stats_event_list.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "initialized",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "obtain",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFP11AStatsEventvE"
    },
    {
     "field_name" : "build",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvP11AStatsEventE"
    },
    {
     "field_name" : "write",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP11AStatsEventE"
    },
    {
     "field_name" : "release",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFvP11AStatsEventE"
    },
    {
     "field_name" : "setAtomId",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFvP11AStatsEventjE"
    },
    {
     "field_name" : "writeInt32",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFvP11AStatsEventiE"
    },
    {
     "field_name" : "writeInt64",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFvP11AStatsEventlE"
    },
    {
     "field_name" : "writeFloat",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFvP11AStatsEventfE"
    },
    {
     "field_name" : "writeBool",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFvP11AStatsEventbE"
    },
    {
     "field_name" : "writeByteArray",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFvP11AStatsEventPKhmE"
    },
    {
     "field_name" : "writeString",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFvP11AStatsEventPKcE"
    },
    {
     "field_name" : "writeAttributionChain",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvP11AStatsEventPKjPKPKchE"
    },
    {
     "field_name" : "addBoolAnnotation",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFvP11AStatsEventhbE"
    },
    {
     "field_name" : "addInt32Annotation",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFvP11AStatsEventhiE"
    }
   ],
   "linker_set_key" : "_ZTI14AStatsEventApi",
   "name" : "AStatsEventApi",
   "referenced_type" : "_ZTI14AStatsEventApi",
   "self_type" : "_ZTI14AStatsEventApi",
   "size" : 120,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mEventR",
     "referenced_type" : "_ZTIP11AStatsEvent"
    },
    {
     "access" : "private",
     "field_name" : "mEventQ",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16stats_event_list"
    }
   ],
   "linker_set_key" : "_ZTI16StatsEventCompat",
   "name" : "StatsEventCompat",
   "record_kind" : "class",
   "referenced_type" : "_ZTI16StatsEventCompat",
   "self_type" : "_ZTI16StatsEventCompat",
   "size" : 24,
   "source_file" : "system/core/libstats/push_compat/include/StatsEventCompat.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ctx",
     "referenced_type" : "_ZTIP28android_log_context_internal"
    },
    {
     "access" : "private",
     "field_name" : "ret",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI16stats_event_list",
   "name" : "stats_event_list",
   "record_kind" : "class",
   "referenced_type" : "_ZTI16stats_event_list",
   "self_type" : "_ZTI16stats_event_list",
   "size" : 16,
   "source_file" : "system/core/libstats/push_compat/include/stats_event_list.h"
  }
 ],
 "rvalue_reference_types" : []
}
