{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_PKc",
   "name" : "const char *[10]",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIA10_PKc",
   "size" : 40,
   "source_file" : "external/zlib/zutil.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFPvS_jjE",
   "name" : "void *(void *, unsigned int, unsigned int)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPv"
    },
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "referenced_type" : "_ZTIFPvS_jjE",
   "return_type" : "_ZTIPv",
   "self_type" : "_ZTIFPvS_jjE",
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFvPvS_E",
   "name" : "void (void *, void *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPv"
    },
    {
     "referenced_type" : "_ZTIPv"
    }
   ],
   "referenced_type" : "_ZTIFvPvS_E",
   "return_type" : "_ZTIv",
   "self_type" : "_ZTIFvPvS_E",
   "source_file" : "external/zlib/zlib.h"
  }
 ],
 "functions" :
 [
  {
   "function_name" : "adler32",
   "linker_set_key" : "adler32",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIm"
    },
    {
     "referenced_type" : "_ZTIPKh"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIm",
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "function_name" : "adler32_combine",
   "linker_set_key" : "adler32_combine",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIm"
    },
    {
     "referenced_type" : "_ZTIm"
    },
    {
     "referenced_type" : "_ZTIl"
    }
   ],
   "return_type" : "_ZTIm",
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "function_name" : "adler32_combine64",
   "linker_set_key" : "adler32_combine64",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIm"
    },
    {
     "referenced_type" : "_ZTIm"
    },
    {
     "referenced_type" : "_ZTIl"
    }
   ],
   "return_type" : "_ZTIm",
   "source_file" : "external/zlib/zutil.h"
  },
  {
   "function_name" : "adler32_z",
   "linker_set_key" : "adler32_z",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIm"
    },
    {
     "referenced_type" : "_ZTIPKh"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIm",
   "source_file" : "external/zlib/zlib.h"
  }
 ],
 "global_vars" :
 [
  {
   "linker_set_key" : "arm_cpu_enable_crc32",
   "name" : "arm_cpu_enable_crc32",
   "referenced_type" : "_ZTIi",
   "source_file" : "external/zlib/cpu_features.h"
  },
  {
   "linker_set_key" : "arm_cpu_enable_pmull",
   "name" : "arm_cpu_enable_pmull",
   "referenced_type" : "_ZTIi",
   "source_file" : "external/zlib/cpu_features.h"
  },
  {
   "linker_set_key" : "x86_cpu_enable_simd",
   "name" : "x86_cpu_enable_simd",
   "referenced_type" : "_ZTIi",
   "source_file" : "external/zlib/cpu_features.h"
  },
  {
   "linker_set_key" : "x86_cpu_enable_sse2",
   "name" : "x86_cpu_enable_sse2",
   "referenced_type" : "_ZTIi",
   "source_file" : "external/zlib/cpu_features.h"
  },
  {
   "linker_set_key" : "x86_cpu_enable_ssse3",
   "name" : "x86_cpu_enable_ssse3",
   "referenced_type" : "_ZTIi",
   "source_file" : "external/zlib/cpu_features.h"
  },
  {
   "linker_set_key" : "z_errmsg",
   "name" : "z_errmsg",
   "referenced_type" : "_ZTIA10_KPKc",
   "source_file" : "external/zlib/zutil.h"
  }
 ],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP14internal_state",
   "name" : "internal_state *",
   "referenced_type" : "_ZTI14internal_state",
   "self_type" : "_ZTIP14internal_state",
   "size" : 4,
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFPvS_jjE",
   "name" : "void *(*)(void *, unsigned int, unsigned int)",
   "referenced_type" : "_ZTIFPvS_jjE",
   "self_type" : "_ZTIPFPvS_jjE",
   "size" : 4,
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvPvS_E",
   "name" : "void (*)(void *, void *)",
   "referenced_type" : "_ZTIFvPvS_E",
   "self_type" : "_ZTIPFvPvS_E",
   "size" : 4,
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 4,
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/zlib/zlib.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIA10_KPKc",
   "name" : "const char *const[10]",
   "referenced_type" : "_ZTIA10_PKc",
   "self_type" : "_ZTIA10_KPKc",
   "size" : 40,
   "source_file" : "external/zlib/zutil.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/zlib/zlib.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next_in",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "avail_in",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "total_in",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "next_out",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "avail_out",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "total_out",
     "field_offset" : 160,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "state",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP14internal_state"
    },
    {
     "field_name" : "zalloc",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFPvS_jjE"
    },
    {
     "field_name" : "zfree",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "opaque",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "data_type",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "adler",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10z_stream_s",
   "name" : "z_stream_s",
   "referenced_type" : "_ZTI10z_stream_s",
   "self_type" : "_ZTI10z_stream_s",
   "size" : 56,
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "text",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "time",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "xflags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "os",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "extra",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "extra_len",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "extra_max",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "name",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "name_max",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "comment",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "comm_max",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hcrc",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "done",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11gz_header_s",
   "name" : "gz_header_s",
   "referenced_type" : "_ZTI11gz_header_s",
   "self_type" : "_ZTI11gz_header_s",
   "size" : 52,
   "source_file" : "external/zlib/zlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "have",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "next",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "pos",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8gzFile_s",
   "name" : "gzFile_s",
   "referenced_type" : "_ZTI8gzFile_s",
   "self_type" : "_ZTI8gzFile_s",
   "size" : 12,
   "source_file" : "external/zlib/zlib.h"
  }
 ],
 "rvalue_reference_types" : []
}
