#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_COMPOSER_V2_3_ICOMPOSERCLIENT_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_COMPOSER_V2_3_ICOMPOSERCLIENT_H

#include <android/hardware/graphics/common/1.1/types.h>
#include <android/hardware/graphics/common/1.2/types.h>
#include <android/hardware/graphics/composer/2.1/IComposerClient.h>
#include <android/hardware/graphics/composer/2.1/types.h>
#include <android/hardware/graphics/composer/2.2/IComposerClient.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace graphics {
namespace composer {
namespace V2_3 {

struct IComposerClient : public ::android::hardware::graphics::composer::V2_2::IComposerClient {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.graphics.composer@2.3::IComposerClient"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class DisplayCapability : uint32_t;
    enum class PerFrameMetadataKey : int32_t;
    struct PerFrameMetadata;
    struct PerFrameMetadataBlob;
    enum class Command : int32_t;
    enum class FormatColorComponent : uint8_t;
    enum class DisplayedContentSampling : int32_t;

    /**
     * Required capabilities which are supported by the display. The
     * particular set of supported capabilities for a given display may be
     * retrieved using getDisplayCapabilities.
     */
    enum class DisplayCapability : uint32_t {
        INVALID = 0u,
        /**
         * Indicates that the display must apply a color transform even when
         * either the client or the device has chosen that all layers should
         * be composed by the client. This prevents the client from applying
         * the color transform during its composition step.
         * If getDisplayCapabilities is supported, the global capability
         * SKIP_CLIENT_COLOR_TRANSFORM is ignored.
         * If getDisplayCapabilities is not supported, and the global capability
         * SKIP_CLIENT_COLOR_TRANSFORM is returned by getCapabilities,
         * then all displays must be treated as having
         * SKIP_CLIENT_COLOR_TRANSFORM.
         */
        SKIP_CLIENT_COLOR_TRANSFORM = 1u,
        /**
         * Indicates that the display supports PowerMode::DOZE and
         * PowerMode::DOZE_SUSPEND. DOZE_SUSPEND may not provide any benefit
         * over DOZE (see the definition of PowerMode for more information),
         * but if both DOZE and DOZE_SUSPEND are no different from
         * PowerMode::ON, the device must not claim support.
         * Must be returned by getDisplayCapabilities when getDozeSupport
         * indicates the display supports PowerMode::DOZE and
         * PowerMode::DOZE_SUSPEND.
         */
        DOZE = 2u,
        /**
         * Indicates that the display supports brightness operations.
         */
        BRIGHTNESS = 3u,
    };

    /**
     * PerFrameMetadataKey
     *
     * A set of PerFrameMetadataKey pertains specifically to blob-formatted
     * metadata (as opposed to float-valued metadata).
     * The list of keys that represent blobs are:
     * 1. HDR10_PLUS_SEI
     */
    enum class PerFrameMetadataKey : int32_t {
        /**
         * SMPTE ST 2084:2014.
         * Coordinates defined in CIE 1931 xy chromaticity space
         *
         *
         * SMPTE ST 2084:2014
         */
        DISPLAY_RED_PRIMARY_X = 0,
        /**
         * SMPTE ST 2084:2014
         */
        DISPLAY_RED_PRIMARY_Y = 1 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.DISPLAY_RED_PRIMARY_X implicitly + 1 */,
        /**
         * SMPTE ST 2084:2014
         */
        DISPLAY_GREEN_PRIMARY_X = 2 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.DISPLAY_RED_PRIMARY_Y implicitly + 1 */,
        /**
         * SMPTE ST 2084:2014
         */
        DISPLAY_GREEN_PRIMARY_Y = 3 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.DISPLAY_GREEN_PRIMARY_X implicitly + 1 */,
        /**
         * SMPTE ST 2084:2014
         */
        DISPLAY_BLUE_PRIMARY_X = 4 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.DISPLAY_GREEN_PRIMARY_Y implicitly + 1 */,
        /**
         * SMPTE ST 2084:2014
         */
        DISPLAY_BLUE_PRIMARY_Y = 5 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.DISPLAY_BLUE_PRIMARY_X implicitly + 1 */,
        /**
         * SMPTE ST 2084:2014
         */
        WHITE_POINT_X = 6 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.DISPLAY_BLUE_PRIMARY_Y implicitly + 1 */,
        /**
         * SMPTE ST 2084:2014
         */
        WHITE_POINT_Y = 7 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.WHITE_POINT_X implicitly + 1 */,
        /**
         * SMPTE ST 2084:2014.
         * Units: nits
         * max as defined by ST 2048: 10,000 nits
         */
        MAX_LUMINANCE = 8 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.WHITE_POINT_Y implicitly + 1 */,
        /**
         * SMPTE ST 2084:2014
         */
        MIN_LUMINANCE = 9 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.MAX_LUMINANCE implicitly + 1 */,
        /**
         * CTA 861.3
         */
        MAX_CONTENT_LIGHT_LEVEL = 10 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.MIN_LUMINANCE implicitly + 1 */,
        /**
         * CTA 861.3
         */
        MAX_FRAME_AVERAGE_LIGHT_LEVEL = 11 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.MAX_CONTENT_LIGHT_LEVEL implicitly + 1 */,
        /**
         * HDR10+ metadata
         * Specifies a metadata blob adhering to
         * the ST2094-40 SEI message spec, Version 1.0
         */
        HDR10_PLUS_SEI = 12 /* ::android::hardware::graphics::composer::V2_2::IComposerClient::PerFrameMetadataKey.MAX_FRAME_AVERAGE_LIGHT_LEVEL implicitly + 1 */,
    };

    /**
     * PerFrameMetadata
     * This struct encapsulates float-valued
     * metadata - key must not be in the list
     * of keys representing blob-formatted metadata
     * (see PerFrameMetadataKey)
     */
    struct PerFrameMetadata final {
        ::android::hardware::graphics::composer::V2_3::IComposerClient::PerFrameMetadataKey key __attribute__ ((aligned(4)));
        float value __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::graphics::composer::V2_3::IComposerClient::PerFrameMetadata, key) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_3::IComposerClient::PerFrameMetadata, value) == 4, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::composer::V2_3::IComposerClient::PerFrameMetadata) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::composer::V2_3::IComposerClient::PerFrameMetadata) == 4, "wrong alignment");

    /**
     * PerFrameMetadataBlob
     * This struct encapsulates blob
     * metadata - key must be one of the list of keys
     * associated with blob-type metadata key
     * and the blob must adhere to the format specified by
     * that key (See PerFrameMetadataKey).
     */
    struct PerFrameMetadataBlob final {
        ::android::hardware::graphics::composer::V2_3::IComposerClient::PerFrameMetadataKey key __attribute__ ((aligned(4)));
        ::android::hardware::hidl_vec<uint8_t> blob __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::composer::V2_3::IComposerClient::PerFrameMetadataBlob, key) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::composer::V2_3::IComposerClient::PerFrameMetadataBlob, blob) == 8, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::composer::V2_3::IComposerClient::PerFrameMetadataBlob) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::composer::V2_3::IComposerClient::PerFrameMetadataBlob) == 8, "wrong alignment");

    enum class Command : int32_t {
        LENGTH_MASK = 65535 /* 0xffff */,
        OPCODE_SHIFT = 16,
        OPCODE_MASK = -65536 /* 0xffff << OPCODE_SHIFT */,
        /**
         * special commands
         */
        SELECT_DISPLAY = 0 /* 0x000 << OPCODE_SHIFT */,
        SELECT_LAYER = 65536 /* 0x001 << OPCODE_SHIFT */,
        /**
         * value commands (for return values)
         */
        SET_ERROR = 16777216 /* 0x100 << OPCODE_SHIFT */,
        SET_CHANGED_COMPOSITION_TYPES = 16842752 /* 0x101 << OPCODE_SHIFT */,
        SET_DISPLAY_REQUESTS = 16908288 /* 0x102 << OPCODE_SHIFT */,
        SET_PRESENT_FENCE = 16973824 /* 0x103 << OPCODE_SHIFT */,
        SET_RELEASE_FENCES = 17039360 /* 0x104 << OPCODE_SHIFT */,
        /**
         * display commands
         */
        SET_COLOR_TRANSFORM = 33554432 /* 0x200 << OPCODE_SHIFT */,
