{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA11_c",
   "name" : "char [11]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA11_c",
   "size" : 11,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA128_m",
   "name" : "unsigned long [128]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA128_m",
   "size" : 512,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA13_i",
   "name" : "int [13]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA13_i",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",
   "name" : "unsigned char [16]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA16_h",
   "size" : 16,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA18_m",
   "name" : "unsigned long [18]",

   "self_type" : "_ZTIKSt16initializer_listIbE",
   "size" : 8,
   "source_file" : "external/libcxx/include/initializer_list"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt16nested_exception",
   "name" : "const std::nested_exception",
   "referenced_type" : "_ZTISt16nested_exception",
   "self_type" : "_ZTIKSt16nested_exception",
   "size" : 8,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "_ZTISt9nothrow_t",
   "self_type" : "_ZTIKSt9nothrow_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "self_type" : "_ZTIKSt9type_info",
   "size" : 8,
   "source_file" : "external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libcxx/include/__debug"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTIVNSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_jPKvE",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvS_jPKvE",
   "self_type" : "_ZTIVPFPvS_jPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjPKvE",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjPKvE",
   "self_type" : "_ZTIVPFPvjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjjPKvE",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjjPKvE",
   "self_type" : "_ZTIVPFPvjjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cgroup",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "referenced_type" : "_ZTI10clone_args",
   "self_type" : "_ZTI10clone_args",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 84,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA2_m"
    }
   ],
   "linker_set_key" : "_ZTI10sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "_ZTI10sigset64_t",
   "self_type" : "_ZTI10sigset64_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "referenced_type" : "_ZTI11sched_param",
   "self_type" : "_ZTI11sched_param",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA8_N11user_fpregs6fp_regE"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "_ZTI11user_fpregs",
   "self_type" : "_ZTI11user_fpregs",
   "size" : 116,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "_ZTI12user_vfp_exc",
   "self_type" : "_ZTI12user_vfp_exc",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 24,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA8_i"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "_ZTI19__pthread_cleanup_t",
   "self_type" : "_ZTI19__pthread_cleanup_t",
   "size" : 12,
   "source_file" : "bionic/libc/include/pthread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "system/logging/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 44,
   "source_file" : "bionic/libc/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTI9user_regs"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP9user_regs"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI11user_fpregs"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIP11user_fpregs"
    }
   ],
   "linker_set_key" : "_ZTI4user",
   "name" : "user",
   "referenced_type" : "_ZTI4user",
   "self_type" : "_ZTI4user",
   "size" : 296,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 40,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10sigcontext"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIA128_m"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 744,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA32_y"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "_ZTI8user_vfp",
   "self_type" : "_ZTI8user_vfp",
   "size" : 264,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "_ZTI9cpu_set_t",
   "self_type" : "_ZTI9cpu_set_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "_ZTIA18_m"
    }
   ],
   "linker_set_key" : "_ZTI9user_regs",
   "name" : "user_regs",
   "referenced_type" : "_ZTI9user_regs",
   "self_type" : "_ZTI9user_regs",
   "size" : 72,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt0_E",
   "self_type" : "_ZTIN10__sifieldsUt0_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt1_E",
   "self_type" : "_ZTIN10__sifieldsUt1_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt2_E",
   "self_type" : "_ZTIN10__sifieldsUt2_E",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_E",
   "self_type" : "_ZTIN10__sifieldsUt3_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt4_E",
   "self_type" : "_ZTIN10__sifieldsUt4_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt5_E",
   "self_type" : "_ZTIN10__sifieldsUt5_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:100:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN11user_fpregs6fp_regE",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "_ZTIN11user_fpregs6fp_regE",
   "self_type" : "_ZTIN11user_fpregs6fp_regE",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN18__kernel_sigactionUt_E",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:68:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN18__kernel_sigactionUt_E",
   "self_type" : "_ZTIN18__kernel_sigactionUt_E",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA13_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:232:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN8ucontextUt_Ut_E"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_Ut_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)::(anonymous struct at bionic/libc/include/sys/ucontext.h:91:5)",
   "referenced_type" : "_ZTIN8ucontextUt_Ut_E",
   "self_type" : "_ZTIN8ucontextUt_Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:89:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__110__function16__policy_storageE",
   "self_type" : "_ZTINSt3__110__function16__policy_storageE",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "referenced_type" : "_ZTINSt3__110__function8__policyE",
   "self_type" : "_ZTINSt3__110__function8__policyE",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj0EEE",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj1EEE",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "_ZTINSt3__110__ignore_tIhEE",
   "self_type" : "_ZTINSt3__110__ignore_tIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEJOPKcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEEJNS_16is_constructibleISA_JOS4_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<const char *, std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>, is_constructible<basic_string<char>, const char *&&>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEEJNS_16is_constructibleISA_JOS4_EEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEEJNS_16is_constructibleISA_JOS4_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEJRKPKcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEEJNS_16is_constructibleISA_JRKS4_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<const char *, std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>, is_constructible<basic_string<char>, const char *const &>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEEJNS_16is_constructibleISA_JRKS4_EEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEEJNS_16is_constructibleISA_JRKS4_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIiJObEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIbiEEEEJNS_16is_constructibleIiJObEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<bool, int>>, is_constructible<int, bool &&>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIbiEEEEJNS_16is_constructibleIiJObEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIbiEEEEJNS_16is_constructibleIiJObEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIbiEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIiJRKbEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIbiEEEEJNS_16is_constructibleIiJRKbEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<bool, int>>, is_constructible<int, const bool &>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIbiEEEEJNS_16is_constructibleIiJRKbEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIbiEEEEJNS_16is_constructibleIiJRKbEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIbiEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIbJOiEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIibEEEEJNS_16is_constructibleIbJOiEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<int, bool>>, is_constructible<bool, int &&>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIibEEEEJNS_16is_constructibleIbJOiEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIibEEEEJNS_16is_constructibleIbJOiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIibEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIbJRKiEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIibEEEEJNS_16is_constructibleIbJRKiEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<int, bool>>, is_constructible<bool, const int &>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIibEEEEJNS_16is_constructibleIbJRKiEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIibEEEEJNS_16is_constructibleIbJRKiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIibEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIdJOiEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIidEEEEJNS_16is_constructibleIdJOiEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<int, double>>, is_constructible<double, int &&>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIidEEEEJNS_16is_constructibleIdJOiEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIidEEEEJNS_16is_constructibleIdJOiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIidEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIdJRKiEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIidEEEEJNS_16is_constructibleIdJRKiEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<int, double>>, is_constructible<double, const int &>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIidEEEEJNS_16is_constructibleIdJRKiEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIidEEEEJNS_16is_constructibleIdJRKiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIidEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIjJOiEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIijEEEEJNS_16is_constructibleIjJOiEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<int, unsigned int>>, is_constructible<unsigned int, int &&>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIijEEEEJNS_16is_constructibleIjJOiEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIijEEEEJNS_16is_constructibleIjJOiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIijEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIjJRKiEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIijEEEEJNS_16is_constructibleIjJRKiEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<int, unsigned int>>, is_constructible<unsigned int, const int &>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIijEEEEJNS_16is_constructibleIjJRKiEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIijEEEEJNS_16is_constructibleIjJRKiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIijEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIxJOiEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIixEEEEJNS_16is_constructibleIxJOiEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<int, long long>>, is_constructible<long long, int &&>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIixEEEEJNS_16is_constructibleIxJOiEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIixEEEEJNS_16is_constructibleIxJOiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIixEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIxJRKiEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIixEEEEJNS_16is_constructibleIxJRKiEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<int, long long>>, is_constructible<long long, const int &>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIixEEEEJNS_16is_constructibleIxJRKiEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIixEEEEJNS_16is_constructibleIxJRKiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIixEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIyJOiEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIiyEEEEJNS_16is_constructibleIyJOiEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<int, unsigned long long>>, is_constructible<unsigned long long, int &&>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIiyEEEEJNS_16is_constructibleIyJOiEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIiyEEEEJNS_16is_constructibleIyJOiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIiyEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIyJRKiEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIiyEEEEJNS_16is_constructibleIyJRKiEEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<int, unsigned long long>>, is_constructible<unsigned long long, const int &>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIiyEEEEJNS_16is_constructibleIyJRKiEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIiyEEEEJNS_16is_constructibleIyJRKiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__110__lazy_notINS_7is_sameIiyEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEE",
   "name" : "std::__lazy_not<std::is_same<const char *, std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>",
   "referenced_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__17is_sameIPKcNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameIbiEEEE",
   "name" : "std::__lazy_not<std::is_same<bool, int>>",
   "referenced_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIbiEEEE",
   "self_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIbiEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__17is_sameIbiEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameIibEEEE",
   "name" : "std::__lazy_not<std::is_same<int, bool>>",
   "referenced_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIibEEEE",
   "self_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIibEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__17is_sameIibEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameIidEEEE",
   "name" : "std::__lazy_not<std::is_same<int, double>>",
   "referenced_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIidEEEE",
   "self_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIidEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__17is_sameIidEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameIijEEEE",
   "name" : "std::__lazy_not<std::is_same<int, unsigned int>>",
   "referenced_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIijEEEE",
   "self_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIijEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__17is_sameIijEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameIixEEEE",
   "name" : "std::__lazy_not<std::is_same<int, long long>>",
   "referenced_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIixEEEE",
   "self_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIixEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__17is_sameIixEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameIiyEEEE",
   "name" : "std::__lazy_not<std::is_same<int, unsigned long long>>",
   "referenced_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIiyEEEE",
   "self_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIiyEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__17is_sameIiyEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "referenced_type" : "_ZTINSt3__110in_place_tE",
   "self_type" : "_ZTINSt3__110in_place_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::is_pointer<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerIPKcEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerIPKcEE",
   "name" : "std::is_pointer<const char *>",
   "referenced_type" : "_ZTINSt3__110is_pointerIPKcEE",
   "self_type" : "_ZTINSt3__110is_pointerIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerIbEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerIbEE",
   "name" : "std::is_pointer<bool>",
   "referenced_type" : "_ZTINSt3__110is_pointerIbEE",
   "self_type" : "_ZTINSt3__110is_pointerIbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerIdEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerIdEE",
   "name" : "std::is_pointer<double>",
   "referenced_type" : "_ZTINSt3__110is_pointerIdEE",
   "self_type" : "_ZTINSt3__110is_pointerIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerIiEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerIiEE",
   "name" : "std::is_pointer<int>",
   "referenced_type" : "_ZTINSt3__110is_pointerIiEE",
   "self_type" : "_ZTINSt3__110is_pointerIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerIjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerIjEE",
   "name" : "std::is_pointer<unsigned int>",
   "referenced_type" : "_ZTINSt3__110is_pointerIjEE",
   "self_type" : "_ZTINSt3__110is_pointerIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerIxEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerIxEE",
   "name" : "std::is_pointer<long long>",
   "referenced_type" : "_ZTINSt3__110is_pointerIxEE",
   "self_type" : "_ZTINSt3__110is_pointerIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerIyEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerIyEE",
   "name" : "std::is_pointer<unsigned long long>",
   "referenced_type" : "_ZTINSt3__110is_pointerIyEE",
   "self_type" : "_ZTINSt3__110is_pointerIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDiEE",
   "name" : "std::is_trivial<char32_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDiEE",
   "self_type" : "_ZTINSt3__110is_trivialIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDsEE",
   "name" : "std::is_trivial<char16_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDsEE",
   "self_type" : "_ZTINSt3__110is_trivialIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "referenced_type" : "_ZTINSt3__110is_trivialIcEE",
   "self_type" : "_ZTINSt3__110is_trivialIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIwEE",
   "self_type" : "_ZTINSt3__110is_trivialIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110less_equalIvEE",
   "name" : "std::less_equal<void>",
   "referenced_type" : "_ZTINSt3__110less_equalIvEE",
   "self_type" : "_ZTINSt3__110less_equalIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110logical_orIvEE",
   "name" : "std::logical_or<void>",
   "referenced_type" : "_ZTINSt3__110logical_orIvEE",
   "self_type" : "_ZTINSt3__110logical_orIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110multipliesIvEE",
   "name" : "std::multiplies<void>",
   "referenced_type" : "_ZTINSt3__110multipliesIvEE",
   "self_type" : "_ZTINSt3__110multipliesIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "referenced_type" : "_ZTINSt3__110owner_lessIvEE",
   "self_type" : "_ZTINSt3__110owner_lessIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELb0EEE",
   "name" : "std::__add_const<std::basic_string<char, std::char_traits<char>, std::allocator<char>>, false>",
   "referenced_type" : "_ZTINSt3__111__add_constINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELb0EEE",
   "self_type" : "_ZTINSt3__111__add_constINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIPKcLb0EEE",
   "name" : "std::__add_const<const char *, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIPKcLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIPKcLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIbLb0EEE",
   "name" : "std::__add_const<bool, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIbLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIbLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIdLb0EEE",
   "name" : "std::__add_const<double, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIdLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIdLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIiLb0EEE",
   "name" : "std::__add_const<int, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIiLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIiLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIjLb0EEE",
   "name" : "std::__add_const<unsigned int, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIjLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIjLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIxLb0EEE",
   "name" : "std::__add_const<long long, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIxLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIxLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIyLb0EEE",
   "name" : "std::__add_const<unsigned long long, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIyLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIyLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char32_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDiEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char16_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDsEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__nat>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__nat>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::add_pointer<const std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKPKcEE",
   "name" : "std::add_pointer<const char *const>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKPKcEE",
   "self_type" : "_ZTINSt3__111add_pointerIKPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKbEE",
   "name" : "std::add_pointer<const bool>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKbEE",
   "self_type" : "_ZTINSt3__111add_pointerIKbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKdEE",
   "name" : "std::add_pointer<const double>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKdEE",
   "self_type" : "_ZTINSt3__111add_pointerIKdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKd" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKiEE",
   "name" : "std::add_pointer<const int>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKiEE",
   "self_type" : "_ZTINSt3__111add_pointerIKiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKjEE",
   "name" : "std::add_pointer<const unsigned int>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKjEE",
   "self_type" : "_ZTINSt3__111add_pointerIKjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKxEE",
   "name" : "std::add_pointer<const long long>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKxEE",
   "self_type" : "_ZTINSt3__111add_pointerIKxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKyEE",
   "name" : "std::add_pointer<const unsigned long long>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKyEE",
   "self_type" : "_ZTINSt3__111add_pointerIKyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::add_pointer<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIPKcEE",
   "name" : "std::add_pointer<const char *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIPKcEE",
   "self_type" : "_ZTINSt3__111add_pointerIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIbEE",
   "name" : "std::add_pointer<bool>",
   "referenced_type" : "_ZTINSt3__111add_pointerIbEE",
   "self_type" : "_ZTINSt3__111add_pointerIbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIdEE",
   "name" : "std::add_pointer<double>",
   "referenced_type" : "_ZTINSt3__111add_pointerIdEE",
   "self_type" : "_ZTINSt3__111add_pointerIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIiEE",
   "name" : "std::add_pointer<int>",
   "referenced_type" : "_ZTINSt3__111add_pointerIiEE",
   "self_type" : "_ZTINSt3__111add_pointerIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIjEE",
   "name" : "std::add_pointer<unsigned int>",
   "referenced_type" : "_ZTINSt3__111add_pointerIjEE",
   "self_type" : "_ZTINSt3__111add_pointerIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIxEE",
   "name" : "std::add_pointer<long long>",
   "referenced_type" : "_ZTINSt3__111add_pointerIxEE",
   "self_type" : "_ZTINSt3__111add_pointerIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIyEE",
   "name" : "std::add_pointer<unsigned long long>",
   "referenced_type" : "_ZTINSt3__111add_pointerIyEE",
   "self_type" : "_ZTINSt3__111add_pointerIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDiEE",
   "name" : "std::char_traits<char32_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDiEE",
   "self_type" : "_ZTINSt3__111char_traitsIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDsEE",
   "name" : "std::char_traits<char16_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDsEE",
   "self_type" : "_ZTINSt3__111char_traitsIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIcEE",
   "name" : "std::char_traits<char>",
   "referenced_type" : "_ZTINSt3__111char_traitsIcEE",
   "self_type" : "_ZTINSt3__111char_traitsIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIwEE",
   "name" : "std::char_traits<wchar_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIwEE",
   "self_type" : "_ZTINSt3__111char_traitsIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "name" : "std::conditional<false, std::pointer_traits<char32_t *>::__nat, char32_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPDiE5__natE", "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "name" : "std::conditional<false, std::pointer_traits<char16_t *>::__nat, char16_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPDsE5__natE", "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "name" : "std::conditional<false, std::pointer_traits<const char *>::__nat, const char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPKcE5__natE", "_ZTIKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "name" : "std::conditional<false, std::pointer_traits<char *>::__nat, char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPcE5__natE", "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "name" : "std::conditional<false, std::pointer_traits<wchar_t *>::__nat, wchar_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPwE5__natE", "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPPKcS2_EE",
   "name" : "std::conditional<false, const char **, const char *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPPKcS2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPPKcS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPPKc", "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPbbEE",
   "name" : "std::conditional<false, bool *, bool>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPbbEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPbbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPb", "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPddEE",
   "name" : "std::conditional<false, double *, double>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPddEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPddEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPd", "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPiiEE",
   "name" : "std::conditional<false, int *, int>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPiiEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPiiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPjjEE",
   "name" : "std::conditional<false, unsigned int *, unsigned int>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPjjEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPjjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPj", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPxxEE",
   "name" : "std::conditional<false, long long *, long long>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPxxEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPxxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPx", "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPyyEE",
   "name" : "std::conditional<false, unsigned long long *, unsigned long long>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPyyEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPyyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPy", "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<basic_string<char>>::_CheckOptionalArgsConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalArgsConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalLikeConstructorIOPKcEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<basic_string<char>>::_CheckOptionalLikeConstructor<const char *&&>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalLikeConstructorIOPKcEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalLikeConstructorIOPKcEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalLikeConstructorIOPKcEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalLikeConstructorIRKPKcEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<basic_string<char>>::_CheckOptionalLikeConstructor<const char *const &>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalLikeConstructorIRKPKcEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalLikeConstructorIRKPKcEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEE29_CheckOptionalLikeConstructorIRKPKcEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIPKcE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<const char *>::_CheckOptionalArgsConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIPKcE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIPKcE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIPKcE29_CheckOptionalArgsConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIbE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<bool>::_CheckOptionalArgsConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIbE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIbE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIbE29_CheckOptionalArgsConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIbE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<bool>::_CheckOptionalLikeConstructor<int &&>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIbE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIbE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIbE29_CheckOptionalLikeConstructorIOiEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIbE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<bool>::_CheckOptionalLikeConstructor<const int &>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIbE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIbE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIbE29_CheckOptionalLikeConstructorIRKiEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIdE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<double>::_CheckOptionalArgsConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIdE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIdE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIdE29_CheckOptionalArgsConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIdE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<double>::_CheckOptionalLikeConstructor<int &&>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIdE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIdE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIdE29_CheckOptionalLikeConstructorIOiEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIdE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<double>::_CheckOptionalLikeConstructor<const int &>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIdE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIdE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIdE29_CheckOptionalLikeConstructorIRKiEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIiE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<int>::_CheckOptionalArgsConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIiE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIiE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIiE29_CheckOptionalArgsConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIiE29_CheckOptionalLikeConstructorIObEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<int>::_CheckOptionalLikeConstructor<bool &&>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIiE29_CheckOptionalLikeConstructorIObEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIiE29_CheckOptionalLikeConstructorIObEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIiE29_CheckOptionalLikeConstructorIObEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIiE29_CheckOptionalLikeConstructorIRKbEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<int>::_CheckOptionalLikeConstructor<const bool &>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIiE29_CheckOptionalLikeConstructorIRKbEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIiE29_CheckOptionalLikeConstructorIRKbEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIiE29_CheckOptionalLikeConstructorIRKbEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIjE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<unsigned int>::_CheckOptionalArgsConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIjE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIjE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIjE29_CheckOptionalArgsConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIjE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<unsigned int>::_CheckOptionalLikeConstructor<int &&>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIjE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIjE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIjE29_CheckOptionalLikeConstructorIOiEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIjE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<unsigned int>::_CheckOptionalLikeConstructor<const int &>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIjE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIjE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIjE29_CheckOptionalLikeConstructorIRKiEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIxE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<long long>::_CheckOptionalArgsConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIxE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIxE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIxE29_CheckOptionalArgsConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIxE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<long long>::_CheckOptionalLikeConstructor<int &&>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIxE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIxE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIxE29_CheckOptionalLikeConstructorIOiEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIxE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<long long>::_CheckOptionalLikeConstructor<const int &>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIxE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIxE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIxE29_CheckOptionalLikeConstructorIRKiEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIyE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<unsigned long long>::_CheckOptionalArgsConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIyE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIyE29_CheckOptionalArgsConstructorENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIyE29_CheckOptionalArgsConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIyE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<unsigned long long>::_CheckOptionalLikeConstructor<int &&>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIyE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIyE29_CheckOptionalLikeConstructorIOiEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIyE29_CheckOptionalLikeConstructorIOiEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_8optionalIyE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::optional<unsigned long long>::_CheckOptionalLikeConstructor<const int &>, std::__check_tuple_constructor_fail>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIyE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_8optionalIyE29_CheckOptionalLikeConstructorIRKiEENS_30__check_tuple_constructor_failEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18optionalIyE29_CheckOptionalLikeConstructorIRKiEE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::is_abstract<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char32_t, std::char_traits<char32_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIDiNS_11char_traitsIDiEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char16_t, std::char_traits<char16_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIDsNS_11char_traitsIDsEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char, std::char_traits<char>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<wchar_t, std::char_traits<wchar_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIwNS_11char_traitsIwEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDiEE",
   "name" : "std::is_abstract<const char32_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKDiEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDsEE",
   "name" : "std::is_abstract<const char16_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKDsEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKcEE",
   "name" : "std::is_abstract<const char *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKwEE",
   "name" : "std::is_abstract<const wchar_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKwEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIbEE",
   "name" : "std::is_abstract<bool>",
   "referenced_type" : "_ZTINSt3__111is_abstractIbEE",
   "self_type" : "_ZTINSt3__111is_abstractIbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIdEE",
   "name" : "std::is_abstract<double>",
   "referenced_type" : "_ZTINSt3__111is_abstractIdEE",
   "self_type" : "_ZTINSt3__111is_abstractIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIiEE",
   "name" : "std::is_abstract<int>",
   "referenced_type" : "_ZTINSt3__111is_abstractIiEE",
   "self_type" : "_ZTINSt3__111is_abstractIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIjEE",
   "name" : "std::is_abstract<unsigned int>",
   "referenced_type" : "_ZTINSt3__111is_abstractIjEE",
   "self_type" : "_ZTINSt3__111is_abstractIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIxEE",
   "name" : "std::is_abstract<long long>",
   "referenced_type" : "_ZTINSt3__111is_abstractIxEE",
   "self_type" : "_ZTINSt3__111is_abstractIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIyEE",
   "name" : "std::is_abstract<unsigned long long>",
   "referenced_type" : "_ZTINSt3__111is_abstractIyEE",
   "self_type" : "_ZTINSt3__111is_abstractIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::is_function<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIPKcLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIPKcEE",
   "name" : "std::is_function<const char *>",
   "referenced_type" : "_ZTINSt3__111is_functionIPKcEE",
   "self_type" : "_ZTINSt3__111is_functionIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIbEE",
   "name" : "std::is_function<bool>",
   "referenced_type" : "_ZTINSt3__111is_functionIbEE",
   "self_type" : "_ZTINSt3__111is_functionIbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIdLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIdEE",
   "name" : "std::is_function<double>",
   "referenced_type" : "_ZTINSt3__111is_functionIdEE",
   "self_type" : "_ZTINSt3__111is_functionIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIiLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIiEE",
   "name" : "std::is_function<int>",
   "referenced_type" : "_ZTINSt3__111is_functionIiEE",
   "self_type" : "_ZTINSt3__111is_functionIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIjLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIjEE",
   "name" : "std::is_function<unsigned int>",
   "referenced_type" : "_ZTINSt3__111is_functionIjEE",
   "self_type" : "_ZTINSt3__111is_functionIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIxLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIxEE",
   "name" : "std::is_function<long long>",
   "referenced_type" : "_ZTINSt3__111is_functionIxEE",
   "self_type" : "_ZTINSt3__111is_functionIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIyLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIyEE",
   "name" : "std::is_function<unsigned long long>",
   "referenced_type" : "_ZTINSt3__111is_functionIyEE",
   "self_type" : "_ZTINSt3__111is_functionIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::is_integral<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111is_integralINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__111is_integralINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIPKcEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIPKcEE",
   "name" : "std::is_integral<const char *>",
   "referenced_type" : "_ZTINSt3__111is_integralIPKcEE",
   "self_type" : "_ZTINSt3__111is_integralIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIbEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIbEE",
   "name" : "std::is_integral<bool>",
   "referenced_type" : "_ZTINSt3__111is_integralIbEE",
   "self_type" : "_ZTINSt3__111is_integralIbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIdEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIdEE",
   "name" : "std::is_integral<double>",
   "referenced_type" : "_ZTINSt3__111is_integralIdEE",
   "self_type" : "_ZTINSt3__111is_integralIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIiEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIiEE",
   "name" : "std::is_integral<int>",
   "referenced_type" : "_ZTINSt3__111is_integralIiEE",
   "self_type" : "_ZTINSt3__111is_integralIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIjEE",
   "name" : "std::is_integral<unsigned int>",
   "referenced_type" : "_ZTINSt3__111is_integralIjEE",
   "self_type" : "_ZTINSt3__111is_integralIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIxEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIxEE",
   "name" : "std::is_integral<long long>",
   "referenced_type" : "_ZTINSt3__111is_integralIxEE",
   "self_type" : "_ZTINSt3__111is_integralIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIyEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIyEE",
   "name" : "std::is_integral<unsigned long long>",
   "referenced_type" : "_ZTINSt3__111is_integralIyEE",
   "self_type" : "_ZTINSt3__111is_integralIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_unsignedIjLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_unsignedIjEE",
   "name" : "std::is_unsigned<unsigned int>",
   "referenced_type" : "_ZTINSt3__111is_unsignedIjEE",
   "self_type" : "_ZTINSt3__111is_unsignedIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_unsignedIyLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_unsignedIyEE",
   "name" : "std::is_unsigned<unsigned long long>",
   "referenced_type" : "_ZTINSt3__111is_unsignedIyEE",
   "self_type" : "_ZTINSt3__111is_unsignedIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_andIvEE",
   "name" : "std::logical_and<void>",
   "referenced_type" : "_ZTINSt3__111logical_andIvEE",
   "self_type" : "_ZTINSt3__111logical_andIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_notIvEE",
   "name" : "std::logical_not<void>",
   "referenced_type" : "_ZTINSt3__111logical_notIvEE",
   "self_type" : "_ZTINSt3__111logical_notIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__115__struct_doubleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__116__struct_double4E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIPiEE",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "_ZTINSt3__112__align_typeIPiEE",
   "self_type" : "_ZTINSt3__112__align_typeIPiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIdEE",
   "name" : "std::__align_type<double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIdEE",
   "self_type" : "_ZTINSt3__112__align_typeIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIeEE",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIeEE",
   "self_type" : "_ZTINSt3__112__align_typeIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIhEE",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "_ZTINSt3__112__align_typeIhEE",
   "self_type" : "_ZTINSt3__112__align_typeIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIjEE",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "_ZTINSt3__112__align_typeIjEE",
   "self_type" : "_ZTINSt3__112__align_typeIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeImEE",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "_ZTINSt3__112__align_typeImEE",
   "self_type" : "_ZTINSt3__112__align_typeImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeItEE",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "_ZTINSt3__112__align_typeItEE",
   "self_type" : "_ZTINSt3__112__align_typeItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIyEE",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112__align_typeIyEE",
   "self_type" : "_ZTINSt3__112__align_typeIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__destruct_nE",
   "name" : "std::__destruct_n",
   "referenced_type" : "_ZTINSt3__112__destruct_nE",
   "self_type" : "_ZTINSt3__112__destruct_nE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__second_tagE",
   "name" : "std::__second_tag",
   "referenced_type" : "_ZTINSt3__112__second_tagE",
   "self_type" : "_ZTINSt3__112__second_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<std::basic_string<char, std::char_traits<char>, std::allocator<char>> &, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
    "_ZTINSt3__117integral_constantIbLb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRPKcNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<const char *&, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRPKcNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRPKcNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPKc", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRbNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<bool &, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRbNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRbNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRb", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRdNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<double &, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRdNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRdNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRd", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRiNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<int &, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRiNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRiNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRi", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRjNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<unsigned int &, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRjNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRjNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRxNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<long long &, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRxNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRxNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRx", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRyNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<unsigned long long &, std::integral_constant<bool, true>>",
   "referenced_type" : "_ZTINSt3__112__select_2ndIRyNS_17integral_constantIbLb1EEEEE",
   "self_type" : "_ZTINSt3__112__select_2ndIRyNS_17integral_constantIbLb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRy", "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__tuple_lessILj0EEE",
   "name" : "std::__tuple_less<0>",
   "referenced_type" : "_ZTINSt3__112__tuple_lessILj0EEE",
   "self_type" : "_ZTINSt3__112__tuple_lessILj0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "name" : "std::alignment_of<std::__struct_double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "self_type" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__115__struct_doubleE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "name" : "std::alignment_of<std::__struct_double4>",
   "referenced_type" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "self_type" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__116__struct_double4E" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj4EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIPiEE",
   "name" : "std::alignment_of<int *>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIPiEE",
   "self_type" : "_ZTINSt3__112alignment_ofIPiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIdEE",
   "name" : "std::alignment_of<double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIdEE",
   "self_type" : "_ZTINSt3__112alignment_ofIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIeEE",
   "name" : "std::alignment_of<long double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIeEE",
   "self_type" : "_ZTINSt3__112alignment_ofIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIhEE",
   "name" : "std::alignment_of<unsigned char>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIhEE",
   "self_type" : "_ZTINSt3__112alignment_ofIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj4EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIjEE",
   "name" : "std::alignment_of<unsigned int>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIjEE",
   "self_type" : "_ZTINSt3__112alignment_ofIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj4EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofImEE",
   "name" : "std::alignment_of<unsigned long>",
   "referenced_type" : "_ZTINSt3__112alignment_ofImEE",
   "self_type" : "_ZTINSt3__112alignment_ofImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofItEE",
   "name" : "std::alignment_of<unsigned short>",
   "referenced_type" : "_ZTINSt3__112alignment_ofItEE",
   "self_type" : "_ZTINSt3__112alignment_ofItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIyEE",
   "name" : "std::alignment_of<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIyEE",
   "self_type" : "_ZTINSt3__112alignment_ofIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112bad_weak_ptrE",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112bad_weak_ptrE",
   "self_type" : "_ZTINSt3__112bad_weak_ptrE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__ulxE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__ulxE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPDi"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA2_Di"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIDi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E",
   "size" : 4,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEEE",
   "name" : "std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEEE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string",
   "template_args" :
   [
    "_ZTIDi",
    "_ZTINSt3__111char_traitsIDiEE",
    "_ZTINSt3__19allocatorIDiEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__ulxE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__ulxE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPDs"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 2,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA5_Ds"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIDs"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E",
   "size" : 2,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEEE",
   "name" : "std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEEE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string",
   "template_args" :
   [
    "_ZTIDs",
    "_ZTINSt3__111char_traitsIDsEE",
    "_ZTINSt3__19allocatorIDsEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "name" : "std::basic_string<char>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "name" : "std::basic_string<char>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "name" : "std::basic_string<char>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "name" : "std::basic_string<char>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "name" : "std::basic_string<char>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA11_c"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "name" : "std::basic_string<char>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIc"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "name" : "std::basic_string<char>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "size" : 1,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string",
   "template_args" : [ "_ZTIc", "_ZTINSt3__111char_traitsIcEE", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "name" : "std::basic_string<wchar_t>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "name" : "std::basic_string<wchar_t>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "name" : "std::basic_string<wchar_t>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "name" : "std::basic_string<wchar_t>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPw"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "name" : "std::basic_string<wchar_t>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA2_w"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "name" : "std::basic_string<wchar_t>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIw"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "name" : "std::basic_string<wchar_t>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "size" : 4,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string",
   "template_args" : [ "_ZTIw", "_ZTINSt3__111char_traitsIwEE", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::is_reference<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_9allocatorIcEEEE",
   "name" : "std::is_reference<std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIPKcEE",
   "name" : "std::is_reference<const char *>",
   "referenced_type" : "_ZTINSt3__112is_referenceIPKcEE",
   "self_type" : "_ZTINSt3__112is_referenceIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIbEE",
   "name" : "std::is_reference<bool>",
   "referenced_type" : "_ZTINSt3__112is_referenceIbEE",
   "self_type" : "_ZTINSt3__112is_referenceIbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIdEE",
   "name" : "std::is_reference<double>",
   "referenced_type" : "_ZTINSt3__112is_referenceIdEE",
   "self_type" : "_ZTINSt3__112is_referenceIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIiEE",
   "name" : "std::is_reference<int>",
   "referenced_type" : "_ZTINSt3__112is_referenceIiEE",
   "self_type" : "_ZTINSt3__112is_referenceIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIjEE",
   "name" : "std::is_reference<unsigned int>",
   "referenced_type" : "_ZTINSt3__112is_referenceIjEE",
   "self_type" : "_ZTINSt3__112is_referenceIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIxEE",
   "name" : "std::is_reference<long long>",
   "referenced_type" : "_ZTINSt3__112is_referenceIxEE",
   "self_type" : "_ZTINSt3__112is_referenceIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIyEE",
   "name" : "std::is_reference<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112is_referenceIyEE",
   "self_type" : "_ZTINSt3__112is_referenceIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112not_equal_toIvEE",
   "name" : "std::not_equal_to<void>",
   "referenced_type" : "_ZTINSt3__112not_equal_toIvEE",
   "self_type" : "_ZTINSt3__112not_equal_toIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "name" : "std::placeholders::__ph<10>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "name" : "std::placeholders::__ph<1>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "name" : "std::placeholders::__ph<2>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "name" : "std::placeholders::__ph<3>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "name" : "std::placeholders::__ph<4>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "name" : "std::placeholders::__ph<5>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "name" : "std::placeholders::__ph<6>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "name" : "std::placeholders::__ph<7>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "name" : "std::placeholders::__ph<8>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "name" : "std::placeholders::__ph<9>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIDiEE",
   "name" : "std::remove_const<char32_t>",
   "referenced_type" : "_ZTINSt3__112remove_constIDiEE",
   "self_type" : "_ZTINSt3__112remove_constIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIDsEE",
   "name" : "std::remove_const<char16_t>",
   "referenced_type" : "_ZTINSt3__112remove_constIDsEE",
   "self_type" : "_ZTINSt3__112remove_constIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::remove_const<const std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_8optionalIbEEEE",
   "name" : "std::remove_const<const std::optional<bool>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_8optionalIbEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_8optionalIbEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__18optionalIbEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_9nullopt_tEEE",
   "name" : "std::remove_const<const std::nullopt_t>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_9nullopt_tEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_9nullopt_tEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__19nullopt_tE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKPKcEE",
   "name" : "std::remove_const<const char *const>",
   "referenced_type" : "_ZTINSt3__112remove_constIKPKcEE",
   "self_type" : "_ZTINSt3__112remove_constIKPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKbEE",
   "name" : "std::remove_const<const bool>",
   "referenced_type" : "_ZTINSt3__112remove_constIKbEE",
   "self_type" : "_ZTINSt3__112remove_constIKbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKcEE",
   "name" : "std::remove_const<const char>",
   "referenced_type" : "_ZTINSt3__112remove_constIKcEE",
   "self_type" : "_ZTINSt3__112remove_constIKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKdEE",
   "name" : "std::remove_const<const double>",
   "referenced_type" : "_ZTINSt3__112remove_constIKdEE",
   "self_type" : "_ZTINSt3__112remove_constIKdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKd" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKiEE",
   "name" : "std::remove_const<const int>",
   "referenced_type" : "_ZTINSt3__112remove_constIKiEE",
   "self_type" : "_ZTINSt3__112remove_constIKiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKjEE",
   "name" : "std::remove_const<const unsigned int>",
   "referenced_type" : "_ZTINSt3__112remove_constIKjEE",
   "self_type" : "_ZTINSt3__112remove_constIKjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKxEE",
   "name" : "std::remove_const<const long long>",
   "referenced_type" : "_ZTINSt3__112remove_constIKxEE",
   "self_type" : "_ZTINSt3__112remove_constIKxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKyEE",
   "name" : "std::remove_const<const unsigned long long>",
   "referenced_type" : "_ZTINSt3__112remove_constIKyEE",
   "self_type" : "_ZTINSt3__112remove_constIKyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::remove_const<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_8optionalIPKcEEEE",
   "name" : "std::remove_const<std::optional<const char *>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_8optionalIPKcEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_8optionalIPKcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__18optionalIPKcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_8optionalIiEEEE",
   "name" : "std::remove_const<std::optional<int>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_8optionalIiEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_8optionalIiEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__18optionalIiEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIONS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::remove_const<std::basic_string<char, std::char_traits<char>, std::allocator<char>> &&>",
   "referenced_type" : "_ZTINSt3__112remove_constIONS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIONS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIONSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOPKcEE",
   "name" : "std::remove_const<const char *&&>",
   "referenced_type" : "_ZTINSt3__112remove_constIOPKcEE",
   "self_type" : "_ZTINSt3__112remove_constIOPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIObEE",
   "name" : "std::remove_const<bool &&>",
   "referenced_type" : "_ZTINSt3__112remove_constIObEE",
   "self_type" : "_ZTINSt3__112remove_constIObEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOdEE",
   "name" : "std::remove_const<double &&>",
   "referenced_type" : "_ZTINSt3__112remove_constIOdEE",
   "self_type" : "_ZTINSt3__112remove_constIOdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOd" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOiEE",
   "name" : "std::remove_const<int &&>",
   "referenced_type" : "_ZTINSt3__112remove_constIOiEE",
   "self_type" : "_ZTINSt3__112remove_constIOiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOjEE",
   "name" : "std::remove_const<unsigned int &&>",
   "referenced_type" : "_ZTINSt3__112remove_constIOjEE",
   "self_type" : "_ZTINSt3__112remove_constIOjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOxEE",
   "name" : "std::remove_const<long long &&>",
   "referenced_type" : "_ZTINSt3__112remove_constIOxEE",
   "self_type" : "_ZTINSt3__112remove_constIOxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOyEE",
   "name" : "std::remove_const<unsigned long long &&>",
   "referenced_type" : "_ZTINSt3__112remove_constIOyEE",
   "self_type" : "_ZTINSt3__112remove_constIOyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIOy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIPKcEE",
   "name" : "std::remove_const<const char *>",
   "referenced_type" : "_ZTINSt3__112remove_constIPKcEE",
   "self_type" : "_ZTINSt3__112remove_constIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::remove_const<const std::basic_string<char, std::char_traits<char>, std::allocator<char>> &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIRKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKPKcEE",
   "name" : "std::remove_const<const char *const &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKPKcEE",
   "self_type" : "_ZTINSt3__112remove_constIRKPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKbEE",
   "name" : "std::remove_const<const bool &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKbEE",
   "self_type" : "_ZTINSt3__112remove_constIRKbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKdEE",
   "name" : "std::remove_const<const double &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKdEE",
   "self_type" : "_ZTINSt3__112remove_constIRKdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKd" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKiEE",
   "name" : "std::remove_const<const int &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKiEE",
   "self_type" : "_ZTINSt3__112remove_constIRKiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKjEE",
   "name" : "std::remove_const<const unsigned int &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKjEE",
   "self_type" : "_ZTINSt3__112remove_constIRKjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKxEE",
   "name" : "std::remove_const<const long long &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKxEE",
   "self_type" : "_ZTINSt3__112remove_constIRKxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKyEE",
   "name" : "std::remove_const<const unsigned long long &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRKyEE",
   "self_type" : "_ZTINSt3__112remove_constIRKyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::remove_const<std::basic_string<char, std::char_traits<char>, std::allocator<char>> &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRPKcEE",
   "name" : "std::remove_const<const char *&>",
   "referenced_type" : "_ZTINSt3__112remove_constIRPKcEE",
   "self_type" : "_ZTINSt3__112remove_constIRPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRbEE",
   "name" : "std::remove_const<bool &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRbEE",
   "self_type" : "_ZTINSt3__112remove_constIRbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRdEE",
   "name" : "std::remove_const<double &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRdEE",
   "self_type" : "_ZTINSt3__112remove_constIRdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRd" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRiEE",
   "name" : "std::remove_const<int &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRiEE",
   "self_type" : "_ZTINSt3__112remove_constIRiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRjEE",
   "name" : "std::remove_const<unsigned int &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRjEE",
   "self_type" : "_ZTINSt3__112remove_constIRjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRxEE",
   "name" : "std::remove_const<long long &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRxEE",
   "self_type" : "_ZTINSt3__112remove_constIRxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRyEE",
   "name" : "std::remove_const<unsigned long long &>",
   "referenced_type" : "_ZTINSt3__112remove_constIRyEE",
   "self_type" : "_ZTINSt3__112remove_constIRyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIbEE",
   "name" : "std::remove_const<bool>",
   "referenced_type" : "_ZTINSt3__112remove_constIbEE",
   "self_type" : "_ZTINSt3__112remove_constIbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIcEE",
   "name" : "std::remove_const<char>",
   "referenced_type" : "_ZTINSt3__112remove_constIcEE",
   "self_type" : "_ZTINSt3__112remove_constIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIdEE",
   "name" : "std::remove_const<double>",
   "referenced_type" : "_ZTINSt3__112remove_constIdEE",
   "self_type" : "_ZTINSt3__112remove_constIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIiEE",
   "name" : "std::remove_const<int>",
   "referenced_type" : "_ZTINSt3__112remove_constIiEE",
   "self_type" : "_ZTINSt3__112remove_constIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIjEE",
   "name" : "std::remove_const<unsigned int>",
   "referenced_type" : "_ZTINSt3__112remove_constIjEE",
   "self_type" : "_ZTINSt3__112remove_constIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIwEE",
   "name" : "std::remove_const<wchar_t>",
   "referenced_type" : "_ZTINSt3__112remove_constIwEE",
   "self_type" : "_ZTINSt3__112remove_constIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIxEE",
   "name" : "std::remove_const<long long>",
   "referenced_type" : "_ZTINSt3__112remove_constIxEE",
   "self_type" : "_ZTINSt3__112remove_constIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIyEE",
   "name" : "std::remove_const<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112remove_constIyEE",
   "self_type" : "_ZTINSt3__112remove_constIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "name" : "std::__make_signed<bool, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "name" : "std::__make_signed<int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "name" : "std::__make_signed<unsigned int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "name" : "std::__make_signed<long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedImLb1EEE",
   "name" : "std::__make_signed<unsigned long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "name" : "std::__make_signed<short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedItLb1EEE",
   "name" : "std::__make_signed<unsigned short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "name" : "std::__make_signed<long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "name" : "std::__make_signed<unsigned long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionINS_6_PairTEjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashINS_6_PairTELj2EEE",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__16_PairTE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIdjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIdLj2EEE",
   "name" : "std::__scalar_hash<double, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIdLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIdLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIejEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIeLj2EEE",
   "name" : "std::__scalar_hash<long double, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIeLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIeLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIfjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIfLj1EEE",
   "name" : "std::__scalar_hash<float, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIfLj1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIfLj1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIxjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIxLj2EEE",
   "name" : "std::__scalar_hash<long long, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIxLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIxLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIyjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIyLj2EEE",
   "name" : "std::__scalar_hash<unsigned long long, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIyLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIyLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_equalILj0EEE",
   "name" : "std::__tuple_equal<0>",
   "referenced_type" : "_ZTINSt3__113__tuple_equalILj0EEE",
   "self_type" : "_ZTINSt3__113__tuple_equalILj0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_typesIJEEE",
   "name" : "std::__tuple_types<>",
   "referenced_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "self_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113greater_equalIvEE",
   "name" : "std::greater_equal<void>",
   "referenced_type" : "_ZTINSt3__113greater_equalIvEE",
   "self_type" : "_ZTINSt3__113greater_equalIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::is_arithmetic<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__113is_arithmeticINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIPKcEE",
   "name" : "std::is_arithmetic<const char *>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIPKcEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIbEE",
   "name" : "std::is_arithmetic<bool>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIbEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIdEE",
   "name" : "std::is_arithmetic<double>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIdEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIiEE",
   "name" : "std::is_arithmetic<int>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIiEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIjEE",
   "name" : "std::is_arithmetic<unsigned int>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIjEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIxEE",
   "name" : "std::is_arithmetic<long long>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIxEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIyEE",
   "name" : "std::is_arithmetic<unsigned long long>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIyEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEOS6_Lb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEOS6_EE",
   "name" : "std::is_assignable<std::basic_string<char, std::char_traits<char>, std::allocator<char>> &, std::basic_string<char, std::char_traits<char>, std::allocator<char>> &&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEOS6_EE",
   "self_type" : "_ZTINSt3__113is_assignableIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEOS6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
    "_ZTIONSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEERKS6_Lb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEERKS6_EE",
   "name" : "std::is_assignable<std::basic_string<char, std::char_traits<char>, std::allocator<char>> &, const std::basic_string<char, std::char_traits<char>, std::allocator<char>> &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEERKS6_EE",
   "self_type" : "_ZTINSt3__113is_assignableIRNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEERKS6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
    "_ZTIRKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRPKcOS2_Lb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRPKcOS2_EE",
   "name" : "std::is_assignable<const char *&, const char *&&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRPKcOS2_EE",
   "self_type" : "_ZTINSt3__113is_assignableIRPKcOS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPKc", "_ZTIOPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRPKcRKS2_Lb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRPKcRKS2_EE",
   "name" : "std::is_assignable<const char *&, const char *const &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRPKcRKS2_EE",
   "self_type" : "_ZTINSt3__113is_assignableIRPKcRKS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPKc", "_ZTIRKPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRbObLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRbObEE",
   "name" : "std::is_assignable<bool &, bool &&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRbObEE",
   "self_type" : "_ZTINSt3__113is_assignableIRbObEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRb", "_ZTIOb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRbRKbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRbRKbEE",
   "name" : "std::is_assignable<bool &, const bool &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRbRKbEE",
   "self_type" : "_ZTINSt3__113is_assignableIRbRKbEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRb", "_ZTIRKb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRdOdLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRdOdEE",
   "name" : "std::is_assignable<double &, double &&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRdOdEE",
   "self_type" : "_ZTINSt3__113is_assignableIRdOdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRd", "_ZTIOd" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRdRKdLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRdRKdEE",
   "name" : "std::is_assignable<double &, const double &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRdRKdEE",
   "self_type" : "_ZTINSt3__113is_assignableIRdRKdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRd", "_ZTIRKd" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRiOiLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRiOiEE",
   "name" : "std::is_assignable<int &, int &&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRiOiEE",
   "self_type" : "_ZTINSt3__113is_assignableIRiOiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRi", "_ZTIOi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRiRKiLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRiRKiEE",
   "name" : "std::is_assignable<int &, const int &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRiRKiEE",
   "self_type" : "_ZTINSt3__113is_assignableIRiRKiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRi", "_ZTIRKi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRjOjLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRjOjEE",
   "name" : "std::is_assignable<unsigned int &, unsigned int &&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRjOjEE",
   "self_type" : "_ZTINSt3__113is_assignableIRjOjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj", "_ZTIOj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRjRKjLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRjRKjEE",
   "name" : "std::is_assignable<unsigned int &, const unsigned int &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRjRKjEE",
   "self_type" : "_ZTINSt3__113is_assignableIRjRKjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRj", "_ZTIRKj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRxOxLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRxOxEE",
   "name" : "std::is_assignable<long long &, long long &&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRxOxEE",
   "self_type" : "_ZTINSt3__113is_assignableIRxOxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRx", "_ZTIOx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRxRKxLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRxRKxEE",
   "name" : "std::is_assignable<long long &, const long long &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRxRKxEE",
   "self_type" : "_ZTINSt3__113is_assignableIRxRKxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRx", "_ZTIRKx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRyOyLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRyOyEE",
   "name" : "std::is_assignable<unsigned long long &, unsigned long long &&>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRyOyEE",
   "self_type" : "_ZTINSt3__113is_assignableIRyOyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRy", "_ZTIOy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRyRKyLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRyRKyEE",
   "name" : "std::is_assignable<unsigned long long &, const unsigned long long &>",
   "referenced_type" : "_ZTINSt3__113is_assignableIRyRKyEE",
   "self_type" : "_ZTINSt3__113is_assignableIRyRKyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRy", "_ZTIRKy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIPKcEE",
   "name" : "std::remove_extent<const char *>",
   "referenced_type" : "_ZTINSt3__113remove_extentIPKcEE",
   "self_type" : "_ZTINSt3__113remove_extentIPKcEE",
   "size" : 1,
