#ifndef HIDL_GENERATED_ANDROID_FRAMEWORKS_STATS_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_FRAMEWORKS_STATS_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace frameworks {
namespace stats {
namespace V1_0 {

// Forward declaration for forward reference support:
struct SpeakerImpedance;
struct HardwareFailed;
struct PhysicalDropDetected;
struct ChargeCycles;
struct BatteryHealthSnapshotArgs;
struct SlowIo;
struct BatteryCausedShutdown;
struct UsbPortOverheatEvent;
struct SpeechDspStat;
struct VendorAtom;

/*
 * Represents the detected speaker impedance value.
 */
struct SpeakerImpedance final {
    /*
     * A vendor-specific value identifying a particular speaker on the device.
     * This value is opaque to the server, it must not try to interpret any
     * meaning to this location.
     */
    int32_t speakerLocation __attribute__ ((aligned(4)));
    /*
     * The detected impedance in milliOhms.
     */
    int32_t milliOhms __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::frameworks::stats::V1_0::SpeakerImpedance, speakerLocation) == 0, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::SpeakerImpedance, milliOhms) == 4, "wrong offset");
static_assert(sizeof(::android::frameworks::stats::V1_0::SpeakerImpedance) == 8, "wrong size");
static_assert(__alignof(::android::frameworks::stats::V1_0::SpeakerImpedance) == 4, "wrong alignment");

/*
 * Represents a failed hardware report.
 */
struct HardwareFailed final {
    // Forward declaration for forward reference support:
    enum class HardwareType : int32_t;
    enum class HardwareErrorCode : int32_t;

    /*
     * HardwareType for reportHardwareFailed
     */
    enum class HardwareType : int32_t {
        UNKNOWN = 0,
        MICROPHONE = 1,
        CODEC = 2,
        SPEAKER = 3,
        FINGERPRINT = 4,
    };

    /**
     * ErrorCodes for reportHardwareFailed.
     * ErrorCode interpretation depends on the hardwareType parameter.
     * Values prefixed by different hardwareTypes overlap.
     * COMPLETE refers to a complete failure e.g. non-responsive microphone.
     * For most components, unless a more specific failure exists, COMPLETE should be used.
     * UNKNOWN refers to an unexpected or unknown error.
     */
    enum class HardwareErrorCode : int32_t {
        UNKNOWN = 0,
        COMPLETE = 1 /* ::android::frameworks::stats::V1_0::HardwareFailed::HardwareErrorCode.UNKNOWN implicitly + 1 */,
        SPEAKER_HIGH_Z = 2 /* ::android::frameworks::stats::V1_0::HardwareFailed::HardwareErrorCode.COMPLETE implicitly + 1 */,
        SPEAKER_SHORT = 3 /* ::android::frameworks::stats::V1_0::HardwareFailed::HardwareErrorCode.SPEAKER_HIGH_Z implicitly + 1 */,
        FINGERPRINT_SENSOR_BROKEN = 4 /* ::android::frameworks::stats::V1_0::HardwareFailed::HardwareErrorCode.SPEAKER_SHORT implicitly + 1 */,
        FINGERPRINT_TOO_MANY_DEAD_PIXELS = 5 /* ::android::frameworks::stats::V1_0::HardwareFailed::HardwareErrorCode.FINGERPRINT_SENSOR_BROKEN implicitly + 1 */,
        DEGRADE = 6 /* ::android::frameworks::stats::V1_0::HardwareFailed::HardwareErrorCode.FINGERPRINT_TOO_MANY_DEAD_PIXELS implicitly + 1 */,
    };

    ::android::frameworks::stats::V1_0::HardwareFailed::HardwareType hardwareType __attribute__ ((aligned(4)));
    /**
     * hardware_location allows vendors to differentiate between multiple
     * instances of the same hardware_type. The specific locations are vendor
     * defined integers, referring to board-specific numbering schemes.
     */
    int32_t hardwareLocation __attribute__ ((aligned(4)));
    ::android::frameworks::stats::V1_0::HardwareFailed::HardwareErrorCode errorCode __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::frameworks::stats::V1_0::HardwareFailed, hardwareType) == 0, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::HardwareFailed, hardwareLocation) == 4, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::HardwareFailed, errorCode) == 8, "wrong offset");
static_assert(sizeof(::android::frameworks::stats::V1_0::HardwareFailed) == 12, "wrong size");
static_assert(__alignof(::android::frameworks::stats::V1_0::HardwareFailed) == 4, "wrong alignment");

/*
 * Represents a physical drop detected event.
 */
struct PhysicalDropDetected final {
    /*
     * Confidence that the event was actually a drop, 0 -> 100
     */
    uint8_t confidencePctg __attribute__ ((aligned(1)));
    /*
     * Peak acceleration of the drop, in 1/1000s of a g.
     */
    int32_t accelPeak __attribute__ ((aligned(4)));
    /*
     * Duration of freefall in ms.
     */
    int32_t freefallDuration __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::frameworks::stats::V1_0::PhysicalDropDetected, confidencePctg) == 0, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::PhysicalDropDetected, accelPeak) == 4, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::PhysicalDropDetected, freefallDuration) == 8, "wrong offset");
static_assert(sizeof(::android::frameworks::stats::V1_0::PhysicalDropDetected) == 12, "wrong size");
static_assert(__alignof(::android::frameworks::stats::V1_0::PhysicalDropDetected) == 4, "wrong alignment");

/**
 * Represents bucketed battery charge cycles.
 *
 * Each list of buckets represents the number of times
 * the battery has charged past equal-sized fractions of full capacity.
 * For example, given the vector [12, 11, 10, 9, 8, 7, 6, 5], the battery
 * has charged past 1/8th full 12 times, 2/8ths full 11 times, etc.
 */
struct ChargeCycles final {
    ::android::hardware::hidl_vec<int32_t> cycleBucket __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::frameworks::stats::V1_0::ChargeCycles, cycleBucket) == 0, "wrong offset");
static_assert(sizeof(::android::frameworks::stats::V1_0::ChargeCycles) == 16, "wrong size");
static_assert(__alignof(::android::frameworks::stats::V1_0::ChargeCycles) == 8, "wrong alignment");

/**
 * Represents parameters for reportBatteryHealthSnapshot.
 */
struct BatteryHealthSnapshotArgs final {
    // Forward declaration for forward reference support:
    enum class BatterySnapshotType : int32_t;

    /*
     * The instance of this snapshot.
     */
    enum class BatterySnapshotType : int32_t {
        MIN_TEMP = 1,
        MAX_TEMP = 2 /* ::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs::BatterySnapshotType.MIN_TEMP implicitly + 1 */,
        MIN_RESISTANCE = 3 /* ::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs::BatterySnapshotType.MAX_TEMP implicitly + 1 */,
        MAX_RESISTANCE = 4 /* ::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs::BatterySnapshotType.MIN_RESISTANCE implicitly + 1 */,
        MIN_VOLTAGE = 5 /* ::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs::BatterySnapshotType.MAX_RESISTANCE implicitly + 1 */,
        MAX_VOLTAGE = 6 /* ::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs::BatterySnapshotType.MIN_VOLTAGE implicitly + 1 */,
        MIN_CURRENT = 7 /* ::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs::BatterySnapshotType.MAX_VOLTAGE implicitly + 1 */,
        MAX_CURRENT = 8 /* ::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs::BatterySnapshotType.MIN_CURRENT implicitly + 1 */,
        MIN_BATT_LEVEL = 9 /* ::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs::BatterySnapshotType.MAX_CURRENT implicitly + 1 */,
        MAX_BATT_LEVEL = 10 /* ::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs::BatterySnapshotType.MIN_BATT_LEVEL implicitly + 1 */,
        AVG_RESISTANCE = 11 /* ::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs::BatterySnapshotType.MAX_BATT_LEVEL implicitly + 1 */,
    };

    ::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs::BatterySnapshotType type __attribute__ ((aligned(4)));
    /*
     * Temperature Temperature, in 1/10ths of degree C.
     */
    int32_t temperatureDeciC __attribute__ ((aligned(4)));
    /*
     * Voltage Battery Voltage, in microVolts.
     */
    int32_t voltageMicroV __attribute__ ((aligned(4)));
    /*
     * Current Battery current, in microAmps.
     */
    int32_t currentMicroA __attribute__ ((aligned(4)));
    /*
     * OpenCircuitVoltage Battery Open Circuit Voltage, in microVolts.
     */
    int32_t openCircuitVoltageMicroV __attribute__ ((aligned(4)));
    /*
     * Resistance Battery Resistance, in microOhms.
     */
    int32_t resistanceMicroOhm __attribute__ ((aligned(4)));
    /*
     * Level Battery Level, as % of full.
     */
    int32_t levelPercent __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs, type) == 0, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs, temperatureDeciC) == 4, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs, voltageMicroV) == 8, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs, currentMicroA) == 12, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs, openCircuitVoltageMicroV) == 16, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs, resistanceMicroOhm) == 20, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs, levelPercent) == 24, "wrong offset");
static_assert(sizeof(::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs) == 28, "wrong size");
static_assert(__alignof(::android::frameworks::stats::V1_0::BatteryHealthSnapshotArgs) == 4, "wrong alignment");

/**
 * Represents slow I/O operations on the primary flash storage, aggregated.
 */
struct SlowIo final {
    // Forward declaration for forward reference support:
    enum class IoOperation : int32_t;

    /*
     * Classifications of IO Operations for reportSlowIo.
     */
    enum class IoOperation : int32_t {
        UNKNOWN = 0,
        READ = 1 /* ::android::frameworks::stats::V1_0::SlowIo::IoOperation.UNKNOWN implicitly + 1 */,
        WRITE = 2 /* ::android::frameworks::stats::V1_0::SlowIo::IoOperation.READ implicitly + 1 */,
        UNMAP = 3 /* ::android::frameworks::stats::V1_0::SlowIo::IoOperation.WRITE implicitly + 1 */,
        SYNC = 4 /* ::android::frameworks::stats::V1_0::SlowIo::IoOperation.UNMAP implicitly + 1 */,
    };

    ::android::frameworks::stats::V1_0::SlowIo::IoOperation operation __attribute__ ((aligned(4)));
    /*
     * The number of slow IO operations of this type over 24 hours.
     */
    int32_t count __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::frameworks::stats::V1_0::SlowIo, operation) == 0, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::SlowIo, count) == 4, "wrong offset");
static_assert(sizeof(::android::frameworks::stats::V1_0::SlowIo) == 8, "wrong size");
static_assert(__alignof(::android::frameworks::stats::V1_0::SlowIo) == 4, "wrong alignment");

/**
 * Represents BatteryCausedShutdown with the last recorded voltage.
 */
struct BatteryCausedShutdown final {
    /*
     * The last recorded battery voltage prior to shutdown.
     */
    int32_t voltageMicroV __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::frameworks::stats::V1_0::BatteryCausedShutdown, voltageMicroV) == 0, "wrong offset");
static_assert(sizeof(::android::frameworks::stats::V1_0::BatteryCausedShutdown) == 4, "wrong size");
static_assert(__alignof(::android::frameworks::stats::V1_0::BatteryCausedShutdown) == 4, "wrong alignment");

/**
 * Represents USB port overheat event.
 */
struct UsbPortOverheatEvent final {
    /*
     * Temperature of USB port at USB plug event, in 1/10ths of degree C.
     */
    int32_t plugTemperatureDeciC __attribute__ ((aligned(4)));
    /*
     * Maximum temperature of USB port during overheat event, in 1/10ths of degree C.
     */
    int32_t maxTemperatureDeciC __attribute__ ((aligned(4)));
    /*
     * Time between USB plug event and overheat threshold trip, in seconds.
     */
    int32_t timeToOverheat __attribute__ ((aligned(4)));
    /*
     * Time between overheat threshold trip and hysteresis, in seconds.
     */
    int32_t timeToHysteresis __attribute__ ((aligned(4)));
    /*
     * Time between hysteresis and active mitigation ending, in seconds.
     */
    int32_t timeToInactive __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::frameworks::stats::V1_0::UsbPortOverheatEvent, plugTemperatureDeciC) == 0, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::UsbPortOverheatEvent, maxTemperatureDeciC) == 4, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::UsbPortOverheatEvent, timeToOverheat) == 8, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::UsbPortOverheatEvent, timeToHysteresis) == 12, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::UsbPortOverheatEvent, timeToInactive) == 16, "wrong offset");
static_assert(sizeof(::android::frameworks::stats::V1_0::UsbPortOverheatEvent) == 20, "wrong size");
static_assert(__alignof(::android::frameworks::stats::V1_0::UsbPortOverheatEvent) == 4, "wrong alignment");

/*
 * Represents the speech DSP stat of total uptime, downtime, crash count and recover count.
 */
struct SpeechDspStat final {
    /*
     * Speech DSP total up time in milliseconds.
     */
    int32_t totalUptimeMillis __attribute__ ((aligned(4)));
    /*
     * Speech DSP total down time in milliseconds.
     */
    int32_t totalDowntimeMillis __attribute__ ((aligned(4)));
    /*
     * Speech DSP total crash count.
     */
    int32_t totalCrashCount __attribute__ ((aligned(4)));
    /*
     * Speech DSP recover mechanism trigger count.
     */
    int32_t totalRecoverCount __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::frameworks::stats::V1_0::SpeechDspStat, totalUptimeMillis) == 0, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::SpeechDspStat, totalDowntimeMillis) == 4, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::SpeechDspStat, totalCrashCount) == 8, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::SpeechDspStat, totalRecoverCount) == 12, "wrong offset");
static_assert(sizeof(::android::frameworks::stats::V1_0::SpeechDspStat) == 16, "wrong size");
static_assert(__alignof(::android::frameworks::stats::V1_0::SpeechDspStat) == 4, "wrong alignment");

/*
 * Generic vendor atom that allows dynamically allocated atoms to be uploaded
 * through statsd.
 *
 * Here's an example that uses this struct:
 *     VendorAtom atom = {
 *         .atomId  = 100000,
 *         .values  = {2, 70000, 5.2, 4, "a"}
 *     };
 *
 * The resulting LogEvent must have the following fields:
 *     Index    Value
 *     0x1      2
 *     0x2      70000
 *     0x3      5.2
 *     0x4      4
 *     0x5      "a"
 */
struct VendorAtom final {
    // Forward declaration for forward reference support:
    struct Value;

    /*
     * Supported field types for this struct.
     */
    struct Value final {
        enum class hidl_discriminator : uint8_t {
            intValue = 0,  // int32_t
            longValue = 1,  // int64_t
            floatValue = 2,  // float
            stringValue = 3,  // ::android::hardware::hidl_string
        };

        Value();
        ~Value();
        Value(Value&&);
        Value(const Value&);
        Value& operator=(Value&&);
        Value& operator=(const Value&);

        void intValue(int32_t);
        int32_t& intValue();
        int32_t intValue() const;

        void longValue(int64_t);
        int64_t& longValue();
        int64_t longValue() const;

        void floatValue(float);
        float& floatValue();
        float floatValue() const;

        void stringValue(const ::android::hardware::hidl_string&);
        void stringValue(::android::hardware::hidl_string&&);
        ::android::hardware::hidl_string& stringValue();
        const ::android::hardware::hidl_string& stringValue() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::frameworks::stats::V1_0::VendorAtom::Value, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            int32_t intValue __attribute__ ((aligned(4)));
            int64_t longValue __attribute__ ((aligned(8)));
            float floatValue __attribute__ ((aligned(4)));
            ::android::hardware::hidl_string stringValue __attribute__ ((aligned(8)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::frameworks::stats::V1_0::VendorAtom::Value::hidl_union) == 16, "wrong size");
        static_assert(__alignof(::android::frameworks::stats::V1_0::VendorAtom::Value::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::frameworks::stats::V1_0::VendorAtom::Value::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::frameworks::stats::V1_0::VendorAtom::Value::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::frameworks::stats::V1_0::VendorAtom::Value) == 24, "wrong size");
    static_assert(__alignof(::android::frameworks::stats::V1_0::VendorAtom::Value) == 8, "wrong alignment");

    /**
     * Vendor or OEM reverse domain name. Must be less than 50 characters.
     * Ex. "com.google.pixel"
     */
    ::android::hardware::hidl_string reverseDomainName __attribute__ ((aligned(8)));
    /*
     * Atom ID. Must be between 100,000 - 199,999 to indicate non-AOSP field.
     */
    int32_t atomId __attribute__ ((aligned(4)));
    /*
     * Vector of fields in the order that the LogEvent should be filled.
     */
    ::android::hardware::hidl_vec<::android::frameworks::stats::V1_0::VendorAtom::Value> values __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::frameworks::stats::V1_0::VendorAtom, reverseDomainName) == 0, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::VendorAtom, atomId) == 16, "wrong offset");
static_assert(offsetof(::android::frameworks::stats::V1_0::VendorAtom, values) == 24, "wrong offset");
static_assert(sizeof(::android::frameworks::stats::V1_0::VendorAtom) == 40, "wrong size");
static_assert(__alignof(::android::frameworks::stats::V1_0::VendorAtom) == 8, "wrong alignment");

//
// type declarations for package
//

static inline std::string toString(const ::android::frameworks::stats::V1_0::SpeakerImpedance& o);
static inline void PrintTo(const ::android::frameworks::stats::V1_0::SpeakerImpedance& o, ::std::ostream*);
static inline bool operator==(const ::android::frameworks::stats::V1_0::SpeakerImpedance& lhs, const ::android::frameworks::stats::V1_0::SpeakerImpedance& rhs);
static inline bool operator!=(const ::android::frameworks::stats::V1_0::SpeakerImpedance& lhs, const ::android::frameworks::stats::V1_0::SpeakerImpedance& rhs);

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::frameworks::stats::V1_0::HardwareFailed::HardwareType o);
static inline void PrintTo(::android::frameworks::stats::V1_0::HardwareFailed::HardwareType o, ::std::ostream* os);
