{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_8in6_addr",
   "name" : "in6_addr [0]",
   "referenced_type" : "_ZTI8in6_addr",
   "self_type" : "_ZTIA0_8in6_addr",
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1025_c",
   "name" : "char [1025]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA1025_c",
   "size" : 1025,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_N11__res_stateUt_E",
   "name" : "__res_state::(anonymous struct at bionic/libc/dns/include/resolv_private.h:166:2) [10]",
   "referenced_type" : "_ZTIN11__res_stateUt_E",
   "self_type" : "_ZTIA10_N11__res_stateUt_E",
   "size" : 80,
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA126_c",
   "name" : "char [126]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA126_c",
   "size" : 126,

   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFvvE",
   "name" : "void (*)(void)",
   "referenced_type" : "_ZTIFvvE",
   "self_type" : "_ZTIPFvvE",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK8sockaddr",
   "name" : "const sockaddr *",
   "referenced_type" : "_ZTIK8sockaddr",
   "self_type" : "_ZTIPK8sockaddr",
   "size" : 8,
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKP8sockaddr",
   "name" : "sockaddr *const *",
   "referenced_type" : "_ZTIKP8sockaddr",
   "self_type" : "_ZTIPKP8sockaddr",
   "size" : 8,
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 8,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 8,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKh",
   "name" : "const unsigned char **",
   "referenced_type" : "_ZTIPKh",
   "self_type" : "_ZTIPPKh",
   "size" : 8,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPc",
   "name" : "char **",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIPPc",
   "size" : 8,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 8,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 8,
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIA5_KPKc",
   "name" : "const char *const[5]",
   "referenced_type" : "_ZTIA5_PKc",
   "self_type" : "_ZTIA5_KPKc",
   "size" : 40,
   "source_file" : "bionic/libc/dns/resolv/herror.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIA65_KPKc",
   "name" : "const char *const[65]",
   "referenced_type" : "_ZTIA65_PKc",
   "self_type" : "_ZTIA65_KPKc",
   "size" : 520,
   "source_file" : "bionic/libc/include/signal.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIA_K7res_sym",
   "name" : "res_sym const[]",
   "referenced_type" : "_ZTIA_7res_sym",
   "self_type" : "_ZTIA_K7res_sym",
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8in6_addr",
   "name" : "const in6_addr",
   "referenced_type" : "_ZTI8in6_addr",
   "self_type" : "_ZTIK8in6_addr",
   "size" : 16,
   "source_file" : "bionic/libc/include/netinet/in.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8sockaddr",
   "name" : "const sockaddr",
   "referenced_type" : "_ZTI8sockaddr",
   "self_type" : "_ZTIK8sockaddr",
   "size" : 16,
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP8sockaddr",
   "name" : "sockaddr *const",
   "referenced_type" : "_ZTIP8sockaddr",
   "self_type" : "_ZTIKP8sockaddr",
   "size" : 8,
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "bionic/libc/dns/resolv/herror.c"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10f_owner_ex",
   "name" : "f_owner_ex",
   "referenced_type" : "_ZTI10f_owner_ex",
   "self_type" : "_ZTI10f_owner_ex",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/fcntl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ipi_ifindex",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ipi_spec_dst",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "ipi_addr",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7in_addr"
    }
   ],
   "linker_set_key" : "_ZTI10in_pktinfo",
   "name" : "in_pktinfo",
   "referenced_type" : "_ZTI10in_pktinfo",
   "self_type" : "_ZTI10in_pktinfo",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10ns_namemap",
   "name" : "ns_namemap",
   "referenced_type" : "_ZTI10ns_namemap",
   "self_type" : "_ZTI10ns_namemap",
   "size" : 16,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "h_addr_ptrs",
     "referenced_type" : "_ZTIA36_Pc"
    },
    {
     "field_name" : "host_aliases",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIA35_Pc"
    },
    {
     "field_name" : "hostbuf",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIA8192_c"
    },
    {
     "field_name" : "host_addr",
     "field_offset" : 70080,
     "referenced_type" : "_ZTIA4_j"
    },
    {
     "field_name" : "hostf",
     "field_offset" : 70208,
     "referenced_type" : "_ZTIP7__sFILE"
    },
    {
     "field_name" : "stayopen",
     "field_offset" : 70272,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "servent_ptr",
     "field_offset" : 70336,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "servent",
     "field_offset" : 70400,
     "referenced_type" : "_ZTI7servent"
    },
    {
     "field_name" : "host",
     "field_offset" : 70656,
     "referenced_type" : "_ZTI7hostent"
    }
   ],
   "linker_set_key" : "_ZTI10res_static",
   "name" : "res_static",
   "referenced_type" : "_ZTI10res_static",
   "self_type" : "_ZTI10res_static",
   "size" : 8864,
   "source_file" : "bionic/libc/dns/include/resolv_static.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA31_y"
    },
    {
     "field_name" : "sp",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIA4096_h"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 4384,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "netid",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "retrans",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "retry",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "options",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "nscount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nsaddr_list",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA4_11sockaddr_in"
    },
    {
     "field_name" : "id",
     "field_offset" : 736,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "dnsrch",
     "field_offset" : 768,
     "referenced_type" : "_ZTIA7_Pc"
    },
    {
     "field_name" : "defdname",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "field_name" : "pfcode",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ndots",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsort",
     "field_offset" : 3332,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unused",
     "field_offset" : 3336,
     "referenced_type" : "_ZTIA3_c"
    },
    {
     "field_name" : "sort_list",
     "field_offset" : 3360,
     "referenced_type" : "_ZTIA10_N11__res_stateUt_E"
    },
    {
     "field_name" : "qhook",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIPF15res_sendhookactPKP8sockaddrPPKhPiPhiS7_E"
    },
    {
     "field_name" : "rhook",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIPF15res_sendhookactPK8sockaddrPKhiPhiPiE"
    },
    {
     "field_name" : "res_h_errno",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_mark",
     "field_offset" : 4192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_vcsock",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_flags",
     "field_offset" : 4256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_pad",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_u",
     "field_offset" : 4352,
     "referenced_type" : "_ZTIN11__res_stateUt_E"
    },
    {
     "field_name" : "rstatic",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIA1_10res_static"
    }
   ],
   "linker_set_key" : "_ZTI11__res_state",
   "name" : "__res_state",
   "referenced_type" : "_ZTI11__res_state",
   "self_type" : "_ZTI11__res_state",
   "size" : 9448,
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "samples",
     "referenced_type" : "_ZTIA64_12__res_sample"
    },
    {
     "field_name" : "sample_count",
     "field_offset" : 8192,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "sample_next",
     "field_offset" : 8200,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI11__res_stats",
   "name" : "__res_stats",
   "referenced_type" : "_ZTI11__res_stats",
   "self_type" : "_ZTI11__res_stats",
   "size" : 1032,
   "source_file" : "bionic/libc/dns/include/resolv_stats.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "interval",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "timeout",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11cisco_proto",
   "name" : "cisco_proto",
   "referenced_type" : "_ZTI11cisco_proto",
   "self_type" : "_ZTI11cisco_proto",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "esr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI11esr_context",
   "name" : "esr_context",
   "referenced_type" : "_ZTI11esr_context",
   "self_type" : "_ZTI11esr_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ifs_ifsu",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11if_settingsUt_E"
    }
   ],
   "linker_set_key" : "_ZTI11if_settings",
   "name" : "if_settings",
   "referenced_type" : "_ZTI11if_settings",
   "self_type" : "_ZTI11if_settings",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ipi6_addr",
     "referenced_type" : "_ZTI8in6_addr"
    },
    {
     "field_name" : "ipi6_ifindex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11in6_pktinfo",
   "name" : "in6_pktinfo",
   "referenced_type" : "_ZTI11in6_pktinfo",
   "self_type" : "_ZTI11in6_pktinfo",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ip6m_addr",
     "referenced_type" : "_ZTI12sockaddr_in6"
    },
    {
     "field_name" : "ip6m_mtu",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11ip6_mtuinfo",
   "name" : "ip6_mtuinfo",
   "referenced_type" : "_ZTI11ip6_mtuinfo",
   "self_type" : "_ZTI11ip6_mtuinfo",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imsf_multiaddr",
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imsf_interface",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imsf_fmode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imsf_numsrc",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imsf_slist",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_7in_addr"
    }
   ],
   "linker_set_key" : "_ZTI11ip_msfilter",
   "name" : "ip_msfilter",
   "referenced_type" : "_ZTI11ip_msfilter",
   "self_type" : "_ZTI11ip_msfilter",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/ip_msfilter.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nexthdr",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "hdrlen",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "type",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "segments_left",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI11ipv6_rt_hdr",
   "name" : "ipv6_rt_hdr",
   "referenced_type" : "_ZTI11ipv6_rt_hdr",
   "self_type" : "_ZTI11ipv6_rt_hdr",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIA1025_c"
    },
    {
     "field_name" : "alg",
     "field_offset" : 8200,
     "referenced_type" : "_ZTIA1025_c"
    },
    {
     "field_name" : "data",
     "field_offset" : 16448,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "len",
     "field_offset" : 16512,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11ns_tsig_key",
   "name" : "ns_tsig_key",
   "referenced_type" : "_ZTI11ns_tsig_key",
   "self_type" : "_ZTI11ns_tsig_key",
   "size" : 2072,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sin_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sin_port",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sin_addr",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA8_h"
    }
   ],
   "linker_set_key" : "_ZTI11sockaddr_in",
   "name" : "sockaddr_in",
   "referenced_type" : "_ZTI11sockaddr_in",
   "self_type" : "_ZTI11sockaddr_in",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "vl",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA3_t"
    }
   ],
   "linker_set_key" : "_ZTI11sve_context",
   "name" : "sve_context",
   "referenced_type" : "_ZTI11sve_context",
   "self_type" : "_ZTI11sve_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sample_validity",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "success_threshold",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "min_samples",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "max_samples",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "base_timeout_msec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI12__res_params",
   "name" : "__res_params",
   "referenced_type" : "_ZTI12__res_params",
   "self_type" : "_ZTI12__res_params",
   "size" : 12,
   "source_file" : "bionic/libc/dns/include/resolv_params.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "at",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rtt",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rcode",
     "field_offset" : 80,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI12__res_sample",
   "name" : "__res_sample",
   "referenced_type" : "_ZTI12__res_sample",
   "self_type" : "_ZTI12__res_sample",
   "size" : 16,
   "source_file" : "bionic/libc/dns/include/resolv_stats.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12_aarch64_ctx",
   "name" : "_aarch64_ctx",
   "referenced_type" : "_ZTI12_aarch64_ctx",
   "self_type" : "_ZTI12_aarch64_ctx",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dlci",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12fr_proto_pvc",
   "name" : "fr_proto_pvc",
   "referenced_type" : "_ZTI12fr_proto_pvc",
   "self_type" : "_ZTI12fr_proto_pvc",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "gf_interface",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gf_group",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16sockaddr_storage"
    },
    {
     "field_name" : "gf_fmode",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gf_numsrc",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gf_slist",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA1_16sockaddr_storage"
    }
   ],
   "linker_set_key" : "_ZTI12group_filter",
   "name" : "group_filter",
   "referenced_type" : "_ZTI12group_filter",
   "self_type" : "_ZTI12group_filter",
   "size" : 272,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "if_index",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "if_name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI12if_nameindex",
   "name" : "if_nameindex",
   "referenced_type" : "_ZTI12if_nameindex",
   "self_type" : "_ZTI12if_nameindex",
   "size" : 16,
   "source_file" : "bionic/libc/include/net/if.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nexthdr",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "hdrlen",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI12ipv6_opt_hdr",
   "name" : "ipv6_opt_hdr",
   "referenced_type" : "_ZTI12ipv6_opt_hdr",
   "self_type" : "_ZTI12ipv6_opt_hdr",
   "size" : 2,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sin6_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sin6_port",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sin6_flowinfo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sin6_addr",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8in6_addr"
    },
    {
     "field_name" : "sin6_scope_id",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12sockaddr_in6",
   "name" : "sockaddr_in6",
   "referenced_type" : "_ZTI12sockaddr_in6",
   "self_type" : "_ZTI12sockaddr_in6",
   "size" : 28,
   "source_file" : "bionic/libc/kernel/uapi/linux/in6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "clock_rate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "clock_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "loopback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "slot_map",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12te1_settings",
   "name" : "te1_settings",
   "referenced_type" : "_ZTI12te1_settings",
   "self_type" : "_ZTI12te1_settings",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "datap",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI13extra_context",
   "name" : "extra_context",
   "referenced_type" : "_ZTI13extra_context",
   "self_type" : "_ZTI13extra_context",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vregs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA32_o"
    }
   ],
   "linker_set_key" : "_ZTI14fpsimd_context",
   "name" : "fpsimd_context",
   "referenced_type" : "_ZTI14fpsimd_context",
   "self_type" : "_ZTI14fpsimd_context",
   "size" : 528,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imr_interface",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imr_sourceaddr",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7in_addr"
    }
   ],
   "linker_set_key" : "_ZTI14ip_mreq_source",
   "name" : "ip_mreq_source",
   "referenced_type" : "_ZTI14ip_mreq_source",
   "self_type" : "_ZTI14ip_mreq_source",
   "size" : 12,
   "source_file" : "bionic/libc/include/bits/ip_mreq_source.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA12_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 48,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "encoding",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "parity",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI14raw_hdlc_proto",
   "name" : "raw_hdlc_proto",
   "referenced_type" : "_ZTI14raw_hdlc_proto",
   "self_type" : "_ZTI14raw_hdlc_proto",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dce",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "modulo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "window",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "t1",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "t2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14x25_hdlc_proto",
   "name" : "x25_hdlc_proto",
   "referenced_type" : "_ZTI14x25_hdlc_proto",
   "self_type" : "_ZTI14x25_hdlc_proto",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "gsr_interface",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gsr_group",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16sockaddr_storage"
    },
    {
     "field_name" : "gsr_source",
     "field_offset" : 1088,
     "referenced_type" : "_ZTI16sockaddr_storage"
    }
   ],
   "linker_set_key" : "_ZTI16group_source_req",
   "name" : "group_source_req",
   "referenced_type" : "_ZTI16group_source_req",
   "self_type" : "_ZTI16group_source_req",
   "size" : 264,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "length",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "addr",
     "field_offset" : 16,
     "referenced_type" : "_ZTI8in6_addr"
    }
   ],
   "linker_set_key" : "_ZTI16ipv6_destopt_hao",
   "name" : "ipv6_destopt_hao",
   "referenced_type" : "_ZTI16ipv6_destopt_hao",
   "self_type" : "_ZTI16ipv6_destopt_hao",
   "size" : 18,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA14_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN16sockaddr_storageUt_E"
    }
   ],
   "linker_set_key" : "_ZTI16sockaddr_storage",
   "name" : "sockaddr_storage",
   "referenced_type" : "_ZTI16sockaddr_storage",
   "self_type" : "_ZTI16sockaddr_storage",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/socket.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTIA31_m"
    },
    {
     "field_name" : "sp",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI16user_regs_struct",
   "name" : "user_regs_struct",
   "referenced_type" : "_ZTI16user_regs_struct",
   "self_type" : "_ZTI16user_regs_struct",
   "size" : 272,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dlci",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "master",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI17fr_proto_pvc_info",
   "name" : "fr_proto_pvc_info",
   "referenced_type" : "_ZTI17fr_proto_pvc_info",
   "self_type" : "_ZTI17fr_proto_pvc_info",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flr_dst",
     "referenced_type" : "_ZTI8in6_addr"
    },
    {
     "field_name" : "flr_label",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flr_action",
     "field_offset" : 160,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "flr_share",
     "field_offset" : 168,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "flr_flags",
     "field_offset" : 176,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "flr_expires",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "flr_linger",
     "field_offset" : 208,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__flr_pad",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17in6_flowlabel_req",
   "name" : "in6_flowlabel_req",
   "referenced_type" : "_ZTI17in6_flowlabel_req",
   "self_type" : "_ZTI17in6_flowlabel_req",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/in6.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "counter",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "key",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP7dst_key"
    },
    {
     "field_name" : "ctx",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "sig",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA512_h"
    },
    {
     "field_name" : "siglen",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI17ns_tcp_tsig_state",
   "name" : "ns_tcp_tsig_state",
   "referenced_type" : "_ZTI17ns_tcp_tsig_state",
   "self_type" : "_ZTI17ns_tcp_tsig_state",
   "size" : 544,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA4_l"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sin",
     "referenced_type" : "_ZTI11sockaddr_in"
    },
    {
     "field_name" : "sin6",
     "referenced_type" : "_ZTI12sockaddr_in6"
    },
    {
     "field_name" : "__align32",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__space",
     "referenced_type" : "_ZTIA128_c"
    }
   ],
   "linker_set_key" : "_ZTI18res_sockaddr_union",
   "name" : "res_sockaddr_union",
   "record_kind" : "union",
   "referenced_type" : "_ZTI18res_sockaddr_union",
   "self_type" : "_ZTI18res_sockaddr_union",
   "size" : 128,
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "vregs",
     "referenced_type" : "_ZTIA32_o"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18user_fpsimd_struct",
   "name" : "user_fpsimd_struct",
   "referenced_type" : "_ZTI18user_fpsimd_struct",
   "self_type" : "_ZTI18user_fpsimd_struct",
   "size" : 528,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "clock_rate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "clock_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "loopback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI20sync_serial_settings",
   "name" : "sync_serial_settings",
   "referenced_type" : "_ZTI20sync_serial_settings",
   "self_type" : "_ZTI20sync_serial_settings",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 56,
   "source_file" : "bionic/libc/include/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5flock",
   "name" : "flock",
   "referenced_type" : "_ZTI5flock",
   "self_type" : "_ZTI5flock",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/flock.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mem_start",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "mem_end",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "base_addr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "irq",
     "field_offset" : 144,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "dma",
     "field_offset" : 152,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "port",
     "field_offset" : 160,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI5ifmap",
   "name" : "ifmap",
   "referenced_type" : "_ZTI5ifmap",
   "self_type" : "_ZTI5ifmap",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ifr_ifrn",
     "referenced_type" : "_ZTIN5ifreqUt_E"
    },
    {
     "field_name" : "ifr_ifru",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN5ifreqUt_E"
    }
   ],
   "linker_set_key" : "_ZTI5ifreq",
   "name" : "ifreq",
   "referenced_type" : "_ZTI5ifreq",
   "self_type" : "_ZTI5ifreq",
   "size" : 40,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "iov_base",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "iov_len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI5iovec",
   "name" : "iovec",
   "referenced_type" : "_ZTI5iovec",
   "self_type" : "_ZTI5iovec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/uio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI5ucred",
   "name" : "ucred",
   "referenced_type" : "_ZTI5ucred",
   "self_type" : "_ZTI5ucred",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rd",
     "field_offset" : 16,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tc",
     "field_offset" : 17,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "aa",
     "field_offset" : 18,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "opcode",
     "field_offset" : 19,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qr",
     "field_offset" : 23,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rcode",
     "field_offset" : 24,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cd",
     "field_offset" : 28,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ad",
     "field_offset" : 29,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unused",
     "field_offset" : 30,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ra",
     "field_offset" : 31,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qdcount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ancount",
     "field_offset" : 48,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nscount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arcount",
     "field_offset" : 80,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6HEADER",
   "name" : "HEADER",
   "referenced_type" : "_ZTI6HEADER",
   "self_type" : "_ZTI6HEADER",
   "size" : 12,
   "source_file" : "bionic/libc/include/arpa/nameser_compat.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ifc_len",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ifc_ifcu",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN6ifconfUt_E"
    }
   ],
   "linker_set_key" : "_ZTI6ifconf",
   "name" : "ifconf",
   "referenced_type" : "_ZTI6ifconf",
   "self_type" : "_ZTI6ifconf",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_onoff",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l_linger",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6linger",
   "name" : "linger",
   "referenced_type" : "_ZTI6linger",
   "self_type" : "_ZTI6linger",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "msg_name",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "msg_namelen",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "msg_iov",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP5iovec"
    },
    {
     "field_name" : "msg_iovlen",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_control",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "msg_controllen",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_flags",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6msghdr",
   "name" : "msghdr",
   "referenced_type" : "_ZTI6msghdr",
   "self_type" : "_ZTI6msghdr",
   "size" : 56,
   "source_file" : "bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "n_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "n_aliases",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "n_addrtype",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "n_net",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6netent",
   "name" : "netent",
   "referenced_type" : "_ZTI6netent",
   "self_type" : "_ZTI6netent",
   "size" : 24,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIA1025_c"
    },
    {
     "field_name" : "type",
     "field_offset" : 8208,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rr_class",
     "field_offset" : 8224,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ttl",
     "field_offset" : 8256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rdlength",
     "field_offset" : 8288,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rdata",
     "field_offset" : 8320,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI7__ns_rr",
   "name" : "__ns_rr",
   "referenced_type" : "_ZTI7__ns_rr",
   "self_type" : "_ZTI7__ns_rr",
   "size" : 1048,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cmsg_len",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cmsg_level",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cmsg_type",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7cmsghdr",
   "name" : "cmsghdr",
   "referenced_type" : "_ZTI7cmsghdr",
   "self_type" : "_ZTI7cmsghdr",
   "size" : 16,
   "source_file" : "bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7flock64",
   "name" : "flock64",
   "referenced_type" : "_ZTI7flock64",
   "self_type" : "_ZTI7flock64",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/flock.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "h_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "h_aliases",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "h_addrtype",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_length",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_addr_list",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPPc"
    }
   ],
   "linker_set_key" : "_ZTI7hostent",
   "name" : "hostent",
   "referenced_type" : "_ZTI7hostent",
   "self_type" : "_ZTI7hostent",
   "size" : 32,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s_addr",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7in_addr",
   "name" : "in_addr",
   "referenced_type" : "_ZTI7in_addr",
   "self_type" : "_ZTI7in_addr",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/in_addr.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imr_interface",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    }
   ],
   "linker_set_key" : "_ZTI7ip_mreq",
   "name" : "ip_mreq",
   "referenced_type" : "_ZTI7ip_mreq",
   "self_type" : "_ZTI7ip_mreq",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "priority",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "version",
     "field_offset" : 4,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "flow_lbl",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA3_h"
    },
    {
     "field_name" : "payload_len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nexthdr",
     "field_offset" : 48,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "hop_limit",
     "field_offset" : 56,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "saddr",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8in6_addr"
    },
    {
     "field_name" : "daddr",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8in6_addr"
    }
   ],
   "linker_set_key" : "_ZTI7ipv6hdr",
   "name" : "ipv6hdr",
   "referenced_type" : "_ZTI7ipv6hdr",
   "self_type" : "_ZTI7ipv6hdr",
   "size" : 40,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "msg_hdr",
     "referenced_type" : "_ZTI6msghdr"
    },
    {
     "field_name" : "msg_len",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7mmsghdr",
   "name" : "mmsghdr",
   "referenced_type" : "_ZTI7mmsghdr",
   "self_type" : "_ZTI7mmsghdr",
   "size" : 64,
   "source_file" : "bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "number",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "humanname",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI7res_sym",
   "name" : "res_sym",
   "referenced_type" : "_ZTI7res_sym",
   "self_type" : "_ZTI7res_sym",
   "size" : 24,
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rt_hdr",
     "referenced_type" : "_ZTI11ipv6_rt_hdr"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "addr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA0_8in6_addr"
    }
   ],
   "linker_set_key" : "_ZTI7rt0_hdr",
   "name" : "rt0_hdr",
   "referenced_type" : "_ZTI7rt0_hdr",
   "self_type" : "_ZTI7rt0_hdr",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rt_hdr",
     "referenced_type" : "_ZTI11ipv6_rt_hdr"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "addr",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8in6_addr"
    }
   ],
   "linker_set_key" : "_ZTI7rt2_hdr",
   "name" : "rt2_hdr",
   "referenced_type" : "_ZTI7rt2_hdr",
   "self_type" : "_ZTI7rt2_hdr",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "s_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "s_aliases",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "s_port",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "s_proto",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI7servent",
   "name" : "servent",
   "referenced_type" : "_ZTI7servent",
   "self_type" : "_ZTI7servent",
   "size" : 32,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_msg",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "_eom",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "_id",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "_flags",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "_counts",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA4_t"
    },
    {
     "field_name" : "_sections",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA4_PKh"
    },
    {
     "field_name" : "_sect",
     "field_offset" : 512,
     "referenced_type" : "_ZTI9__ns_sect"
    },
    {
     "field_name" : "_rrnum",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_msg_ptr",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI8__ns_msg",
   "name" : "__ns_msg",
   "referenced_type" : "_ZTI8__ns_msg",
   "self_type" : "_ZTI8__ns_msg",
   "size" : 80,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nname",
     "referenced_type" : "_ZTIA256_h"
    },
    {
     "field_name" : "nnamel",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "type",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rr_class",
     "field_offset" : 2144,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ttl",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rdlength",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rdata",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI8__ns_rr2",
   "name" : "__ns_rr2",
   "referenced_type" : "_ZTI8__ns_rr2",
   "self_type" : "_ZTI8__ns_rr2",
   "size" : 288,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ai_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ai_family",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ai_socktype",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ai_protocol",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ai_addrlen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ai_canonname",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "ai_addr",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP8sockaddr"
    },
    {
     "field_name" : "ai_next",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP8addrinfo"
    }
   ],
   "linker_set_key" : "_ZTI8addrinfo",
   "name" : "addrinfo",
   "referenced_type" : "_ZTI8addrinfo",
   "self_type" : "_ZTI8addrinfo",
   "size" : 48,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "t391",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "t392",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n391",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n392",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n393",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lmi",
     "field_offset" : 160,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "dce",
     "field_offset" : 176,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI8fr_proto",
   "name" : "fr_proto",
   "referenced_type" : "_ZTI8fr_proto",
   "self_type" : "_ZTI8fr_proto",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "in6_u",
     "referenced_type" : "_ZTIN8in6_addrUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8in6_addr",
   "name" : "in6_addr",
   "referenced_type" : "_ZTI8in6_addr",
   "self_type" : "_ZTI8in6_addr",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/in6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imr_address",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imr_ifindex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8ip_mreqn",
   "name" : "ip_mreqn",
   "referenced_type" : "_ZTI8ip_mreqn",
   "self_type" : "_ZTI8ip_mreqn",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "p_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "p_aliases",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "p_proto",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8protoent",
   "name" : "protoent",
   "referenced_type" : "_ZTI8protoent",
   "self_type" : "_ZTI8protoent",
   "size" : 24,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI8sigset_t",
   "name" : "sigset_t",
   "referenced_type" : "_ZTI8sigset_t",
   "self_type" : "_ZTI8sigset_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "sa_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sa_data",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA14_c"
    }
   ],
   "linker_set_key" : "_ZTI8sockaddr",
   "name" : "sockaddr",
   "referenced_type" : "_ZTI8sockaddr",
   "self_type" : "_ZTI8sockaddr",
   "size" : 16,
   "source_file" : "bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_offset" : 320,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI10sigcontext"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 4560,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "gr_interface",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gr_group",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16sockaddr_storage"
    }
   ],
   "linker_set_key" : "_ZTI9group_req",
   "name" : "group_req",
   "referenced_type" : "_ZTI9group_req",
   "self_type" : "_ZTI9group_req",
   "size" : 136,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifr6_addr",
     "referenced_type" : "_ZTI8in6_addr"
    },
    {
     "field_name" : "ifr6_prefixlen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ifr6_ifindex",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI9in6_ifreq",
   "name" : "in6_ifreq",
   "referenced_type" : "_ZTI9in6_ifreq",
   "self_type" : "_ZTI9in6_ifreq",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ipv6mr_multiaddr",
     "referenced_type" : "_ZTI8in6_addr"
    },
    {
     "field_name" : "ipv6mr_ifindex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI9ipv6_mreq",
   "name" : "ipv6_mreq",
   "referenced_type" : "_ZTI9ipv6_mreq",
   "self_type" : "_ZTI9ipv6_mreq",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/linux/in6.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "msg",
     "referenced_type" : "_ZTI8__ns_msg"
    },
    {
     "field_name" : "dnptrs",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA25_PKh"
    },
    {
     "field_name" : "lastdnptr",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPPKh"
    }
   ],
   "linker_set_key" : "_ZTI9ns_newmsg",
   "name" : "ns_newmsg",
   "referenced_type" : "_ZTI9ns_newmsg",
   "self_type" : "_ZTI9ns_newmsg",
   "size" : 288,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt_Ut_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt_Ut_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "addr",
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11__res_stateUt_E",
   "name" : "__res_state::(anonymous struct at bionic/libc/dns/include/resolv_private.h:166:2)",
   "referenced_type" : "_ZTIN11__res_stateUt_E",
   "self_type" : "_ZTIN11__res_stateUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nscount",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nstimes",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA4_t"
    },
    {
     "field_name" : "nssocks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "ext",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP15__res_state_ext"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11__res_stateUt_Ut_E",
   "name" : "__res_state::(anonymous union at bionic/libc/dns/include/resolv_private.h:180:2)::(anonymous struct at bionic/libc/dns/include/resolv_private.h:183:3)",
   "referenced_type" : "_ZTIN11__res_stateUt_Ut_E",
   "self_type" : "_ZTIN11__res_stateUt_Ut_E",
   "size" : 40,
   "source_file" : "bionic/libc/dns/include/resolv_private.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "raw_hdlc",
     "referenced_type" : "_ZTIP14raw_hdlc_proto"
    },
    {
     "field_name" : "cisco",
     "referenced_type" : "_ZTIP11cisco_proto"
    },
    {
     "field_name" : "fr",
     "referenced_type" : "_ZTIP8fr_proto"
    },
    {
     "field_name" : "fr_pvc",
     "referenced_type" : "_ZTIP12fr_proto_pvc"
    },
    {
     "field_name" : "fr_pvc_info",
     "referenced_type" : "_ZTIP17fr_proto_pvc_info"
    },
    {
     "field_name" : "x25",
     "referenced_type" : "_ZTIP14x25_hdlc_proto"
    },
    {
     "field_name" : "sync",
     "referenced_type" : "_ZTIP20sync_serial_settings"
    },
    {
     "field_name" : "te1",
     "referenced_type" : "_ZTIP12te1_settings"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11if_settingsUt_E",
   "name" : "if_settings::(anonymous union at bionic/libc/kernel/uapi/linux/if.h:132:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11if_settingsUt_E",
   "self_type" : "_ZTIN11if_settingsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:79:22)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN16sockaddr_storageUt_Ut_E"
    },
    {
     "field_name" : "__align",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN16sockaddr_storageUt_E",
   "name" : "sockaddr_storage::(anonymous union at bionic/libc/kernel/uapi/linux/socket.h:24:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN16sockaddr_storageUt_E",
   "self_type" : "_ZTIN16sockaddr_storageUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/socket.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "ss_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__data",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA126_c"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN16sockaddr_storageUt_Ut_E",
   "name" : "sockaddr_storage::(anonymous union at bionic/libc/kernel/uapi/linux/socket.h:24:3)::(anonymous struct at bionic/libc/kernel/uapi/linux/socket.h:25:5)",
   "referenced_type" : "_ZTIN16sockaddr_storageUt_Ut_E",
   "self_type" : "_ZTIN16sockaddr_storageUt_Ut_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/socket.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "ifrn_name",
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN5ifreqUt_E",
   "name" : "ifreq::(anonymous union at bionic/libc/kernel/uapi/linux/if.h:146:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN5ifreqUt_E",
   "self_type" : "_ZTIN5ifreqUt_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ifcu_buf",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "ifcu_req",
     "referenced_type" : "_ZTIP5ifreq"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN6ifconfUt_E",
   "name" : "ifconf::(anonymous union at bionic/libc/kernel/uapi/linux/if.h:186:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN6ifconfUt_E",
   "self_type" : "_ZTIN6ifconfUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "u6_addr8",
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "u6_addr16",
     "referenced_type" : "_ZTIA8_t"
    },
    {
     "field_name" : "u6_addr32",
     "referenced_type" : "_ZTIA4_j"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8in6_addrUt_E",
   "name" : "in6_addr::(anonymous union at bionic/libc/kernel/uapi/linux/in6.h:25:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8in6_addrUt_E",
   "self_type" : "_ZTIN8in6_addrUt_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/in6.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA12_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:232:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:117:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:78:20)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  }
 ],
 "rvalue_reference_types" : []
}
