{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA3_N4piex16PreviewImageData8RationalE",
   "name" : "piex::PreviewImageData::Rational [3]",
   "referenced_type" : "_ZTIN4piex16PreviewImageData8RationalE",
   "self_type" : "_ZTIA3_N4piex16PreviewImageData8RationalE",
   "size" : 24,
   "source_file" : "external/piex/src/piex_types.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",

   "linker_set_key" : "_ZNK4piex12binary_parse19RangeCheckedBytePtrixEm",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPKN4piex12binary_parse19RangeCheckedBytePtrE"
    },
    {
     "referenced_type" : "_ZTIm"
    }
   ],
   "return_type" : "_ZTIh",
   "source_file" : "external/piex/src/binary_parse/range_checked_byte_ptr.h"
  },
  {
   "function_name" : "piex::Image::operator>",
   "linker_set_key" : "_ZNK4piex5ImagegtERKS0_",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPKN4piex5ImageE"
    },
    {
     "referenced_type" : "_ZTIRKN4piex5ImageE"
    }
   ],
   "return_type" : "_ZTIb",
   "source_file" : "external/piex/src/piex_types.h"
  }
 ],
 "global_vars" :
 [
  {
   "linker_set_key" : "_ZN4piexL22kThumbnailMaxDimensionE",
   "name" : "piex::kThumbnailMaxDimension",
   "referenced_type" : "_ZTIKi",
   "source_file" : "external/piex/src/tiff_parser.h"
  }
 ],
 "lvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIRKN4piex12binary_parse19RangeCheckedBytePtrE",
   "name" : "const piex::binary_parse::RangeCheckedBytePtr &",
   "referenced_type" : "_ZTIKN4piex12binary_parse19RangeCheckedBytePtrE",
   "self_type" : "_ZTIRKN4piex12binary_parse19RangeCheckedBytePtrE",
   "size" : 8,
   "source_file" : "external/piex/src/binary_parse/range_checked_byte_ptr.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIRKN4piex5ImageE",
   "name" : "const piex::Image &",
   "referenced_type" : "_ZTIKN4piex5ImageE",
   "self_type" : "_ZTIRKN4piex5ImageE",
   "size" : 8,
   "source_file" : "external/piex/src/piex_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIRN4piex12binary_parse19RangeCheckedBytePtrE",
   "name" : "piex::binary_parse::RangeCheckedBytePtr &",
   "referenced_type" : "_ZTIN4piex12binary_parse19RangeCheckedBytePtrE",
   "self_type" : "_ZTIRN4piex12binary_parse19RangeCheckedBytePtrE",
   "size" : 8,
   "source_file" : "external/piex/src/binary_parse/range_checked_byte_ptr.h"
  }
 ],
 "pointer_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKN4piex12binary_parse19RangeCheckedBytePtrE",
   "name" : "const piex::binary_parse::RangeCheckedBytePtr *",
   "referenced_type" : "_ZTIKN4piex12binary_parse19RangeCheckedBytePtrE",
   "self_type" : "_ZTIPKN4piex12binary_parse19RangeCheckedBytePtrE",
   "size" : 8,
   "source_file" : "external/piex/src/binary_parse/range_checked_byte_ptr.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKN4piex5ImageE",
   "name" : "const piex::Image *",
   "referenced_type" : "_ZTIKN4piex5ImageE",
   "self_type" : "_ZTIPKN4piex5ImageE",
   "size" : 8,
   "source_file" : "external/piex/src/piex_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 8,
   "source_file" : "external/piex/src/binary_parse/range_checked_byte_ptr.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN4piex12binary_parse19RangeCheckedBytePtrE",
   "name" : "piex::binary_parse::RangeCheckedBytePtr *",
   "referenced_type" : "_ZTIN4piex12binary_parse19RangeCheckedBytePtrE",
   "self_type" : "_ZTIPN4piex12binary_parse19RangeCheckedBytePtrE",
   "size" : 8,
   "source_file" : "external/piex/src/binary_parse/range_checked_byte_ptr.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN4piex15StreamInterfaceE",
   "name" : "piex::StreamInterface *",
   "referenced_type" : "_ZTIN4piex15StreamInterfaceE",
   "self_type" : "_ZTIPN4piex15StreamInterfaceE",
   "size" : 8,
   "source_file" : "external/piex/src/piex_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN4piex16PreviewImageDataE",
   "name" : "piex::PreviewImageData *",
   "referenced_type" : "_ZTIN4piex16PreviewImageDataE",
   "self_type" : "_ZTIPN4piex16PreviewImageDataE",
   "size" : 8,
   "source_file" : "external/piex/src/piex.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPNSt3__16vectorIjNS_9allocatorIjEEEE",
   "name" : "std::vector<unsigned int, std::allocator<unsigned int>> *",
   "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE",
   "self_type" : "_ZTIPNSt3__16vectorIjNS_9allocatorIjEEEE",
   "size" : 8,
   "source_file" : "external/piex/src/piex.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 8,
   "source_file" : "external/piex/src/piex.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4piex12binary_parse19RangeCheckedBytePtrE",
   "name" : "const piex::binary_parse::RangeCheckedBytePtr",
   "referenced_type" : "_ZTIN4piex12binary_parse19RangeCheckedBytePtrE",
   "self_type" : "_ZTIKN4piex12binary_parse19RangeCheckedBytePtrE",
   "size" : 88,
   "source_file" : "external/piex/src/binary_parse/range_checked_byte_ptr.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4piex5ImageE",
   "name" : "const piex::Image",
   "referenced_type" : "_ZTIN4piex5ImageE",
   "self_type" : "_ZTIKN4piex5ImageE",
   "size" : 16,
   "source_file" : "external/piex/src/piex_types.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/piex/src/binary_parse/range_checked_byte_ptr.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/piex/src/tiff_parser.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "stream_",
     "referenced_type" : "_ZTIPN4piex15StreamInterfaceE"
    },
    {
     "access" : "private",
     "field_name" : "tiff_offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "endian_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4piex14tiff_directory6EndianE"
    }
   ],
   "linker_set_key" : "_ZTIN4piex10TiffParserE",
   "name" : "piex::TiffParser",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4piex10TiffParserE",
   "self_type" : "_ZTIN4piex10TiffParserE",
   "size" : 16,
   "source_file" : "external/piex/src/tiff_parser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tiff_directory",
     "referenced_type" : "_ZTINSt3__16vectorIN4piex14tiff_directory13TiffDirectoryENS_9allocatorIS3_EEEE"
    },
    {
     "field_name" : "exif_directory",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN4piex14tiff_directory13TiffDirectoryENS_14default_deleteIS3_EEEE"
    },
    {
     "field_name" : "gps_directory",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN4piex14tiff_directory13TiffDirectoryENS_14default_deleteIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4piex11TiffContentE",
   "name" : "piex::TiffContent",
   "referenced_type" : "_ZTIN4piex11TiffContentE",
   "self_type" : "_ZTIN4piex11TiffContentE",
   "size" : 40,
   "source_file" : "external/piex/src/tiff_parser.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4piex12binary_parse14PagedByteArray4PageE",
   "name" : "piex::binary_parse::PagedByteArray::Page",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4piex12binary_parse14PagedByteArray4PageE",
   "self_type" : "_ZTIN4piex12binary_parse14PagedByteArray4PageE",
   "size" : 1,
   "source_file" : "external/piex/src/binary_parse/range_checked_byte_ptr.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN4piex12binary_parse14PagedByteArrayE",
   "name" : "piex::binary_parse::PagedByteArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4piex12binary_parse14PagedByteArrayE",
   "self_type" : "_ZTIN4piex12binary_parse14PagedByteArrayE",
   "size" : 8,
   "source_file" : "external/piex/src/binary_parse/range_checked_byte_ptr.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4piex12binary_parse14PagedByteArrayE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4piex12binary_parse14PagedByteArrayD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4piex12binary_parse14PagedByteArrayD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4piex12binary_parse14PagedByteArray6lengthEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4piex12binary_parse14PagedByteArray8pageSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4piex12binary_parse14PagedByteArray7getPageEmPPKhS4_PNSt3__110shared_ptrINS1_4PageEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "array_",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4piex12binary_parse14PagedByteArrayEEE"
    },
    {
     "access" : "private",
     "field_name" : "page_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4piex12binary_parse14PagedByteArray4PageEEE"
    },
    {
     "access" : "private",
     "field_name" : "page_data_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "current_pos_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "sub_array_begin_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "sub_array_end_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "page_begin_offset_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "current_page_len_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "error_flag_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIN4piex12binary_parse12MemoryStatusE"
    }
   ],
   "linker_set_key" : "_ZTIN4piex12binary_parse19RangeCheckedBytePtrE",
   "name" : "piex::binary_parse::RangeCheckedBytePtr",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4piex12binary_parse19RangeCheckedBytePtrE",
   "self_type" : "_ZTIN4piex12binary_parse19RangeCheckedBytePtrE",
   "size" : 88,
   "source_file" : "external/piex/src/binary_parse/range_checked_byte_ptr.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "count",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "value",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4piex14tiff_directory13TiffDirectory14DirectoryEntryE",
   "name" : "piex::tiff_directory::TiffDirectory::DirectoryEntry",
   "referenced_type" : "_ZTIN4piex14tiff_directory13TiffDirectory14DirectoryEntryE",
   "self_type" : "_ZTIN4piex14tiff_directory13TiffDirectory14DirectoryEntryE",
   "size" : 40,
   "source_file" : "external/piex/src/tiff_directory/tiff_directory.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "directory_entries_",
     "referenced_type" : "_ZTINSt3__13mapIjN4piex14tiff_directory13TiffDirectory14DirectoryEntryENS_4lessIjEENS_9allocatorINS_4pairIKjS4_EEEEEE"
    },
    {
     "access" : "private",
     "field_name" : "tag_order_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    },
    {
     "access" : "private",
     "field_name" : "sub_directories_",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIN4piex14tiff_directory13TiffDirectoryENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "endian_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4piex14tiff_directory6EndianE"
    }
   ],
   "linker_set_key" : "_ZTIN4piex14tiff_directory13TiffDirectoryE",
   "name" : "piex::tiff_directory::TiffDirectory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4piex14tiff_directory13TiffDirectoryE",
   "self_type" : "_ZTIN4piex14tiff_directory13TiffDirectoryE",
   "size" : 80,
   "source_file" : "external/piex/src/tiff_directory/tiff_directory.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "numerator",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "denominator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4piex14tiff_directory8RationalE",
   "name" : "piex::tiff_directory::Rational",
   "referenced_type" : "_ZTIN4piex14tiff_directory8RationalE",
   "self_type" : "_ZTIN4piex14tiff_directory8RationalE",
   "size" : 8,
   "source_file" : "external/piex/src/tiff_directory/tiff_directory.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "numerator",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "denominator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4piex14tiff_directory9SRationalE",
   "name" : "piex::tiff_directory::SRational",
   "referenced_type" : "_ZTIN4piex14tiff_directory9SRationalE",
   "self_type" : "_ZTIN4piex14tiff_directory9SRationalE",
   "size" : 8,
   "source_file" : "external/piex/src/tiff_directory/tiff_directory.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN4piex15StreamInterfaceE",
   "name" : "piex::StreamInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4piex15StreamInterfaceE",
   "self_type" : "_ZTIN4piex15StreamInterfaceE",
   "size" : 8,
   "source_file" : "external/piex/src/piex_types.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4piex15StreamInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4piex15StreamInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4piex15StreamInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4piex15StreamInterface7GetDataEmmPh"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "is_valid",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "latitude_ref",
     "field_offset" : 8,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "latitude",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA3_N4piex16PreviewImageData8RationalE"
    },
    {
     "field_name" : "longitude_ref",
     "field_offset" : 224,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "longitude",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA3_N4piex16PreviewImageData8RationalE"
    },
    {
     "field_name" : "altitude_ref",
     "field_offset" : 448,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "altitude",
     "field_offset" : 480,
     "referenced_type" : "_ZTIN4piex16PreviewImageData8RationalE"
    },
    {
     "field_name" : "time_stamp",
     "field_offset" : 544,
     "referenced_type" : "_ZTIA3_N4piex16PreviewImageData8RationalE"
    },
    {
     "field_name" : "date_stamp",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4piex16PreviewImageData3GpsE",
   "name" : "piex::PreviewImageData::Gps",
   "referenced_type" : "_ZTIN4piex16PreviewImageData3GpsE",
   "self_type" : "_ZTIN4piex16PreviewImageData3GpsE",
   "size" : 120,
   "source_file" : "external/piex/src/piex_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "numerator",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "denominator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4piex16PreviewImageData8RationalE",
   "name" : "piex::PreviewImageData::Rational",
   "referenced_type" : "_ZTIN4piex16PreviewImageData8RationalE",
   "self_type" : "_ZTIN4piex16PreviewImageData8RationalE",
   "size" : 8,
   "source_file" : "external/piex/src/piex_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "preview",
     "referenced_type" : "_ZTIN4piex5ImageE"
    },
    {
     "field_name" : "thumbnail",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4piex5ImageE"
    },
    {
     "field_name" : "exif_orientation",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "color_space",
     "field_offset" : 288,
     "referenced_type" : "_ZTIN4piex16PreviewImageData10ColorSpaceE"
    },
    {
     "field_name" : "full_width",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "full_height",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maker",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "model",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "date_time",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "iso",
     "field_offset" : 960,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exposure_time",
     "field_offset" : 992,
     "referenced_type" : "_ZTIN4piex16PreviewImageData8RationalE"
    },
    {
     "field_name" : "fnumber",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIN4piex16PreviewImageData8RationalE"
    },
    {
     "field_name" : "focal_length",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIN4piex16PreviewImageData8RationalE"
    },
    {
     "field_name" : "gps",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIN4piex16PreviewImageData3GpsE"
    },
    {
     "field_name" : "cfa_pattern_dim",
     "field_offset" : 2176,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4piex16PreviewImageDataE",
   "name" : "piex::PreviewImageData",
   "referenced_type" : "_ZTIN4piex16PreviewImageDataE",
   "self_type" : "_ZTIN4piex16PreviewImageDataE",
   "size" : 296,
   "source_file" : "external/piex/src/piex_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "height",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "length",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4piex5Image6FormatE"
    }
   ],
   "linker_set_key" : "_ZTIN4piex5ImageE",
   "name" : "piex::Image",
   "referenced_type" : "_ZTIN4piex5ImageE",
   "self_type" : "_ZTIN4piex5ImageE",
   "size" : 16,
   "source_file" : "external/piex/src/piex_types.h"
  }
 ],
 "rvalue_reference_types" : []
}
