#ifndef HIDL_GENERATED_ANDROID_HARDWARE_TV_CEC_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_TV_CEC_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace tv {
namespace cec {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class MaxLength : int32_t;
enum class CecDeviceType : int32_t;
enum class CecLogicalAddress : int32_t;
enum class CecMessageType : int32_t;
enum class AbortReason : int32_t;
enum class Result : int32_t;
enum class SendMessageResult : int32_t;
enum class HdmiPortType : int32_t;
enum class OptionKey : int32_t;
struct CecMessage;
struct HotplugEvent;
struct HdmiPortInfo;

enum class MaxLength : int32_t {
    MESSAGE_BODY = 15,
};

enum class CecDeviceType : int32_t {
    INACTIVE = -1 /* -1 */,
    TV = 0,
    RECORDER = 1,
    TUNER = 3,
    PLAYBACK = 4,
    AUDIO_SYSTEM = 5,
    MAX = 5 /* AUDIO_SYSTEM */,
};

enum class CecLogicalAddress : int32_t {
    TV = 0,
    RECORDER_1 = 1,
    RECORDER_2 = 2,
    TUNER_1 = 3,
    PLAYBACK_1 = 4,
    AUDIO_SYSTEM = 5,
    TUNER_2 = 6,
    TUNER_3 = 7,
    PLAYBACK_2 = 8,
    RECORDER_3 = 9,
    TUNER_4 = 10,
    PLAYBACK_3 = 11,
    FREE_USE = 14,
    UNREGISTERED = 15,
    BROADCAST = 15,
};

/**
 * HDMI CEC message types. The assigned values represent opcode used in CEC
 * frame as specified in CEC Table 8-26 of the CEC Spec 1.4b.
 */
enum class CecMessageType : int32_t {
    FEATURE_ABORT = 0 /* 0x00 */,
    IMAGE_VIEW_ON = 4 /* 0x04 */,
    TUNER_STEP_INCREMENT = 5 /* 0x05 */,
    TUNER_STEP_DECREMENT = 6 /* 0x06 */,
    TUNER_DEVICE_STATUS = 7 /* 0x07 */,
    GIVE_TUNER_DEVICE_STATUS = 8 /* 0x08 */,
    RECORD_ON = 9 /* 0x09 */,
    RECORD_STATUS = 10 /* 0x0A */,
    RECORD_OFF = 11 /* 0x0B */,
    TEXT_VIEW_ON = 13 /* 0x0D */,
    RECORD_TV_SCREEN = 15 /* 0x0F */,
    GIVE_DECK_STATUS = 26 /* 0x1A */,
    DECK_STATUS = 27 /* 0x1B */,
    SET_MENU_LANGUAGE = 50 /* 0x32 */,
    CLEAR_ANALOG_TIMER = 51 /* 0x33 */,
    SET_ANALOG_TIMER = 52 /* 0x34 */,
    TIMER_STATUS = 53 /* 0x35 */,
    STANDBY = 54 /* 0x36 */,
    PLAY = 65 /* 0x41 */,
    DECK_CONTROL = 66 /* 0x42 */,
    TIMER_CLEARED_STATUS = 67 /* 0x43 */,
    USER_CONTROL_PRESSED = 68 /* 0x44 */,
    USER_CONTROL_RELEASED = 69 /* 0x45 */,
    GIVE_OSD_NAME = 70 /* 0x46 */,
    SET_OSD_NAME = 71 /* 0x47 */,
    SET_OSD_STRING = 100 /* 0x64 */,
    SET_TIMER_PROGRAM_TITLE = 103 /* 0x67 */,
    SYSTEM_AUDIO_MODE_REQUEST = 112 /* 0x70 */,
    GIVE_AUDIO_STATUS = 113 /* 0x71 */,
    SET_SYSTEM_AUDIO_MODE = 114 /* 0x72 */,
    REPORT_AUDIO_STATUS = 122 /* 0x7A */,
    GIVE_SYSTEM_AUDIO_MODE_STATUS = 125 /* 0x7D */,
    SYSTEM_AUDIO_MODE_STATUS = 126 /* 0x7E */,
    ROUTING_CHANGE = 128 /* 0x80 */,
    ROUTING_INFORMATION = 129 /* 0x81 */,
    ACTIVE_SOURCE = 130 /* 0x82 */,
    GIVE_PHYSICAL_ADDRESS = 131 /* 0x83 */,
    REPORT_PHYSICAL_ADDRESS = 132 /* 0x84 */,
    REQUEST_ACTIVE_SOURCE = 133 /* 0x85 */,
    SET_STREAM_PATH = 134 /* 0x86 */,
    DEVICE_VENDOR_ID = 135 /* 0x87 */,
    VENDOR_COMMAND = 137 /* 0x89 */,
    VENDOR_REMOTE_BUTTON_DOWN = 138 /* 0x8A */,
    VENDOR_REMOTE_BUTTON_UP = 139 /* 0x8B */,
    GIVE_DEVICE_VENDOR_ID = 140 /* 0x8C */,
    MENU_REQUEST = 141 /* 0x8D */,
    MENU_STATUS = 142 /* 0x8E */,
    GIVE_DEVICE_POWER_STATUS = 143 /* 0x8F */,
    REPORT_POWER_STATUS = 144 /* 0x90 */,
    GET_MENU_LANGUAGE = 145 /* 0x91 */,
    SELECT_ANALOG_SERVICE = 146 /* 0x92 */,
    SELECT_DIGITAL_SERVICE = 147 /* 0x93 */,
    SET_DIGITAL_TIMER = 151 /* 0x97 */,
    CLEAR_DIGITAL_TIMER = 153 /* 0x99 */,
    SET_AUDIO_RATE = 154 /* 0x9A */,
    INACTIVE_SOURCE = 157 /* 0x9D */,
    CEC_VERSION = 158 /* 0x9E */,
    GET_CEC_VERSION = 159 /* 0x9F */,
    VENDOR_COMMAND_WITH_ID = 160 /* 0xA0 */,
    CLEAR_EXTERNAL_TIMER = 161 /* 0xA1 */,
    SET_EXTERNAL_TIMER = 162 /* 0xA2 */,
    REPORT_SHORT_AUDIO_DESCRIPTOR = 163 /* 0xA3 */,
    REQUEST_SHORT_AUDIO_DESCRIPTOR = 164 /* 0xA4 */,
    INITIATE_ARC = 192 /* 0xC0 */,
    REPORT_ARC_INITIATED = 193 /* 0xC1 */,
    REPORT_ARC_TERMINATED = 194 /* 0xC2 */,
    REQUEST_ARC_INITIATION = 195 /* 0xC3 */,
    REQUEST_ARC_TERMINATION = 196 /* 0xC4 */,
    TERMINATE_ARC = 197 /* 0xC5 */,
    ABORT = 255 /* 0xFF */,
};

/**
 * Operand description [Abort Reason]
 */
enum class AbortReason : int32_t {
    UNRECOGNIZED_MODE = 0,
    NOT_IN_CORRECT_MODE = 1,
    CANNOT_PROVIDE_SOURCE = 2,
    INVALID_OPERAND = 3,
    REFUSED = 4,
    UNABLE_TO_DETERMINE = 5,
};

enum class Result : int32_t {
    SUCCESS = 0,
    FAILURE_UNKNOWN = 1,
    FAILURE_INVALID_ARGS = 2,
    FAILURE_INVALID_STATE = 3,
    FAILURE_NOT_SUPPORTED = 4,
    FAILURE_BUSY = 5,
};

/**
 * error code used for send_message.
 */
enum class SendMessageResult : int32_t {
    SUCCESS = 0,
    NACK = 1,
    BUSY = 2,
    FAIL = 3,
};

/**
 * HDMI port type.
 */
enum class HdmiPortType : int32_t {
    INPUT = 0,
    OUTPUT = 1,
};

/**
 * Options used for IHdmiCec.setOption()
 */
enum class OptionKey : int32_t {
    /**
     * When set to false, HAL does not wake up the system upon receiving <Image
     * View On> or <Text View On>. Used when user changes the TV settings to
     * disable the auto TV on functionality.
     * True by default.
     */
    WAKEUP = 1,
    /**
     * When set to false, all the CEC commands are discarded. Used when user
     * changes the TV settings to disable CEC functionality.
     * True by default.
     */
    ENABLE_CEC = 2,
    /**
     * Setting this flag to false means Android system must stop handling CEC
     * service and yield the control over to the microprocessor that is powered
     * on through the standby mode. When set to true, the system must gain the
     * control over, hence telling the microprocessor to stop handling the CEC
     * commands. For example, this may be called when system goes in and out of
     * standby mode to notify the microprocessor that it should start/stop
     * handling CEC commands on behalf of the system.
     * False by default.
     */
    SYSTEM_CEC_CONTROL = 3,
};

struct CecMessage final {
    /**
     * logical address of sender
     */
    ::android::hardware::tv::cec::V1_0::CecLogicalAddress initiator __attribute__ ((aligned(4)));
    /**
     * logical address of receiver
     */
    ::android::hardware::tv::cec::V1_0::CecLogicalAddress destination __attribute__ ((aligned(4)));
    /**
     * The maximum size of body is 15 (MaxLength::MESSAGE_BODY) as specified in
     * the section 6 of the CEC Spec 1.4b. Overflowed data must be ignored.
     */
    ::android::hardware::hidl_vec<uint8_t> body __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::cec::V1_0::CecMessage, initiator) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V1_0::CecMessage, destination) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V1_0::CecMessage, body) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::tv::cec::V1_0::CecMessage) == 24, "wrong size");
static_assert(__alignof(::android::hardware::tv::cec::V1_0::CecMessage) == 8, "wrong alignment");

struct HotplugEvent final {
    bool connected __attribute__ ((aligned(1)));
    uint32_t portId __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::cec::V1_0::HotplugEvent, connected) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V1_0::HotplugEvent, portId) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::tv::cec::V1_0::HotplugEvent) == 8, "wrong size");
static_assert(__alignof(::android::hardware::tv::cec::V1_0::HotplugEvent) == 4, "wrong alignment");

/**
 * HDMI port descriptor
 */
struct HdmiPortInfo final {
    ::android::hardware::tv::cec::V1_0::HdmiPortType type __attribute__ ((aligned(4)));
    uint32_t portId __attribute__ ((aligned(4)));
    bool cecSupported __attribute__ ((aligned(1)));
    bool arcSupported __attribute__ ((aligned(1)));
    uint16_t physicalAddress __attribute__ ((aligned(2)));
};

static_assert(offsetof(::android::hardware::tv::cec::V1_0::HdmiPortInfo, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V1_0::HdmiPortInfo, portId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V1_0::HdmiPortInfo, cecSupported) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V1_0::HdmiPortInfo, arcSupported) == 9, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V1_0::HdmiPortInfo, physicalAddress) == 10, "wrong offset");
static_assert(sizeof(::android::hardware::tv::cec::V1_0::HdmiPortInfo) == 12, "wrong size");
static_assert(__alignof(::android::hardware::tv::cec::V1_0::HdmiPortInfo) == 4, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::tv::cec::V1_0::MaxLength o);
static inline void PrintTo(::android::hardware::tv::cec::V1_0::MaxLength o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::tv::cec::V1_0::MaxLength lhs, const ::android::hardware::tv::cec::V1_0::MaxLength rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::tv::cec::V1_0::MaxLength rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::tv::cec::V1_0::MaxLength lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
