{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA16_j",
   "name" : "unsigned int [16]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA16_j",
   "size" : 64,
   "source_file" : "external/llvm/include/llvm/Support/MD5.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1_c",
   "name" : "char [1]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA1_c",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA255_N4llvm21AlignedCharArrayUnionIccccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<char, char, char, char, char, char, char, char, char, char> [255]",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE",
   "self_type" : "_ZTIA255_N4llvm21AlignedCharArrayUnionIccccccccccEE",
   "size" : 255,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA256_h",
   "name" : "unsigned char [256]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA256_h",
   "size" : 256,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA2_c",
   "name" : "char [2]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA2_c",
   "size" : 2,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 4,

   "referenced_type" : "_ZTIN4llvm8ConstantE",
   "self_type" : "_ZTIKN4llvm8ConstantE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/IR/Constant.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4llvm8NoneTypeE",
   "name" : "const llvm::NoneType",
   "referenced_type" : "_ZTIN4llvm8NoneTypeE",
   "self_type" : "_ZTIKN4llvm8NoneTypeE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/None.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4llvm9ArrayTypeE",
   "name" : "const llvm::ArrayType",
   "referenced_type" : "_ZTIN4llvm9ArrayTypeE",
   "self_type" : "_ZTIKN4llvm9ArrayTypeE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4llvm9StringMapIPNS_5ValueENS_15MallocAllocatorEEE",
   "name" : "const llvm::StringMap<llvm::Value *, llvm::MallocAllocator>",
   "referenced_type" : "_ZTIN4llvm9StringMapIPNS_5ValueENS_15MallocAllocatorEEE",
   "self_type" : "_ZTIKN4llvm9StringMapIPNS_5ValueENS_15MallocAllocatorEEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4llvm9StringRefE",
   "name" : "const llvm::StringRef",
   "referenced_type" : "_ZTIN4llvm9StringRefE",
   "self_type" : "_ZTIKN4llvm9StringRefE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4llvm9hash_codeE",
   "name" : "const llvm::hash_code",
   "referenced_type" : "_ZTIN4llvm9hash_codeE",
   "self_type" : "_ZTIKN4llvm9hash_codeE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 12,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKN4llvm4TypeE",
   "name" : "const llvm::Type *const",
   "referenced_type" : "_ZTIPKN4llvm4TypeE",
   "self_type" : "_ZTIKPKN4llvm4TypeE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKN4llvm5ValueE",
   "name" : "const llvm::Value *const",
   "referenced_type" : "_ZTIPKN4llvm5ValueE",
   "self_type" : "_ZTIKPKN4llvm5ValueE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKv",
   "name" : "const void *const",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIKPKv",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN4llvm4TypeE",
   "name" : "llvm::Type *const",
   "referenced_type" : "_ZTIPN4llvm4TypeE",
   "self_type" : "_ZTIKPN4llvm4TypeE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN4llvm5ValueE",
   "name" : "llvm::Value *const",
   "referenced_type" : "_ZTIPN4llvm5ValueE",
   "self_type" : "_ZTIKPN4llvm5ValueE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKT_",
   "name" : "const type-parameter-0-0",
   "referenced_type" : "_ZTIT_",
   "self_type" : "_ZTIKT_",
   "source_file" : "external/llvm/include/llvm/ADT/iterator.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/APInt.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13CompositeTypeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "SymbolTableEntry",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm10StructTypeE",
   "name" : "llvm::StructType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm10StructTypeE",
   "self_type" : "_ZTIN4llvm10StructTypeE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm14SequentialTypeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "NumElements",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm10VectorTypeE",
   "name" : "llvm::VectorType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm10VectorTypeE",
   "self_type" : "_ZTIN4llvm10VectorTypeE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEKPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::StructType, const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10StructTypeE", "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::StructType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_10StructTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10StructTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEKPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::VectorType, const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::VectorType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_10VectorTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEKPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::IntegerType, const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::IntegerType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11IntegerTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEKPNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::PointerType, llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEKPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEKPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIKPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::PointerType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::PointerType, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_11PointerTypeEPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEKPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::FunctionType, const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm12FunctionTypeE", "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::FunctionType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_12FunctionTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm12FunctionTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_8ConstantEKPNS_5ValueEEE",
   "name" : "llvm::cast_retty<llvm::Constant, llvm::Value *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_8ConstantEKPNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_8ConstantEKPNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIKPN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_8ConstantEPKNS_5ValueEEE",
   "name" : "llvm::cast_retty<llvm::Constant, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_8ConstantEPKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_8ConstantEPKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIPKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_8ConstantEPNS_5ValueEEE",
   "name" : "llvm::cast_retty<llvm::Constant, llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_8ConstantEPNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_8ConstantEPNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIPN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEKPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::ArrayType, const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty<llvm::ArrayType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm10cast_rettyINS_9ArrayTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm8ConstantE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "ValueType",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPN4llvm4TypeE"
    },
    {
     "access" : "protected",
     "field_name" : "Linkage",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "Visibility",
     "field_offset" : 196,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "UnnamedAddrVal",
     "field_offset" : 198,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "DllStorageClass",
     "field_offset" : 200,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "ThreadLocal",
     "field_offset" : 202,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "SubClassData",
     "field_offset" : 205,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "IntID",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN4llvm9Intrinsic2IDE"
    },
    {
     "access" : "protected",
     "field_name" : "Parent",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPN4llvm6ModuleE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11GlobalValueE",
   "name" : "llvm::GlobalValue",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11GlobalValueE",
   "self_type" : "_ZTIN4llvm11GlobalValueE",
   "size" : 36,
   "source_file" : "external/llvm/include/llvm/IR/GlobalValue.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm11GlobalValueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm11GlobalValueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm11GlobalValueD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm8Constant6anchorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11GlobalValue18copyAttributesFromEPKS0_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm11GlobalValue16removeFromParentEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm11GlobalValue15eraseFromParentEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11GraphTraitsIPKNS_4TypeEEE",
   "name" : "llvm::GraphTraits<const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm11GraphTraitsIPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm11GraphTraitsIPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Type.h",
   "template_args" : [ "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11GraphTraitsIPNS_4TypeEEE",
   "name" : "llvm::GraphTraits<llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm11GraphTraitsIPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm11GraphTraitsIPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Type.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11IntegerTypeE",
   "name" : "llvm::IntegerType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11IntegerTypeE",
   "self_type" : "_ZTIN4llvm11IntegerTypeE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm14SequentialTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11PointerTypeE",
   "name" : "llvm::PointerType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11PointerTypeE",
   "self_type" : "_ZTIN4llvm11PointerTypeE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm11SmallVectorIcLj256EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallStringILj256EEE",
   "name" : "llvm::SmallString<256>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallStringILj256EEE",
   "self_type" : "_ZTIN4llvm11SmallStringILj256EEE",
   "size" : 268,
   "source_file" : "external/llvm/include/llvm/ADT/SmallString.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvjEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvjEELj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvjEELj0EEE",
   "name" : "llvm::SmallVector<std::pair<void *, unsigned int>, 0>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvjEELj0EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvjEELj0EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvjEE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPvEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "name" : "llvm::SmallVector<void *, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE",
   "size" : 28,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 104,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIcLj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIcLj0EEE",
   "name" : "llvm::SmallVector<char, 0>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIcLj0EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIcLj0EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorImplIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Storage",
     "field_offset" : 104,
     "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIcLj256EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11SmallVectorIcLj256EEE",
   "name" : "llvm::SmallVector<char, 256>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIcLj256EEE",
   "self_type" : "_ZTIN4llvm11SmallVectorIcLj256EEE",
   "size" : 268,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11isa_impl_clINS_11GlobalAliasEKNS_5ValueEEE",
   "name" : "llvm::isa_impl_cl<llvm::GlobalAlias, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm11isa_impl_clINS_11GlobalAliasEKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm11isa_impl_clINS_11GlobalAliasEKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11GlobalAliasE", "_ZTIKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11isa_impl_clINS_11GlobalIFuncEKNS_5ValueEEE",
   "name" : "llvm::isa_impl_cl<llvm::GlobalIFunc, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm11isa_impl_clINS_11GlobalIFuncEKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm11isa_impl_clINS_11GlobalIFuncEKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11GlobalIFuncE", "_ZTIKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11isa_impl_clINS_11GlobalValueEPKNS_5ValueEEE",
   "name" : "llvm::isa_impl_cl<llvm::GlobalValue, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm11isa_impl_clINS_11GlobalValueEPKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm11isa_impl_clINS_11GlobalValueEPKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11GlobalValueE", "_ZTIPKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11isa_impl_clINS_11InstructionEPKNS_5ValueEEE",
   "name" : "llvm::isa_impl_cl<llvm::Instruction, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm11isa_impl_clINS_11InstructionEPKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm11isa_impl_clINS_11InstructionEPKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11InstructionE", "_ZTIPKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11isa_impl_clINS_12GlobalObjectEKNS_5ValueEEE",
   "name" : "llvm::isa_impl_cl<llvm::GlobalObject, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm11isa_impl_clINS_12GlobalObjectEKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm11isa_impl_clINS_12GlobalObjectEKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm12GlobalObjectE", "_ZTIKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11isa_impl_clINS_14GlobalVariableEKNS_5ValueEEE",
   "name" : "llvm::isa_impl_cl<llvm::GlobalVariable, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm11isa_impl_clINS_14GlobalVariableEKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm11isa_impl_clINS_14GlobalVariableEKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm14GlobalVariableE", "_ZTIKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11isa_impl_clINS_20GlobalIndirectSymbolEKNS_5ValueEEE",
   "name" : "llvm::isa_impl_cl<llvm::GlobalIndirectSymbol, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm11isa_impl_clINS_20GlobalIndirectSymbolEKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm11isa_impl_clINS_20GlobalIndirectSymbolEKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm20GlobalIndirectSymbolE", "_ZTIKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11isa_impl_clINS_8ConstantEPKNS_5ValueEEE",
   "name" : "llvm::isa_impl_cl<llvm::Constant, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm11isa_impl_clINS_8ConstantEPKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm11isa_impl_clINS_8ConstantEPKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIPKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm11isa_impl_clINS_8FunctionEKNS_5ValueEEE",
   "name" : "llvm::isa_impl_cl<llvm::Function, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm11isa_impl_clINS_8FunctionEKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm11isa_impl_clINS_8FunctionEKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8FunctionE", "_ZTIKN4llvm5ValueE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "OutBufStart",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "OutBufEnd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "OutBufCur",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "BufferMode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4llvm11raw_ostream10BufferKindE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm11raw_ostreamE",
   "name" : "llvm::raw_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm11raw_ostreamE",
   "self_type" : "_ZTIN4llvm11raw_ostreamE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm11raw_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm11raw_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm11raw_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm11raw_ostream10write_implEPKcj"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm11raw_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm12FunctionTypeE",
   "name" : "llvm::FunctionType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm12FunctionTypeE",
   "self_type" : "_ZTIN4llvm12FunctionTypeE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "name" : "llvm::AllocatorBase<llvm::MallocAllocator>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "self_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" : [ "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELj4096ELj4096EEEEE",
   "name" : "llvm::AllocatorBase<llvm::BumpPtrAllocatorImpl<llvm::MallocAllocator, 4096, 4096>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELj4096ELj4096EEEEE",
   "self_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELj4096ELj4096EEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" :
   [
    "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELj4096ELj4096EEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm13CompositeTypeE",
   "name" : "llvm::CompositeType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13CompositeTypeE",
   "self_type" : "_ZTIN4llvm13CompositeTypeE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "TheTable",
     "referenced_type" : "_ZTIPPN4llvm18StringMapEntryBaseE"
    },
    {
     "access" : "protected",
     "field_name" : "NumBuckets",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumItems",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumTombstones",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "ItemSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm13StringMapImplE",
   "name" : "llvm::StringMapImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm13StringMapImplE",
   "self_type" : "_ZTIN4llvm13StringMapImplE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalAliasEKNS_5ValueES3_EE",
   "name" : "llvm::isa_impl_wrap<llvm::GlobalAlias, const llvm::Value, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalAliasEKNS_5ValueES3_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalAliasEKNS_5ValueES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11GlobalAliasE",
    "_ZTIKN4llvm5ValueE",
    "_ZTIKN4llvm5ValueE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalIFuncEKNS_5ValueES3_EE",
   "name" : "llvm::isa_impl_wrap<llvm::GlobalIFunc, const llvm::Value, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalIFuncEKNS_5ValueES3_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalIFuncEKNS_5ValueES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11GlobalIFuncE",
    "_ZTIKN4llvm5ValueE",
    "_ZTIKN4llvm5ValueE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalValueEKPNS_5ValueEPKS2_EE",
   "name" : "llvm::isa_impl_wrap<llvm::GlobalValue, llvm::Value *const, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalValueEKPNS_5ValueEPKS2_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalValueEKPNS_5ValueEPKS2_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11GlobalValueE",
    "_ZTIKPN4llvm5ValueE",
    "_ZTIPKN4llvm5ValueE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalValueEPKNS_5ValueES4_EE",
   "name" : "llvm::isa_impl_wrap<llvm::GlobalValue, const llvm::Value *, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalValueEPKNS_5ValueES4_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_11GlobalValueEPKNS_5ValueES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11GlobalValueE",
    "_ZTIPKN4llvm5ValueE",
    "_ZTIPKN4llvm5ValueE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_11InstructionEKPKNS_5ValueES4_EE",
   "name" : "llvm::isa_impl_wrap<llvm::Instruction, const llvm::Value *const, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_11InstructionEKPKNS_5ValueES4_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_11InstructionEKPKNS_5ValueES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11InstructionE",
    "_ZTIKPKN4llvm5ValueE",
    "_ZTIPKN4llvm5ValueE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_11InstructionEPKNS_5ValueES4_EE",
   "name" : "llvm::isa_impl_wrap<llvm::Instruction, const llvm::Value *, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_11InstructionEPKNS_5ValueES4_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_11InstructionEPKNS_5ValueES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11InstructionE",
    "_ZTIPKN4llvm5ValueE",
    "_ZTIPKN4llvm5ValueE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_12GlobalObjectEKNS_5ValueES3_EE",
   "name" : "llvm::isa_impl_wrap<llvm::GlobalObject, const llvm::Value, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_12GlobalObjectEKNS_5ValueES3_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_12GlobalObjectEKNS_5ValueES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm12GlobalObjectE",
    "_ZTIKN4llvm5ValueE",
    "_ZTIKN4llvm5ValueE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_14GlobalVariableEKNS_5ValueES3_EE",
   "name" : "llvm::isa_impl_wrap<llvm::GlobalVariable, const llvm::Value, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_14GlobalVariableEKNS_5ValueES3_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_14GlobalVariableEKNS_5ValueES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm14GlobalVariableE",
    "_ZTIKN4llvm5ValueE",
    "_ZTIKN4llvm5ValueE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_20GlobalIndirectSymbolEKNS_5ValueES3_EE",
   "name" : "llvm::isa_impl_wrap<llvm::GlobalIndirectSymbol, const llvm::Value, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_20GlobalIndirectSymbolEKNS_5ValueES3_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_20GlobalIndirectSymbolEKNS_5ValueES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm20GlobalIndirectSymbolE",
    "_ZTIKN4llvm5ValueE",
    "_ZTIKN4llvm5ValueE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_8ConstantEKPKNS_5ValueES4_EE",
   "name" : "llvm::isa_impl_wrap<llvm::Constant, const llvm::Value *const, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_8ConstantEKPKNS_5ValueES4_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_8ConstantEKPKNS_5ValueES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIKPKN4llvm5ValueE", "_ZTIPKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_8ConstantEPKNS_5ValueES4_EE",
   "name" : "llvm::isa_impl_wrap<llvm::Constant, const llvm::Value *, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_8ConstantEPKNS_5ValueES4_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_8ConstantEPKNS_5ValueES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIPKN4llvm5ValueE", "_ZTIPKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13isa_impl_wrapINS_8FunctionEKNS_5ValueES3_EE",
   "name" : "llvm::isa_impl_wrap<llvm::Function, const llvm::Value, const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm13isa_impl_wrapINS_8FunctionEKNS_5ValueES3_EE",
   "self_type" : "_ZTIN4llvm13isa_impl_wrapINS_8FunctionEKNS_5ValueES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8FunctionE", "_ZTIKN4llvm5ValueE", "_ZTIKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIKNS_3UseEEE",
   "name" : "llvm::simplify_type<const llvm::Use>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIKNS_3UseEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIKNS_3UseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Use.h",
   "template_args" : [ "_ZTIKN4llvm3UseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIKNS_5ValueEEE",
   "name" : "llvm::simplify_type<const llvm::Value>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIKPKNS_4TypeEEE",
   "name" : "llvm::simplify_type<const llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIKPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIKPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIKPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIKPKNS_5ValueEEE",
   "name" : "llvm::simplify_type<const llvm::Value *const>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIKPKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIKPKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIKPKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIKPNS_4TypeEEE",
   "name" : "llvm::simplify_type<llvm::Type *const>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIKPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIKPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIKPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIKPNS_5ValueEEE",
   "name" : "llvm::simplify_type<llvm::Value *const>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIKPNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIKPNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIKPN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeINS_3UseEEE",
   "name" : "llvm::simplify_type<llvm::Use>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeINS_3UseEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeINS_3UseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Use.h",
   "template_args" : [ "_ZTIN4llvm3UseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeINS_5ValueEEE",
   "name" : "llvm::simplify_type<llvm::Value>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeINS_5ValueEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeINS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIPKNS_3UseEEE",
   "name" : "llvm::simplify_type<const llvm::Use *>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIPKNS_3UseEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIPKNS_3UseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/User.h",
   "template_args" : [ "_ZTIPKN4llvm3UseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIPKNS_4TypeEEE",
   "name" : "llvm::simplify_type<const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIPKNS_5ValueEEE",
   "name" : "llvm::simplify_type<const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIPKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIPKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIPKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIPNS_3UseEEE",
   "name" : "llvm::simplify_type<llvm::Use *>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIPNS_3UseEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIPNS_3UseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/User.h",
   "template_args" : [ "_ZTIPN4llvm3UseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIPNS_4TypeEEE",
   "name" : "llvm::simplify_type<llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm13simplify_typeIPNS_5ValueEEE",
   "name" : "llvm::simplify_type<llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm13simplify_typeIPNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm13simplify_typeIPNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIPN4llvm5ValueE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14PointerIntPairIPPNS_3UseELj2ENS1_10PrevPtrTagENS_21PointerLikeTypeTraitsIS3_EENS_18PointerIntPairInfoIS3_Lj2ES6_EEEE",
   "name" : "llvm::PointerIntPair<llvm::Use **, 2, llvm::Use::PrevPtrTag, llvm::PointerLikeTypeTraits<llvm::Use **>, llvm::PointerIntPairInfo<llvm::Use **, 2, llvm::PointerLikeTypeTraits<llvm::Use **>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14PointerIntPairIPPNS_3UseELj2ENS1_10PrevPtrTagENS_21PointerLikeTypeTraitsIS3_EENS_18PointerIntPairInfoIS3_Lj2ES6_EEEE",
   "self_type" : "_ZTIN4llvm14PointerIntPairIPPNS_3UseELj2ENS1_10PrevPtrTagENS_21PointerLikeTypeTraitsIS3_EENS_18PointerIntPairInfoIS3_Lj2ES6_EEEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/PointerIntPair.h",
   "template_args" :
   [
    "_ZTIPPN4llvm3UseE",
    "_ZTIN4llvm3Use10PrevPtrTagE",
    "_ZTIN4llvm21PointerLikeTypeTraitsIPPNS_3UseEEE",
    "_ZTIN4llvm18PointerIntPairInfoIPPNS_3UseELj2ENS_21PointerLikeTypeTraitsIS3_EEEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13CompositeTypeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ContainedType",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14SequentialTypeE",
   "name" : "llvm::SequentialType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14SequentialTypeE",
   "self_type" : "_ZTIN4llvm14SequentialTypeE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm18StringMapEntryBaseE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "second",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN4llvm5ValueE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14StringMapEntryIPNS_5ValueEEE",
   "name" : "llvm::StringMapEntry<llvm::Value *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14StringMapEntryIPNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm14StringMapEntryIPNS_5ValueEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h",
   "template_args" : [ "_ZTIPN4llvm5ValueE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm19raw_svector_ostreamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "OS",
     "field_offset" : 192,
     "referenced_type" : "_ZTIRN4llvm11raw_ostreamE"
    },
    {
     "access" : "private",
     "field_name" : "Buffer",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIcLj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14buffer_ostreamE",
   "name" : "llvm::buffer_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14buffer_ostreamE",
   "self_type" : "_ZTIN4llvm14buffer_ostreamE",
   "size" : 44,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm14buffer_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm14buffer_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm14buffer_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostream10write_implEPKcj"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm19raw_svector_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostream11pwrite_implEPKcjy"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm14is_simple_typeIPKNS_4TypeEEE",
   "name" : "llvm::is_simple_type<const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm14is_simple_typeIPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm14is_simple_typeIPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm14is_simple_typeIPNS_4TypeEEE",
   "name" : "llvm::is_simple_type<llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm14is_simple_typeIPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm14is_simple_typeIPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm14is_simple_typeIPNS_5ValueEEE",
   "name" : "llvm::is_simple_type<llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm14is_simple_typeIPNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm14is_simple_typeIPNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIPN4llvm5ValueE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIN4llvm4User17value_op_iteratorE"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm4User17value_op_iteratorE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeINS_4User17value_op_iteratorEEE",
   "name" : "llvm::iterator_range<llvm::User::value_op_iterator>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeINS_4User17value_op_iteratorEEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeINS_4User17value_op_iteratorEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIN4llvm4User17value_op_iteratorE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIN4llvm5Value17use_iterator_implIKNS_3UseEEE"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm5Value17use_iterator_implIKNS_3UseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeINS_5Value17use_iterator_implIKNS_3UseEEEEE",
   "name" : "llvm::iterator_range<llvm::Value::use_iterator_impl<const llvm::Use>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeINS_5Value17use_iterator_implIKNS_3UseEEEEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeINS_5Value17use_iterator_implIKNS_3UseEEEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIN4llvm5Value17use_iterator_implIKNS_3UseEEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIN4llvm5Value17use_iterator_implINS_3UseEEE"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm5Value17use_iterator_implINS_3UseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeINS_5Value17use_iterator_implINS_3UseEEEEE",
   "name" : "llvm::iterator_range<llvm::Value::use_iterator_impl<llvm::Use>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeINS_5Value17use_iterator_implINS_3UseEEEEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeINS_5Value17use_iterator_implINS_3UseEEEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIN4llvm5Value17use_iterator_implINS_3UseEEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIN4llvm5Value18user_iterator_implIKNS_4UserEEE"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm5Value18user_iterator_implIKNS_4UserEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeINS_5Value18user_iterator_implIKNS_4UserEEEEE",
   "name" : "llvm::iterator_range<llvm::Value::user_iterator_impl<const llvm::User>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeINS_5Value18user_iterator_implIKNS_4UserEEEEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeINS_5Value18user_iterator_implIKNS_4UserEEEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIN4llvm5Value18user_iterator_implIKNS_4UserEEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIN4llvm5Value18user_iterator_implINS_4UserEEE"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm5Value18user_iterator_implINS_4UserEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeINS_5Value18user_iterator_implINS_4UserEEEEE",
   "name" : "llvm::iterator_range<llvm::Value::user_iterator_impl<llvm::User>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeINS_5Value18user_iterator_implINS_4UserEEEEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeINS_5Value18user_iterator_implINS_4UserEEEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIN4llvm5Value18user_iterator_implINS_4UserEEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIPKN4llvm3UseE"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKN4llvm3UseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeIPKNS_3UseEEE",
   "name" : "llvm::iterator_range<const llvm::Use *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeIPKNS_3UseEEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeIPKNS_3UseEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIPKN4llvm3UseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "name" : "llvm::iterator_range<const unsigned char *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeIPKhEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIPKh" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_iterator",
     "referenced_type" : "_ZTIPN4llvm3UseE"
    },
    {
     "access" : "private",
     "field_name" : "end_iterator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN4llvm3UseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14iterator_rangeIPNS_3UseEEE",
   "name" : "llvm::iterator_range<llvm::Use *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14iterator_rangeIPNS_3UseEEE",
   "self_type" : "_ZTIN4llvm14iterator_rangeIPNS_3UseEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/iterator_range.h",
   "template_args" : [ "_ZTIPN4llvm3UseE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm17raw_pwrite_streamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FD",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "ShouldClose",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "Error",
     "field_offset" : 200,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "pos",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "SupportsSeeking",
     "field_offset" : 320,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm14raw_fd_ostreamE",
   "name" : "llvm::raw_fd_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm14raw_fd_ostreamE",
   "self_type" : "_ZTIN4llvm14raw_fd_ostreamE",
   "size" : 48,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm14raw_fd_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostream11changeColorENS_11raw_ostream6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm14raw_fd_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm14raw_fd_ostream10has_colorsEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostream10write_implEPKcj"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm14raw_fd_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm14raw_fd_ostream21preferred_buffer_sizeEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm14raw_fd_ostream11pwrite_implEPKcjy"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_15MallocAllocatorEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15MallocAllocatorE",
   "name" : "llvm::MallocAllocator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15MallocAllocatorE",
   "self_type" : "_ZTIN4llvm15MallocAllocatorE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "BeginX",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "EndX",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "CapacityX",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorBaseE",
   "name" : "llvm::SmallVectorBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE",
   "self_type" : "_ZTIN4llvm15SmallVectorBaseE",
   "size" : 12,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvjEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvjEEEE",
   "name" : "llvm::SmallVectorImpl<std::pair<void *, unsigned int>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvjEEEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplINSt3__14pairIPvjEEEE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvjEE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "name" : "llvm::SmallVectorImpl<void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplIPvEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm15SmallVectorImplIcEE",
   "name" : "llvm::SmallVectorImpl<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplIcEE",
   "self_type" : "_ZTIN4llvm15SmallVectorImplIcEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_10StructTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::StructType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_10StructTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_10StructTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10StructTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_10VectorTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::VectorType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_10VectorTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_10VectorTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_11IntegerTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::IntegerType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_11IntegerTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_11IntegerTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11IntegerTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::PointerType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::PointerType, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_11PointerTypeEPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_12FunctionTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::FunctionType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_12FunctionTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_12FunctionTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm12FunctionTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_8ConstantEPKNS_5ValueEEE",
   "name" : "llvm::cast_retty_impl<llvm::Constant, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_8ConstantEPKNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_8ConstantEPKNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIPKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_8ConstantEPNS_5ValueEEE",
   "name" : "llvm::cast_retty_impl<llvm::Constant, llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_8ConstantEPNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_8ConstantEPNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIPN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_implINS_9ArrayTypeEPKNS_4TypeEEE",
   "name" : "llvm::cast_retty_impl<llvm::ArrayType, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_implINS_9ArrayTypeEPKNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm15cast_retty_implINS_9ArrayTypeEPKNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEKPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::StructType, const llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEKPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEKPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm10StructTypeE",
    "_ZTIKPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::StructType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_10StructTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10StructTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEKPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::VectorType, const llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEKPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEKPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm10VectorTypeE",
    "_ZTIKPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::VectorType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_10VectorTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEKPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::IntegerType, const llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEKPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEKPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11IntegerTypeE",
    "_ZTIKPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::IntegerType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11IntegerTypeE",
    "_ZTIPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEKPNS_4TypeEPKS2_EE",
   "name" : "llvm::cast_retty_wrap<llvm::PointerType, llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEKPNS_4TypeEPKS2_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEKPNS_4TypeEPKS2_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11PointerTypeE",
    "_ZTIKPN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::PointerType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11PointerTypeE",
    "_ZTIPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPNS_4TypeES3_EE",
   "name" : "llvm::cast_retty_wrap<llvm::PointerType, llvm::Type *, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPNS_4TypeES3_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_11PointerTypeEPNS_4TypeES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPN4llvm4TypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEKPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::FunctionType, const llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEKPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEKPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm12FunctionTypeE",
    "_ZTIKPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::FunctionType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm12FunctionTypeE",
    "_ZTIPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_8ConstantEKPNS_5ValueEPKS2_EE",
   "name" : "llvm::cast_retty_wrap<llvm::Constant, llvm::Value *const, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_8ConstantEKPNS_5ValueEPKS2_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_8ConstantEKPNS_5ValueEPKS2_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIKPN4llvm5ValueE", "_ZTIPKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_8ConstantEPKNS_5ValueES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::Constant, const llvm::Value *, const llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_8ConstantEPKNS_5ValueES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_8ConstantEPKNS_5ValueES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIPKN4llvm5ValueE", "_ZTIPKN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_8ConstantEPNS_5ValueES3_EE",
   "name" : "llvm::cast_retty_wrap<llvm::Constant, llvm::Value *, llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_8ConstantEPNS_5ValueES3_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_8ConstantEPNS_5ValueES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIPN4llvm5ValueE", "_ZTIPN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEKPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::ArrayType, const llvm::Type *const, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEKPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEKPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIKPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_retty_wrap<llvm::ArrayType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm15cast_retty_wrapINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILj1ELj1EEE",
   "name" : "llvm::AlignedCharArray<1, 1>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj1EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA2_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILj1ELj2EEE",
   "name" : "llvm::AlignedCharArray<1, 2>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj2EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj2EEE",
   "size" : 2,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA4_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILj1ELj4EEE",
   "name" : "llvm::AlignedCharArray<1, 4>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj4EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj4EEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA8_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILj1ELj8EEE",
   "name" : "llvm::AlignedCharArray<1, 8>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj8EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj8EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA4_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILj4ELj4EEE",
   "name" : "llvm::AlignedCharArray<4, 4>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj4ELj4EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILj4ELj4EEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA8_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16AlignedCharArrayILj4ELj8EEE",
   "name" : "llvm::AlignedCharArray<4, 8>",
   "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj4ELj8EEE",
   "self_type" : "_ZTIN4llvm16AlignedCharArrayILj4ELj8EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "vmap",
     "referenced_type" : "_ZTIN4llvm9StringMapIPNS_5ValueENS_15MallocAllocatorEEE"
    },
    {
     "access" : "private",
     "field_name" : "LastUnique",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16ValueSymbolTableE",
   "name" : "llvm::ValueSymbolTable",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm16ValueSymbolTableE",
   "self_type" : "_ZTIN4llvm16ValueSymbolTableE",
   "size" : 28,
   "source_file" : "external/llvm/include/llvm/IR/ValueSymbolTable.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_10StructTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_convert_val<llvm::StructType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_10StructTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_10StructTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10StructTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_10VectorTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_convert_val<llvm::VectorType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_10VectorTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_10VectorTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm10VectorTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_convert_val<llvm::IntegerType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_11IntegerTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm11IntegerTypeE",
    "_ZTIPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_11PointerTypeEPNS_4TypeES3_EE",
   "name" : "llvm::cast_convert_val<llvm::PointerType, llvm::Type *, llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_11PointerTypeEPNS_4TypeES3_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_11PointerTypeEPNS_4TypeES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIPN4llvm4TypeE", "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_convert_val<llvm::FunctionType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_12FunctionTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" :
   [
    "_ZTIN4llvm12FunctionTypeE",
    "_ZTIPKN4llvm4TypeE",
    "_ZTIPKN4llvm4TypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_8ConstantEPNS_5ValueES3_EE",
   "name" : "llvm::cast_convert_val<llvm::Constant, llvm::Value *, llvm::Value *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_8ConstantEPNS_5ValueES3_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_8ConstantEPNS_5ValueES3_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIPN4llvm5ValueE", "_ZTIPN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm16cast_convert_valINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "name" : "llvm::cast_convert_val<llvm::ArrayType, const llvm::Type *, const llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm16cast_convert_valINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "self_type" : "_ZTIN4llvm16cast_convert_valINS_9ArrayTypeEPKNS_4TypeES4_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Casting.h",
   "template_args" : [ "_ZTIN4llvm9ArrayTypeE", "_ZTIPKN4llvm4TypeE", "_ZTIPKN4llvm4TypeE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm17raw_pwrite_streamE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm16raw_null_ostreamE",
   "name" : "llvm::raw_null_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm16raw_null_ostreamE",
   "self_type" : "_ZTIN4llvm16raw_null_ostreamE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm16raw_null_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm16raw_null_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm16raw_null_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm16raw_null_ostream10write_implEPKcj"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm16raw_null_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm16raw_null_ostream11pwrite_implEPKcjy"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm22StringMapConstIteratorIPNS_5ValueEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm17StringMapIteratorIPNS_5ValueEEE",
   "name" : "llvm::StringMapIterator<llvm::Value *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm17StringMapIteratorIPNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm17StringMapIteratorIPNS_5ValueEEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h",
   "template_args" : [ "_ZTIPN4llvm5ValueE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm11raw_ostreamE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm17raw_pwrite_streamE",
   "name" : "llvm::raw_pwrite_stream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm17raw_pwrite_streamE",
   "self_type" : "_ZTIN4llvm17raw_pwrite_streamE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm17raw_pwrite_streamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm17raw_pwrite_streamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm17raw_pwrite_streamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm11raw_ostream10write_implEPKcj"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4llvm11raw_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4llvm17raw_pwrite_stream11pwrite_implEPKcjy"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm18PointerIntPairInfoIPPNS_3UseELj2ENS_21PointerLikeTypeTraitsIS3_EEEE",
   "name" : "llvm::PointerIntPairInfo<llvm::Use **, 2, llvm::PointerLikeTypeTraits<llvm::Use **>>",
   "referenced_type" : "_ZTIN4llvm18PointerIntPairInfoIPPNS_3UseELj2ENS_21PointerLikeTypeTraitsIS3_EEEE",
   "self_type" : "_ZTIN4llvm18PointerIntPairInfoIPPNS_3UseELj2ENS_21PointerLikeTypeTraitsIS3_EEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/PointerIntPair.h",
   "template_args" : [ "_ZTIPPN4llvm3UseE", "_ZTIN4llvm21PointerLikeTypeTraitsIPPNS_3UseEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvjEELj0EEE",
   "name" : "llvm::SmallVectorStorage<std::pair<void *, unsigned int>, 0>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvjEELj0EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageINSt3__14pairIPvjEELj0EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvjEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA3_N4llvm21AlignedCharArrayUnionIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "name" : "llvm::SmallVectorStorage<void *, 4>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIPvLj4EEE",
   "size" : 12,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIcLj0EEE",
   "name" : "llvm::SmallVectorStorage<char, 0>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIcLj0EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIcLj0EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "InlineElts",
     "referenced_type" : "_ZTIA255_N4llvm21AlignedCharArrayUnionIccccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18SmallVectorStorageIcLj256EEE",
   "name" : "llvm::SmallVectorStorage<char, 256>",
   "referenced_type" : "_ZTIN4llvm18SmallVectorStorageIcLj256EEE",
   "self_type" : "_ZTIN4llvm18SmallVectorStorageIcLj256EEE",
   "size" : 255,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "StrLen",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18StringMapEntryBaseE",
   "name" : "llvm::StringMapEntryBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm18StringMapEntryBaseE",
   "self_type" : "_ZTIN4llvm18StringMapEntryBaseE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm11raw_ostreamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "OS",
     "field_offset" : 160,
     "referenced_type" : "_ZTIRNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm18raw_string_ostreamE",
   "name" : "llvm::raw_string_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm18raw_string_ostreamE",
   "self_type" : "_ZTIN4llvm18raw_string_ostreamE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm18raw_string_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm18raw_string_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm18raw_string_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm18raw_string_ostream10write_implEPKcj"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm18raw_string_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "SmallArray",
     "referenced_type" : "_ZTIPPKv"
    },
    {
     "access" : "protected",
     "field_name" : "CurArray",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPKv"
    },
    {
     "access" : "protected",
     "field_name" : "CurArraySize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumNonEmpty",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumTombstones",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm19SmallPtrSetImplBaseE",
   "name" : "llvm::SmallPtrSetImplBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm19SmallPtrSetImplBaseE",
   "self_type" : "_ZTIN4llvm19SmallPtrSetImplBaseE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm17raw_pwrite_streamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "OS",
     "field_offset" : 160,
     "referenced_type" : "_ZTIRN4llvm15SmallVectorImplIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm19raw_svector_ostreamE",
   "name" : "llvm::raw_svector_ostream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm19raw_svector_ostreamE",
   "self_type" : "_ZTIN4llvm19raw_svector_ostreamE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/raw_ostream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm19raw_svector_ostreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream11changeColorENS0_6ColorsEbb"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream10resetColorEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream12reverseColorEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream12is_displayedEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream10has_colorsEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostream10write_implEPKcj"
    },
    {
     "mangled_component_name" : "_ZN4llvm11raw_ostream6handleEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm19raw_svector_ostream11current_posEv"
    },
    {
     "mangled_component_name" : "_ZNK4llvm11raw_ostream21preferred_buffer_sizeEv"
    },
    {
     "mangled_component_name" : "_ZN4llvm19raw_svector_ostream11pwrite_implEPKcjy"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13AllocatorBaseINS_20BumpPtrAllocatorImplINS_15MallocAllocatorELj4096ELj4096EEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "CurPtr",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "End",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "Slabs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm11SmallVectorIPvLj4EEE"
    },
    {
     "access" : "private",
     "field_name" : "CustomSizedSlabs",
     "field_offset" : 288,
     "referenced_type" : "_ZTIN4llvm11SmallVectorINSt3__14pairIPvjEELj0EEE"
    },
    {
     "access" : "private",
     "field_name" : "BytesAllocated",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "Allocator",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN4llvm15MallocAllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELj4096ELj4096EEE",
   "name" : "llvm::BumpPtrAllocatorImpl<llvm::MallocAllocator, 4096, 4096>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELj4096ELj4096EEE",
   "self_type" : "_ZTIN4llvm20BumpPtrAllocatorImplINS_15MallocAllocatorELj4096ELj4096EEE",
   "size" : 68,
   "source_file" : "external/llvm/include/llvm/Support/Allocator.h",
   "template_args" : [ "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_26random_access_iterator_tagEPN4llvm5ValueEiS4_S4_EE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm20iterator_facade_baseINS_4User17value_op_iteratorENSt3__126random_access_iterator_tagEPNS_5ValueEiS6_S6_EE",
   "name" : "llvm::iterator_facade_base<llvm::User::value_op_iterator, std::random_access_iterator_tag, llvm::Value *, int, llvm::Value *, llvm::Value *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm20iterator_facade_baseINS_4User17value_op_iteratorENSt3__126random_access_iterator_tagEPNS_5ValueEiS6_S6_EE",
   "self_type" : "_ZTIN4llvm20iterator_facade_baseINS_4User17value_op_iteratorENSt3__126random_access_iterator_tagEPNS_5ValueEiS6_S6_EE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/iterator.h",
   "template_args" :
   [
    "_ZTIN4llvm4User17value_op_iteratorE",
    "_ZTINSt3__126random_access_iterator_tagE",
    "_ZTIPN4llvm5ValueE",
    "_ZTIi",
    "_ZTIPN4llvm5ValueE",
    "_ZTIPN4llvm5ValueE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj4ELj8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvjEEcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<std::pair<void *, unsigned int>, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvjEEcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvjEEcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvjEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj4ELj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<void *, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE",
   "name" : "llvm::AlignedCharArrayUnion<char, char, char, char, char, char, char, char, char, char>",
   "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE",
   "self_type" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "name" : "llvm::PointerLikeTypeTraits<llvm::StringMapEntryBase *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_18StringMapEntryBaseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIPN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_5ValueEEE",
   "name" : "llvm::PointerLikeTypeTraits<llvm::Value *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPNS_5ValueEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIPN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPPNS_3UseEEE",
   "name" : "llvm::PointerLikeTypeTraits<llvm::Use **>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPPNS_3UseEEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPPNS_3UseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Use.h",
   "template_args" : [ "_ZTIPPN4llvm3UseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "name" : "llvm::PointerLikeTypeTraits<void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIPvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm21PointerLikeTypeTraitsIjEE",
   "name" : "llvm::PointerLikeTypeTraits<uintptr_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIjEE",
   "self_type" : "_ZTIN4llvm21PointerLikeTypeTraitsIjEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm20iterator_facade_baseINS_4User17value_op_iteratorENSt3__126random_access_iterator_tagEPNS_5ValueEiS6_S6_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "I",
     "referenced_type" : "_ZTIPN4llvm3UseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm21iterator_adaptor_baseINS_4User17value_op_iteratorEPNS_3UseENSt3__126random_access_iterator_tagEPNS_5ValueEiS8_S8_NS5_15iterator_traitsIS4_EEEE",
   "name" : "llvm::iterator_adaptor_base<llvm::User::value_op_iterator, llvm::Use *, std::random_access_iterator_tag, llvm::Value *, int, llvm::Value *, llvm::Value *, std::iterator_traits<llvm::Use *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm21iterator_adaptor_baseINS_4User17value_op_iteratorEPNS_3UseENSt3__126random_access_iterator_tagEPNS_5ValueEiS8_S8_NS5_15iterator_traitsIS4_EEEE",
   "self_type" : "_ZTIN4llvm21iterator_adaptor_baseINS_4User17value_op_iteratorEPNS_3UseENSt3__126random_access_iterator_tagEPNS_5ValueEiS8_S8_NS5_15iterator_traitsIS4_EEEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/iterator.h",
   "template_args" :
   [
    "_ZTIN4llvm4User17value_op_iteratorE",
    "_ZTIPN4llvm3UseE",
    "_ZTINSt3__126random_access_iterator_tagE",
    "_ZTIPN4llvm5ValueE",
    "_ZTIi",
    "_ZTIPN4llvm5ValueE",
    "_ZTIPN4llvm5ValueE",
    "_ZTINSt3__115iterator_traitsIPN4llvm3UseEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "Ptr",
     "referenced_type" : "_ZTIPPN4llvm18StringMapEntryBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm22StringMapConstIteratorIPNS_5ValueEEE",
   "name" : "llvm::StringMapConstIterator<llvm::Value *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm22StringMapConstIteratorIPNS_5ValueEEE",
   "self_type" : "_ZTIN4llvm22StringMapConstIteratorIPNS_5ValueEEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h",
   "template_args" : [ "_ZTIPN4llvm5ValueE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm22add_const_past_pointerINS_5ValueEvEE",
   "name" : "llvm::add_const_past_pointer<llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm22add_const_past_pointerINS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm22add_const_past_pointerINS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm22add_const_past_pointerIPKNS_4TypeEvEE",
   "name" : "llvm::add_const_past_pointer<const llvm::Type *, void>",
   "referenced_type" : "_ZTIN4llvm22add_const_past_pointerIPKNS_4TypeEvEE",
   "self_type" : "_ZTIN4llvm22add_const_past_pointerIPKNS_4TypeEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPKN4llvm4TypeE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm22add_const_past_pointerIPKNS_5ValueEvEE",
   "name" : "llvm::add_const_past_pointer<const llvm::Value *, void>",
   "referenced_type" : "_ZTIN4llvm22add_const_past_pointerIPKNS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm22add_const_past_pointerIPKNS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPKN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm22add_const_past_pointerIPNS_4TypeEvEE",
   "name" : "llvm::add_const_past_pointer<llvm::Type *, void>",
   "referenced_type" : "_ZTIN4llvm22add_const_past_pointerIPNS_4TypeEvEE",
   "self_type" : "_ZTIN4llvm22add_const_past_pointerIPNS_4TypeEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm22add_const_past_pointerIPNS_5ValueEvEE",
   "name" : "llvm::add_const_past_pointer<llvm::Value *, void>",
   "referenced_type" : "_ZTIN4llvm22add_const_past_pointerIPNS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm22add_const_past_pointerIPNS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "name" : "llvm::ScopedFatalErrorHandler",
   "referenced_type" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "self_type" : "_ZTIN4llvm23ScopedFatalErrorHandlerE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/ErrorHandling.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "Bucket",
     "referenced_type" : "_ZTIPKPKv"
    },
    {
     "access" : "protected",
     "field_name" : "End",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKPKv"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallPtrSetIteratorImplE",
   "name" : "llvm::SmallPtrSetIteratorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallPtrSetIteratorImplE",
   "self_type" : "_ZTIN4llvm23SmallPtrSetIteratorImplE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/SmallPtrSet.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvjEEvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvjEELb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<std::pair<void *, unsigned int>, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvjEELb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseINSt3__14pairIPvjEELb1EEE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvjEE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<void *, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIPvLb1EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE",
   "name" : "llvm::SmallVectorTemplateBase<char, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE",
   "self_type" : "_ZTIN4llvm23SmallVectorTemplateBaseIcLb1EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionINSt3__14pairIPvjEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvjEEvEE",
   "name" : "llvm::SmallVectorTemplateCommon<std::pair<void *, unsigned int>, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvjEEvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonINSt3__14pairIPvjEEvEE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTINSt3__14pairIPvjEE", "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "name" : "llvm::SmallVectorTemplateCommon<void *, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIPvvEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIPv", "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm15SmallVectorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "FirstEl",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4llvm21AlignedCharArrayUnionIccccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE",
   "name" : "llvm::SmallVectorTemplateCommon<char, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE",
   "self_type" : "_ZTIN4llvm25SmallVectorTemplateCommonIcvEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h",
   "template_args" : [ "_ZTIc", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIKNS_5ValueEvEE",
   "name" : "llvm::add_lvalue_reference_if_not_pointer<const llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIKNS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIKNS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIKN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIPKNS_4TypeEvEE",
   "name" : "llvm::add_lvalue_reference_if_not_pointer<const llvm::Type *, void>",
   "referenced_type" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIPKNS_4TypeEvEE",
   "self_type" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIPKNS_4TypeEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPKN4llvm4TypeE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIPKNS_5ValueEvEE",
   "name" : "llvm::add_lvalue_reference_if_not_pointer<const llvm::Value *, void>",
   "referenced_type" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIPKNS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm35add_lvalue_reference_if_not_pointerIPKNS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPKN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "a",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "b",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "c",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "d",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "hi",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "lo",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "buffer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA64_h"
    },
    {
     "access" : "private",
     "field_name" : "block",
     "field_offset" : 704,
     "referenced_type" : "_ZTIA16_j"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3MD5E",
   "name" : "llvm::MD5",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3MD5E",
   "self_type" : "_ZTIN4llvm3MD5E",
   "size" : 152,
   "source_file" : "external/llvm/include/llvm/Support/MD5.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Val",
     "referenced_type" : "_ZTIPN4llvm5ValueE"
    },
    {
     "access" : "private",
     "field_name" : "Next",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN4llvm3UseE"
    },
    {
     "access" : "private",
     "field_name" : "Prev",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm14PointerIntPairIPPNS_3UseELj2ENS1_10PrevPtrTagENS_21PointerLikeTypeTraitsIS3_EENS_18PointerIntPairInfoIS3_Lj2ES6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3UseE",
   "name" : "llvm::Use",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3UseE",
   "self_type" : "_ZTIN4llvm3UseE",
   "size" : 12,
   "source_file" : "external/llvm/include/llvm/IR/Use.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Address",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "Size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys11MemoryBlockE",
   "name" : "llvm::sys::MemoryBlock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys11MemoryBlockE",
   "self_type" : "_ZTIN4llvm3sys11MemoryBlockE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "M",
     "referenced_type" : "_ZTIN4llvm3sys11MemoryBlockE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "name" : "llvm::sys::OwningMemoryBlock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "self_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm3sys6MemoryE",
   "name" : "llvm::sys::Memory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm3sys6MemoryE",
   "self_type" : "_ZTIN4llvm3sys6MemoryE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Context",
     "referenced_type" : "_ZTIRN4llvm11LLVMContextE"
    },
    {
     "access" : "private",
     "field_name" : "ID",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm4Type6TypeIDE"
    },
    {
     "access" : "private",
     "field_name" : "SubclassData",
     "field_offset" : 40,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "NumContainedTys",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "ContainedTys",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKPN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm4TypeE",
   "name" : "llvm::Type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm4TypeE",
   "self_type" : "_ZTIN4llvm4TypeE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/IR/Type.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm21iterator_adaptor_baseINS_4User17value_op_iteratorEPNS_3UseENSt3__126random_access_iterator_tagEPNS_5ValueEiS8_S8_NS5_15iterator_traitsIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm4User17value_op_iteratorE",
   "name" : "llvm::User::value_op_iterator",
   "referenced_type" : "_ZTIN4llvm4User17value_op_iteratorE",
   "self_type" : "_ZTIN4llvm4User17value_op_iteratorE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/IR/User.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm5ValueE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm4UserE",
   "name" : "llvm::User",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm4UserE",
   "self_type" : "_ZTIN4llvm4UserE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/IR/User.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm4UserE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm4UserD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm4UserD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm4User6anchorEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "_ZTIN4llvm5APIntE"
    },
    {
     "field_name" : "s",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5APInt2msE",
   "name" : "llvm::APInt::ms",
   "referenced_type" : "_ZTIN4llvm5APInt2msE",
   "self_type" : "_ZTIN4llvm5APInt2msE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/APInt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "_ZTIN4llvm5APIntE"
    },
    {
     "field_name" : "a",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "s",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5APInt2muE",
   "name" : "llvm::APInt::mu",
   "referenced_type" : "_ZTIN4llvm5APInt2muE",
   "self_type" : "_ZTIN4llvm5APInt2muE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/APInt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "BitWidth",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm5APIntUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5APIntE",
   "name" : "llvm::APInt",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm5APIntE",
   "self_type" : "_ZTIN4llvm5APIntE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/ADT/APInt.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "VAL",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pVal",
     "referenced_type" : "_ZTIPy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN4llvm5APIntUt_E",
   "name" : "llvm::APInt::(anonymous union at external/llvm/include/llvm/ADT/APInt.h:78:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm5APIntUt_E",
   "self_type" : "_ZTIN4llvm5APIntUt_E",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/APInt.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_20forward_iterator_tagEPKN4llvm3UseEiPS5_RS5_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "U",
     "referenced_type" : "_ZTIPKN4llvm3UseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5Value17use_iterator_implIKNS_3UseEEE",
   "name" : "llvm::Value::use_iterator_impl<const llvm::Use>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm5Value17use_iterator_implIKNS_3UseEEE",
   "self_type" : "_ZTIN4llvm5Value17use_iterator_implIKNS_3UseEEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIKN4llvm3UseE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_20forward_iterator_tagEPN4llvm3UseEiPS4_RS4_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "U",
     "referenced_type" : "_ZTIPN4llvm3UseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5Value17use_iterator_implINS_3UseEEE",
   "name" : "llvm::Value::use_iterator_impl<llvm::Use>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm5Value17use_iterator_implINS_3UseEEE",
   "self_type" : "_ZTIN4llvm5Value17use_iterator_implINS_3UseEEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm3UseE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_20forward_iterator_tagEPKN4llvm4UserEiPS5_RS5_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "UI",
     "referenced_type" : "_ZTIN4llvm5Value17use_iterator_implINS_3UseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5Value18user_iterator_implIKNS_4UserEEE",
   "name" : "llvm::Value::user_iterator_impl<const llvm::User>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm5Value18user_iterator_implIKNS_4UserEEE",
   "self_type" : "_ZTIN4llvm5Value18user_iterator_implIKNS_4UserEEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIKN4llvm4UserE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_20forward_iterator_tagEPN4llvm4UserEiPS4_RS4_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "UI",
     "referenced_type" : "_ZTIN4llvm5Value17use_iterator_implINS_3UseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5Value18user_iterator_implINS_4UserEEE",
   "name" : "llvm::Value::user_iterator_impl<llvm::User>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm5Value18user_iterator_implINS_4UserEEE",
   "self_type" : "_ZTIN4llvm5Value18user_iterator_implINS_4UserEEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm4UserE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "VTy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN4llvm4TypeE"
    },
    {
     "access" : "private",
     "field_name" : "UseList",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN4llvm3UseE"
    },
    {
     "access" : "private",
     "field_name" : "SubclassID",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKh"
    },
    {
     "access" : "private",
     "field_name" : "HasValueHandle",
     "field_offset" : 104,
     "referenced_type" : "_ZTIh"
    },
    {
     "access" : "protected",
     "field_name" : "SubclassOptionalData",
     "field_offset" : 105,
     "referenced_type" : "_ZTIh"
    },
    {
     "access" : "private",
     "field_name" : "SubclassData",
     "field_offset" : 112,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "protected",
     "field_name" : "NumUserOperands",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "IsUsedByMD",
     "field_offset" : 156,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "HasName",
     "field_offset" : 157,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "HasHungOffUses",
     "field_offset" : 158,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "HasDescriptor",
     "field_offset" : 159,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm5ValueE",
   "name" : "llvm::Value",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm5ValueE",
   "self_type" : "_ZTIN4llvm5ValueE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm5ValueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm5ValueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm5ValueD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTINSt3__14pairIPvjEE"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 80,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 88,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 120,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 128,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvjEEcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<std::pair<void *, unsigned int>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvjEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvjEEcccccccccEE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvjEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 32,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 40,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 48,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 56,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 80,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 88,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "name" : "llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "t1",
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t2",
     "field_offset" : 8,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t3",
     "field_offset" : 16,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t4",
     "field_offset" : 24,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t5",
     "field_offset" : 32,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t6",
     "field_offset" : 40,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t7",
     "field_offset" : 48,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t8",
     "field_offset" : 56,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t9",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "t10",
     "field_offset" : 72,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE",
   "name" : "llvm::detail::AlignerImpl<char, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE",
   "self_type" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE",
   "size" : 10,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILj1EEE",
   "name" : "llvm::detail::ConstantLog2<1>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILj1EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILj1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILj2EEE",
   "name" : "llvm::detail::ConstantLog2<2>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILj2EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILj2EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail12ConstantLog2ILj4EEE",
   "name" : "llvm::detail::ConstantLog2<4>",
   "referenced_type" : "_ZTIN4llvm6detail12ConstantLog2ILj4EEE",
   "self_type" : "_ZTIN4llvm6detail12ConstantLog2ILj4EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/PointerLikeTypeTraits.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvjEEcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvjEEcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<std::pair<void *, unsigned int>, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvjEEcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplINSt3__14pairIPvjEEcccccccccEELb0EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvjEEcccccccccEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIPvcccccccccEELb0EEE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN4llvm6detail11AlignerImplIccccccccccEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIccccccccccEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::detail::AlignerImpl<char, char, char, char, char, char, char, char, char, char>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIccccccccccEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS0_11AlignerImplIccccccccccEELb0EEE",
   "size" : 11,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIccccccccccEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm12FunctionTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_12FunctionTypeELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::FunctionType, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_12FunctionTypeELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_12FunctionTypeELb0EEE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm12FunctionTypeE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm14StringMapEntryIPNS_5ValueEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_14StringMapEntryIPNS_5ValueEEELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::StringMapEntry<llvm::Value *>, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_14StringMapEntryIPNS_5ValueEEELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_14StringMapEntryIPNS_5ValueEEELb0EEE",
   "size" : 12,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm14StringMapEntryIPNS_5ValueEEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm18StringMapEntryBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::StringMapEntryBase, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_18StringMapEntryBaseELb0EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm3UseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_3UseELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::Use, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_3UseELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_3UseELb0EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm3UseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4llvm4UserE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_4UserELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::User, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_4UserELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplINS_4UserELb0EEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm4UserE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN4llvm3UseE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplIPNS_3UseELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::Use *, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplIPNS_3UseELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplIPNS_3UseELb0EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIPN4llvm3UseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN4llvm4TypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplIPNS_4TypeELb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<llvm::Type *, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplIPNS_4TypeELb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplIPNS_4TypeELb0EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplIjLb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<unsigned int, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplIjLb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplIjLb0EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplItLb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<unsigned short, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplItLb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplItLb0EEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail17AlignmentCalcImplIyLb0EEE",
   "name" : "llvm::detail::AlignmentCalcImpl<unsigned long long, false>",
   "referenced_type" : "_ZTIN4llvm6detail17AlignmentCalcImplIyLb0EEE",
   "self_type" : "_ZTIN4llvm6detail17AlignmentCalcImplIyLb0EEE",
   "size" : 16,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail17PopulationCounterIyLj8EEE",
   "name" : "llvm::detail::PopulationCounter<unsigned long long, 8>",
   "referenced_type" : "_ZTIN4llvm6detail17PopulationCounterIyLj8EEE",
   "self_type" : "_ZTIN4llvm6detail17PopulationCounterIyLj8EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLj4EEE",
   "name" : "llvm::detail::LeadingZerosCounter<unsigned int, 4>",
   "referenced_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLj4EEE",
   "self_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIjLj4EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail19LeadingZerosCounterIyLj8EEE",
   "name" : "llvm::detail::LeadingZerosCounter<unsigned long long, 8>",
   "referenced_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIyLj8EEE",
   "self_type" : "_ZTIN4llvm6detail19LeadingZerosCounterIyLj8EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm6detail20TrailingZerosCounterIyLj8EEE",
   "name" : "llvm::detail::TrailingZerosCounter<unsigned long long, 8>",
   "referenced_type" : "_ZTIN4llvm6detail20TrailingZerosCounterIyLj8EEE",
   "self_type" : "_ZTIN4llvm6detail20TrailingZerosCounterIyLj8EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/MathExtras.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "name" : "llvm::detail::AlignmentCalcImplBase",
   "referenced_type" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "self_type" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm6detail21AlignmentCalcImplBaseE"
    },
    {
     "is_pure" : true,
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm6detail21AlignmentCalcImplBaseD1Ev"
    },
    {
     "is_pure" : true,
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm6detail21AlignmentCalcImplBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvjEEcccccccccEE",
   "name" : "llvm::detail::SizerImpl<std::pair<void *, unsigned int>, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvjEEcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplINSt3__14pairIPvjEEcccccccccEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvjEE",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "name" : "llvm::detail::SizerImpl<void *, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplIPvcccccccccEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIPv",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "arr1",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr2",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr3",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr4",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr5",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr6",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr7",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr8",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr9",
     "referenced_type" : "_ZTIA1_c"
    },
    {
     "field_name" : "arr10",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm6detail9SizerImplIccccccccccEE",
   "name" : "llvm::detail::SizerImpl<char, char, char, char, char, char, char, char, char, char>",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm6detail9SizerImplIccccccccccEE",
   "self_type" : "_ZTIN4llvm6detail9SizerImplIccccccccccEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "part",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parts",
     "referenced_type" : "_ZTIPy"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7APFloat11SignificandE",
   "name" : "llvm::APFloat::Significand",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4llvm7APFloat11SignificandE",
   "self_type" : "_ZTIN4llvm7APFloat11SignificandE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/APFloat.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "semantics",
     "referenced_type" : "_ZTIPKN4llvm12fltSemanticsE"
    },
    {
     "access" : "private",
     "field_name" : "significand",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4llvm7APFloat11SignificandE"
    },
    {
     "access" : "private",
     "field_name" : "exponent",
     "field_offset" : 128,
     "referenced_type" : "_ZTIs"
    },
    {
     "access" : "private",
     "field_name" : "category",
     "field_offset" : 144,
     "referenced_type" : "_ZTIN4llvm7APFloat11fltCategoryE"
    },
    {
     "access" : "private",
     "field_name" : "sign",
     "field_offset" : 147,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7APFloatE",
   "name" : "llvm::APFloat",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm7APFloatE",
   "self_type" : "_ZTIN4llvm7APFloatE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/APFloat.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_12FunctionTypeEEE",
   "name" : "llvm::AlignOf<llvm::FunctionType>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_12FunctionTypeEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_12FunctionTypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm12FunctionTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_14StringMapEntryIPNS_5ValueEEEEE",
   "name" : "llvm::AlignOf<llvm::StringMapEntry<llvm::Value *>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_14StringMapEntryIPNS_5ValueEEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_14StringMapEntryIPNS_5ValueEEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm14StringMapEntryIPNS_5ValueEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "name" : "llvm::AlignOf<llvm::StringMapEntryBase>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_18StringMapEntryBaseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm18StringMapEntryBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_3UseEEE",
   "name" : "llvm::AlignOf<llvm::Use>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_3UseEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_3UseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm3UseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_4UserEEE",
   "name" : "llvm::AlignOf<llvm::User>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_4UserEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_4UserEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm4UserE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvjEEcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<std::pair<void *, unsigned int>, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvjEEcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplINSt3__14pairIPvjEEcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplINSt3__14pairIPvjEEcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<void *, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIPvcccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIPvcccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIccccccccccEEEE",
   "name" : "llvm::AlignOf<llvm::detail::AlignerImpl<char, char, char, char, char, char, char, char, char, char>>",
   "referenced_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIccccccccccEEEE",
   "self_type" : "_ZTIN4llvm7AlignOfINS_6detail11AlignerImplIccccccccccEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIN4llvm6detail11AlignerImplIccccccccccEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfIPNS_3UseEEE",
   "name" : "llvm::AlignOf<llvm::Use *>",
   "referenced_type" : "_ZTIN4llvm7AlignOfIPNS_3UseEEE",
   "self_type" : "_ZTIN4llvm7AlignOfIPNS_3UseEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIPN4llvm3UseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfIPNS_4TypeEEE",
   "name" : "llvm::AlignOf<llvm::Type *>",
   "referenced_type" : "_ZTIN4llvm7AlignOfIPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm7AlignOfIPNS_4TypeEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfIjEE",
   "name" : "llvm::AlignOf<unsigned int>",
   "referenced_type" : "_ZTIN4llvm7AlignOfIjEE",
   "self_type" : "_ZTIN4llvm7AlignOfIjEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfItEE",
   "name" : "llvm::AlignOf<unsigned short>",
   "referenced_type" : "_ZTIN4llvm7AlignOfItEE",
   "self_type" : "_ZTIN4llvm7AlignOfItEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7AlignOfIyEE",
   "name" : "llvm::AlignOf<unsigned long long>",
   "referenced_type" : "_ZTIN4llvm7AlignOfIyEE",
   "self_type" : "_ZTIN4llvm7AlignOfIyEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/AlignOf.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "h0",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "h1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "h2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "h3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "h4",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "h5",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "h6",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "name" : "llvm::hashing::detail::hash_state",
   "referenced_type" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "self_type" : "_ZTIN4llvm7hashing6detail10hash_stateE",
   "size" : 56,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA64_c"
    },
    {
     "field_name" : "state",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN4llvm7hashing6detail10hash_stateE"
    },
    {
     "field_name" : "seed",
     "field_offset" : 960,
     "referenced_type" : "_ZTIKj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "name" : "llvm::hashing::detail::hash_combine_recursive_helper",
   "referenced_type" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "self_type" : "_ZTIN4llvm7hashing6detail29hash_combine_recursive_helperE",
   "size" : 128,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7support6detail13PickAlignmentIjLi1EEE",
   "name" : "llvm::support::detail::PickAlignment<unsigned int, 1>",
   "referenced_type" : "_ZTIN4llvm7support6detail13PickAlignmentIjLi1EEE",
   "self_type" : "_ZTIN4llvm7support6detail13PickAlignmentIjLi1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Endian.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7support6detail13PickAlignmentItLi1EEE",
   "name" : "llvm::support::detail::PickAlignment<unsigned short, 1>",
   "referenced_type" : "_ZTIN4llvm7support6detail13PickAlignmentItLi1EEE",
   "self_type" : "_ZTIN4llvm7support6detail13PickAlignmentItLi1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Endian.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm7support6detail13PickAlignmentIyLi1EEE",
   "name" : "llvm::support::detail::PickAlignment<unsigned long long, 1>",
   "referenced_type" : "_ZTIN4llvm7support6detail13PickAlignmentIyLi1EEE",
   "self_type" : "_ZTIN4llvm7support6detail13PickAlignmentIyLi1EEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/Endian.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIjLNS0_10endiannessE0ELj1EEE",
   "name" : "llvm::support::detail::packed_endian_specific_integral<unsigned int, llvm::support::big, 1>",
   "referenced_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIjLNS0_10endiannessE0ELj1EEE",
   "self_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIjLNS0_10endiannessE0ELj1EEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/Endian.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIjLNS0_10endiannessE1ELj1EEE",
   "name" : "llvm::support::detail::packed_endian_specific_integral<unsigned int, llvm::support::little, 1>",
   "referenced_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIjLNS0_10endiannessE1ELj1EEE",
   "self_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIjLNS0_10endiannessE1ELj1EEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/Endian.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralItLNS0_10endiannessE0ELj1EEE",
   "name" : "llvm::support::detail::packed_endian_specific_integral<unsigned short, llvm::support::big, 1>",
   "referenced_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralItLNS0_10endiannessE0ELj1EEE",
   "self_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralItLNS0_10endiannessE0ELj1EEE",
   "size" : 2,
   "source_file" : "external/llvm/include/llvm/Support/Endian.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralItLNS0_10endiannessE1ELj1EEE",
   "name" : "llvm::support::detail::packed_endian_specific_integral<unsigned short, llvm::support::little, 1>",
   "referenced_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralItLNS0_10endiannessE1ELj1EEE",
   "self_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralItLNS0_10endiannessE1ELj1EEE",
   "size" : 2,
   "source_file" : "external/llvm/include/llvm/Support/Endian.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIyLNS0_10endiannessE0ELj1EEE",
   "name" : "llvm::support::detail::packed_endian_specific_integral<unsigned long long, llvm::support::big, 1>",
   "referenced_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIyLNS0_10endiannessE0ELj1EEE",
   "self_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIyLNS0_10endiannessE0ELj1EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/Endian.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Value",
     "referenced_type" : "_ZTIN4llvm16AlignedCharArrayILj1ELj8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIyLNS0_10endiannessE1ELj1EEE",
   "name" : "llvm::support::detail::packed_endian_specific_integral<unsigned long long, llvm::support::little, 1>",
   "referenced_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIyLNS0_10endiannessE1ELj1EEE",
   "self_type" : "_ZTIN4llvm7support6detail31packed_endian_specific_integralIyLNS0_10endiannessE1ELj1EEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/Support/Endian.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKPN4llvm4TypeE"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm8ArrayRefIPNS_4TypeEEE",
   "name" : "llvm::ArrayRef<llvm::Type *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm8ArrayRefIPNS_4TypeEEE",
   "self_type" : "_ZTIN4llvm8ArrayRefIPNS_4TypeEEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/ArrayRef.h",
   "template_args" : [ "_ZTIPN4llvm4TypeE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm8ArrayRefIhEE",
   "name" : "llvm::ArrayRef<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm8ArrayRefIhEE",
   "self_type" : "_ZTIN4llvm8ArrayRefIhEE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/ArrayRef.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm4UserE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm8ConstantE",
   "name" : "llvm::Constant",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm8ConstantE",
   "self_type" : "_ZTIN4llvm8ConstantE",
   "size" : 20,
   "source_file" : "external/llvm/include/llvm/IR/Constant.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4llvm8ConstantE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm8ConstantD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4llvm8ConstantD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4llvm8Constant6anchorEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_10BasicBlockENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::BasicBlock, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_10BasicBlockENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_10BasicBlockENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm10BasicBlockE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_11GlobalAliasENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::GlobalAlias, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_11GlobalAliasENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_11GlobalAliasENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm11GlobalAliasE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_11GlobalIFuncENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::GlobalIFunc, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_11GlobalIFuncENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_11GlobalIFuncENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm11GlobalIFuncE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_11GlobalValueENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::GlobalValue, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_11GlobalValueENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_11GlobalValueENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm11GlobalValueE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_11InstructionENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::Instruction, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_11InstructionENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_11InstructionENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm11InstructionE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_11PointerTypeENS_4TypeEvEE",
   "name" : "llvm::isa_impl<llvm::PointerType, llvm::Type, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_11PointerTypeENS_4TypeEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_11PointerTypeENS_4TypeEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Type.h",
   "template_args" : [ "_ZTIN4llvm11PointerTypeE", "_ZTIN4llvm4TypeE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_12ConstantDataENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::ConstantData, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_12ConstantDataENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_12ConstantDataENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm12ConstantDataE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_12GlobalObjectENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::GlobalObject, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_12GlobalObjectENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_12GlobalObjectENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm12GlobalObjectE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_14GlobalVariableENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::GlobalVariable, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_14GlobalVariableENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_14GlobalVariableENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm14GlobalVariableE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_17ConstantAggregateENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::ConstantAggregate, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_17ConstantAggregateENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_17ConstantAggregateENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm17ConstantAggregateE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_20GlobalIndirectSymbolENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::GlobalIndirectSymbol, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_20GlobalIndirectSymbolENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_20GlobalIndirectSymbolENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm20GlobalIndirectSymbolE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_8ArgumentENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::Argument, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_8ArgumentENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_8ArgumentENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm8ArgumentE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_8ConstantENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::Constant, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_8ConstantENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_8ConstantENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm8ConstantE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_8FunctionENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::Function, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_8FunctionENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_8FunctionENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm8FunctionE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm8isa_implINS_9InlineAsmENS_5ValueEvEE",
   "name" : "llvm::isa_impl<llvm::InlineAsm, llvm::Value, void>",
   "referenced_type" : "_ZTIN4llvm8isa_implINS_9InlineAsmENS_5ValueEvEE",
   "self_type" : "_ZTIN4llvm8isa_implINS_9InlineAsmENS_5ValueEvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/IR/Value.h",
   "template_args" : [ "_ZTIN4llvm9InlineAsmE", "_ZTIN4llvm5ValueE", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm14SequentialTypeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "NumElements",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9ArrayTypeE",
   "name" : "llvm::ArrayType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9ArrayTypeE",
   "self_type" : "_ZTIN4llvm9ArrayTypeE",
   "size" : 32,
   "source_file" : "external/llvm/include/llvm/IR/DerivedTypes.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4llvm13StringMapImplE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Allocator",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN4llvm15MallocAllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9StringMapIPNS_5ValueENS_15MallocAllocatorEEE",
   "name" : "llvm::StringMap<llvm::Value *, llvm::MallocAllocator>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9StringMapIPNS_5ValueENS_15MallocAllocatorEEE",
   "self_type" : "_ZTIN4llvm9StringMapIPNS_5ValueENS_15MallocAllocatorEEE",
   "size" : 24,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h",
   "template_args" : [ "_ZTIPN4llvm5ValueE", "_ZTIN4llvm15MallocAllocatorE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "Length",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9StringRefE",
   "name" : "llvm::StringRef",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9StringRefE",
   "self_type" : "_ZTIN4llvm9StringRefE",
   "size" : 8,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4llvm9hash_codeE",
   "name" : "llvm::hash_code",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4llvm9hash_codeE",
   "self_type" : "_ZTIN4llvm9hash_codeE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/Hashing.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "name" : "llvm::isPodLike<llvm::StringRef>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINS_9StringRefEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/ADT/StringRef.h",
   "template_args" : [ "_ZTIN4llvm9StringRefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvjEEEE",
   "name" : "llvm::isPodLike<std::pair<void *, unsigned int>>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvjEEEE",
   "self_type" : "_ZTIN4llvm9isPodLikeINSt3__14pairIPvjEEEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTINSt3__14pairIPvjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIPvEE",
   "name" : "llvm::isPodLike<void *>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIPvEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIPvEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIcEE",
   "name" : "llvm::isPodLike<char>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIcEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIcEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4llvm9isPodLikeIjEE",
   "name" : "llvm::isPodLike<unsigned int>",
   "referenced_type" : "_ZTIN4llvm9isPodLikeIjEE",
   "self_type" : "_ZTIN4llvm9isPodLikeIjEE",
   "size" : 1,
   "source_file" : "external/llvm/include/llvm/Support/type_traits.h",
   "template_args" : [ "_ZTIj" ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION4llvm11SmallVectorIcLj256EEE",
   "name" : "llvm::SmallVector<char, 256> &&",
   "referenced_type" : "_ZTIN4llvm11SmallVectorIcLj256EEE",
   "self_type" : "_ZTION4llvm11SmallVectorIcLj256EEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION4llvm13StringMapImplE",
   "name" : "llvm::StringMapImpl &&",
   "referenced_type" : "_ZTIN4llvm13StringMapImplE",
   "self_type" : "_ZTION4llvm13StringMapImplE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/StringMap.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION4llvm15SmallVectorImplIcEE",
   "name" : "llvm::SmallVectorImpl<char> &&",
   "referenced_type" : "_ZTIN4llvm15SmallVectorImplIcEE",
   "self_type" : "_ZTION4llvm15SmallVectorImplIcEE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/ADT/SmallVector.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION4llvm3sys17OwningMemoryBlockE",
   "name" : "llvm::sys::OwningMemoryBlock &&",
   "referenced_type" : "_ZTIN4llvm3sys17OwningMemoryBlockE",
   "self_type" : "_ZTION4llvm3sys17OwningMemoryBlockE",
   "size" : 4,
   "source_file" : "external/llvm/include/llvm/Support/Memory.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION4llvm5APIntE",
