#ifndef HIDL_GENERATED_ANDROID_HARDWARE_WIFI_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_WIFI_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace wifi {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class WifiStatusCode : uint32_t;
struct WifiStatus;
enum class IfaceType : uint32_t;
enum class WifiChannelWidthInMhz : uint32_t;
struct WifiChannelInfo;
struct WifiInformationElement;
enum class WifiRatePreamble : uint32_t;
enum class WifiRateNss : uint32_t;
struct WifiRateInfo;
enum class WifiBand : uint32_t;
struct StaApfPacketFilterCapabilities;
struct StaBackgroundScanCapabilities;
enum class StaBackgroundScanBucketEventReportSchemeMask : uint32_t;
enum class StaScanLimits : uint32_t;
struct StaBackgroundScanBucketParameters;
struct StaBackgroundScanParameters;
struct StaLinkLayerIfacePacketStats;
struct StaLinkLayerIfaceStats;
struct StaLinkLayerRadioStats;
struct StaLinkLayerStats;
struct StaScanResult;
enum class StaScanDataFlagMask : int32_t;
struct StaScanData;
struct StaRoamingCapabilities;
struct StaRoamingConfig;
enum class StaRoamingState : uint8_t;
enum class NanParamSizeLimits : uint32_t;
enum class NanStatusType : uint32_t;
enum class NanBandIndex : uint32_t;
struct WifiNanStatus;
enum class NanMatchAlg : uint32_t;
enum class NanPublishType : uint32_t;
enum class NanTxType : uint32_t;
enum class NanSubscribeType : uint32_t;
enum class NanSrfType : uint32_t;
enum class NanDataPathChannelCfg : uint32_t;
enum class NanDataPathSecurityType : uint32_t;
struct NanBandSpecificConfig;
struct NanDebugConfig;
struct NanConfigRequest;
struct NanEnableRequest;
enum class NanCipherSuiteType : uint32_t;
enum class NanRangingIndication : uint32_t;
struct NanDataPathSecurityConfig;
struct NanDiscoveryCommonConfig;
struct NanPublishRequest;
struct NanSubscribeRequest;
struct NanTransmitFollowupRequest;
struct NanInitiateDataPathRequest;
struct NanRespondToDataPathIndicationRequest;
struct NanCapabilities;
struct NanMatchInd;
struct NanFollowupReceivedInd;
enum class NanClusterEventType : uint32_t;
struct NanClusterEventInd;
struct NanDataPathRequestInd;
struct NanDataPathConfirmInd;
enum class RttStatus : uint32_t;
enum class RttPeerType : uint32_t;
enum class RttBw : uint32_t;
enum class RttPreamble : uint32_t;
enum class RttType : uint32_t;
struct RttConfig;
struct RttResult;
struct RttCapabilities;
enum class RttMotionPattern : uint32_t;
struct RttLciInformation;
struct RttLcrInformation;
struct RttResponder;
enum class WifiDebugRingBufferFlags : uint32_t;
struct WifiDebugRingBufferStatus;
enum class WifiDebugRingBufferVerboseLevel : uint32_t;
enum class WifiDebugTxPacketFate : uint32_t;
enum class WifiDebugRxPacketFate : uint32_t;
enum class WifiDebugPacketFateFrameType : uint32_t;
struct WifiDebugPacketFateFrameInfo;
struct WifiDebugTxPacketFateReport;
struct WifiDebugRxPacketFateReport;
struct WifiDebugHostWakeReasonRxPacketDetails;
struct WifiDebugHostWakeReasonRxMulticastPacketDetails;
struct WifiDebugHostWakeReasonRxIcmpPacketDetails;
struct WifiDebugHostWakeReasonStats;

/**
 * Enum values indicating the status of operation.
 */
enum class WifiStatusCode : uint32_t {
    /**
     * No errors.
     */
    SUCCESS = 0u,
    /**
     * Method invoked on an invalid |IWifiChip| object.
     */
    ERROR_WIFI_CHIP_INVALID = 1u /* ::android::hardware::wifi::V1_0::WifiStatusCode.SUCCESS implicitly + 1 */,
    /**
     * Method invoked on an invalid |IWifiIface| object.
     */
    ERROR_WIFI_IFACE_INVALID = 2u /* ::android::hardware::wifi::V1_0::WifiStatusCode.ERROR_WIFI_CHIP_INVALID implicitly + 1 */,
    /**
     * Method invoked on an invalid |IWifiRttController| object.
     */
    ERROR_WIFI_RTT_CONTROLLER_INVALID = 3u /* ::android::hardware::wifi::V1_0::WifiStatusCode.ERROR_WIFI_IFACE_INVALID implicitly + 1 */,
    ERROR_NOT_SUPPORTED = 4u /* ::android::hardware::wifi::V1_0::WifiStatusCode.ERROR_WIFI_RTT_CONTROLLER_INVALID implicitly + 1 */,
    ERROR_NOT_AVAILABLE = 5u /* ::android::hardware::wifi::V1_0::WifiStatusCode.ERROR_NOT_SUPPORTED implicitly + 1 */,
    ERROR_NOT_STARTED = 6u /* ::android::hardware::wifi::V1_0::WifiStatusCode.ERROR_NOT_AVAILABLE implicitly + 1 */,
    ERROR_INVALID_ARGS = 7u /* ::android::hardware::wifi::V1_0::WifiStatusCode.ERROR_NOT_STARTED implicitly + 1 */,
    ERROR_BUSY = 8u /* ::android::hardware::wifi::V1_0::WifiStatusCode.ERROR_INVALID_ARGS implicitly + 1 */,
    ERROR_UNKNOWN = 9u /* ::android::hardware::wifi::V1_0::WifiStatusCode.ERROR_BUSY implicitly + 1 */,
};

/**
 * Generic structure to return the status of an operation.
 */
struct WifiStatus final {
    ::android::hardware::wifi::V1_0::WifiStatusCode code __attribute__ ((aligned(4)));
    /**
     * A vendor specific error message from the vendor to provide more
     * information beyond the reason code.
     */
    ::android::hardware::hidl_string description __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiStatus, code) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiStatus, description) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiStatus) == 24, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiStatus) == 8, "wrong alignment");

/**
 * List of Iface types supported.
 */
enum class IfaceType : uint32_t {
    STA = 0u,
    AP = 1u /* ::android::hardware::wifi::V1_0::IfaceType.STA implicitly + 1 */,
    P2P = 2u /* ::android::hardware::wifi::V1_0::IfaceType.AP implicitly + 1 */,
    /**
     * NAN control interface. Datapath support must be queried and created
     * through this interface.
     */
    NAN = 3u /* ::android::hardware::wifi::V1_0::IfaceType.P2P implicitly + 1 */,
};

/**
 * An identifier assigned to every chip on the device.
 */
typedef uint32_t ChipId;

/**
 * An identifier for a mode that the chip can be put in.
 */
typedef uint32_t ChipModeId;

/**
 * A unique handle provided by the client to identify individual invocations of
 * certain API's like |IWifiStaIface.startBackgroundScan|,
 * |IWifiStaIface.installApfPacketFilter|, etc.
 */
typedef uint32_t CommandId;

/**
 * Channel frequency in Mhz.
 */
typedef uint32_t WifiChannelInMhz;

/**
 * Channel operating width in Mhz.
 */
enum class WifiChannelWidthInMhz : uint32_t {
    WIDTH_20 = 0u,
    WIDTH_40 = 1u,
    WIDTH_80 = 2u,
    WIDTH_160 = 3u,
    WIDTH_80P80 = 4u,
    WIDTH_5 = 5u,
    WIDTH_10 = 6u,
    WIDTH_INVALID = 4294967295u /* -1 */,
};

/**
 * Channel information.
 */
struct WifiChannelInfo final {
    /**
     * Channel width (20, 40, 80, 80+80, 160).
     */
    ::android::hardware::wifi::V1_0::WifiChannelWidthInMhz width __attribute__ ((aligned(4)));
    /**
     * Primary 20 MHz channel.
     */
    uint32_t centerFreq __attribute__ ((aligned(4)));
    /**
     * Center frequency (MHz) first segment.
     */
    uint32_t centerFreq0 __attribute__ ((aligned(4)));
    /**
     * Center frequency (MHz) second segment.
     */
    uint32_t centerFreq1 __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiChannelInfo, width) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiChannelInfo, centerFreq) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiChannelInfo, centerFreq0) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiChannelInfo, centerFreq1) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiChannelInfo) == 16, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiChannelInfo) == 4, "wrong alignment");

/**
 * RSSI information.
 */
typedef int32_t Rssi;

/**
 * Mac Address type. 6 octets representing physical address of a device.
 */
typedef ::android::hardware::hidl_array<uint8_t, 6> MacAddress;

/**
 * SSID type. 32 octets representing the network.
 */
typedef ::android::hardware::hidl_array<uint8_t, 32> Ssid;

/**
 * BSSID type. 6 octets representing the physical address of an AP.
 */
typedef ::android::hardware::hidl_array<uint8_t, 6> Bssid;

/**
 * TimeStamp in milliseconds (ms).
 */
typedef uint64_t TimeStampInMs;

/**
 * TimeStamp in microseconds (us).
 */
typedef uint64_t TimeStampInUs;

/**
 * TimeStamp in picoseconds (ps).
 */
typedef uint64_t TimeSpanInPs;

/**
 * Information elements contained within the |ScanResult| structure.
 * These elements correspond to the IEEE_802.11 standard.
 */
struct WifiInformationElement final {
    uint8_t id __attribute__ ((aligned(1)));
    ::android::hardware::hidl_vec<uint8_t> data __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiInformationElement, id) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiInformationElement, data) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiInformationElement) == 24, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiInformationElement) == 8, "wrong alignment");

enum class WifiRatePreamble : uint32_t {
    OFDM = 0u,
    CCK = 1u,
    HT = 2u,
    VHT = 3u,
    RESERVED = 4u,
};

/**
 * Number of spatial streams in VHT/HT.
 */
enum class WifiRateNss : uint32_t {
    NSS_1x1 = 0u,
    NSS_2x2 = 1u,
    NSS_3x3 = 2u,
    NSS_4x4 = 3u,
};

/**
 * Wifi rate info.
 */
struct WifiRateInfo final {
    /**
     * Preamble used for RTT measurements.
     */
    ::android::hardware::wifi::V1_0::WifiRatePreamble preamble __attribute__ ((aligned(4)));
    /**
     * Number of spatial streams.
     */
    ::android::hardware::wifi::V1_0::WifiRateNss nss __attribute__ ((aligned(4)));
    /**
     * Bandwidth of channel.
     */
    ::android::hardware::wifi::V1_0::WifiChannelWidthInMhz bw __attribute__ ((aligned(4)));
    /**
     * OFDM/CCK rate code would be as per ieee std in the units of 0.5mbps.
     * HT/VHT it would be mcs index.
     */
    uint8_t rateMcsIdx __attribute__ ((aligned(1)));
    /**
     * Bitrate in units of 100 Kbps.
     */
    uint32_t bitRateInKbps __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiRateInfo, preamble) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiRateInfo, nss) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiRateInfo, bw) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiRateInfo, rateMcsIdx) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiRateInfo, bitRateInKbps) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiRateInfo) == 20, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiRateInfo) == 4, "wrong alignment");

/**
 * Wifi bands defined in 80211 spec.
 */
enum class WifiBand : uint32_t {
    BAND_UNSPECIFIED = 0u,
    /**
     * 2.4 GHz.
     */
    BAND_24GHZ = 1u,
    /**
     * 5 GHz without DFS.
     */
    BAND_5GHZ = 2u,
    /**
     * 5 GHz DFS only.
     */
    BAND_5GHZ_DFS = 4u,
    /**
     * 5 GHz with DFS.
     */
    BAND_5GHZ_WITH_DFS = 6u,
    /**
     * 2.4 GHz + 5 GHz; no DFS.
     */
    BAND_24GHZ_5GHZ = 3u,
    /**
     * 2.4 GHz + 5 GHz with DFS
     */
    BAND_24GHZ_5GHZ_WITH_DFS = 7u,
};

/**
 * STA specific types.
 * TODO(b/32159498): Move to a separate sta_types.hal.
 *
 *
 * Parameters to specify the APF capabilities of this iface.
 */
struct StaApfPacketFilterCapabilities final {
    /**
     * Version of the packet filter interpreter supported
     */
    uint32_t version __attribute__ ((aligned(4)));
    /**
     * Maximum size of the filter bytecodes in byte for an iface.
     */
    uint32_t maxLength __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaApfPacketFilterCapabilities, version) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaApfPacketFilterCapabilities, maxLength) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaApfPacketFilterCapabilities) == 8, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaApfPacketFilterCapabilities) == 4, "wrong alignment");

/**
 * Parameters to specify the Background Scan capabilities of this iface.
 */
struct StaBackgroundScanCapabilities final {
    /**
     * Maximum number of byte available for cached scan results
     */
    uint32_t maxCacheSize __attribute__ ((aligned(4)));
    /**
     * Maximum number of buckets that can be supplied for a scan
     */
    uint32_t maxBuckets __attribute__ ((aligned(4)));
    /**
     * Maximum number of APs that must be stored for each scan.
     */
    uint32_t maxApCachePerScan __attribute__ ((aligned(4)));
    /**
     * Max reporting number of scans threshold that can be specified in the scan
     * parameters.
     */
    int32_t maxReportingThreshold __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanCapabilities, maxCacheSize) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanCapabilities, maxBuckets) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanCapabilities, maxApCachePerScan) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanCapabilities, maxReportingThreshold) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaBackgroundScanCapabilities) == 16, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaBackgroundScanCapabilities) == 4, "wrong alignment");

/**
 * Mask of event reporting schemes that can be specified in background scan
 * requests.
 */
enum class StaBackgroundScanBucketEventReportSchemeMask : uint32_t {
    /**
     * Report a scan completion event after scan. If this is not set then scan
     * completion events must be reported if report_threshold_percent or
     * report_threshold_num_scans is reached.
     */
    EACH_SCAN = 1u /* 1 << 0 */,
    /**
     * Forward scan results (beacons/probe responses + IEs) in real time to HAL,
     * in addition to completion events.
     * Note: To keep backward compatibility, fire completion events regardless
     * of REPORT_EVENTS_EACH_SCAN.
     */
    FULL_RESULTS = 2u /* 1 << 1 */,
    /**
     * Controls if scans for this bucket must be placed in the results buffer.
     */
    NO_BATCH = 4u /* 1 << 2 */,
};

/**
 * Max limits for background scan.
 */
enum class StaScanLimits : uint32_t {
    MAX_CHANNELS = 16u,
    MAX_BUCKETS = 16u,
    MAX_AP_CACHE_PER_SCAN = 32u,
};

/**
 * Background Scan parameters per bucket that can be specified in background
 * scan requests.
 */
struct StaBackgroundScanBucketParameters final {
    /**
     * Bucket index. This index is used to report results in
     * |StaScanData.bucketsScanned|.
     */
    uint32_t bucketIdx __attribute__ ((aligned(4)));
    /**
     * Bands to scan or |BAND_UNSPECIFIED| if frequencies list must be used
     * instead.
     */
    ::android::hardware::wifi::V1_0::WifiBand band __attribute__ ((aligned(4)));
    /**
     * Channel frequencies (in Mhz) to scan if |band| is set to
     * |BAND_UNSPECIFIED|.
     * Max length: |StaScanLimits.MAX_CHANNELS|.
     */
    ::android::hardware::hidl_vec<uint32_t> frequencies __attribute__ ((aligned(8)));
    /**
     * Period at which this bucket must be scanned (in milliseconds). Must be an integer
     * multiple of the |basePeriodInMs| specified in the BackgroundScanParameters.
     */
    uint32_t periodInMs __attribute__ ((aligned(4)));
    /**
     * Bitset of |StaBackgroundScanBucketEventReportSchemeMask| values controlling
     * when events for this bucket must be reported.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::wifi::V1_0::StaBackgroundScanBucketEventReportSchemeMask> eventReportScheme __attribute__ ((aligned(4)));
    /**
     * For exponential back off. If |exponentialMaxPeriodInMs| is non zero or
     * different than period, then this bucket is an exponential backoff bucket
     * and the scan period must grow exponentially as per formula:
     *   actual_period(N) = period * (base ^ (N/step_count))
     * to this maximum period (in milliseconds).
     */
    uint32_t exponentialMaxPeriodInMs __attribute__ ((aligned(4)));
    /**
     * For exponential back off. multiplier: new_period=old_period * base
     */
    uint32_t exponentialBase __attribute__ ((aligned(4)));
    /**
     * For exponential back off. Number of scans to perform for a given
     * period.
     */
    uint32_t exponentialStepCount __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanBucketParameters, bucketIdx) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanBucketParameters, band) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanBucketParameters, frequencies) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanBucketParameters, periodInMs) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanBucketParameters, eventReportScheme) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanBucketParameters, exponentialMaxPeriodInMs) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanBucketParameters, exponentialBase) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanBucketParameters, exponentialStepCount) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaBackgroundScanBucketParameters) == 48, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaBackgroundScanBucketParameters) == 8, "wrong alignment");

/**
 * Background Scan parameters that can be specified in background scan
 * requests.
 */
struct StaBackgroundScanParameters final {
    /**
     * GCD of all bucket periods (in milliseconds).
     */
    uint32_t basePeriodInMs __attribute__ ((aligned(4)));
    /**
     * Maximum number of APs that must be stored for each scan. If the maximum
     * is reached the highest RSSI results must be returned.
     * Max length: |StaScanLimits.MAX_AP_CACHE_PER_SCAN|.
     */
    uint32_t maxApPerScan __attribute__ ((aligned(4)));
    /**
     * % cache buffer filled threshold at which the host must be notified of
     * batched scan results.
     */
    uint32_t reportThresholdPercent __attribute__ ((aligned(4)));
    /**
     * Threshold at which the AP must be woken up, in number of scans.
     */
    uint32_t reportThresholdNumScans __attribute__ ((aligned(4)));
    /**
     * List of buckets to be scheduled.
     * Max length: |StaScanLimits.MAX_BUCKETS|.
     */
    ::android::hardware::hidl_vec<::android::hardware::wifi::V1_0::StaBackgroundScanBucketParameters> buckets __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanParameters, basePeriodInMs) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanParameters, maxApPerScan) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanParameters, reportThresholdPercent) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanParameters, reportThresholdNumScans) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaBackgroundScanParameters, buckets) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaBackgroundScanParameters) == 32, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaBackgroundScanParameters) == 8, "wrong alignment");

/**
 * Packet stats for different traffic categories.
 */
struct StaLinkLayerIfacePacketStats final {
    /**
     * Number of received unicast data packets.
     */
    uint64_t rxMpdu __attribute__ ((aligned(8)));
    /**
     * Number of successfully transmitted unicast data pkts (ACK rcvd).
     */
    uint64_t txMpdu __attribute__ ((aligned(8)));
    /**
     * Number of transmitted unicast data pkt losses (no ACK).
     */
    uint64_t lostMpdu __attribute__ ((aligned(8)));
    /**
     * Number of transmitted unicast data retry pkts.
     */
    uint64_t retries __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerIfacePacketStats, rxMpdu) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerIfacePacketStats, txMpdu) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerIfacePacketStats, lostMpdu) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerIfacePacketStats, retries) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaLinkLayerIfacePacketStats) == 32, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaLinkLayerIfacePacketStats) == 8, "wrong alignment");

/**
 * Iface statistics for the current connection.
 */
struct StaLinkLayerIfaceStats final {
    /**
     * Number beacons received from the connected AP.
     */
    uint32_t beaconRx __attribute__ ((aligned(4)));
    /**
     * Access Point Beacon and Management frames RSSI (averaged).
     */
    int32_t avgRssiMgmt __attribute__ ((aligned(4)));
    /**
     * WME Best Effort Access Category packet counters.
     */
    ::android::hardware::wifi::V1_0::StaLinkLayerIfacePacketStats wmeBePktStats __attribute__ ((aligned(8)));
    /**
     * WME Background Access Category packet counters.
     */
    ::android::hardware::wifi::V1_0::StaLinkLayerIfacePacketStats wmeBkPktStats __attribute__ ((aligned(8)));
    /**
     * WME Video Access Category packet counters.
     */
    ::android::hardware::wifi::V1_0::StaLinkLayerIfacePacketStats wmeViPktStats __attribute__ ((aligned(8)));
    /**
     * WME Voice Access Category packet counters.
     */
    ::android::hardware::wifi::V1_0::StaLinkLayerIfacePacketStats wmeVoPktStats __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerIfaceStats, beaconRx) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerIfaceStats, avgRssiMgmt) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerIfaceStats, wmeBePktStats) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerIfaceStats, wmeBkPktStats) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerIfaceStats, wmeViPktStats) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerIfaceStats, wmeVoPktStats) == 104, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaLinkLayerIfaceStats) == 136, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaLinkLayerIfaceStats) == 8, "wrong alignment");

/**
 * Cumulative radio statistics since collection was enabled.
 */
struct StaLinkLayerRadioStats final {
    /**
     * Time for which the radio is awake.
     */
    uint32_t onTimeInMs __attribute__ ((aligned(4)));
    /**
     * Total time for which the radio is in active transmission.
     */
    uint32_t txTimeInMs __attribute__ ((aligned(4)));
    /**
     * Time for which the radio is in active tranmission per tx level.
     */
    ::android::hardware::hidl_vec<uint32_t> txTimeInMsPerLevel __attribute__ ((aligned(8)));
    /**
     * Time for which the radio is in active receive.
     */
    uint32_t rxTimeInMs __attribute__ ((aligned(4)));
    /**
     *  Total time for which the radio is awake due to scan.
     */
    uint32_t onTimeInMsForScan __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerRadioStats, onTimeInMs) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerRadioStats, txTimeInMs) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerRadioStats, txTimeInMsPerLevel) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerRadioStats, rxTimeInMs) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerRadioStats, onTimeInMsForScan) == 28, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaLinkLayerRadioStats) == 32, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaLinkLayerRadioStats) == 8, "wrong alignment");

/**
 * Link layer stats retrieved via |getLinkLayerStats|.
 */
struct StaLinkLayerStats final {
    ::android::hardware::wifi::V1_0::StaLinkLayerIfaceStats iface __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::wifi::V1_0::StaLinkLayerRadioStats> radios __attribute__ ((aligned(8)));
    /**
     * TimeStamp for each stats sample.
     * This is the absolute milliseconds from boot when these stats were
     * sampled.
     */
    uint64_t timeStampInMs __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerStats, iface) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerStats, radios) == 136, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaLinkLayerStats, timeStampInMs) == 152, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaLinkLayerStats) == 160, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaLinkLayerStats) == 8, "wrong alignment");

/**
 * Structure describing all the information about a single access point seen
 * during the scan.
 */
struct StaScanResult final {
    uint64_t timeStampInUs __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<uint8_t> ssid __attribute__ ((aligned(8)));
    ::android::hardware::hidl_array<uint8_t, 6> bssid __attribute__ ((aligned(1)));
    int32_t rssi __attribute__ ((aligned(4)));
    uint32_t frequency __attribute__ ((aligned(4)));
    uint16_t beaconPeriodInMs __attribute__ ((aligned(2)));
    uint16_t capability __attribute__ ((aligned(2)));
    ::android::hardware::hidl_vec<::android::hardware::wifi::V1_0::WifiInformationElement> informationElements __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaScanResult, timeStampInUs) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaScanResult, ssid) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaScanResult, bssid) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaScanResult, rssi) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaScanResult, frequency) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaScanResult, beaconPeriodInMs) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaScanResult, capability) == 42, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaScanResult, informationElements) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaScanResult) == 64, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaScanResult) == 8, "wrong alignment");

/**
 * Mask of flags set in the |ScanData| instance.
 */
enum class StaScanDataFlagMask : int32_t {
    /**
     * Indicates that a scan was interrupted/did not occur so results may be
     * incomplete.
     */
    INTERRUPTED = 1 /* 1 << 0 */,
};

/**
 * Structure describing all the information about all the access points seen during
 * the scan.
 */
struct StaScanData final {
    /**
     * Bitset containing |ScanDataFlagMask| values.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::wifi::V1_0::StaScanDataFlagMask> flags __attribute__ ((aligned(4)));
    /**
     * Bitset where each bit indicates if the bucket with that index (starting at
     * 0) was scanned.
     */
    uint32_t bucketsScanned __attribute__ ((aligned(4)));
    /**
     * List of scan results.
     */
    ::android::hardware::hidl_vec<::android::hardware::wifi::V1_0::StaScanResult> results __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaScanData, flags) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaScanData, bucketsScanned) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaScanData, results) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaScanData) == 24, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaScanData) == 8, "wrong alignment");

/**
 * Structure describing the roaming control capabilities supported.
 */
struct StaRoamingCapabilities final {
    /**
     * Maximum number of BSSID's that may be blacklisted.
     */
    uint32_t maxBlacklistSize __attribute__ ((aligned(4)));
    /**
     * Maximum number of SSID's that may be whitelisted.
     */
    uint32_t maxWhitelistSize __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaRoamingCapabilities, maxBlacklistSize) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaRoamingCapabilities, maxWhitelistSize) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaRoamingCapabilities) == 8, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaRoamingCapabilities) == 4, "wrong alignment");

/**
 * Structure describing the roaming control configuration.
 */
struct StaRoamingConfig final {
    /**
     * List of BSSID's that are blacklisted for roaming.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_array<uint8_t, 6>> bssidBlacklist __attribute__ ((aligned(8)));
    /**
     * List of SSID's that are whitelisted for roaming.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_array<uint8_t, 32>> ssidWhitelist __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::StaRoamingConfig, bssidBlacklist) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::StaRoamingConfig, ssidWhitelist) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::StaRoamingConfig) == 32, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::StaRoamingConfig) == 8, "wrong alignment");

/**
 * Enum describing the various states to set the roaming
 * control to.
 */
enum class StaRoamingState : uint8_t {
    /**
     * Driver/Firmware must not perform any roaming.
     */
    DISABLED = 0,
    /**
     * Driver/Firmware is allowed to perform roaming respecting
     * the |StaRoamingConfig| parameters set using |configureRoaming|.
     */
    ENABLED = 1,
};

/**
 * NAN specific types.
 * TODO(b/32159498): Move to a separate nan_types.hal.
 *
 * References to "NAN Spec" are to the Wi-Fi Alliance "Wi-Fi Neighbor Awareness
 * Networking (NAN) Technical Specification".
 *
 *
 * Size limits for parameters used in the NAN interface.
 */
enum class NanParamSizeLimits : uint32_t {
    /**
     * Minimum length of Passphrase argument for data-path configuration
     */
    MIN_PASSPHRASE_LENGTH = 8u,
    /**
     * Maximum length of Passphrase argument for data-path configuration
     */
    MAX_PASSPHRASE_LENGTH = 63u,
};

/**
 * A unique short handle provided by the client to identify individual invocations of
 * certain API's like |IWifiNanIface.*|.
 */
typedef uint16_t CommandIdShort;

/**
 * NAN API response codes used in request notifications and events.
 */
enum class NanStatusType : uint32_t {
    SUCCESS = 0u,
    /**
     * NAN Discovery Engine/Host driver failures
     */
    INTERNAL_FAILURE = 1u,
    /**
     * NAN OTA failures
     */
    PROTOCOL_FAILURE = 2u,
    /**
     * The publish/subscribe discovery session id is invalid
     */
    INVALID_SESSION_ID = 3u,
    /**
     * Out of resources to fufill request
     */
    NO_RESOURCES_AVAILABLE = 4u,
    /**
     * Invalid arguments passed
     */
    INVALID_ARGS = 5u,
    /**
     * Invalid peer id
     */
    INVALID_PEER_ID = 6u,
    /**
     * Invalid NAN data-path (ndp) id
     */
    INVALID_NDP_ID = 7u,
    /**
     * Attempting to enable NAN when not available, e.g. wifi is disabled
     */
    NAN_NOT_ALLOWED = 8u,
    /**
     * Over the air ACK not received
     */
    NO_OTA_ACK = 9u,
    /**
     * Attempting to enable NAN when already enabled
     */
    ALREADY_ENABLED = 10u,
    /**
     * Can't queue tx followup message foor transmission
     */
    FOLLOWUP_TX_QUEUE_FULL = 11u,
    /**
     * Unsupported concurrency of NAN and another feature - NAN disabled
     */
    UNSUPPORTED_CONCURRENCY_NAN_DISABLED = 12u,
};

/**
 * The discovery bands supported by NAN.
 */
enum class NanBandIndex : uint32_t {
    NAN_BAND_24GHZ = 0u,
    NAN_BAND_5GHZ = 1u /* ::android::hardware::wifi::V1_0::NanBandIndex.NAN_BAND_24GHZ implicitly + 1 */,
};

/**
 * The status information returned in NAN notifications.
 */
struct WifiNanStatus final {
    /**
     * Status of the command request.
     */
    ::android::hardware::wifi::V1_0::NanStatusType status __attribute__ ((aligned(4)));
    /**
     * Further description of the issue causing a failure.
     */
    ::android::hardware::hidl_string description __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiNanStatus, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiNanStatus, description) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiNanStatus) == 24, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiNanStatus) == 8, "wrong alignment");

/**
 * NAN Match indication type: control how often to trigger |IWifiNanIfaceEventCallback.eventMatch|
 * for a single discovery session - i.e. continuously discovering the same publisher with no new
 * data.
 */
enum class NanMatchAlg : uint32_t {
    MATCH_ONCE = 0u,
    MATCH_CONTINUOUS = 1u /* ::android::hardware::wifi::V1_0::NanMatchAlg.MATCH_ONCE implicitly + 1 */,
    MATCH_NEVER = 2u /* ::android::hardware::wifi::V1_0::NanMatchAlg.MATCH_CONTINUOUS implicitly + 1 */,
};

/**
 * NAN publish discovery session types.
 */
enum class NanPublishType : uint32_t {
    UNSOLICITED = 0u,
    SOLICITED = 1u /* ::android::hardware::wifi::V1_0::NanPublishType.UNSOLICITED implicitly + 1 */,
    UNSOLICITED_SOLICITED = 2u /* ::android::hardware::wifi::V1_0::NanPublishType.SOLICITED implicitly + 1 */,
};

/**
 * NAN transmit type used in |NanPublishType.SOLICITED| or |NanPublishType.UNSOLICITED_SOLICITED|
 * publish discovery sessions. Describes the addressing of the packet responding to an ACTIVE
 * subscribe query.
 */
enum class NanTxType : uint32_t {
    BROADCAST = 0u,
    UNICAST = 1u /* ::android::hardware::wifi::V1_0::NanTxType.BROADCAST implicitly + 1 */,
};

/**
 * NAN subscribe discovery session types.
 */
enum class NanSubscribeType : uint32_t {
    PASSIVE = 0u,
    ACTIVE = 1u /* ::android::hardware::wifi::V1_0::NanSubscribeType.PASSIVE implicitly + 1 */,
};

/**
 * NAN Service Response Filter Attribute Bit.
 */
enum class NanSrfType : uint32_t {
    BLOOM_FILTER = 0u,
    PARTIAL_MAC_ADDR = 1u /* ::android::hardware::wifi::V1_0::NanSrfType.BLOOM_FILTER implicitly + 1 */,
};

/**
 * NAN DP (data-path) channel config options.
 */
enum class NanDataPathChannelCfg : uint32_t {
    CHANNEL_NOT_REQUESTED = 0u,
    REQUEST_CHANNEL_SETUP = 1u /* ::android::hardware::wifi::V1_0::NanDataPathChannelCfg.CHANNEL_NOT_REQUESTED implicitly + 1 */,
    FORCE_CHANNEL_SETUP = 2u /* ::android::hardware::wifi::V1_0::NanDataPathChannelCfg.REQUEST_CHANNEL_SETUP implicitly + 1 */,
};

/**
 * NAN DP (data-path) security configuration options.
 */
enum class NanDataPathSecurityType : uint32_t {
    OPEN = 0u,
    PMK = 1u /* ::android::hardware::wifi::V1_0::NanDataPathSecurityType.OPEN implicitly + 1 */,
    PASSPHRASE = 2u /* ::android::hardware::wifi::V1_0::NanDataPathSecurityType.PMK implicitly + 1 */,
};

/**
 * NAN band-specific configuration.
 */
struct NanBandSpecificConfig final {
    /**
     * RSSI values controlling clustering behavior per spec. RSSI values are specified without a sign,
     * e.g. a value of -65dBm would be specified as 65.
     */
    uint8_t rssiClose __attribute__ ((aligned(1)));
    uint8_t rssiMiddle __attribute__ ((aligned(1)));
    /**
     * RSSI value determining whether discovery is near (used if enabled in discovery by
     * |NanDiscoveryCommonConfig.useRssiThreshold|).
     * RSSI values are specified without a sign, e.g. a value of -65dBm would be specified as 65.
     * NAN Spec: RSSI_close_proximity
     */
    uint8_t rssiCloseProximity __attribute__ ((aligned(1)));
    /**
     * Dwell time of each discovery channel in milliseconds. If set to 0 then the firmware determines
     * the dwell time to use.
     */
    uint8_t dwellTimeMs __attribute__ ((aligned(1)));
    /**
     * Scan period of each discovery channel in seconds. If set to 0 then the firmware determines
     * the scan period to use.
     */
    uint16_t scanPeriodSec __attribute__ ((aligned(2)));
    /**
     * Specifies the discovery window interval for Sync beacons and SDF's.
     * Valid values of DW Interval are: 1, 2, 3, 4 and 5 corresponding to 1, 2, 4, 8, and 16 DWs.
     * Value of 0:
     *  - reserved in 2.4GHz band
     *  - no wakeup at all in 5GHz band
     * The publish/subscribe period values don't override this device level configurations if
     * it is specified.
     * Configuration is only used only if |validDiscoveryWindowIntervalVal| is set to true.
     * NAN Spec: Device Capability Attribute / 2.4 GHz DW, Device Capability Attribute / 5 GHz DW
     */
    bool validDiscoveryWindowIntervalVal __attribute__ ((aligned(1)));
    uint8_t discoveryWindowIntervalVal __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanBandSpecificConfig, rssiClose) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanBandSpecificConfig, rssiMiddle) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanBandSpecificConfig, rssiCloseProximity) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanBandSpecificConfig, dwellTimeMs) == 3, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanBandSpecificConfig, scanPeriodSec) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanBandSpecificConfig, validDiscoveryWindowIntervalVal) == 6, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanBandSpecificConfig, discoveryWindowIntervalVal) == 7, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanBandSpecificConfig) == 8, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanBandSpecificConfig) == 2, "wrong alignment");

/**
 * Debug configuration parameters. Many of these allow non-standard-compliant operation and are
 * not intended for normal operational mode.
 */
struct NanDebugConfig final {
    /**
     * Specification of the lower 2 bytes of the cluster ID. The cluster ID is 50-60-9a-01-00-00 to
     * 50-60-9a-01-FF-FF. Configuration of the bottom and top values of the range (which defaults to
     * 0x0000 and 0xFFFF respectively).
     * Configuration is only used if |validClusterIdVals| is set to true.
     */
    bool validClusterIdVals __attribute__ ((aligned(1)));
    uint16_t clusterIdBottomRangeVal __attribute__ ((aligned(2)));
    uint16_t clusterIdTopRangeVal __attribute__ ((aligned(2)));
    /**
     * NAN management interface address, if specified (|validIntfAddrVal| is true) then overrides any
     * other configuration (specifically the default randomization configured by
     * |NanConfigRequest.macAddressRandomizationIntervalSec|).
     */
    bool validIntfAddrVal __attribute__ ((aligned(1)));
    ::android::hardware::hidl_array<uint8_t, 6> intfAddrVal __attribute__ ((aligned(1)));
    /**
     * Combination of the 24 bit Organizationally Unique ID (OUI) and the 8 bit OUI Type.
     * Used if |validOuiVal| is set to true.
     */
    bool validOuiVal __attribute__ ((aligned(1)));
    uint32_t ouiVal __attribute__ ((aligned(4)));
    /**
     * Force the Random Factor to the specified value for all transmitted Sync/Discovery beacons.
     * Used if |validRandomFactorForceVal| is set to true.
     * NAN Spec: Master Indication Attribute / Random Factor
     */
    bool validRandomFactorForceVal __attribute__ ((aligned(1)));
    uint8_t randomFactorForceVal __attribute__ ((aligned(1)));
    /**
     * Forces the hop-count for all transmitted Sync and Discovery Beacons NO matter the real
     * hop-count being received over the air. Used if the |validHopCountForceVal}| flag is set to
     * true.
     * NAN Spec: Cluster Attribute / Anchor Master Information / Hop Count to Anchor Master
     */
    bool validHopCountForceVal __attribute__ ((aligned(1)));
    uint8_t hopCountForceVal __attribute__ ((aligned(1)));
    /**
     * Frequency in MHz to of the discovery channel in the specified band. Indexed by |NanBandIndex|.
     * Used if the |validDiscoveryChannelVal| is set to true.
     */
    bool validDiscoveryChannelVal __attribute__ ((aligned(1)));
    ::android::hardware::hidl_array<uint32_t, 2> discoveryChannelMhzVal __attribute__ ((aligned(4)));
    /**
     * Specifies whether sync/discovery beacons are transmitted in the specified band. Indexed by
     * |NanBandIndex|. Used if the |validUseBeaconsInBandVal| is set to true.
     */
    bool validUseBeaconsInBandVal __attribute__ ((aligned(1)));
    ::android::hardware::hidl_array<bool, 2> useBeaconsInBandVal __attribute__ ((aligned(1)));
    /**
     * Specifies whether SDF (service discovery frames) are transmitted in the specified band. Indexed
     * by |NanBandIndex|. Used if the |validUseSdfInBandVal| is set to true.
     */
    bool validUseSdfInBandVal __attribute__ ((aligned(1)));
    ::android::hardware::hidl_array<bool, 2> useSdfInBandVal __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, validClusterIdVals) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, clusterIdBottomRangeVal) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, clusterIdTopRangeVal) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, validIntfAddrVal) == 6, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, intfAddrVal) == 7, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, validOuiVal) == 13, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, ouiVal) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, validRandomFactorForceVal) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, randomFactorForceVal) == 21, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, validHopCountForceVal) == 22, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, hopCountForceVal) == 23, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, validDiscoveryChannelVal) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, discoveryChannelMhzVal) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, validUseBeaconsInBandVal) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, useBeaconsInBandVal) == 37, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, validUseSdfInBandVal) == 39, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDebugConfig, useSdfInBandVal) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanDebugConfig) == 44, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanDebugConfig) == 4, "wrong alignment");

/**
 * Configuration parameters of NAN: used when enabling and re-configuring a NAN cluster.
 */
struct NanConfigRequest final {
    /**
     * Master preference of this device.
     * NAN Spec: Master Indication Attribute / Master Preference
     */
    uint8_t masterPref __attribute__ ((aligned(1)));
    /**
     * Controls whether or not the |IWifiNanIfaceEventCallback.eventClusterEvent| will be delivered
     * for |NanClusterEventType.DISCOVERY_MAC_ADDRESS_CHANGED|.
     */
    bool disableDiscoveryAddressChangeIndication __attribute__ ((aligned(1)));
    /**
     * Controls whether or not the |IWifiNanIfaceEventCallback.eventClusterEvent| will be delivered
     * for |NanClusterEventType.STARTED_CLUSTER|.
     */
    bool disableStartedClusterIndication __attribute__ ((aligned(1)));
    /**
     * Controls whether or not the |IWifiNanIfaceEventCallback.eventClusterEvent| will be delivered
     * for |NanClusterEventType.JOINED_CLUSTER|.
     */
    bool disableJoinedClusterIndication __attribute__ ((aligned(1)));
    /**
     * Control whether publish service IDs are included in Sync/Discovery beacons.
     * NAN Spec: Service ID List Attribute
     */
    bool includePublishServiceIdsInBeacon __attribute__ ((aligned(1)));
    /**
     * If |includePublishServiceIdsInBeacon| is true then specifies the number of publish service IDs
     * to include in the Sync/Discovery beacons:
     *  Value = 0: include as many service IDs as will fit into the maximum allowed beacon frame size.
     *  Value must fit within 7 bits - i.e. <= 127.
     */
    uint8_t numberOfPublishServiceIdsInBeacon __attribute__ ((aligned(1)));
    /**
     * Control whether subscribe service IDs are included in Sync/Discovery beacons.
     * Spec: Subscribe Service ID List Attribute
     */
    bool includeSubscribeServiceIdsInBeacon __attribute__ ((aligned(1)));
    /**
     * If |includeSubscribeServiceIdsInBeacon| is true then specifies the number of subscribe service
     * IDs to include in the Sync/Discovery beacons:
     *  Value = 0: include as many service IDs as will fit into the maximum allowed beacon frame size.
     *  Value must fit within 7 bits - i.e. <= 127.
     */
    uint8_t numberOfSubscribeServiceIdsInBeacon __attribute__ ((aligned(1)));
    /**
     * Number of samples used to calculate RSSI.
     */
    uint16_t rssiWindowSize __attribute__ ((aligned(2)));
    /**
     * Specifies the interval in seconds that the NAN management interface MAC address is randomized.
     * A value of 0 is used to disable the MAC address randomization
     */
    uint32_t macAddressRandomizationIntervalSec __attribute__ ((aligned(4)));
    /**
     * Additional configuration provided per band: indexed by |NanBandIndex|.
     */
    ::android::hardware::hidl_array<::android::hardware::wifi::V1_0::NanBandSpecificConfig, 2> bandSpecificConfig __attribute__ ((aligned(2)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanConfigRequest, masterPref) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanConfigRequest, disableDiscoveryAddressChangeIndication) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanConfigRequest, disableStartedClusterIndication) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanConfigRequest, disableJoinedClusterIndication) == 3, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanConfigRequest, includePublishServiceIdsInBeacon) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanConfigRequest, numberOfPublishServiceIdsInBeacon) == 5, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanConfigRequest, includeSubscribeServiceIdsInBeacon) == 6, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanConfigRequest, numberOfSubscribeServiceIdsInBeacon) == 7, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanConfigRequest, rssiWindowSize) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanConfigRequest, macAddressRandomizationIntervalSec) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanConfigRequest, bandSpecificConfig) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanConfigRequest) == 32, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanConfigRequest) == 4, "wrong alignment");

/**
 * Enable requests for NAN: start-up configuration |IWifiNanIface.enableRequest|.
 */
struct NanEnableRequest final {
    /**
     * Enable operation in a specific band: indexed by |NanBandIndex|.
     */
    ::android::hardware::hidl_array<bool, 2> operateInBand __attribute__ ((aligned(1)));
    /**
     * Specify extent of cluster by specifying the max hop count.
     */
    uint8_t hopCountMax __attribute__ ((aligned(1)));
    /**
     * Configurations of NAN cluster operation. Can also be modified at run-time using
     * |IWifiNanIface.configRequest|.
     */
    ::android::hardware::wifi::V1_0::NanConfigRequest configParams __attribute__ ((aligned(4)));
    /**
     * Non-standard configurations of NAN cluster operation - useful for debugging operations.
     */
    ::android::hardware::wifi::V1_0::NanDebugConfig debugConfigs __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanEnableRequest, operateInBand) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanEnableRequest, hopCountMax) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanEnableRequest, configParams) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanEnableRequest, debugConfigs) == 36, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanEnableRequest) == 80, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanEnableRequest) == 4, "wrong alignment");

/**
 * Cipher suite flags.
 */
enum class NanCipherSuiteType : uint32_t {
    NONE = 0u,
    SHARED_KEY_128_MASK = 1u /* 1 << 0 */,
    SHARED_KEY_256_MASK = 2u /* 1 << 1 */,
};

/**
 * Ranging in the context of discovery sessions indication controls. Controls the frequency of
 * ranging-driven |IWifiNanIfaceEventCallback.eventMatch|.
 */
enum class NanRangingIndication : uint32_t {
    CONTINUOUS_INDICATION_MASK = 1u /* 1 << 0 */,
    INGRESS_MET_MASK = 2u /* 1 << 1 */,
    EGRESS_MET_MASK = 4u /* 1 << 2 */,
};

/**
 * Configuration of NAN data-path security.
 */
struct NanDataPathSecurityConfig final {
    /**
     * Security configuration of the data-path (NDP). Security is required if not equal to
     * |NanDataPathSecurityType.OPEN|.
     * NAN Spec: Service Discovery Extension Attribute (SDEA) / Control / Security Required
     */
    ::android::hardware::wifi::V1_0::NanDataPathSecurityType securityType __attribute__ ((aligned(4)));
    /**
     * Cipher type for data-paths. If |securityType| is |NanDataPathSecurityType.OPEN| then must
     * be set to |NanCipherSuiteType.NONE|, otherwise a non-|NanCipherSuiteType.NONE| cipher suite
     * must be specified.
     */
    ::android::hardware::wifi::V1_0::NanCipherSuiteType cipherType __attribute__ ((aligned(4)));
    /**
     * Optional Pairwise Master Key (PMK). Must be specified (and is only used) if |securityType| is
     * set to |NanDataPathSecurityType.PMK|.
     * Ref: IEEE 802.11i
     */
    ::android::hardware::hidl_array<uint8_t, 32> pmk __attribute__ ((aligned(1)));
    /**
     * Optional Passphrase. Must be specified (and is only used) if |securityType| is set to
     * |NanDataPathSecurityType.PASSPHRASE|.
     * Min length: |MIN_PASSPHRASE_LENGTH|
     * Max length: |MAX_PASSPHRASE_LENGTH|
     * NAN Spec: Appendix: Mapping pass-phrase to PMK for NCS-SK Cipher Suites
     */
    ::android::hardware::hidl_vec<uint8_t> passphrase __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathSecurityConfig, securityType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathSecurityConfig, cipherType) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathSecurityConfig, pmk) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathSecurityConfig, passphrase) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanDataPathSecurityConfig) == 56, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanDataPathSecurityConfig) == 8, "wrong alignment");

/**
 * Configurations of NAN discovery sessions: common to publish and subscribe discovery.
 */
struct NanDiscoveryCommonConfig final {
    /**
     * The ID of the discovery session being configured. A value of 0 specifies a request to create
     * a new discovery session. The new discovery session ID is returned with
     * |IWifiNanIfaceEventCallback.notifyStartPublishResponse| or
     * |IWifiNanIfaceEventCallback.notifyStartSubscribeResponse|.
     * NAN Spec: Service Descriptor Attribute (SDA) / Instance ID
     */
    uint8_t sessionId __attribute__ ((aligned(1)));
    /**
     * The lifetime of the discovery session in seconds. A value of 0 means run forever or until
     * canceled using |IWifiIface.stopPublishRequest| or |IWifiIface.stopSubscribeRequest|.
     */
    uint16_t ttlSec __attribute__ ((aligned(2)));
    /**
     * Indicates the interval between two Discovery Windows in which the device supporting the
     * service is awake to transmit or receive the Service Discovery frames. Valid values of Awake
     * DW Interval are: 1, 2, 4, 8 and 16. A value of 0 will default to 1. Does not override
     * |NanBandSpecificConfig.discoveryWindowIntervalVal| configurations if those are specified.
     */
    uint16_t discoveryWindowPeriod __attribute__ ((aligned(2)));
    /**
     * The lifetime of the discovery session in number of transmitted SDF discovery packets. A value
     * of 0 means forever or until canceled using |IWifiIface.stopPublishRequest| or
     * |IWifiIface.stopSubscribeRequest|.
     */
    uint8_t discoveryCount __attribute__ ((aligned(1)));
    /**
     * UTF-8 encoded string identifying the service.
     * Max length: |NanCapabilities.maxServiceNameLen|.
     * NAN Spec: The only acceptable single-byte UTF-8 symbols for a Service Name are alphanumeric
     * values (A-Z, a-z, 0-9), the hyphen ('-'), and the period ('.'). All valid multi-byte UTF-8
     * characters are acceptable in a Service Name.
     */
    ::android::hardware::hidl_vec<uint8_t> serviceName __attribute__ ((aligned(8)));
    /**
     * Specifies how often to trigger |IWifiNanIfaceEventCallback.eventMatch| when continuously
     * discovering the same discovery session (with no changes).
     */
    ::android::hardware::wifi::V1_0::NanMatchAlg discoveryMatchIndicator __attribute__ ((aligned(4)));
    /**
     * Arbitrary information communicated in discovery packets - there is no semantic meaning to these
     * bytes. They are passed-through from publisher to subscriber as-is with no parsing.
     * Max length: |NanCapabilities.maxServiceSpecificInfoLen|.
     * NAN Spec: Service Descriptor Attribute (SDA) / Service Info
     */
    ::android::hardware::hidl_vec<uint8_t> serviceSpecificInfo __attribute__ ((aligned(8)));
    /**
     * Arbitrary information communicated in discovery packets - there is no semantic meaning to these
     * bytes. They are passed-through from publisher to subscriber as-is with no parsing.
     * Max length: |NanCapabilities.maxExtendedServiceSpecificInfoLen|.
     * Spec: Service Descriptor Extension Attribute (SDEA) / Service Info
     */
    ::android::hardware::hidl_vec<uint8_t> extendedServiceSpecificInfo __attribute__ ((aligned(8)));
    /**
     * Ordered sequence of <length, value> pairs (|length| uses 1 byte and contains the number of
     * bytes in the |value| field) which specify further match criteria (beyond the service name).
     * The match behavior is specified in details in the NAN spec.
     * Publisher: used in SOLICITED or SOLICITED_UNSOLICITED sessions.
     * Subscriber: used in ACTIVE or PASSIVE sessions.
     * Max length: |NanCapabilities.maxMatchFilterLen|.
     * NAN Spec: matching_filter_rx
     */
    ::android::hardware::hidl_vec<uint8_t> rxMatchFilter __attribute__ ((aligned(8)));
    /**
     * Ordered sequence of <length, value> pairs (|length| uses 1 byte and contains the number of
     * bytes in the |value| field) which specify further match criteria (beyond the service name).
     * The match behavior is specified in details in the NAN spec.
     * Publisher: used if provided.
     * Subscriber: used (if provided) only in ACTIVE sessions.
     * Max length: |NanCapabilities.maxMatchFilterLen|.
     * NAN Spec: matching_filter_tx and Service Descriptor Attribute (SDA) / Matching Filter
     */
    ::android::hardware::hidl_vec<uint8_t> txMatchFilter __attribute__ ((aligned(8)));
    /**
     * Specifies whether or not the discovery session uses the
     * |NanBandSpecificConfig.rssiCloseProximity| value (configured in enable/configure requests) to
     * filter out matched discovered peers.
     * NAN Spec: Service Descriptor Attribute / Service Control / Discovery Range Limited.
     */
    bool useRssiThreshold __attribute__ ((aligned(1)));
    /**
     * Controls whether or not the |IWifiNanIfaceEventCallback.eventPublishTerminated| (for publish
     * discovery sessions) or |IWifiNanIfaceEventCallback.eventSubscribeTerminated| (for subscribe
     * discovery sessions) will be delivered.
     */
    bool disableDiscoveryTerminationIndication __attribute__ ((aligned(1)));
    /**
     * Controls whether or not the |IWifiNanIfaceEventCallback.eventMatchExpired| will be delivered.
     */
    bool disableMatchExpirationIndication __attribute__ ((aligned(1)));
    /**
     * Controls whether or not the |IWifiNanIfaceEventCallback.eventFollowupReceived| will be
     * delivered.
     */
    bool disableFollowupReceivedIndication __attribute__ ((aligned(1)));
    /**
     * Security configuration of data-paths created in the context of this discovery session. Security
     * parameters can be overridden during the actual construction of the data-path - allowing
     * individual data-paths to have unique PMKs or Passphrases.
     */
    ::android::hardware::wifi::V1_0::NanDataPathSecurityConfig securityConfig __attribute__ ((aligned(8)));
    /**
     * Specifies whether or not there is a ranging requirement in this discovery session.
     * Ranging is only performed if all other match criteria with the peer are met. Ranging must
     * be performed if both peers in the discovery session (publisher and subscriber) set this
     * flag to true. Otherwise, if either peer sets this flag to false, ranging must not be performed
     * and must not impact discovery decisions.
     * Note: specifying that ranging is required also implies that this device must automatically
     * accept ranging requests from peers.
     * NAN Spec: Service Discovery Extension Attribute (SDEA) / Control / Ranging Require.
     */
    bool rangingRequired __attribute__ ((aligned(1)));
    /**
     * Interval in msec between two ranging measurements. Only relevant if |rangingRequired| is true.
     * If the Awake DW interval specified either in |discoveryWindowPeriod| or in
     * |NanBandSpecificConfig.discoveryWindowIntervalVal| is larger than the ranging interval then
     * priority is given to Awake DW interval.
     */
    uint32_t rangingIntervalMsec __attribute__ ((aligned(4)));
    /**
     * The type of ranging feedback to be provided by discovery session matches
     * |IWifiNanIfaceEventCallback.eventMatch|. Only relevant if |rangingRequired| is true.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::wifi::V1_0::NanRangingIndication> configRangingIndications __attribute__ ((aligned(4)));
    /**
     * The ingress and egress distance in cm. If ranging is enabled (|rangingEnabled| is true) then
     * |configRangingIndications| is used to determine whether ingress and/or egress (or neither)
     * are used to determine whether a match has occurred.
     * NAN Spec: Service Discovery Extension Attribute (SDEA) / Ingress & Egress Range Limit
     */
    uint16_t distanceIngressCm __attribute__ ((aligned(2)));
    uint16_t distanceEgressCm __attribute__ ((aligned(2)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, sessionId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, ttlSec) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, discoveryWindowPeriod) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, discoveryCount) == 6, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, serviceName) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, discoveryMatchIndicator) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, serviceSpecificInfo) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, extendedServiceSpecificInfo) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, rxMatchFilter) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, txMatchFilter) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, useRssiThreshold) == 96, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, disableDiscoveryTerminationIndication) == 97, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, disableMatchExpirationIndication) == 98, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, disableFollowupReceivedIndication) == 99, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, securityConfig) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, rangingRequired) == 160, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, rangingIntervalMsec) == 164, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, configRangingIndications) == 168, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, distanceIngressCm) == 172, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig, distanceEgressCm) == 174, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig) == 176, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig) == 8, "wrong alignment");

/**
 * Publish request: specifies a publish discovery operation.
 */
struct NanPublishRequest final {
    /**
     * Common configuration of discovery sessions.
     */
    ::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig baseConfigs __attribute__ ((aligned(8)));
    /**
     * The type of the publish discovery session.
     */
    ::android::hardware::wifi::V1_0::NanPublishType publishType __attribute__ ((aligned(4)));
    /**
     * For publishType of |NanPublishType.SOLICITED| or |NanPublishType.UNSOLICITED_SOLICITED|
     * specifies the type of transmission used for responding to the probing subscribe discovery
     * peer.
     */
    ::android::hardware::wifi::V1_0::NanTxType txType __attribute__ ((aligned(4)));
    /**
     * Specifies whether data-path requests |IWifiNanIfaceEventCallback.eventDataPathRequest| (in
     * the context of this discovery session) are automatically accepted (if true) - in which case
     * the Responder must not call the |IWifiNanIface.respondToDataPathIndicationRequest| method and
     * the device must automatically accept the data-path request and complete the negotiation.
     */
    bool autoAcceptDataPathRequests __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanPublishRequest, baseConfigs) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanPublishRequest, publishType) == 176, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanPublishRequest, txType) == 180, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanPublishRequest, autoAcceptDataPathRequests) == 184, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanPublishRequest) == 192, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanPublishRequest) == 8, "wrong alignment");

/**
 * Subscribe request: specifies a subscribe discovery operation.
 */
struct NanSubscribeRequest final {
    /**
     * Common configuration of discovery sessions.
     */
    ::android::hardware::wifi::V1_0::NanDiscoveryCommonConfig baseConfigs __attribute__ ((aligned(8)));
    /**
     * The type of the subscribe discovery session.
     */
    ::android::hardware::wifi::V1_0::NanSubscribeType subscribeType __attribute__ ((aligned(4)));
    /**
     * For |NanSubscribeType.ACTIVE| subscribe discovery sessions specify how the Service Response
     * Filter (SRF) attribute is populated. Relevant only if |shouldUseSrf| is set to true.
     * NAN Spec: Service Descriptor Attribute (SDA) / Service Response Filter / SRF Control / SRF Type
     */
    ::android::hardware::wifi::V1_0::NanSrfType srfType __attribute__ ((aligned(4)));
    /**
     * Configure whether inclusion of an address in |intfAddr| indicates that those devices should
     * respond or the reverse. Relevant only if |shouldUseSrf| is set to true and |srfType| is set to
     * |NanSrfType.PARTIAL_MAC_ADDR|.
     * NAN Spec: Service Descriptor Attribute (SDA) / Service Response Filter / SRF Control / Include
     */
    bool srfRespondIfInAddressSet __attribute__ ((aligned(1)));
    /**
     * Control whether the Service Response Filter (SRF) is used.
     * NAN Spec: Service Descriptor Attribute (SDA) / Service Control /
     *           Service Response Filter Present
     */
    bool shouldUseSrf __attribute__ ((aligned(1)));
    /**
     * Control whether the presence of |NanDiscoveryCommonConfig.serviceSpecificInfo| data is needed
     * in the publisher in order to trigger service discovery, i.e. a
     * |IWifiNanIfaceEventCallback.eventMatch|. The test is for presence of data - not for the
     * specific contents of the data.
     */
    bool isSsiRequiredForMatch __attribute__ ((aligned(1)));
    /**
     * NAN Interface Addresses constituting the Service Response Filter (SRF).
     * Max length (number of addresses): |NanCapabilities.maxSubscribeInterfaceAddresses|.
     * NAN Spec: Service Descriptor Attribute (SDA) / Service Response Filter / Address Set
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_array<uint8_t, 6>> intfAddr __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanSubscribeRequest, baseConfigs) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanSubscribeRequest, subscribeType) == 176, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanSubscribeRequest, srfType) == 180, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanSubscribeRequest, srfRespondIfInAddressSet) == 184, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanSubscribeRequest, shouldUseSrf) == 185, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanSubscribeRequest, isSsiRequiredForMatch) == 186, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanSubscribeRequest, intfAddr) == 192, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanSubscribeRequest) == 208, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanSubscribeRequest) == 8, "wrong alignment");

/**
 * Transmit follow up message request.
 */
struct NanTransmitFollowupRequest final {
    /**
     * ID of an active publish or subscribe discovery session. Follow-up message is transmitted in the
     * context of the discovery session.
     * NAN Spec: Service Descriptor Attribute (SDA) / Instance ID
     */
    uint8_t discoverySessionId __attribute__ ((aligned(1)));
    /**
     * ID of the peer. Obtained as part of an earlier |IWifiNanIfaceEventCallback.eventMatch| or
     * |IWifiNanIfaceEventCallback.eventFollowupReceived|.
     */
    uint32_t peerId __attribute__ ((aligned(4)));
    /**
     * MAC address of the peer. Obtained as part of an earlier |IWifiNanIfaceEventCallback.eventMatch|
     * or |IWifiNanIfaceEventCallback.eventFollowupReceived|.
     */
    ::android::hardware::hidl_array<uint8_t, 6> addr __attribute__ ((aligned(1)));
    /**
     * Should the follow-up message be transmitted with a high priority.
     */
    bool isHighPriority __attribute__ ((aligned(1)));
    /**
     * Should the follow-up message be transmitted in a discovery window (true) or a further
     * availability window (false).
     */
    bool shouldUseDiscoveryWindow __attribute__ ((aligned(1)));
    /**
     * Arbitrary information communicated to the peer - there is no semantic meaning to these
     * bytes. They are passed-through from sender to receiver as-is with no parsing.
     * Max length: |NanCapabilities.maxServiceSpecificInfoLen|.
     * NAN Spec: Service Descriptor Attribute (SDA) / Service Info
     */
    ::android::hardware::hidl_vec<uint8_t> serviceSpecificInfo __attribute__ ((aligned(8)));
    /**
     * Arbitrary information communicated in discovery packets - there is no semantic meaning to these
     * bytes. They are passed-through from publisher to subscriber as-is with no parsing.
     * Max length: |NanCapabilities.maxExtendedServiceSpecificInfoLen|.
     * Spec: Service Descriptor Extension Attribute (SDEA) / Service Info
     */
    ::android::hardware::hidl_vec<uint8_t> extendedServiceSpecificInfo __attribute__ ((aligned(8)));
    /**
     * Disable |IWifiNanIfaceEventCallback.eventTransmitFollowup| - i.e. do not get indication on
     * whether the follow-up was transmitted and received successfully.
     */
    bool disableFollowupResultIndication __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanTransmitFollowupRequest, discoverySessionId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanTransmitFollowupRequest, peerId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanTransmitFollowupRequest, addr) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanTransmitFollowupRequest, isHighPriority) == 14, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanTransmitFollowupRequest, shouldUseDiscoveryWindow) == 15, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanTransmitFollowupRequest, serviceSpecificInfo) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanTransmitFollowupRequest, extendedServiceSpecificInfo) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanTransmitFollowupRequest, disableFollowupResultIndication) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanTransmitFollowupRequest) == 56, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanTransmitFollowupRequest) == 8, "wrong alignment");

/**
 *  Data Path Initiator requesting a data-path.
 */
struct NanInitiateDataPathRequest final {
    /**
     * ID of the peer. Obtained as part of an earlier |IWifiNanIfaceEventCallback.eventMatch| or
     * |IWifiNanIfaceEventCallback.eventFollowupReceived|.
     */
    uint32_t peerId __attribute__ ((aligned(4)));
    /**
     * NAN management interface MAC address of the peer. Obtained as part of an earlier
     * |IWifiNanIfaceEventCallback.eventMatch| or |IWifiNanIfaceEventCallback.eventFollowupReceived|.
     */
    ::android::hardware::hidl_array<uint8_t, 6> peerDiscMacAddr __attribute__ ((aligned(1)));
    /**
     * Config flag for channel request.
     */
    ::android::hardware::wifi::V1_0::NanDataPathChannelCfg channelRequestType __attribute__ ((aligned(4)));
    /**
     * Channel frequency in MHz to start data-path. Not relevant if |channelRequestType| is
     * |NanDataPathChannelCfg.CHANNEL_NOT_REQUESTED|.
     */
    uint32_t channel __attribute__ ((aligned(4)));
    /**
     * NAN data interface name on which this data-path session is to be initiated.
     * This must be an interface created using |IWifiNanIface.createDataInterfaceRequest|.
     */
    ::android::hardware::hidl_string ifaceName __attribute__ ((aligned(8)));
    /**
     * Security configuration of the requested data-path.
     */
    ::android::hardware::wifi::V1_0::NanDataPathSecurityConfig securityConfig __attribute__ ((aligned(8)));
    /**
     * Arbitrary information communicated to the peer as part of the data-path setup process - there
     * is no semantic meaning to these bytes. They are passed-through from sender to receiver as-is
     * with no parsing.
     * Max length: |NanCapabilities.maxAppInfoLen|.
     * NAN Spec: Data Path Attributes / NDP Attribute / NDP Specific Info
     */
    ::android::hardware::hidl_vec<uint8_t> appInfo __attribute__ ((aligned(8)));
    /**
     * A service name to be used with |passphrase| to construct a Pairwise Master Key (PMK) for the
     * data-path. Only relevant when a data-path is requested which is not associated with a NAN
     * discovery session - e.g. using out-of-band discovery.
     * Constraints: same as |NanDiscoveryCommonConfig.serviceName|
     * NAN Spec: Appendix: Mapping pass-phrase to PMK for NCS-SK Cipher Suites
     */
    ::android::hardware::hidl_vec<uint8_t> serviceNameOutOfBand __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanInitiateDataPathRequest, peerId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanInitiateDataPathRequest, peerDiscMacAddr) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanInitiateDataPathRequest, channelRequestType) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanInitiateDataPathRequest, channel) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanInitiateDataPathRequest, ifaceName) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanInitiateDataPathRequest, securityConfig) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanInitiateDataPathRequest, appInfo) == 96, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanInitiateDataPathRequest, serviceNameOutOfBand) == 112, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanInitiateDataPathRequest) == 128, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanInitiateDataPathRequest) == 8, "wrong alignment");

/**
 * Response to a data-path request from a peer.
 */
struct NanRespondToDataPathIndicationRequest final {
    /**
     * Accept (true) or reject (false) the request.
     * NAN Spec: Data Path Attributes / NDP Attribute / Type and Status
     */
    bool acceptRequest __attribute__ ((aligned(1)));
    /**
     * ID of the data-path (NDP) for which we're responding - obtained as part of the request in
     * |IWifiNanIfaceEventCallback.eventDataPathRequest|.
     */
    uint32_t ndpInstanceId __attribute__ ((aligned(4)));
    /**
     * NAN data interface name on which this data-path session is to be started.
     * This must be an interface created using |IWifiNanIface.createDataInterfaceRequest|.
     */
    ::android::hardware::hidl_string ifaceName __attribute__ ((aligned(8)));
    /**
     * Security configuration of the requested data-path.
     */
    ::android::hardware::wifi::V1_0::NanDataPathSecurityConfig securityConfig __attribute__ ((aligned(8)));
    /**
     * Arbitrary information communicated to the peer as part of the data-path setup process - there
     * is no semantic meaning to these bytes. They are passed-through from sender to receiver as-is
     * with no parsing.
     * Max length: |NanCapabilities.maxAppInfoLen|.
     * NAN Spec: Data Path Attributes / NDP Attribute / NDP Specific Info
     */
    ::android::hardware::hidl_vec<uint8_t> appInfo __attribute__ ((aligned(8)));
    /**
     * A service name to be used with |passphrase| to construct a Pairwise Master Key (PMK) for the
     * data-path. Only relevant when a data-path is requested which is not associated with a NAN
     * discovery session - e.g. using out-of-band discovery.
     * Constraints: same as |NanDiscoveryCommonConfig.serviceName|
     * NAN Spec: Appendix: Mapping pass-phrase to PMK for NCS-SK Cipher Suites
     */
    ::android::hardware::hidl_vec<uint8_t> serviceNameOutOfBand __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanRespondToDataPathIndicationRequest, acceptRequest) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanRespondToDataPathIndicationRequest, ndpInstanceId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanRespondToDataPathIndicationRequest, ifaceName) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanRespondToDataPathIndicationRequest, securityConfig) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanRespondToDataPathIndicationRequest, appInfo) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanRespondToDataPathIndicationRequest, serviceNameOutOfBand) == 96, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanRespondToDataPathIndicationRequest) == 112, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanRespondToDataPathIndicationRequest) == 8, "wrong alignment");

/**
 * NDP Capabilities response.
 */
struct NanCapabilities final {
    /**
     * Maximum number of clusters which the device can join concurrently.
     */
    uint32_t maxConcurrentClusters __attribute__ ((aligned(4)));
    /**
     * Maximum number of concurrent publish discovery sessions.
     */
    uint32_t maxPublishes __attribute__ ((aligned(4)));
    /**
     * Maximum number of concurrent subscribe discovery sessions.
     */
    uint32_t maxSubscribes __attribute__ ((aligned(4)));
    /**
     * Maximum length (in bytes) of service name.
     */
    uint32_t maxServiceNameLen __attribute__ ((aligned(4)));
    /**
     * Maximum length (in bytes) of individual match filters.
     */
    uint32_t maxMatchFilterLen __attribute__ ((aligned(4)));
    /**
     * Maximum length (in bytes) of aggregate match filters across all active sessions.
     */
    uint32_t maxTotalMatchFilterLen __attribute__ ((aligned(4)));
    /**
     * Maximum length (in bytes) of the service specific info field.
     */
    uint32_t maxServiceSpecificInfoLen __attribute__ ((aligned(4)));
    /**
     * Maximum length (in bytes) of the extended service specific info field.
     */
    uint32_t maxExtendedServiceSpecificInfoLen __attribute__ ((aligned(4)));
    /**
     * Maximum number of data interfaces (NDI) which can be created concurrently on the device.
     */
    uint32_t maxNdiInterfaces __attribute__ ((aligned(4)));
    /**
     * Maximum number of data paths (NDP) which can be created concurrently on the device, across all
     * data interfaces (NDI).
     */
    uint32_t maxNdpSessions __attribute__ ((aligned(4)));
    /**
     * Maximum length (in bytes) of application info field (used in data-path negotiations).
     */
    uint32_t maxAppInfoLen __attribute__ ((aligned(4)));
    /**
     * Maximum number of transmitted followup messages which can be queued by the firmware.
     */
    uint32_t maxQueuedTransmitFollowupMsgs __attribute__ ((aligned(4)));
    /**
     * Maximum number MAC interface addresses which can be specified to a subscribe discovery session.
     */
    uint32_t maxSubscribeInterfaceAddresses __attribute__ ((aligned(4)));
    /**
     * The set of supported Cipher suites. The |NanCipherSuiteType| bit fields are used.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::wifi::V1_0::NanCipherSuiteType> supportedCipherSuites __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxConcurrentClusters) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxPublishes) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxSubscribes) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxServiceNameLen) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxMatchFilterLen) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxTotalMatchFilterLen) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxServiceSpecificInfoLen) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxExtendedServiceSpecificInfoLen) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxNdiInterfaces) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxNdpSessions) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxAppInfoLen) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxQueuedTransmitFollowupMsgs) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, maxSubscribeInterfaceAddresses) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanCapabilities, supportedCipherSuites) == 52, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanCapabilities) == 56, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanCapabilities) == 4, "wrong alignment");

/**
 * Match indication structure
 */
struct NanMatchInd final {
    /**
     * Publish or subscribe discovery session ID of an existing discovery session.
     * NAN Spec: Service Descriptor Attribute (SDA) / Instance ID
     */
    uint8_t discoverySessionId __attribute__ ((aligned(1)));
    /**
     * A unique ID of the peer. Can be subsequently used in |IWifiNanIface.transmitFollowupRequest| or
     * to set up a data-path.
     */
    uint32_t peerId __attribute__ ((aligned(4)));
    /**
     * The NAN Discovery (management) MAC address of the peer.
     */
    ::android::hardware::hidl_array<uint8_t, 6> addr __attribute__ ((aligned(1)));
    /**
     * The arbitrary information contained in the |NanDiscoveryCommonConfig.serviceSpecificInfo| of
     * the peer's discovery session configuration.
     * Max length: |NanCapabilities.maxServiceSpecificInfoLen|.
     * NAN Spec: Service Descriptor Attribute (SDA) / Service Info
     */
    ::android::hardware::hidl_vec<uint8_t> serviceSpecificInfo __attribute__ ((aligned(8)));
    /**
     * Arbitrary information communicated in discovery packets - there is no semantic meaning to these
     * bytes. They are passed-through from publisher to subscriber as-is with no parsing.
     * Max length: |NanCapabilities.maxExtendedServiceSpecificInfoLen|.
     * Spec: Service Descriptor Extension Attribute (SDEA) / Service Info
     */
    ::android::hardware::hidl_vec<uint8_t> extendedServiceSpecificInfo __attribute__ ((aligned(8)));
    /**
     * The match filter from the discovery packet (publish or subscribe) which caused service
     * discovery. Matches the |NanDiscoveryCommonConfig.txMatchFilter| of the peer's Unsolicited
     * publish message or of the local device's Active subscribe message.
     * Max length: |NanCapabilities.maxMatchFilterLen|.
     * NAN Spec: Service Descriptor Attribute (SDA) / Matching Filter
     */
    ::android::hardware::hidl_vec<uint8_t> matchFilter __attribute__ ((aligned(8)));
    /**
     * Indicates the type of discovery: true if match occurred on a Beacon frame, false if the match
     * occurred on a Service Discovery Frames (SDF).
     */
    bool matchOccuredInBeaconFlag __attribute__ ((aligned(1)));
    /**
     * Flag to indicate firmware is out of resource and that it can no longer track this Service Name.
     * Indicates that while |IWifiNanIfaceEventCallback.eventMatch| will be received, the
     * |NanDiscoveryCommonConfig.discoveryMatchIndicator| configuration will not be honored.
     */
    bool outOfResourceFlag __attribute__ ((aligned(1)));
    /**
     * If RSSI filtering was enabled using |NanDiscoveryCommonConfig.useRssiThreshold| in discovery
     * session setup then this field contains the received RSSI value. It will contain 0 if RSSI
     * filtering was not enabled.
     * RSSI values are returned without sign, e.g. -70dBm will be returned as 70.
     */
    uint8_t rssiValue __attribute__ ((aligned(1)));
    /**
     * Cipher type for data-paths constructed in the context of this discovery session. Valid if
     * |peerRequiresSecurityEnabledInNdp| is true.
     */
    ::android::hardware::wifi::V1_0::NanCipherSuiteType peerCipherType __attribute__ ((aligned(4)));
    /**
     * Indicates whether or not the peer requires security enabled in any data-path (NDP) constructed
     * in the context of this discovery session. The |cipherType| specifies the cipher type for such
     * data-paths.
     * NAN Spec: Service Discovery Extension Attribute (SDEA) / Control / Security Required
     */
    bool peerRequiresSecurityEnabledInNdp __attribute__ ((aligned(1)));
    /**
     * Indicates whether or not the peer requires (and hence allows) ranging in the context of this
     * discovery session.
     * Note that ranging is only performed if all other match criteria with the peer are met.
     * NAN Spec: Service Discovery Extension Attribute (SDEA) / Control / Ranging Require.
     */
    bool peerRequiresRanging __attribute__ ((aligned(1)));
    /**
     * Ranging indication supersedes the NanMatchAlg specification.
     * Ex: If NanMatchAlg is MATCH_ONCE, but ranging indications is continuous then continuous
     * match notifications will be received (with ranging information).
     * Ranging indication data is provided if Ranging required is enabled in the discovery
     * specification and:
     *   1) continuous ranging specified.
     *   2) ingress/egress specified and:
     *       - notify once for ingress >= ingress_distance and egress <= egress_distance,
     *       - same for ingress_egress_both
     * If the Awake DW intervals are larger than the ranging intervals then priority is given to the
     * device DW intervals.
     *
     * If ranging was required and executed contains the distance to the peer in CM. The
     * |rangingIndicationType| field specifies the event which triggered ranging.
     */
    uint32_t rangingMeasurementInCm __attribute__ ((aligned(4)));
    /**
     * The ranging event(s) which triggered the ranging. E.g. can indicate that continuous ranging was
     * requested, or else that an ingress event occurred.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::wifi::V1_0::NanRangingIndication> rangingIndicationType __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, discoverySessionId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, peerId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, addr) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, serviceSpecificInfo) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, extendedServiceSpecificInfo) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, matchFilter) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, matchOccuredInBeaconFlag) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, outOfResourceFlag) == 65, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, rssiValue) == 66, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, peerCipherType) == 68, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, peerRequiresSecurityEnabledInNdp) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, peerRequiresRanging) == 73, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, rangingMeasurementInCm) == 76, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanMatchInd, rangingIndicationType) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanMatchInd) == 88, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanMatchInd) == 8, "wrong alignment");

/**
 * Followup message received from peer indication structure.
 */
struct NanFollowupReceivedInd final {
    /**
     * Discovery session (publish or subscribe) ID of a previously created discovery session. The
     * message is received in the context of this discovery session.
     * NAN Spec: Service Descriptor Attribute (SDA) / Instance ID
     */
    uint8_t discoverySessionId __attribute__ ((aligned(1)));
    /**
     * A unique ID of the peer. Can be subsequently used in |IWifiNanIface.transmitFollowupRequest| or
     * to set up a data-path.
     */
    uint32_t peerId __attribute__ ((aligned(4)));
    /**
     * The NAN Discovery (management) MAC address of the peer.
     */
    ::android::hardware::hidl_array<uint8_t, 6> addr __attribute__ ((aligned(1)));
    /**
     * Indicates whether received in a further availability window (FAW) if true, or in a discovery
     * window (DW) if false.
     */
    bool receivedInFaw __attribute__ ((aligned(1)));
    /**
     * Received message from the peer - there is no semantic meaning to these bytes. They are
     * passed-through from sender to receiver as-is with no parsing.
     * Max length: |NanCapabilities.maxServiceSpecificInfoLen|.
     * NAN Spec: Service Descriptor Attribute (SDA) / Service Info
     */
    ::android::hardware::hidl_vec<uint8_t> serviceSpecificInfo __attribute__ ((aligned(8)));
    /**
     * Arbitrary information communicated in discovery packets - there is no semantic meaning to these
     * bytes. They are passed-through from publisher to subscriber as-is with no parsing.
     * Max length: |NanCapabilities.maxExtendedServiceSpecificInfoLen|.
     * Spec: Service Descriptor Extension Attribute (SDEA) / Service Info
     */
    ::android::hardware::hidl_vec<uint8_t> extendedServiceSpecificInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanFollowupReceivedInd, discoverySessionId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanFollowupReceivedInd, peerId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanFollowupReceivedInd, addr) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanFollowupReceivedInd, receivedInFaw) == 14, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanFollowupReceivedInd, serviceSpecificInfo) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanFollowupReceivedInd, extendedServiceSpecificInfo) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanFollowupReceivedInd) == 48, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanFollowupReceivedInd) == 8, "wrong alignment");

/**
 * Event types for a cluster event indication.
 */
enum class NanClusterEventType : uint32_t {
    /**
     * Management/discovery interface MAC address has changed (e.g. due to randomization or at
     * startup).
     */
    DISCOVERY_MAC_ADDRESS_CHANGED = 0u,
    /**
     * A new cluster has been formed by this device.
     */
    STARTED_CLUSTER = 1u /* ::android::hardware::wifi::V1_0::NanClusterEventType.DISCOVERY_MAC_ADDRESS_CHANGED implicitly + 1 */,
    /**
     * This device has joined an existing cluster.
     */
    JOINED_CLUSTER = 2u /* ::android::hardware::wifi::V1_0::NanClusterEventType.STARTED_CLUSTER implicitly + 1 */,
};

/**
 * Cluster event indication structure: triggered on events impacting how this device is
 * visible to peers - cluster forming, joining a new cluster, or changing of the MAC address.
 */
struct NanClusterEventInd final {
    /**
     * Event type causing the cluster event indication to be triggered.
     */
    ::android::hardware::wifi::V1_0::NanClusterEventType eventType __attribute__ ((aligned(4)));
    /**
     * MAC Address associated with the corresponding event.
     */
    ::android::hardware::hidl_array<uint8_t, 6> addr __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanClusterEventInd, eventType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanClusterEventInd, addr) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanClusterEventInd) == 12, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanClusterEventInd) == 4, "wrong alignment");

/**
 * NAN Data path request Indication Message structure.
 * Event indication received by an intended Responder when a Nan Data request initiated by an
 * Initiator.
 */
struct NanDataPathRequestInd final {
    /**
     * ID of an active publish or subscribe discovery session - the data-path request is in the
     * context of this discovery session.
     * NAN Spec: Data Path Attributes / NDP Attribute / Publish ID
     */
    uint8_t discoverySessionId __attribute__ ((aligned(1)));
    /**
     * MAC address of the Initiator peer. This is the MAC address of the peer's management/discovery
     * NAN interface.
     */
    ::android::hardware::hidl_array<uint8_t, 6> peerDiscMacAddr __attribute__ ((aligned(1)));
    /**
     * ID of the data-path - used to identify the data-path in further negotiation/APIs.
     */
    uint32_t ndpInstanceId __attribute__ ((aligned(4)));
    /**
     * Specifies whether or not security is required by the peer for the data-path being created.
     * NAN Spec: Data Path Attributes / NDP Attribute / NDP Control / Security Present
     */
    bool securityRequired __attribute__ ((aligned(1)));
    /**
     * Arbitrary information communicated from the peer as part of the data-path setup process - there
     * is no semantic meaning to these bytes. They are passed-through from sender to receiver as-is
     * with no parsing.
     * Max length: |NanCapabilities.maxAppInfoLen|.
     * NAN Spec: Data Path Attributes / NDP Attribute / NDP Specific Info
     */
    ::android::hardware::hidl_vec<uint8_t> appInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathRequestInd, discoverySessionId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathRequestInd, peerDiscMacAddr) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathRequestInd, ndpInstanceId) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathRequestInd, securityRequired) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathRequestInd, appInfo) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanDataPathRequestInd) == 32, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanDataPathRequestInd) == 8, "wrong alignment");

/**
 * NAN Data path confirmation Indication structure.
 * Event indication is received on both initiator and responder side when negotiation for a
 * data-path finish: on success or failure.
 */
struct NanDataPathConfirmInd final {
    /**
     * ID of the data-path.
     */
    uint32_t ndpInstanceId __attribute__ ((aligned(4)));
    /**
     * Indicates whether the data-path setup succeeded (true) or failed (false).
     */
    bool dataPathSetupSuccess __attribute__ ((aligned(1)));
    /**
     * MAC address of the peer's data-interface (not it's management/discovery interface).
     */
    ::android::hardware::hidl_array<uint8_t, 6> peerNdiMacAddr __attribute__ ((aligned(1)));
    /**
     * Arbitrary information communicated from the peer as part of the data-path setup process - there
     * is no semantic meaning to these bytes. They are passed-through from sender to receiver as-is
     * with no parsing.
     * Max length: |NanCapabilities.maxAppInfoLen|.
     * NAN Spec: Data Path Attributes / NDP Attribute / NDP Specific Info
     */
    ::android::hardware::hidl_vec<uint8_t> appInfo __attribute__ ((aligned(8)));
    /**
     * Failure reason if |dataPathSetupSuccess| is false.
     */
    ::android::hardware::wifi::V1_0::WifiNanStatus status __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathConfirmInd, ndpInstanceId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathConfirmInd, dataPathSetupSuccess) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathConfirmInd, peerNdiMacAddr) == 5, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathConfirmInd, appInfo) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::NanDataPathConfirmInd, status) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::NanDataPathConfirmInd) == 56, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::NanDataPathConfirmInd) == 8, "wrong alignment");

/**
 * RTT specific types.
 * TODO(b/32159498): Move to a separate rtt_types.hal.
 *
 *
 * Ranging status.
 */
enum class RttStatus : uint32_t {
    SUCCESS = 0u,
    /**
     * General failure status
     */
    FAILURE = 1u,
    /**
     * Target STA does not respond to request
     */
    FAIL_NO_RSP = 2u,
    /**
     * Request rejected. Applies to 2-sided RTT only
     */
    FAIL_REJECTED = 3u,
    FAIL_NOT_SCHEDULED_YET = 4u,
    /**
     * Timing measurement times out
     */
    FAIL_TM_TIMEOUT = 5u,
    /**
     * Target on different channel, cannot range
     */
    FAIL_AP_ON_DIFF_CHANNEL = 6u,
    /**
     * Ranging not supported
     */
    FAIL_NO_CAPABILITY = 7u,
    /**
     * Request aborted for unknown reason
     */
    ABORTED = 8u,
    /**
     * Invalid T1-T4 timestamp
     */
    FAIL_INVALID_TS = 9u,
    /**
     * 11mc protocol failed
     */
    FAIL_PROTOCOL = 10u,
    /**
     * Request could not be scheduled
     */
    FAIL_SCHEDULE = 11u,
    /**
     * Responder cannot collaborate at time of request
     */
    FAIL_BUSY_TRY_LATER = 12u,
    /**
     * Bad request args
     */
    INVALID_REQ = 13u,
    /**
     * WiFi not enabled.
     */
    NO_WIFI = 14u,
    /**
     * Responder overrides param info, cannot range with new params
     */
    FAIL_FTM_PARAM_OVERRIDE = 15u,
};

/**
 * RTT peer types.
 */
enum class RttPeerType : uint32_t {
    AP = 1u /* 0x1 */,
    STA = 2u /* 0x2 */,
    P2P_GO = 3u /* 0x3 */,
    P2P_CLIENT = 4u /* 0x4 */,
    NAN = 5u /* 0x5 */,
};

/**
 * RTT Measurement Bandwidth.
 */
enum class RttBw : uint32_t {
    BW_5MHZ = 1u /* 0x01 */,
    BW_10MHZ = 2u /* 0x02 */,
    BW_20MHZ = 4u /* 0x04 */,
    BW_40MHZ = 8u /* 0x08 */,
    BW_80MHZ = 16u /* 0x10 */,
    BW_160MHZ = 32u /* 0x20 */,
};

/**
 * RTT Measurement Preamble.
 */
enum class RttPreamble : uint32_t {
    LEGACY = 1u /* 0x1 */,
    HT = 2u /* 0x2 */,
    VHT = 4u /* 0x4 */,
};

/**
 * RTT Types.
 */
enum class RttType : uint32_t {
    ONE_SIDED = 1u /* 0x1 */,
    TWO_SIDED = 2u /* 0x2 */,
};

/**
 * RTT configuration.
 */
struct RttConfig final {
    /**
     * Peer device mac address.
     */
    ::android::hardware::hidl_array<uint8_t, 6> addr __attribute__ ((aligned(1)));
    /**
     * 1-sided or 2-sided RTT.
     */
    ::android::hardware::wifi::V1_0::RttType type __attribute__ ((aligned(4)));
    /**
     * Optional - peer device hint (STA, P2P, AP).
     */
    ::android::hardware::wifi::V1_0::RttPeerType peer __attribute__ ((aligned(4)));
    /**
     * Required for STA-AP mode, optional for P2P, NBD etc.
     */
    ::android::hardware::wifi::V1_0::WifiChannelInfo channel __attribute__ ((aligned(4)));
    /**
     * Time interval between bursts (units: 100 ms).
     * Applies to 1-sided and 2-sided RTT multi-burst requests.
     * Range: 0-31, 0: no preference by initiator (2-sided RTT).
     */
    uint32_t burstPeriod __attribute__ ((aligned(4)));
    /**
     * Total number of RTT bursts to be executed. It will be
     * specified in the same way as the parameter "Number of
     * Burst Exponent" found in the FTM frame format. It
     * applies to both: 1-sided RTT and 2-sided RTT. Valid
     * values are 0 to 15 as defined in 802.11mc std.
     * 0 means single shot
     * The implication of this parameter on the maximum
     * number of RTT results is the following:
     * for 1-sided RTT: max num of RTT results = (2^num_burst)*(num_frames_per_burst)
     * for 2-sided RTT: max num of RTT results = (2^num_burst)*(num_frames_per_burst - 1)
     */
    uint32_t numBurst __attribute__ ((aligned(4)));
    /**
     * Num of frames per burst.
     * Minimum value = 1, Maximum value = 31
     * For 2-sided this equals the number of FTM frames
     * to be attempted in a single burst. This also
     * equals the number of FTM frames that the
     * initiator will request that the responder send
     * in a single frame.
     */
    uint32_t numFramesPerBurst __attribute__ ((aligned(4)));
    /**
     * Number of retries for a failed RTT frame.
     * Applies to 1-sided RTT only. Minimum value = 0, Maximum value = 3
     */
    uint32_t numRetriesPerRttFrame __attribute__ ((aligned(4)));
    /**
     * Following fields are only valid for 2-side RTT.
     *
     *
     * Maximum number of retries that the initiator can
     * retry an FTMR frame.
     * Minimum value = 0, Maximum value = 3
     */
    uint32_t numRetriesPerFtmr __attribute__ ((aligned(4)));
    /**
     * Whether to request location civic info or not.
     */
    bool mustRequestLci __attribute__ ((aligned(1)));
    /**
     * Whether to request location civic records or not.
     */
    bool mustRequestLcr __attribute__ ((aligned(1)));
    /**
     * Applies to 1-sided and 2-sided RTT. Valid values will
     * be 2-11 and 15 as specified by the 802.11mc std for
     * the FTM parameter burst duration. In a multi-burst
     * request, if responder overrides with larger value,
     * the initiator will return failure. In a single-burst
     * request if responder overrides with larger value,
     * the initiator will sent TMR_STOP to terminate RTT
     * at the end of the burst_duration it requested.
     */
    uint32_t burstDuration __attribute__ ((aligned(4)));
    /**
     * RTT preamble to be used in the RTT frames.
     */
    ::android::hardware::wifi::V1_0::RttPreamble preamble __attribute__ ((aligned(4)));
    /**
     * RTT BW to be used in the RTT frames.
     */
    ::android::hardware::wifi::V1_0::RttBw bw __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, addr) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, type) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, peer) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, channel) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, burstPeriod) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, numBurst) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, numFramesPerBurst) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, numRetriesPerRttFrame) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, numRetriesPerFtmr) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, mustRequestLci) == 52, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, mustRequestLcr) == 53, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, burstDuration) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, preamble) == 60, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttConfig, bw) == 64, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::RttConfig) == 68, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::RttConfig) == 4, "wrong alignment");

/**
 * RTT results.
 */
struct RttResult final {
    /**
     * Peer device mac address.
     */
    ::android::hardware::hidl_array<uint8_t, 6> addr __attribute__ ((aligned(1)));
    /**
     * Burst number in a multi-burst request.
     */
    uint32_t burstNum __attribute__ ((aligned(4)));
    /**
     * Total RTT measurement frames attempted.
     */
    uint32_t measurementNumber __attribute__ ((aligned(4)));
    /**
     * Total successful RTT measurement frames.
     */
    uint32_t successNumber __attribute__ ((aligned(4)));
    /**
     * Maximum number of "FTM frames per burst" supported by
     * the responder STA. Applies to 2-sided RTT only.
     * If reponder overrides with larger value:
     * - for single-burst request initiator will truncate the
     * larger value and send a TMR_STOP after receiving as
     * many frames as originally requested.
     * - for multi-burst request, initiator will return
     * failure right away.
     */
    uint8_t numberPerBurstPeer __attribute__ ((aligned(1)));
    /**
     * Ranging status.
     */
    ::android::hardware::wifi::V1_0::RttStatus status __attribute__ ((aligned(4)));
    /**
     * When status == RTT_STATUS_FAIL_BUSY_TRY_LATER,
     * this will be the time provided by the responder as to
     * when the request can be tried again. Applies to 2-sided
     * RTT only. In sec, 1-31sec.
     */
    uint8_t retryAfterDuration __attribute__ ((aligned(1)));
    /**
     * RTT type.
     */
    ::android::hardware::wifi::V1_0::RttType type __attribute__ ((aligned(4)));
    /**
     * Average rssi in 0.5 dB steps e.g. 143 implies -71.5 dB.
     */
    int32_t rssi __attribute__ ((aligned(4)));
    /**
     * Rssi spread in 0.5 dB steps e.g. 5 implies 2.5 dB spread (optional).
     */
    int32_t rssiSpread __attribute__ ((aligned(4)));
    /**
     * 1-sided RTT: TX rate of RTT frame.
     * 2-sided RTT: TX rate of initiator's Ack in response to FTM frame.
     */
    ::android::hardware::wifi::V1_0::WifiRateInfo txRate __attribute__ ((aligned(4)));
    /**
     * 1-sided RTT: TX rate of Ack from other side.
     * 2-sided RTT: TX rate of FTM frame coming from responder.
     */
    ::android::hardware::wifi::V1_0::WifiRateInfo rxRate __attribute__ ((aligned(4)));
    /**
     * Round trip time in picoseconds
     */
    uint64_t rtt __attribute__ ((aligned(8)));
    /**
     * Rtt standard deviation in picoseconds.
     */
    uint64_t rttSd __attribute__ ((aligned(8)));
    /**
     * Difference between max and min rtt times recorded in picoseconds.
     */
    uint64_t rttSpread __attribute__ ((aligned(8)));
    /**
     * Distance in mm (optional).
     */
    int32_t distanceInMm __attribute__ ((aligned(4)));
    /**
     * Standard deviation in mm (optional).
     */
    int32_t distanceSdInMm __attribute__ ((aligned(4)));
    /**
     * Difference between max and min distance recorded in mm (optional).
     */
    int32_t distanceSpreadInMm __attribute__ ((aligned(4)));
    /**
     * Time of the measurement (in microseconds since boot).
     */
    uint64_t timeStampInUs __attribute__ ((aligned(8)));
    /**
     * in ms, actual time taken by the FW to finish one burst
     * measurement. Applies to 1-sided and 2-sided RTT.
     */
    uint32_t burstDurationInMs __attribute__ ((aligned(4)));
    /**
     * Number of bursts allowed by the responder. Applies
     * to 2-sided RTT only.
     */
    uint32_t negotiatedBurstNum __attribute__ ((aligned(4)));
    /**
     * for 11mc only.
     */
    ::android::hardware::wifi::V1_0::WifiInformationElement lci __attribute__ ((aligned(8)));
    /**
     * for 11mc only.
     */
    ::android::hardware::wifi::V1_0::WifiInformationElement lcr __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, addr) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, burstNum) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, measurementNumber) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, successNumber) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, numberPerBurstPeer) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, status) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, retryAfterDuration) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, type) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, rssi) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, rssiSpread) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, txRate) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, rxRate) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, rtt) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, rttSd) == 96, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, rttSpread) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, distanceInMm) == 112, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, distanceSdInMm) == 116, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, distanceSpreadInMm) == 120, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, timeStampInUs) == 128, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, burstDurationInMs) == 136, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, negotiatedBurstNum) == 140, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, lci) == 144, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResult, lcr) == 168, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::RttResult) == 192, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::RttResult) == 8, "wrong alignment");

/**
 * RTT Capabilities.
 */
struct RttCapabilities final {
    /**
     * if 1-sided rtt data collection is supported.
     */
    bool rttOneSidedSupported __attribute__ ((aligned(1)));
    /**
     * if ftm rtt data collection is supported.
     */
    bool rttFtmSupported __attribute__ ((aligned(1)));
    /**
     * if initiator supports LCI request. Applies to 2-sided RTT.
     */
    bool lciSupported __attribute__ ((aligned(1)));
    /**
     * if initiator supports LCR request. Applies to 2-sided RTT.
     */
    bool lcrSupported __attribute__ ((aligned(1)));
    /**
     * if 11mc responder mode is supported.
     */
    bool responderSupported __attribute__ ((aligned(1)));
    /**
     * Bit mask indicates what preamble is supported by initiator.
     * Combination of |RttPreamble| values.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::wifi::V1_0::RttPreamble> preambleSupport __attribute__ ((aligned(4)));
    /**
     * Bit mask indicates what BW is supported by initiator.
     * Combination of |RttBw| values.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::wifi::V1_0::RttBw> bwSupport __attribute__ ((aligned(4)));
    /**
     * Draft 11mc spec version supported by chip.
     * For instance, version 4.0 must be 40 and version 4.3 must be 43 etc.
     */
    uint8_t mcVersion __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::RttCapabilities, rttOneSidedSupported) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttCapabilities, rttFtmSupported) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttCapabilities, lciSupported) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttCapabilities, lcrSupported) == 3, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttCapabilities, responderSupported) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttCapabilities, preambleSupport) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttCapabilities, bwSupport) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttCapabilities, mcVersion) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::RttCapabilities) == 20, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::RttCapabilities) == 4, "wrong alignment");

/**
 * Structs for setting LCI/LCR information to be provided to a requestor.
 */
enum class RttMotionPattern : uint32_t {
    /**
     * Not expected to change location.
     */
    NOT_EXPECTED = 0u,
    /**
     * Expected to change location.
     */
    EXPECTED = 1u,
    /**
     * Movement pattern unknown.
     */
    UNKNOWN = 2u,
};

/**
 * Movement pattern unknown.
 */
struct RttLciInformation final {
    /**
     * latitude in degrees * 2^25 , 2's complement.
     */
    int64_t latitude __attribute__ ((aligned(8)));
    /**
     * longitude in degrees * 2^25 , 2's complement.
     */
    int64_t longitude __attribute__ ((aligned(8)));
    /**
     * Altitude in units of 1/256 m.
     */
    int32_t altitude __attribute__ ((aligned(4)));
    /**
     * As defined in Section 2.3.2 of IETF RFC 6225.
     */
    uint8_t latitudeUnc __attribute__ ((aligned(1)));
    /**
     * As defined in Section 2.3.2 of IETF RFC 6225.
     */
    uint8_t longitudeUnc __attribute__ ((aligned(1)));
    /**
     * As defined in Section 2.4.5 from IETF RFC 6225.
     */
    uint8_t altitudeUnc __attribute__ ((aligned(1)));
    /**
     * Following element for configuring the Z subelement.
     *
     *
     * Motion pattern type.
     */
    ::android::hardware::wifi::V1_0::RttMotionPattern motionPattern __attribute__ ((aligned(4)));
    /**
     * Floor in units of 1/16th of floor. 0x80000000 if unknown.
     */
    int32_t floor __attribute__ ((aligned(4)));
    /**
     * in units of 1/64 m.
     */
    int32_t heightAboveFloor __attribute__ ((aligned(4)));
    /**
     * in units of 1/64 m. 0 if unknown
     */
    int32_t heightUnc __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::RttLciInformation, latitude) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttLciInformation, longitude) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttLciInformation, altitude) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttLciInformation, latitudeUnc) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttLciInformation, longitudeUnc) == 21, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttLciInformation, altitudeUnc) == 22, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttLciInformation, motionPattern) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttLciInformation, floor) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttLciInformation, heightAboveFloor) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttLciInformation, heightUnc) == 36, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::RttLciInformation) == 40, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::RttLciInformation) == 8, "wrong alignment");

struct RttLcrInformation final {
    /**
     * Country code symbol.
     */
    ::android::hardware::hidl_array<int8_t, 2> countryCode __attribute__ ((aligned(1)));
    /**
     * Civic info to be copied in FTM frame.
     */
    ::android::hardware::hidl_string civicInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::RttLcrInformation, countryCode) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttLcrInformation, civicInfo) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::RttLcrInformation) == 24, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::RttLcrInformation) == 8, "wrong alignment");

/**
 * RTT Responder information
 */
struct RttResponder final {
    ::android::hardware::wifi::V1_0::WifiChannelInfo channel __attribute__ ((aligned(4)));
    ::android::hardware::wifi::V1_0::RttPreamble preamble __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::RttResponder, channel) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::RttResponder, preamble) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::RttResponder) == 20, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::RttResponder) == 4, "wrong alignment");

/**
 * Debug data specific types.
 * TODO(b/32159498): Move to a separate debug_types.hal.
 */
typedef uint32_t WifiRingBufferId;

/**
 * Flags describing each debug ring buffer.
 */
enum class WifiDebugRingBufferFlags : uint32_t {
    HAS_BINARY_ENTRIES = 1u /* 1 << 0 */,
    HAS_ASCII_ENTRIES = 2u /* 1 << 1 */,
    HAS_PER_PACKET_ENTRIES = 4u /* 1 << 2 */,
};

/**
 * Struct describing each debug ring buffer supported by
 * the device.
 */
struct WifiDebugRingBufferStatus final {
    /**
     * Name of this debug ring buffer.
     */
    ::android::hardware::hidl_string ringName __attribute__ ((aligned(8)));
    /**
     * Combination of |WifiDebugRingBufferFlags| values.
     */
    uint32_t flags __attribute__ ((aligned(4)));
    /**
     * Unique integer representing the ring.
     */
    uint32_t ringId __attribute__ ((aligned(4)));
    /**
     * Total memory size allocated for the buffer.
     */
    uint32_t sizeInBytes __attribute__ ((aligned(4)));
    /**
     * Amount of free space in the buffer.
     */
    uint32_t freeSizeInBytes __attribute__ ((aligned(4)));
    /**
     * Verbose level for ring buffer.
     */
    uint32_t verboseLevel __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugRingBufferStatus, ringName) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugRingBufferStatus, flags) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugRingBufferStatus, ringId) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugRingBufferStatus, sizeInBytes) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugRingBufferStatus, freeSizeInBytes) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugRingBufferStatus, verboseLevel) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiDebugRingBufferStatus) == 40, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiDebugRingBufferStatus) == 8, "wrong alignment");

/**
 * Verbose logging level to set for each debug ring buffer supported
 * by the device.
 */
enum class WifiDebugRingBufferVerboseLevel : uint32_t {
    /**
     * Level 0 corresponds to no collection, and it makes log handler
     * stop by no more events from driver.
     */
    NONE = 0u,
    /**
     * Level 1 correspond to normal log level, with minimal user impact.
     * This is the default value.
     */
    DEFAULT = 1u,
    /**
     * Level 2 is enabled when user is lazily trying to reproduce a problem,
     * wifi performances and power can be impacted but device should not
     * otherwise be significantly impacted.
     */
    VERBOSE = 2u,
    /**
     * Level 3 is used when trying to actively debug a problem.
     * This will cause sever performance degradation.
     */
    EXCESSIVE = 3u,
};

/**
 * Enum describing the fate of the TX packets.
 */
enum class WifiDebugTxPacketFate : uint32_t {
    /**
     * Sent over air and ACKed.
     */
    ACKED = 0u,
    /**
     * Sent over air but not ACKed. (Normal for broadcast/multicast.)
     */
    SENT = 1u /* ::android::hardware::wifi::V1_0::WifiDebugTxPacketFate.ACKED implicitly + 1 */,
    /**
     * Queued within firmware, but not yet sent over air.
     */
    FW_QUEUED = 2u /* ::android::hardware::wifi::V1_0::WifiDebugTxPacketFate.SENT implicitly + 1 */,
    /**
     * Dropped by firmware as invalid. E.g. bad source address, bad checksum,
     * or invalid for current state.
     */
    FW_DROP_INVALID = 3u /* ::android::hardware::wifi::V1_0::WifiDebugTxPacketFate.FW_QUEUED implicitly + 1 */,
    /**
     * Dropped by firmware due to lack of buffer space.
     */
    FW_DROP_NOBUFS = 4u /* ::android::hardware::wifi::V1_0::WifiDebugTxPacketFate.FW_DROP_INVALID implicitly + 1 */,
    /**
     * Dropped by firmware for any other reason. Includes frames that  were sent
     * by driver to firmware, but unaccounted for by  firmware.
     */
    FW_DROP_OTHER = 5u /* ::android::hardware::wifi::V1_0::WifiDebugTxPacketFate.FW_DROP_NOBUFS implicitly + 1 */,
    /**
     * Queued within driver, not yet sent to firmware.
     */
    DRV_QUEUED = 6u /* ::android::hardware::wifi::V1_0::WifiDebugTxPacketFate.FW_DROP_OTHER implicitly + 1 */,
    /**
     * Dropped by driver as invalid. E.g. bad source address, or invalid for
     * current state.
     */
    DRV_DROP_INVALID = 7u /* ::android::hardware::wifi::V1_0::WifiDebugTxPacketFate.DRV_QUEUED implicitly + 1 */,
    /**
     * Dropped by driver due to lack of buffer space.
     */
    DRV_DROP_NOBUFS = 8u /* ::android::hardware::wifi::V1_0::WifiDebugTxPacketFate.DRV_DROP_INVALID implicitly + 1 */,
    /**
     * Dropped by driver for any other reason.
     */
    DRV_DROP_OTHER = 9u /* ::android::hardware::wifi::V1_0::WifiDebugTxPacketFate.DRV_DROP_NOBUFS implicitly + 1 */,
};

/**
 * Enum describing the fate of the TX packets.
 */
enum class WifiDebugRxPacketFate : uint32_t {
    /**
     * Valid and delivered to network stack (e.g., netif_rx()).
     */
    SUCCESS = 0u,
    /**
     * Queued within firmware, but not yet sent to driver.
     */
    FW_QUEUED = 1u /* ::android::hardware::wifi::V1_0::WifiDebugRxPacketFate.SUCCESS implicitly + 1 */,
    /**
     * Dropped by firmware due to host-programmable filters.
     */
    FW_DROP_FILTER = 2u /* ::android::hardware::wifi::V1_0::WifiDebugRxPacketFate.FW_QUEUED implicitly + 1 */,
    /**
     * Dropped by firmware as invalid. E.g. bad checksum, decrypt failed,
     * or invalid for current state.
     */
    FW_DROP_INVALID = 3u /* ::android::hardware::wifi::V1_0::WifiDebugRxPacketFate.FW_DROP_FILTER implicitly + 1 */,
    /**
     * Dropped by firmware due to lack of buffer space.
     */
    FW_DROP_NOBUFS = 4u /* ::android::hardware::wifi::V1_0::WifiDebugRxPacketFate.FW_DROP_INVALID implicitly + 1 */,
    /**
     * Dropped by firmware for any other reason.
     */
    FW_DROP_OTHER = 5u /* ::android::hardware::wifi::V1_0::WifiDebugRxPacketFate.FW_DROP_NOBUFS implicitly + 1 */,
    /**
     * Queued within driver, not yet delivered to network stack.
     */
    DRV_QUEUED = 6u /* ::android::hardware::wifi::V1_0::WifiDebugRxPacketFate.FW_DROP_OTHER implicitly + 1 */,
    /**
     * Dropped by driver due to filter rules.
     */
    DRV_DROP_FILTER = 7u /* ::android::hardware::wifi::V1_0::WifiDebugRxPacketFate.DRV_QUEUED implicitly + 1 */,
    /**
     * Dropped by driver as invalid. E.g. not permitted in current state.
     */
    DRV_DROP_INVALID = 8u /* ::android::hardware::wifi::V1_0::WifiDebugRxPacketFate.DRV_DROP_FILTER implicitly + 1 */,
    /**
     * Dropped by driver due to lack of buffer space.
     */
    DRV_DROP_NOBUFS = 9u /* ::android::hardware::wifi::V1_0::WifiDebugRxPacketFate.DRV_DROP_INVALID implicitly + 1 */,
    /**
     * Dropped by driver for any other reason.
     */
    DRV_DROP_OTHER = 10u /* ::android::hardware::wifi::V1_0::WifiDebugRxPacketFate.DRV_DROP_NOBUFS implicitly + 1 */,
};

/**
 * Type of frame transmitted/received.
 */
enum class WifiDebugPacketFateFrameType : uint32_t {
    UNKNOWN = 0u,
    ETHERNET_II = 1u /* ::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameType.UNKNOWN implicitly + 1 */,
    MGMT_80211 = 2u /* ::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameType.ETHERNET_II implicitly + 1 */,
};

/**
 * Information regarding the frame transmitted/received.
 */
struct WifiDebugPacketFateFrameInfo final {
    /**
     * The type of MAC-layer frame that this frame_info holds.
     * - For data frames, use FRAME_TYPE_ETHERNET_II.
     * - For management frames, use FRAME_TYPE_80211_MGMT.
     * - If the type of the frame is unknown, use FRAME_TYPE_UNKNOWN.
     */
    ::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameType frameType __attribute__ ((aligned(4)));
    /**
     * The number of bytes included in |frameContent|.
     * If the frame  contents are missing (e.g. RX frame dropped in firmware),
     * |frameLen| must be set to 0.
     */
    uint64_t frameLen __attribute__ ((aligned(8)));
    /**
     * Host clock when this frame was received by the driver (either  outbound
     * from the host network stack, or inbound from the firmware).
     * - The timestamp must be taken from a clock which includes time the host
     *   spent suspended (e.g. ktime_get_boottime()).
     * - If no host timestamp is available (e.g. RX frame was dropped in firmware),
     *   this field must be set to 0.
     */
    uint64_t driverTimestampUsec __attribute__ ((aligned(8)));
    /**
     * Firmware clock when this frame was received by the firmware
     * (either outbound from the host, or inbound from a remote  station).
     * - The timestamp must be taken from a clock which includes time firmware
     *   spent suspended (if applicable).
     * - If no firmware timestamp is available (e.g. TX frame was dropped by
     *   driver), this field must be set to 0.
     * - Consumers of |frameInfo| must not assume any synchronization between
     *   driver and firmware clocks.
     */
    uint64_t firmwareTimestampUsec __attribute__ ((aligned(8)));
    /**
     * Actual frame content. This is the raw bytes of the corresponding packet.
     * - Should be provided for TX frames originated by the host.
     * - Should be provided for RX frames received by the driver.
     * - Optionally provided for TX frames originated by firmware.
     *   (At discretion of HAL implementation.)
     * - Optionally provided for RX frames dropped in firmware.
     *   (At discretion of HAL implementation.)
     * - If frame content is not provided, |frameLen| must be set to 0.
     */
    ::android::hardware::hidl_vec<uint8_t> frameContent __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameInfo, frameType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameInfo, frameLen) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameInfo, driverTimestampUsec) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameInfo, firmwareTimestampUsec) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameInfo, frameContent) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameInfo) == 48, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameInfo) == 8, "wrong alignment");

/**
 * Struct describing packet fate report for each Tx frame.
 */
struct WifiDebugTxPacketFateReport final {
    ::android::hardware::wifi::V1_0::WifiDebugTxPacketFate fate __attribute__ ((aligned(4)));
    ::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameInfo frameInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugTxPacketFateReport, fate) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugTxPacketFateReport, frameInfo) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiDebugTxPacketFateReport) == 56, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiDebugTxPacketFateReport) == 8, "wrong alignment");

/**
 * Struct describing packet fate report for each Rx frame.
 */
struct WifiDebugRxPacketFateReport final {
    ::android::hardware::wifi::V1_0::WifiDebugRxPacketFate fate __attribute__ ((aligned(4)));
    ::android::hardware::wifi::V1_0::WifiDebugPacketFateFrameInfo frameInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugRxPacketFateReport, fate) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugRxPacketFateReport, frameInfo) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiDebugRxPacketFateReport) == 56, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiDebugRxPacketFateReport) == 8, "wrong alignment");

/**
 * Struct capturing the count of all rx packets that caused
 * host wakeup.
 */
struct WifiDebugHostWakeReasonRxPacketDetails final {
    /**
     * Total rx unicast packet which woke up host.
     */
    uint32_t rxUnicastCnt __attribute__ ((aligned(4)));
    /**
     * Total rx multicast packet which woke up host.
     */
    uint32_t rxMulticastCnt __attribute__ ((aligned(4)));
    /**
     * Total rx broadcast packet which woke up host.
     */
    uint32_t rxBroadcastCnt __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxPacketDetails, rxUnicastCnt) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxPacketDetails, rxMulticastCnt) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxPacketDetails, rxBroadcastCnt) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxPacketDetails) == 12, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxPacketDetails) == 4, "wrong alignment");

/**
 * Struct capturing the count of all rx multicast packets that caused
 * host wakeup.
 */
struct WifiDebugHostWakeReasonRxMulticastPacketDetails final {
    /**
     * Rx wake packet was ipv4 multicast.
     */
    uint32_t ipv4RxMulticastAddrCnt __attribute__ ((aligned(4)));
    /**
     * Rx wake packet was ipv6 multicast.
     */
    uint32_t ipv6RxMulticastAddrCnt __attribute__ ((aligned(4)));
    /**
     * Rx wake packet was non-ipv4 and non-ipv6.
     */
    uint32_t otherRxMulticastAddrCnt __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxMulticastPacketDetails, ipv4RxMulticastAddrCnt) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxMulticastPacketDetails, ipv6RxMulticastAddrCnt) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxMulticastPacketDetails, otherRxMulticastAddrCnt) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxMulticastPacketDetails) == 12, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxMulticastPacketDetails) == 4, "wrong alignment");

/**
 * Struct capturing the count of all rx ICMP packets that caused
 * host wakeup.
 */
struct WifiDebugHostWakeReasonRxIcmpPacketDetails final {
    /**
     * Wake icmp packet count.
     */
    uint32_t icmpPkt __attribute__ ((aligned(4)));
    /**
     * Wake icmp6 packet count.
     */
    uint32_t icmp6Pkt __attribute__ ((aligned(4)));
    /**
     * Wake icmp6 RA packet count.
     */
    uint32_t icmp6Ra __attribute__ ((aligned(4)));
    /**
     * Wake icmp6 NA packet count.
     */
    uint32_t icmp6Na __attribute__ ((aligned(4)));
    /**
     * Wake icmp6 NS packet count.
     */
    uint32_t icmp6Ns __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxIcmpPacketDetails, icmpPkt) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxIcmpPacketDetails, icmp6Pkt) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxIcmpPacketDetails, icmp6Ra) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxIcmpPacketDetails, icmp6Na) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxIcmpPacketDetails, icmp6Ns) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxIcmpPacketDetails) == 20, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxIcmpPacketDetails) == 4, "wrong alignment");

/**
 * Structure capturing the count of all the wireless related host wakeup.
 * This is used to capture all the reasons why the host processor
 * (WLAN driver) was woken up by the WLAN firmware.
 * These stats may be used to debug any power issues caused due to frequent
 * wakeup of the host processor by the WLAN firmware.
 */
struct WifiDebugHostWakeReasonStats final {
    /**
     * Total count of cmd/event wakes.
     * These must account for all wakeups due to WLAN management
     * commands/events received over the air.
     */
    uint32_t totalCmdEventWakeCnt __attribute__ ((aligned(4)));
    /**
     * Vector of wake counts per cmd/event type.
     * The number of command types and their meaning is only understood by the
     * vendor.
     */
    ::android::hardware::hidl_vec<uint32_t> cmdEventWakeCntPerType __attribute__ ((aligned(8)));
    /**
     * Total count of drive/fw wakes.
     * These must account for all wakeups due to local driver/firmware
     * interactions. These include all vendor implementation specific
     * interactions like any heart-beat monitoring, Bus management, etc.
     */
    uint32_t totalDriverFwLocalWakeCnt __attribute__ ((aligned(4)));
    /**
     * Vector of wake counts per driver/firmware interaction type.
     * The number of command types and their meaning is only understood by the
     * vendor.
     */
    ::android::hardware::hidl_vec<uint32_t> driverFwLocalWakeCntPerType __attribute__ ((aligned(8)));
    /**
     * Total data rx packets, that woke up host.
     */
    uint32_t totalRxPacketWakeCnt __attribute__ ((aligned(4)));
    ::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxPacketDetails rxPktWakeDetails __attribute__ ((aligned(4)));
    ::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxMulticastPacketDetails rxMulticastPkWakeDetails __attribute__ ((aligned(4)));
    ::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonRxIcmpPacketDetails rxIcmpPkWakeDetails __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonStats, totalCmdEventWakeCnt) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonStats, cmdEventWakeCntPerType) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonStats, totalDriverFwLocalWakeCnt) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonStats, driverFwLocalWakeCntPerType) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonStats, totalRxPacketWakeCnt) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonStats, rxPktWakeDetails) == 52, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonStats, rxMulticastPkWakeDetails) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonStats, rxIcmpPkWakeDetails) == 76, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonStats) == 96, "wrong size");
static_assert(__alignof(::android::hardware::wifi::V1_0::WifiDebugHostWakeReasonStats) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint32_t o);
static inline std::string toString(::android::hardware::wifi::V1_0::WifiStatusCode o);
static inline void PrintTo(::android::hardware::wifi::V1_0::WifiStatusCode o, ::std::ostream* os);
constexpr uint32_t operator|(const ::android::hardware::wifi::V1_0::WifiStatusCode lhs, const ::android::hardware::wifi::V1_0::WifiStatusCode rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const uint32_t lhs, const ::android::hardware::wifi::V1_0::WifiStatusCode rhs) {
    return static_cast<uint32_t>(lhs | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const ::android::hardware::wifi::V1_0::WifiStatusCode lhs, const uint32_t rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | rhs);
