{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "linker_set_key" : "_ZTIs",
   "name" : "short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIs",
   "size" : 2
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" :
 [
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 0,
     "name" : "CURLSHE_OK"
    },

     "enum_field_value" : 12,
     "name" : "CURLUE_NO_PASSWORD"
    },
    {
     "enum_field_value" : 13,
     "name" : "CURLUE_NO_OPTIONS"
    },
    {
     "enum_field_value" : 14,
     "name" : "CURLUE_NO_HOST"
    },
    {
     "enum_field_value" : 15,
     "name" : "CURLUE_NO_PORT"
    },
    {
     "enum_field_value" : 16,
     "name" : "CURLUE_NO_QUERY"
    },
    {
     "enum_field_value" : 17,
     "name" : "CURLUE_NO_FRAGMENT"
    }
   ],
   "linker_set_key" : "_ZTI9CURLUcode",
   "name" : "CURLUcode",
   "referenced_type" : "_ZTI9CURLUcode",
   "self_type" : "_ZTI9CURLUcode",
   "size" : 4,
   "source_file" : "external/curl/include/curl/urlapi.h",
   "underlying_type" : "_ZTIj"
  },
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 0,
     "name" : "CURLIOCMD_NOP"
    },
    {
     "enum_field_value" : 1,
     "name" : "CURLIOCMD_RESTARTREAD"
    },
    {
     "enum_field_value" : 2,
     "name" : "CURLIOCMD_LAST"
    }
   ],
   "linker_set_key" : "_ZTI9curliocmd",
   "name" : "curliocmd",
   "referenced_type" : "_ZTI9curliocmd",
   "self_type" : "_ZTI9curliocmd",
   "size" : 4,
   "source_file" : "external/curl/include/curl/curl.h",
   "underlying_type" : "_ZTIj"
  },
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 0,
     "name" : "CURLIOE_OK"
    },
    {
     "enum_field_value" : 1,
     "name" : "CURLIOE_UNKNOWNCMD"
    },
    {
     "enum_field_value" : 2,
     "name" : "CURLIOE_FAILRESTART"
    },
    {
     "enum_field_value" : 3,
     "name" : "CURLIOE_LAST"
    }
   ],
   "linker_set_key" : "_ZTI9curlioerr",
   "name" : "curlioerr",
   "referenced_type" : "_ZTI9curlioerr",
   "self_type" : "_ZTI9curlioerr",
   "size" : 4,
   "source_file" : "external/curl/include/curl/curl.h",
   "underlying_type" : "_ZTIj"
  }
 ],
 "function_types" : [],
 "functions" :
 [
  {
   "function_name" : "curl_easy_option_by_id",
   "linker_set_key" : "curl_easy_option_by_id",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTI10CURLoption"
    }
   ],
   "return_type" : "_ZTIPK15curl_easyoption",
   "source_file" : "external/curl/include/curl/options.h"
  },
  {
   "function_name" : "curl_easy_option_by_name",
   "linker_set_key" : "curl_easy_option_by_name",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "return_type" : "_ZTIPK15curl_easyoption",
   "source_file" : "external/curl/include/curl/options.h"
  },
  {
   "function_name" : "curl_easy_option_next",
   "linker_set_key" : "curl_easy_option_next",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK15curl_easyoption"
    }
   ],
   "return_type" : "_ZTIPK15curl_easyoption",
   "source_file" : "external/curl/include/curl/options.h"
  }
 ],
 "global_vars" : [],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP10curl_slist",
   "name" : "curl_slist *",
   "referenced_type" : "_ZTI10curl_slist",
   "self_type" : "_ZTIP10curl_slist",
   "size" : 8,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP13curl_httppost",
   "name" : "curl_httppost *",
   "referenced_type" : "_ZTI13curl_httppost",
   "self_type" : "_ZTIP13curl_httppost",
   "size" : 8,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP9Curl_easy",
   "name" : "Curl_easy *",
   "referenced_type" : "_ZTI9Curl_easy",
   "self_type" : "_ZTIP9Curl_easy",
   "size" : 8,
   "source_file" : "external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK15curl_easyoption",
   "name" : "const curl_easyoption *",
   "referenced_type" : "_ZTIK15curl_easyoption",
   "self_type" : "_ZTIPK15curl_easyoption",
   "size" : 8,
   "source_file" : "external/curl/include/curl/options.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKPKc",
   "name" : "const char *const *",
   "referenced_type" : "_ZTIKPKc",
   "self_type" : "_ZTIPKPKc",
   "size" : 8,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 8,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP10curl_slist",
   "name" : "curl_slist **",
   "referenced_type" : "_ZTIP10curl_slist",
   "self_type" : "_ZTIPP10curl_slist",
   "size" : 8,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/curl/include/curl/curl.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK15curl_easyoption",
   "name" : "const curl_easyoption",
   "referenced_type" : "_ZTI15curl_easyoption",
   "self_type" : "_ZTIK15curl_easyoption",
   "size" : 24,
   "source_file" : "external/curl/include/curl/options.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/curl/include/curl/curl.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "option",
     "referenced_type" : "_ZTI14CURLformoption"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI10curl_forms",
   "name" : "curl_forms",
   "referenced_type" : "_ZTI10curl_forms",
   "self_type" : "_ZTI10curl_forms",
   "size" : 16,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "keytype",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11curl_khtype"
    }
   ],
   "linker_set_key" : "_ZTI10curl_khkey",
   "name" : "curl_khkey",
   "referenced_type" : "_ZTI10curl_khkey",
   "self_type" : "_ZTI10curl_khkey",
   "size" : 24,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "next",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP10curl_slist"
    }
   ],
   "linker_set_key" : "_ZTI10curl_slist",
   "name" : "curl_slist",
   "referenced_type" : "_ZTI10curl_slist",
   "self_type" : "_ZTI10curl_slist",
   "size" : 16,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "events",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "revents",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI11curl_waitfd",
   "name" : "curl_waitfd",
   "referenced_type" : "_ZTI11curl_waitfd",
   "self_type" : "_ZTI11curl_waitfd",
   "size" : 8,
   "source_file" : "external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "num_of_certs",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "certinfo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPP10curl_slist"
    }
   ],
   "linker_set_key" : "_ZTI13curl_certinfo",
   "name" : "curl_certinfo",
   "referenced_type" : "_ZTI13curl_certinfo",
   "self_type" : "_ZTI13curl_certinfo",
   "size" : 16,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "filename",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "filetype",
     "field_offset" : 64,
     "referenced_type" : "_ZTI12curlfiletype"
    },
    {
     "field_name" : "time",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "perm",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "gid",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "size",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "hardlinks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "strings",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN13curl_fileinfoUt_E"
    },
    {
     "field_name" : "flags",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "b_data",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "b_size",
     "field_offset" : 896,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "b_used",
     "field_offset" : 960,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI13curl_fileinfo",
   "name" : "curl_fileinfo",
   "referenced_type" : "_ZTI13curl_fileinfo",
   "self_type" : "_ZTI13curl_fileinfo",
   "size" : 128,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP13curl_httppost"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "namelength",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "contents",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "contentslength",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "bufferlength",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "contenttype",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "contentheader",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP10curl_slist"
    },
    {
     "field_name" : "more",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP13curl_httppost"
    },
    {
     "field_name" : "flags",
     "field_offset" : 640,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "showfilename",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "userp",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "contentlen",
     "field_offset" : 832,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI13curl_httppost",
   "name" : "curl_httppost",
   "referenced_type" : "_ZTI13curl_httppost",
   "self_type" : "_ZTI13curl_httppost",
   "size" : 112,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "family",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "socktype",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "protocol",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "addrlen",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "addr",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sockaddr"
    }
   ],
   "linker_set_key" : "_ZTI13curl_sockaddr",
   "name" : "curl_sockaddr",
   "referenced_type" : "_ZTI13curl_sockaddr",
   "self_type" : "_ZTI13curl_sockaddr",
   "size" : 32,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "id",
     "field_offset" : 64,
     "referenced_type" : "_ZTI10CURLoption"
    },
    {
     "field_name" : "type",
     "field_offset" : 96,
     "referenced_type" : "_ZTI13curl_easytype"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15curl_easyoption",
   "name" : "curl_easyoption",
   "referenced_type" : "_ZTI15curl_easyoption",
   "self_type" : "_ZTI15curl_easyoption",
   "size" : 24,
   "source_file" : "external/curl/include/curl/options.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTI15curl_sslbackend"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI16curl_ssl_backend",
   "name" : "curl_ssl_backend",
   "referenced_type" : "_ZTI16curl_ssl_backend",
   "self_type" : "_ZTI16curl_ssl_backend",
   "size" : 16,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "backend",
     "referenced_type" : "_ZTI15curl_sslbackend"
    },
    {
     "field_name" : "internals",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19curl_tlssessioninfo",
   "name" : "curl_tlssessioninfo",
   "referenced_type" : "_ZTI19curl_tlssessioninfo",
   "self_type" : "_ZTI19curl_tlssessioninfo",
   "size" : 16,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "age",
     "referenced_type" : "_ZTI11CURLversion"
    },
    {
     "field_name" : "version",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "version_num",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "host",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "features",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ssl_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "ssl_version_num",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "libz_version",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "protocols",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPKPKc"
    },
    {
     "field_name" : "ares",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "ares_num",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "libidn",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "iconv_ver_num",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "libssh_version",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "brotli_ver_num",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "brotli_version",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "nghttp2_ver_num",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nghttp2_version",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "quic_version",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "cainfo",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "capath",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "zstd_ver_num",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "zstd_version",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI22curl_version_info_data",
   "name" : "curl_version_info_data",
   "referenced_type" : "_ZTI22curl_version_info_data",
   "self_type" : "_ZTI22curl_version_info_data",
   "size" : 184,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "msg",
     "referenced_type" : "_ZTI7CURLMSG"
    },
    {
     "field_name" : "easy_handle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9Curl_easy"
    },
    {
     "field_name" : "data",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7CURLMsgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7CURLMsg",
   "name" : "CURLMsg",
   "referenced_type" : "_ZTI7CURLMsg",
   "self_type" : "_ZTI7CURLMsg",
   "size" : 24,
   "source_file" : "external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI9curl_blob",
   "name" : "curl_blob",
   "referenced_type" : "_ZTI9curl_blob",
   "self_type" : "_ZTI9curl_blob",
   "size" : 24,
   "source_file" : "external/curl/include/curl/easy.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "time",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "perm",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "user",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "group",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "target",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN13curl_fileinfoUt_E",
   "name" : "curl_fileinfo::(anonymous struct at external/curl/include/curl/curl.h:304:3)",
   "referenced_type" : "_ZTIN13curl_fileinfoUt_E",
   "self_type" : "_ZTIN13curl_fileinfoUt_E",
   "size" : 40,
   "source_file" : "external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "whatever",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "result",
     "referenced_type" : "_ZTI8CURLcode"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7CURLMsgUt_E",
   "name" : "CURLMsg::(anonymous union at external/curl/include/curl/multi.h:100:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7CURLMsgUt_E",
   "self_type" : "_ZTIN7CURLMsgUt_E",
   "size" : 8,
   "source_file" : "external/curl/include/curl/multi.h"
  }
 ],
 "rvalue_reference_types" : []
}
