{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA2_m",
   "name" : "unsigned long [2]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA2_m",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfLocation.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {

   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/MapInfo.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11unwindstack8DwarfCieE",
   "name" : "const unwindstack::DwarfCie",
   "referenced_type" : "_ZTIN11unwindstack8DwarfCieE",
   "self_type" : "_ZTIKN11unwindstack8DwarfCieE",
   "size" : 88,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfLocation.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11unwindstack8DwarfFdeE",
   "name" : "const unwindstack::DwarfFde",
   "referenced_type" : "_ZTIN11unwindstack8DwarfFdeE",
   "self_type" : "_ZTIKN11unwindstack8DwarfFdeE",
   "size" : 56,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfSection.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11unwindstack9ErrorDataE",
   "name" : "const unwindstack::ErrorData",
   "referenced_type" : "_ZTIN11unwindstack9ErrorDataE",
   "self_type" : "_ZTIKN11unwindstack9ErrorDataE",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/SharedString.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__113unordered_mapImN11unwindstack8LoadInfoENS_4hashImEENS_8equal_toImEENS_9allocatorINS_4pairIKmS2_EEEEEE",
   "name" : "const std::unordered_map<unsigned long, unwindstack::LoadInfo, std::hash<unsigned long>, std::equal_to<unsigned long>, std::allocator<std::pair<const unsigned long, unwindstack::LoadInfo>>>",
   "referenced_type" : "_ZTINSt3__113unordered_mapImN11unwindstack8LoadInfoENS_4hashImEENS_8equal_toImEENS_9allocatorINS_4pairIKmS2_EEEEEE",
   "self_type" : "_ZTIKNSt3__113unordered_mapImN11unwindstack8LoadInfoENS_4hashImEENS_8equal_toImEENS_9allocatorINS_4pairIKmS2_EEEEEE",
   "size" : 40,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/SharedString.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfStructs.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN11unwindstack10ElfTypes32E",
   "name" : "unwindstack::ElfTypes32",
   "referenced_type" : "_ZTIN11unwindstack10ElfTypes32E",
   "self_type" : "_ZTIN11unwindstack10ElfTypes32E",
   "size" : 1,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN11unwindstack10ElfTypes64E",
   "name" : "unwindstack::ElfTypes64",
   "referenced_type" : "_ZTIN11unwindstack10ElfTypes64E",
   "self_type" : "_ZTIN11unwindstack10ElfTypes64E",
   "size" : 1,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN11unwindstack8RegsImplImEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack10RegsX86_64E",
   "name" : "unwindstack::RegsX86_64",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack10RegsX86_64E",
   "self_type" : "_ZTIN11unwindstack10RegsX86_64E",
   "size" : 48,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/RegsX86_64.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack10RegsX86_64E"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_64D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_64D0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_644ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplImE7RawDataEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_642pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_642spEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_646set_pcEm"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_646set_spEm"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs11fallback_pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs20ResetPseudoRegistersEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17SetPseudoRegisterEtm"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17GetPseudoRegisterEtPm"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_6419StepIfSignalHandlerEmPNS_3ElfEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_6422SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_6416IterateRegistersENSt3__18functionIFvPKcmEEE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_645CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "memory_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN11unwindstack6MemoryE"
    },
    {
     "access" : "private",
     "field_name" : "cur_offset_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "pc_offset_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "access" : "private",
     "field_name" : "data_offset_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "func_offset_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "text_offset_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack11DwarfMemoryE",
   "name" : "unwindstack::DwarfMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack11DwarfMemoryE",
   "self_type" : "_ZTIN11unwindstack11DwarfMemoryE",
   "size" : 56,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfMemory.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack11DwarfMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11DwarfMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11DwarfMemoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_26bidirectional_iterator_tagEPN11unwindstack8DwarfFdeElPS4_RS4_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fdes_",
     "referenced_type" : "_ZTINSt3__16vectorIPKN11unwindstack8DwarfFdeENS_9allocatorIS4_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "index_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack12DwarfSection8iteratorE",
   "name" : "unwindstack::DwarfSection::iterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack12DwarfSection8iteratorE",
   "self_type" : "_ZTIN11unwindstack12DwarfSection8iteratorE",
   "size" : 32,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfSection.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "memory_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11unwindstack11DwarfMemoryE"
    },
    {
     "access" : "protected",
     "field_name" : "last_error_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN11unwindstack14DwarfErrorDataE"
    },
    {
     "access" : "protected",
     "field_name" : "cie32_value_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "cie64_value_",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "fde_entries_",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__113unordered_mapImN11unwindstack8DwarfFdeENS_4hashImEENS_8equal_toImEENS_9allocatorINS_4pairIKmS2_EEEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "cie_entries_",
     "field_offset" : 1088,
     "referenced_type" : "_ZTINSt3__113unordered_mapImN11unwindstack8DwarfCieENS_4hashImEENS_8equal_toImEENS_9allocatorINS_4pairIKmS2_EEEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "cie_loc_regs_",
     "field_offset" : 1408,
     "referenced_type" : "_ZTINSt3__113unordered_mapImN11unwindstack14DwarfLocationsENS_4hashImEENS_8equal_toImEENS_9allocatorINS_4pairIKmS2_EEEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "loc_regs_",
     "field_offset" : 1728,
     "referenced_type" : "_ZTINSt3__13mapImN11unwindstack14DwarfLocationsENS_4lessImEENS_9allocatorINS_4pairIKmS2_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack12DwarfSectionE",
   "name" : "unwindstack::DwarfSection",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack12DwarfSectionE",
   "self_type" : "_ZTIN11unwindstack12DwarfSectionE",
   "size" : 240,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfSection.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack12DwarfSectionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12DwarfSectionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12DwarfSectionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection4InitEmml"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection4EvalEPKNS_8DwarfCieEPNS_6MemoryERKNS_14DwarfLocationsEPNS_4RegsEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection3LogEhmPKNS_8DwarfFdeENS_8ArchEnumE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection7GetFdesEPNSt3__16vectorIPKNS_8DwarfFdeENS1_9allocatorIS5_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection12GetFdeFromPcEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection18GetCfaLocationInfoEmPKNS_8DwarfFdeEPNS_14DwarfLocationsENS_8ArchEnumE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde32Ej"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde64Em"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection15AdjustPcFromFdeEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "memory_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN11unwindstack6MemoryE"
    },
    {
     "access" : "protected",
     "field_name" : "pt_loads_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__113unordered_mapImN11unwindstack8LoadInfoENS_4hashImEENS_8equal_toImEENS_9allocatorINS_4pairIKmS2_EEEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "dynamic_offset_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "dynamic_vaddr_start_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "dynamic_vaddr_end_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "data_offset_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "data_vaddr_start_",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "data_vaddr_end_",
     "field_offset" : 768,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_hdr_offset_",
     "field_offset" : 832,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_hdr_section_bias_",
     "field_offset" : 896,
     "referenced_type" : "_ZTIl"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_hdr_size_",
     "field_offset" : 960,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_offset_",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_section_bias_",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIl"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_size_",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "debug_frame_offset_",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "debug_frame_section_bias_",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIl"
    },
    {
     "access" : "protected",
     "field_name" : "debug_frame_size_",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_offset_",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_size_",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_build_id_offset_",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_build_id_size_",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "text_addr_",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "text_size_",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "soname_type_",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIh"
    },
    {
     "access" : "protected",
     "field_name" : "soname_",
     "field_offset" : 1856,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "last_error_",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIN11unwindstack9ErrorDataE"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_",
     "field_offset" : 2176,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack12DwarfSectionENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "debug_frame_",
     "field_offset" : 2240,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack12DwarfSectionENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_interface_",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIPN11unwindstack12ElfInterfaceE"
    },
    {
     "access" : "protected",
     "field_name" : "symbols_",
     "field_offset" : 2368,
     "referenced_type" : "_ZTINSt3__16vectorIPN11unwindstack7SymbolsENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "strtabs_",
     "field_offset" : 2560,
     "referenced_type" : "_ZTINSt3__16vectorINS_4pairImmEENS_9allocatorIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack12ElfInterfaceE",
   "name" : "unwindstack::ElfInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack12ElfInterfaceE",
   "self_type" : "_ZTIN11unwindstack12ElfInterfaceE",
   "size" : 344,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack12ElfInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12ElfInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12ElfInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface4InitEPl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface11InitHeadersEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface9GetSonameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface15GetFunctionNameEmPNS_12SharedStringEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface17GetGlobalVariableERKNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface10GetBuildIDEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface4StepEmPNS_4RegsEPNS_6MemoryEPbS5_"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface9IsValidPcEm"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface17HandleUnknownTypeEjmm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTINSt3__110shared_ptrIKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack12SharedStringE",
   "name" : "unwindstack::SharedString",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack12SharedStringE",
   "self_type" : "_ZTIN11unwindstack12SharedStringE",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/SharedString.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN11unwindstack17DwarfLocationEnumE"
    },
    {
     "field_name" : "values",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA2_m"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack13DwarfLocationE",
   "name" : "unwindstack::DwarfLocation",
   "referenced_type" : "_ZTIN11unwindstack13DwarfLocationE",
   "self_type" : "_ZTIN11unwindstack13DwarfLocationE",
   "size" : 24,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfLocation.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "code",
     "referenced_type" : "_ZTIN11unwindstack14DwarfErrorCodeE"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack14DwarfErrorDataE",
   "name" : "unwindstack::DwarfErrorData",
   "referenced_type" : "_ZTIN11unwindstack14DwarfErrorDataE",
   "self_type" : "_ZTIN11unwindstack14DwarfErrorDataE",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfError.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113unordered_mapIjN11unwindstack13DwarfLocationENS_4hashIjEENS_8equal_toIjEENS_9allocatorINS_4pairIKjS2_EEEEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "cie",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKN11unwindstack8DwarfCieE"
    },
    {
     "field_name" : "pc_start",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pc_end",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack14DwarfLocationsE",
   "name" : "unwindstack::DwarfLocations",
   "referenced_type" : "_ZTIN11unwindstack14DwarfLocationsE",
   "self_type" : "_ZTIN11unwindstack14DwarfLocationsE",
   "size" : 64,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfLocation.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pad",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack14x86_64_stack_tE",
   "name" : "unwindstack::x86_64_stack_t",
   "referenced_type" : "_ZTIN11unwindstack14x86_64_stack_tE",
   "self_type" : "_ZTIN11unwindstack14x86_64_stack_tE",
   "size" : 24,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UcontextX86_64.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r15",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r14",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r13",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r12",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rbp",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rbx",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r11",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r10",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r9",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r8",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rax",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rcx",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rdx",
     "field_offset" : 768,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rsi",
     "field_offset" : 832,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rdi",
     "field_offset" : 896,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "orig_rax",
     "field_offset" : 960,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rip",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cs",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rsp",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ss",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fs_base",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "gs_base",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ds",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "es",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fs",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "gs",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack16x86_64_user_regsE",
   "name" : "unwindstack::x86_64_user_regs",
   "referenced_type" : "_ZTIN11unwindstack16x86_64_user_regsE",
   "self_type" : "_ZTIN11unwindstack16x86_64_user_regsE",
   "size" : 216,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UserX86_64.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r8",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r9",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r10",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r11",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r12",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r13",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r14",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "r15",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rdi",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rsi",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rbp",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rbx",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rdx",
     "field_offset" : 768,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rax",
     "field_offset" : 832,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rcx",
     "field_offset" : 896,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rsp",
     "field_offset" : 960,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rip",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "efl",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "csgsfs",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "err",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack17x86_64_mcontext_tE",
   "name" : "unwindstack::x86_64_mcontext_t",
   "referenced_type" : "_ZTIN11unwindstack17x86_64_mcontext_tE",
   "self_type" : "_ZTIN11unwindstack17x86_64_mcontext_tE",
   "size" : 184,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UcontextX86_64.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN11unwindstack14x86_64_stack_tE"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN11unwindstack17x86_64_mcontext_tE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack17x86_64_ucontext_tE",
   "name" : "unwindstack::x86_64_ucontext_t",
   "referenced_type" : "_ZTIN11unwindstack17x86_64_ucontext_tE",
   "self_type" : "_ZTIN11unwindstack17x86_64_ucontext_tE",
   "size" : 224,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UcontextX86_64.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "valid_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "load_bias_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "access" : "protected",
     "field_name" : "interface_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack12ElfInterfaceENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "memory_",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack6MemoryENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "machine_type_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "class_type_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIh"
    },
    {
     "access" : "protected",
     "field_name" : "arch_",
     "field_offset" : 360,
     "referenced_type" : "_ZTIN11unwindstack8ArchEnumE"
    },
    {
     "access" : "protected",
     "field_name" : "lock_",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_memory_",
     "field_offset" : 704,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack6MemoryENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_interface_",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack12ElfInterfaceENS_14default_deleteIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack3ElfE",
   "name" : "unwindstack::Elf",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack3ElfE",
   "self_type" : "_ZTIN11unwindstack3ElfE",
   "size" : 104,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Elf.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack3ElfE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack3ElfD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack3ElfD0Ev"
    }
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN11unwindstack4Regs12LocationEnumE"
    },
    {
     "field_name" : "value",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack4Regs8LocationE",
   "name" : "unwindstack::Regs::Location",
   "referenced_type" : "_ZTIN11unwindstack4Regs8LocationE",
   "self_type" : "_ZTIN11unwindstack4Regs8LocationE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "total_regs_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "protected",
     "field_name" : "return_loc_",
     "field_offset" : 80,
     "referenced_type" : "_ZTIN11unwindstack4Regs8LocationE"
    },
    {
     "access" : "protected",
     "field_name" : "dex_pc_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack4RegsE",
   "name" : "unwindstack::Regs",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack4RegsE",
   "self_type" : "_ZTIN11unwindstack4RegsE",
   "size" : 24,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack4RegsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack4RegsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack4RegsD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs4ArchEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs7RawDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2pcEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2spEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_pcEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_spEm"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs11fallback_pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs20ResetPseudoRegistersEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17SetPseudoRegisterEtm"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17GetPseudoRegisterEtPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs19StepIfSignalHandlerEmPNS_3ElfEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs16IterateRegistersENSt3__18functionIFvPKcmEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs5CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN11unwindstack6MemoryE",
   "name" : "unwindstack::Memory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack6MemoryE",
   "self_type" : "_ZTIN11unwindstack6MemoryE",
   "size" : 8,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Memory.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack6MemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack6MemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack6MemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory17AsMemoryCacheBaseEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEmPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEm"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory6GetPtrEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack6Memory4ReadEmPvm"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory7ReadTagEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "elf_",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN11unwindstack3ElfEEE"
    },
    {
     "field_name" : "elf_offset_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "elf_start_offset_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "load_bias_",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16atomicIlEE"
    },
    {
     "field_name" : "build_id_",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16atomicIPN11unwindstack12SharedStringEEE"
    },
    {
     "field_name" : "memory_backed_elf_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "elf_mutex_",
     "field_offset" : 416,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack7MapInfo9ElfFieldsE",
   "name" : "unwindstack::MapInfo::ElfFields",
   "referenced_type" : "_ZTIN11unwindstack7MapInfo9ElfFieldsE",
   "self_type" : "_ZTIN11unwindstack7MapInfo9ElfFieldsE",
   "size" : 96,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/MapInfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "start_",
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "end_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "offset_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "flags_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "name_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN11unwindstack12SharedStringE"
    },
    {
     "access" : "private",
     "field_name" : "elf_fields_",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16atomicIPN11unwindstack7MapInfo9ElfFieldsEEE"
    },
    {
     "access" : "private",
     "field_name" : "prev_map_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPN11unwindstack7MapInfoE"
    },
    {
     "access" : "private",
     "field_name" : "prev_real_map_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPN11unwindstack7MapInfoE"
    },
    {
     "access" : "private",
     "field_name" : "next_real_map_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPN11unwindstack7MapInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack7MapInfoE",
   "name" : "unwindstack::MapInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack7MapInfoE",
   "self_type" : "_ZTIN11unwindstack7MapInfoE",
   "size" : 80,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/MapInfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "fde_address_encoding",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "lsda_encoding",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "segment_size",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "augmentation_string",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIcNS_9allocatorIcEEEE"
    },
    {
     "field_name" : "personality_handler",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cfa_instructions_offset",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cfa_instructions_end",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "code_alignment_factor",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "data_alignment_factor",
     "field_offset" : 512,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "return_address_register",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "is_signal_frame",
     "field_offset" : 640,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack8DwarfCieE",
   "name" : "unwindstack::DwarfCie",
   "referenced_type" : "_ZTIN11unwindstack8DwarfCieE",
   "self_type" : "_ZTIN11unwindstack8DwarfCieE",
   "size" : 88,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfStructs.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cie_offset",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cfa_instructions_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cfa_instructions_end",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pc_start",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pc_end",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "lsda_address",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cie",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKN11unwindstack8DwarfCieE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack8DwarfFdeE",
   "name" : "unwindstack::DwarfFde",
   "referenced_type" : "_ZTIN11unwindstack8DwarfFdeE",
   "self_type" : "_ZTIN11unwindstack8DwarfFdeE",
   "size" : 56,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfStructs.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "table_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "table_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack8LoadInfoE",
   "name" : "unwindstack::LoadInfo",
   "referenced_type" : "_ZTIN11unwindstack8LoadInfoE",
   "self_type" : "_ZTIN11unwindstack8LoadInfoE",
   "size" : 24,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN11unwindstack4RegsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "regs_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorImNS_9allocatorImEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack8RegsImplImEE",
   "name" : "unwindstack::RegsImpl<unsigned long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack8RegsImplImEE",
   "self_type" : "_ZTIN11unwindstack8RegsImplImEE",
   "size" : 48,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h",
   "template_args" : [ "_ZTIm" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack8RegsImplImEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplImED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplImED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs4ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplImE7RawDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2pcEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2spEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_pcEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_spEm"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs11fallback_pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs20ResetPseudoRegistersEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17SetPseudoRegisterEtm"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17GetPseudoRegisterEtPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs19StepIfSignalHandlerEmPNS_3ElfEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplImE16IterateRegistersENSt3__18functionIFvPKcmEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs5CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "code",
     "referenced_type" : "_ZTIN11unwindstack9ErrorCodeE"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack9ErrorDataE",
   "name" : "unwindstack::ErrorData",
   "referenced_type" : "_ZTIN11unwindstack9ErrorDataE",
   "self_type" : "_ZTIN11unwindstack9ErrorDataE",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Error.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIONSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>> &&",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIONSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 8,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/SharedString.h"
  }
 ]
}
