{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_N6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "name" : "google::protobuf::internal::ArenaImpl::CleanupNode [1]",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "self_type" : "_ZTIA1_N6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 2,

   "referenced_type" : "_ZTIN6google8protobuf2io16CodedInputStreamE",
   "self_type" : "_ZTIKN6google8protobuf2io16CodedInputStreamE",
   "size" : 56,
   "source_file" : "external/protobuf/src/google/protobuf/io/coded_stream.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf2io17CodedOutputStreamE",
   "name" : "const google::protobuf::io::CodedOutputStream",
   "referenced_type" : "_ZTIN6google8protobuf2io17CodedOutputStreamE",
   "self_type" : "_ZTIKN6google8protobuf2io17CodedOutputStreamE",
   "size" : 20,
   "source_file" : "external/protobuf/src/google/protobuf/io/coded_stream.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf2io20ZeroCopyOutputStreamE",
   "name" : "const google::protobuf::io::ZeroCopyOutputStream",
   "referenced_type" : "_ZTIN6google8protobuf2io20ZeroCopyOutputStreamE",
   "self_type" : "_ZTIKN6google8protobuf2io20ZeroCopyOutputStreamE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf5ArenaE",
   "name" : "const google::protobuf::Arena",
   "referenced_type" : "_ZTIN6google8protobuf5ArenaE",
   "self_type" : "_ZTIKN6google8protobuf5ArenaE",
   "size" : 64,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "name" : "const google::protobuf::internal::ArenaImpl::SerialArena",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "self_type" : "_ZTIKN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "size" : 36,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf8internal9ArenaImpl5BlockE",
   "name" : "const google::protobuf::internal::ArenaImpl::Block",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl5BlockE",
   "self_type" : "_ZTIKN6google8protobuf8internal9ArenaImpl5BlockE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/common.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKh",
   "name" : "const unsigned char *const",
   "referenced_type" : "_ZTIPKh",
   "self_type" : "_ZTIKPKh",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPh",
   "name" : "unsigned char *const",
   "referenced_type" : "_ZTIPh",
   "self_type" : "_ZTIKPh",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "self_type" : "_ZTIKSt9type_info",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/io/coded_stream.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf11LogSilencerE",
   "name" : "google::protobuf::LogSilencer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf11LogSilencerE",
   "self_type" : "_ZTIN6google8protobuf11LogSilencerE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_block_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "max_block_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "initial_block",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "initial_block_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "block_alloc",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFPvjE"
    },
    {
     "field_name" : "block_dealloc",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFvPvjE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_init",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFPvPN6google8protobuf5ArenaEE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_reset",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvyE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_destruction",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvyE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_allocation",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFvPKSt9type_infoyPvE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf12ArenaOptionsE",
   "name" : "google::protobuf::ArenaOptions",
   "referenced_type" : "_ZTIN6google8protobuf12ArenaOptionsE",
   "self_type" : "_ZTIN6google8protobuf12ArenaOptionsE",
   "size" : 40,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6google8protobuf2io19ZeroCopyInputStreamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPKh"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKi"
    },
    {
     "access" : "private",
     "field_name" : "block_size_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKi"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "last_returned_size_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf2io16ArrayInputStreamE",
   "name" : "google::protobuf::io::ArrayInputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io16ArrayInputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io16ArrayInputStreamE",
   "size" : 24,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io16ArrayInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io16ArrayInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io16ArrayInputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io16ArrayInputStream4NextEPPKvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io16ArrayInputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io16ArrayInputStream4SkipEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io16ArrayInputStream9ByteCountEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "buffer_end_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "input_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN6google8protobuf2io19ZeroCopyInputStreamE"
    },
    {
     "access" : "private",
     "field_name" : "total_bytes_read_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "overflow_bytes_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "last_tag_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "legitimate_message_end_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "aliasing_enabled_",
     "field_offset" : 200,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "current_limit_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_after_limit_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_bytes_limit_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "recursion_budget_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "recursion_limit_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "extension_pool_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKN6google8protobuf14DescriptorPoolE"
    },
    {
     "access" : "private",
     "field_name" : "extension_factory_",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPN6google8protobuf14MessageFactoryE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf2io16CodedInputStreamE",
   "name" : "google::protobuf::io::CodedInputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io16CodedInputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io16CodedInputStreamE",
   "size" : 56,
   "source_file" : "external/protobuf/src/google/protobuf/io/coded_stream.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6google8protobuf2io20ZeroCopyOutputStreamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPh"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKi"
    },
    {
     "access" : "private",
     "field_name" : "block_size_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKi"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "last_returned_size_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf2io17ArrayOutputStreamE",
   "name" : "google::protobuf::io::ArrayOutputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io17ArrayOutputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io17ArrayOutputStreamE",
   "size" : 24,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io17ArrayOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io17ArrayOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io17ArrayOutputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io17ArrayOutputStream4NextEPPvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io17ArrayOutputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io17ArrayOutputStream9ByteCountEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream14AllowsAliasingEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "output_",
     "referenced_type" : "_ZTIPN6google8protobuf2io20ZeroCopyOutputStreamE"
    },
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_bytes_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "had_error_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "aliasing_enabled_",
     "field_offset" : 136,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "is_serialization_deterministic_",
     "field_offset" : 144,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf2io17CodedOutputStreamE",
   "name" : "google::protobuf::io::CodedOutputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io17CodedOutputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io17CodedOutputStreamE",
   "size" : 20,
   "source_file" : "external/protobuf/src/google/protobuf/io/coded_stream.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN6google8protobuf2io18CopyingInputStreamE",
   "name" : "google::protobuf::io::CopyingInputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io18CopyingInputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io18CopyingInputStreamE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io18CopyingInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18CopyingInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18CopyingInputStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io18CopyingInputStream4ReadEPvi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18CopyingInputStream4SkipEi"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6google8protobuf2io20ZeroCopyOutputStreamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "target_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf2io18StringOutputStreamE",
   "name" : "google::protobuf::io::StringOutputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io18StringOutputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io18StringOutputStreamE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io18StringOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18StringOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18StringOutputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18StringOutputStream4NextEPPvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18StringOutputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io18StringOutputStream9ByteCountEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream14AllowsAliasingEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN6google8protobuf2io19CopyingOutputStreamE",
   "name" : "google::protobuf::io::CopyingOutputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io19CopyingOutputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io19CopyingOutputStreamE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io19CopyingOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19CopyingOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19CopyingOutputStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io19CopyingOutputStream5WriteEPKvi"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6google8protobuf2io19ZeroCopyInputStreamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "input_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN6google8protobuf2io19ZeroCopyInputStreamE"
    },
    {
     "access" : "private",
     "field_name" : "limit_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "prior_bytes_read_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf2io19LimitingInputStreamE",
   "name" : "google::protobuf::io::LimitingInputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io19LimitingInputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io19LimitingInputStreamE",
   "size" : 24,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io19LimitingInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19LimitingInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19LimitingInputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io19LimitingInputStream4NextEPPKvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io19LimitingInputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io19LimitingInputStream4SkipEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io19LimitingInputStream9ByteCountEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN6google8protobuf2io19ZeroCopyInputStreamE",
   "name" : "google::protobuf::io::ZeroCopyInputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io19ZeroCopyInputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io19ZeroCopyInputStreamE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io19ZeroCopyInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19ZeroCopyInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19ZeroCopyInputStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io19ZeroCopyInputStream4NextEPPKvPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io19ZeroCopyInputStream6BackUpEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io19ZeroCopyInputStream4SkipEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf2io19ZeroCopyInputStream9ByteCountEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN6google8protobuf2io20ZeroCopyOutputStreamE",
   "name" : "google::protobuf::io::ZeroCopyOutputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io20ZeroCopyOutputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io20ZeroCopyOutputStreamE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io20ZeroCopyOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream4NextEPPvPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream6BackUpEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream9ByteCountEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream14AllowsAliasingEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6google8protobuf2io19ZeroCopyInputStreamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "copying_stream_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN6google8protobuf2io18CopyingInputStreamE"
    },
    {
     "access" : "private",
     "field_name" : "owns_copying_stream_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "failed_",
     "field_offset" : 72,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110unique_ptrIA_hNS_14default_deleteIS1_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIKi"
    },
    {
     "access" : "private",
     "field_name" : "buffer_used_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "backup_bytes_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf2io25CopyingInputStreamAdaptorE",
   "name" : "google::protobuf::io::CopyingInputStreamAdaptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io25CopyingInputStreamAdaptorE",
   "self_type" : "_ZTIN6google8protobuf2io25CopyingInputStreamAdaptorE",
   "size" : 40,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io25CopyingInputStreamAdaptorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io25CopyingInputStreamAdaptorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io25CopyingInputStreamAdaptorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io25CopyingInputStreamAdaptor4NextEPPKvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io25CopyingInputStreamAdaptor6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io25CopyingInputStreamAdaptor4SkipEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io25CopyingInputStreamAdaptor9ByteCountEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6google8protobuf2io20ZeroCopyOutputStreamE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "copying_stream_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN6google8protobuf2io19CopyingOutputStreamE"
    },
    {
     "access" : "private",
     "field_name" : "owns_copying_stream_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "failed_",
     "field_offset" : 72,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110unique_ptrIA_hNS_14default_deleteIS1_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIKi"
    },
    {
     "access" : "private",
     "field_name" : "buffer_used_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf2io26CopyingOutputStreamAdaptorE",
   "name" : "google::protobuf::io::CopyingOutputStreamAdaptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io26CopyingOutputStreamAdaptorE",
   "self_type" : "_ZTIN6google8protobuf2io26CopyingOutputStreamAdaptorE",
   "size" : 40,
   "source_file" : "external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io26CopyingOutputStreamAdaptorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io26CopyingOutputStreamAdaptorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io26CopyingOutputStreamAdaptorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io26CopyingOutputStreamAdaptor4NextEPPvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io26CopyingOutputStreamAdaptor6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io26CopyingOutputStreamAdaptor9ByteCountEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream14AllowsAliasingEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4BitsE",
   "name" : "google::protobuf::Bits",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf4BitsE",
   "self_type" : "_ZTIN6google8protobuf4BitsE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "impl_",
     "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImplE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_allocation_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFvPKSt9type_infoyPvE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_reset_",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvyE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_destruction_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvyE"
    },
    {
     "access" : "private",
     "field_name" : "hooks_cookie_",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf5ArenaE",
   "name" : "google::protobuf::Arena",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf5ArenaE",
   "self_type" : "_ZTIN6google8protobuf5ArenaE",
   "size" : 64,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN6google8protobuf7ClosureE",
   "name" : "google::protobuf::Closure",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf7ClosureE",
   "self_type" : "_ZTIN6google8protobuf7ClosureE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/callback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf7ClosureE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7ClosureD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7ClosureD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf7Closure3RunEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "level_",
     "referenced_type" : "_ZTIN6google8protobuf8LogLevelE"
    },
    {
     "access" : "private",
     "field_name" : "filename_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "line_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "message_",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "name" : "google::protobuf::internal::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "self_type" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "size" : 24,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "name" : "google::protobuf::internal::LogFinisher",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "self_type" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6google8protobuf7ClosureE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "function_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "access" : "private",
     "field_name" : "self_deleting_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal16FunctionClosure0E",
   "name" : "google::protobuf::internal::FunctionClosure0",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal16FunctionClosure0E",
   "self_type" : "_ZTIN6google8protobuf8internal16FunctionClosure0E",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/callback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf8internal16FunctionClosure0E"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal16FunctionClosure0D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal16FunctionClosure0D0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal16FunctionClosure03RunEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "elem",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "name" : "google::protobuf::internal::ArenaImpl::CleanupNode",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "arena_",
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImplE"
    },
    {
     "access" : "private",
     "field_name" : "owner_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "head_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "cleanup_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl12CleanupChunkE"
    },
    {
     "access" : "private",
     "field_name" : "next_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11SerialArenaE"
    },
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "limit_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "cleanup_ptr_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11CleanupNodeE"
    },
    {
     "access" : "private",
     "field_name" : "cleanup_limit_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11CleanupNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "name" : "google::protobuf::internal::ArenaImpl::SerialArena",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "size" : 36,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "last_lifecycle_id_seen",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "last_serial_arena",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11SerialArenaE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl11ThreadCacheE",
   "name" : "google::protobuf::internal::ArenaImpl::ThreadCache",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11ThreadCacheE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11ThreadCacheE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "next",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl12CleanupChunkE"
    },
    {
     "field_name" : "nodes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA1_N6google8protobuf8internal9ArenaImpl11CleanupNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl12CleanupChunkE",
   "name" : "google::protobuf::internal::ArenaImpl::CleanupChunk",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl12CleanupChunkE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl12CleanupChunkE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "next_",
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "pos_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl5BlockE",
   "name" : "google::protobuf::internal::ArenaImpl::Block",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl5BlockE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl5BlockE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_block_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "max_block_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "initial_block",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "initial_block_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "block_alloc",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFPvjE"
    },
    {
     "field_name" : "block_dealloc",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFvPvjE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE",
   "name" : "google::protobuf::internal::ArenaImpl::Options",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE",
   "size" : 24,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "threads_",
     "referenced_type" : "_ZTINSt3__16atomicIPN6google8protobuf8internal9ArenaImpl11SerialArenaEEE"
    },
    {
     "access" : "private",
     "field_name" : "hint_",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16atomicIPN6google8protobuf8internal9ArenaImpl11SerialArenaEEE"
    },
    {
     "access" : "private",
     "field_name" : "space_allocated_",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16atomicIjEE"
    },
    {
     "access" : "private",
     "field_name" : "initial_block_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "lifecycle_id_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "options_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImplE",
   "name" : "google::protobuf::internal::ArenaImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImplE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImplE",
   "size" : 48,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf9BigEndianE",
   "name" : "google::protobuf::BigEndian",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf9BigEndianE",
   "self_type" : "_ZTIN6google8protobuf9BigEndianE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  }
 ],
 "rvalue_reference_types" : []
}
