{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_N3art3dex20AnnotationSetRefItemE",
   "name" : "art::dex::AnnotationSetRefItem [1]",
   "referenced_type" : "_ZTIN3art3dex20AnnotationSetRefItemE",
   "self_type" : "_ZTIA1_N3art3dex20AnnotationSetRefItemE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_N3art3dex7MapItemE",
   "name" : "art::dex::MapItem [1]",
   "referenced_type" : "_ZTIN3art3dex7MapItemE",
   "self_type" : "_ZTIA1_N3art3dex7MapItemE",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA1_N3art3dex8TypeItemE",
   "name" : "art::dex::TypeItem [1]",
   "referenced_type" : "_ZTIN3art3dex8TypeItemE",
   "self_type" : "_ZTIA1_N3art3dex8TypeItemE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1_h",
   "name" : "unsigned char [1]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA1_h",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_j",
   "name" : "unsigned int [1]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA1_j",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA1_t",
   "name" : "unsigned short [1]",

   "referenced_type" : "_ZTIPKN3art7DexFile6HeaderE",
   "self_type" : "_ZTIKPKN3art7DexFile6HeaderE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_loader.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKh",
   "name" : "const unsigned char *const",
   "referenced_type" : "_ZTIPKh",
   "self_type" : "_ZTIKPKh",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKj",
   "name" : "const unsigned int *const",
   "referenced_type" : "_ZTIPKj",
   "self_type" : "_ZTIKPKj",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/compact_offset_table.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_loader.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/art_dex_file_loader.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/errno_restorer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "art/libartbase/base/mem_map.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art10FreeDeleteE",
   "name" : "art::FreeDelete",
   "referenced_type" : "_ZTIN3art10FreeDeleteE",
   "self_type" : "_ZTIN3art10FreeDeleteE",
   "size" : 1,
   "source_file" : "art/libartbase/base/stl_util.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "handle_",
     "referenced_type" : "_ZTIP10ZipArchive"
    }
   ],
   "linker_set_key" : "_ZTIN3art10ZipArchiveE",
   "name" : "art::ZipArchive",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art10ZipArchiveE",
   "self_type" : "_ZTIN3art10ZipArchiveE",
   "size" : 8,
   "source_file" : "art/libartbase/base/zip_archive.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art11ScopedTraceE",
   "name" : "art::ScopedTrace",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art11ScopedTraceE",
   "self_type" : "_ZTIN3art11ScopedTraceE",
   "size" : 1,
   "source_file" : "art/libartbase/base/systrace.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art11ValueObjectE",
   "name" : "art::ValueObject",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art11ValueObjectE",
   "self_type" : "_ZTIN3art11ValueObjectE",
   "size" : 1,
   "source_file" : "art/libartbase/base/value_object.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN3art13DexFileLoaderE",
   "name" : "art::DexFileLoader",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art13DexFileLoaderE",
   "self_type" : "_ZTIN3art13DexFileLoaderE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_loader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art13DexFileLoaderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art13DexFileLoaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art13DexFileLoaderD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader20GetMultiDexChecksumsEPKcPNSt3__16vectorIjNS3_9allocatorIjEEEEPNS4_INS3_12basic_stringIcNS3_11char_traitsIcEENS5_IcEEEENS5_ISD_EEEEPSD_iPb"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader4OpenEPKhmRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEjPKNS_10OatDexFileEbbPS9_NS3_10unique_ptrINS_16DexFileContainerENS3_14default_deleteISH_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader19OpenWithDataSectionEPKhmS2_mRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEjPKNS_10OatDexFileEbbPS9_"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader7OpenAllEPKhmRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEbbPNS_22DexFileLoaderErrorCodeEPS9_PNS3_6vectorINS3_10unique_ptrIKNS_7DexFileENS3_14default_deleteISI_EEEENS7_ISL_EEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lo",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hi",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3art13TwoWordReturnE",
   "name" : "art::TwoWordReturn",
   "referenced_type" : "_ZTIN3art13TwoWordReturnE",
   "self_type" : "_ZTIN3art13TwoWordReturnE",
   "size" : 16,
   "source_file" : "art/libartbase/arch/instruction_set.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFile6HeaderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "feature_flags_",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_pos_",
     "field_offset" : 928,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_table_offset_",
     "field_offset" : 960,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_base_",
     "field_offset" : 992,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "owned_data_begin_",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "owned_data_end_",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art14CompactDexFile6HeaderE",
   "name" : "art::CompactDexFile::Header",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art14CompactDexFile6HeaderE",
   "self_type" : "_ZTIN3art14CompactDexFile6HeaderE",
   "size" : 136,
   "source_file" : "art/libdexfile/dex/compact_dex_file.h"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8CodeItemE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fields_",
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "insns_count_and_flags_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "insns_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_t"
    }
   ],
   "linker_set_key" : "_ZTIN3art14CompactDexFile8CodeItemE",
   "name" : "art::CompactDexFile::CodeItem",
   "referenced_type" : "_ZTIN3art14CompactDexFile8CodeItemE",
   "self_type" : "_ZTIN3art14CompactDexFile8CodeItemE",
   "size" : 6,
   "source_file" : "art/libdexfile/dex/compact_dex_file.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFileE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIN3art18CompactOffsetTable8AccessorE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14CompactDexFileE",
   "name" : "art::CompactDexFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art14CompactDexFileE",
   "self_type" : "_ZTIN3art14CompactDexFileE",
   "size" : 216,
   "source_file" : "art/libdexfile/dex/compact_dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art14CompactDexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art14CompactDexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art14CompactDexFileD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile12IsMagicValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile14IsVersionValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile22SupportsDefaultMethodsEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile18GetDequickenedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "_ZTIN3art15SplitStringIterE"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3art15SplitStringIterE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14IterationRangeINS_15SplitStringIterEEE",
   "name" : "art::IterationRange<art::SplitStringIter>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art14IterationRangeINS_15SplitStringIterEEE",
   "self_type" : "_ZTIN3art14IterationRangeINS_15SplitStringIterEEE",
   "size" : 64,
   "source_file" : "art/libartbase/base/iteration_range.h",
   "template_args" : [ "_ZTIN3art15SplitStringIterE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "_ZTIN3art9CountIterE"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3art9CountIterE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14IterationRangeINS_9CountIterEEE",
   "name" : "art::IterationRange<art::CountIter>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art14IterationRangeINS_9CountIterEEE",
   "self_type" : "_ZTIN3art14IterationRangeINS_9CountIterEEE",
   "size" : 16,
   "source_file" : "art/libartbase/base/iteration_range.h",
   "template_args" : [ "_ZTIN3art9CountIterE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_20forward_iterator_tagENS_17basic_string_viewIcNS_11char_traitsIcEEEElPS5_RS5_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "cur_index_",
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "split_on_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "sv_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15SplitStringIterE",
   "name" : "art::SplitStringIter",
   "referenced_type" : "_ZTIN3art15SplitStringIterE",
   "self_type" : "_ZTIN3art15SplitStringIterE",
   "size" : 32,
   "source_file" : "art/libartbase/base/stl_util.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFile6HeaderE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15StandardDexFile6HeaderE",
   "name" : "art::StandardDexFile::Header",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art15StandardDexFile6HeaderE",
   "self_type" : "_ZTIN3art15StandardDexFile6HeaderE",
   "size" : 112,
   "source_file" : "art/libdexfile/dex/standard_dex_file.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8CodeItemE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "registers_size_",
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "ins_size_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "outs_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "tries_size_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_off_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "insns_size_in_code_units_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "insns_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_t"
    }
   ],
   "linker_set_key" : "_ZTIN3art15StandardDexFile8CodeItemE",
   "name" : "art::StandardDexFile::CodeItem",
   "referenced_type" : "_ZTIN3art15StandardDexFile8CodeItemE",
   "self_type" : "_ZTIN3art15StandardDexFile8CodeItemE",
   "size" : 20,
   "source_file" : "art/libdexfile/dex/standard_dex_file.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFileE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15StandardDexFileE",
   "name" : "art::StandardDexFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art15StandardDexFileE",
   "self_type" : "_ZTIN3art15StandardDexFileE",
   "size" : 192,
   "source_file" : "art/libdexfile/dex/standard_dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art15StandardDexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art15StandardDexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art15StandardDexFileD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile12IsMagicValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile14IsVersionValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile22SupportsDefaultMethodsEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile18GetDequickenedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art7DexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art13DexFileLoaderE"
    }
   ],
   "linker_set_key" : "_ZTIN3art16ArtDexFileLoaderE",
   "name" : "art::ArtDexFileLoader",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art16ArtDexFileLoaderE",
   "self_type" : "_ZTIN3art16ArtDexFileLoaderE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/art_dex_file_loader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art16ArtDexFileLoaderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art16ArtDexFileLoaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art16ArtDexFileLoaderD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art16ArtDexFileLoader20GetMultiDexChecksumsEPKcPNSt3__16vectorIjNS3_9allocatorIjEEEEPNS4_INS3_12basic_stringIcNS3_11char_traitsIcEENS5_IcEEEENS5_ISD_EEEEPSD_iPb"
    },
    {
     "mangled_component_name" : "_ZNK3art16ArtDexFileLoader4OpenEPKhmRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEjPKNS_10OatDexFileEbbPS9_NS3_10unique_ptrINS_16DexFileContainerENS3_14default_deleteISH_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader19OpenWithDataSectionEPKhmS2_mRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEjPKNS_10OatDexFileEbbPS9_"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader7OpenAllEPKhmRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEbbPNS_22DexFileLoaderErrorCodeEPS9_PNS3_6vectorINS3_10unique_ptrIKNS_7DexFileENS3_14default_deleteISI_EEEENS7_ISL_EEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN3art16DexFileContainerE",
   "name" : "art::DexFileContainer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art16DexFileContainerE",
   "self_type" : "_ZTIN3art16DexFileContainerE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art16DexFileContainerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art16DexFileContainerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art16DexFileContainerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer14GetPermissionsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer10IsReadOnlyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer11EnableWriteEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer12DisableWriteEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "table_",
     "referenced_type" : "_ZTIKPKj"
    },
    {
     "access" : "private",
     "field_name" : "minimum_offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "data_begin_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKPKh"
    }
   ],
   "linker_set_key" : "_ZTIN3art18CompactOffsetTable8AccessorE",
   "name" : "art::CompactOffsetTable::Accessor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art18CompactOffsetTable8AccessorE",
   "self_type" : "_ZTIN3art18CompactOffsetTable8AccessorE",
   "size" : 24,
   "source_file" : "art/libdexfile/dex/compact_offset_table.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art18CompactOffsetTableE",
   "name" : "art::CompactOffsetTable",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art18CompactOffsetTableE",
   "self_type" : "_ZTIN3art18CompactOffsetTableE",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/compact_offset_table.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTINSt3__119basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art18ScopedTraceNoStart24ScopedTraceMessageHelperE",
   "name" : "art::ScopedTraceNoStart::ScopedTraceMessageHelper",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art18ScopedTraceNoStart24ScopedTraceMessageHelperE",
   "self_type" : "_ZTIN3art18ScopedTraceNoStart24ScopedTraceMessageHelperE",
   "size" : 264,
   "source_file" : "art/libartbase/base/systrace.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art18ScopedTraceNoStartE",
   "name" : "art::ScopedTraceNoStart",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art18ScopedTraceNoStartE",
   "self_type" : "_ZTIN3art18ScopedTraceNoStartE",
   "size" : 1,
   "source_file" : "art/libartbase/base/systrace.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_file_",
     "referenced_type" : "_ZTIRKN3art7DexFileE"
    },
    {
     "access" : "private",
     "field_name" : "type_list_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKN3art3dex8TypeListE"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "pos_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art24DexFileParameterIteratorE",
   "name" : "art::DexFileParameterIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art24DexFileParameterIteratorE",
   "self_type" : "_ZTIN3art24DexFileParameterIteratorE",
   "size" : 24,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "dex_file_",
     "referenced_type" : "_ZTIRKN3art7DexFileE"
    },
    {
     "access" : "protected",
     "field_name" : "array_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "pos_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "ptr_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "protected",
     "field_name" : "type_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE"
    },
    {
     "access" : "protected",
     "field_name" : "jval_",
     "field_offset" : 320,
     "referenced_type" : "_ZTI6jvalue"
    }
   ],
   "linker_set_key" : "_ZTIN3art25EncodedArrayValueIteratorE",
   "name" : "art::EncodedArrayValueIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art25EncodedArrayValueIteratorE",
   "self_type" : "_ZTIN3art25EncodedArrayValueIteratorE",
   "size" : 48,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art25EncodedArrayValueIteratorE"
    }
   ],
   "linker_set_key" : "_ZTIN3art26CallSiteArrayValueIteratorE",
   "name" : "art::CallSiteArrayValueIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art26CallSiteArrayValueIteratorE",
   "self_type" : "_ZTIN3art26CallSiteArrayValueIteratorE",
   "size" : 48,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art2OSE",
   "name" : "art::OS",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art2OSE",
   "self_type" : "_ZTIN3art2OSE",
   "size" : 1,
   "source_file" : "art/libartbase/base/os.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art25EncodedArrayValueIteratorE"
    }
   ],
   "linker_set_key" : "_ZTIN3art31EncodedStaticFieldValueIteratorE",
   "name" : "art::EncodedStaticFieldValueIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art31EncodedStaticFieldValueIteratorE",
   "self_type" : "_ZTIN3art31EncodedStaticFieldValueIteratorE",
   "size" : 48,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8DexIndexItEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex10ProtoIndexE",
   "name" : "art::dex::ProtoIndex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex10ProtoIndexE",
   "self_type" : "_ZTIN3art3dex10ProtoIndexE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8DexIndexIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex11StringIndexE",
   "name" : "art::dex::StringIndex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex11StringIndexE",
   "self_type" : "_ZTIN3art3dex11StringIndexE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "visibility_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "annotation_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex14AnnotationItemE",
   "name" : "art::dex::AnnotationItem",
   "referenced_type" : "_ZTIN3art3dex14AnnotationItemE",
   "self_type" : "_ZTIN3art3dex14AnnotationItemE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data_off_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex14CallSiteIdItemE",
   "name" : "art::dex::CallSiteIdItem",
   "referenced_type" : "_ZTIN3art3dex14CallSiteIdItemE",
   "self_type" : "_ZTIN3art3dex14CallSiteIdItemE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "method_handle_type_",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "reserved1_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "field_or_method_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "reserved2_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex16MethodHandleItemE",
   "name" : "art::dex::MethodHandleItem",
   "referenced_type" : "_ZTIN3art3dex16MethodHandleItemE",
   "self_type" : "_ZTIN3art3dex16MethodHandleItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "entries_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_j"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex17AnnotationSetItemE",
   "name" : "art::dex::AnnotationSetItem",
   "referenced_type" : "_ZTIN3art3dex17AnnotationSetItemE",
   "self_type" : "_ZTIN3art3dex17AnnotationSetItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags_offset_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_j"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex18HiddenapiClassDataE",
   "name" : "art::dex::HiddenapiClassData",
   "referenced_type" : "_ZTIN3art3dex18HiddenapiClassDataE",
   "self_type" : "_ZTIN3art3dex18HiddenapiClassDataE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "annotations_off_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex20AnnotationSetRefItemE",
   "name" : "art::dex::AnnotationSetRefItem",
   "referenced_type" : "_ZTIN3art3dex20AnnotationSetRefItemE",
   "self_type" : "_ZTIN3art3dex20AnnotationSetRefItemE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_N3art3dex20AnnotationSetRefItemE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex20AnnotationSetRefListE",
   "name" : "art::dex::AnnotationSetRefList",
   "referenced_type" : "_ZTIN3art3dex20AnnotationSetRefListE",
   "self_type" : "_ZTIN3art3dex20AnnotationSetRefListE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "field_idx_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex20FieldAnnotationsItemE",
   "name" : "art::dex::FieldAnnotationsItem",
   "referenced_type" : "_ZTIN3art3dex20FieldAnnotationsItemE",
   "self_type" : "_ZTIN3art3dex20FieldAnnotationsItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "method_idx_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex21MethodAnnotationsItemE",
   "name" : "art::dex::MethodAnnotationsItem",
   "referenced_type" : "_ZTIN3art3dex21MethodAnnotationsItemE",
   "self_type" : "_ZTIN3art3dex21MethodAnnotationsItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_annotations_off_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fields_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "methods_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "parameters_size_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex24AnnotationsDirectoryItemE",
   "name" : "art::dex::AnnotationsDirectoryItem",
   "referenced_type" : "_ZTIN3art3dex24AnnotationsDirectoryItemE",
   "self_type" : "_ZTIN3art3dex24AnnotationsDirectoryItemE",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "method_idx_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex24ParameterAnnotationsItemE",
   "name" : "art::dex::ParameterAnnotationsItem",
   "referenced_type" : "_ZTIN3art3dex24ParameterAnnotationsItemE",
   "self_type" : "_ZTIN3art3dex24ParameterAnnotationsItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "descriptor_idx_",
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex6TypeIdE",
   "name" : "art::dex::TypeId",
   "referenced_type" : "_ZTIN3art3dex6TypeIdE",
   "self_type" : "_ZTIN3art3dex6TypeIdE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "type_idx_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "name_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7FieldIdE",
   "name" : "art::dex::FieldId",
   "referenced_type" : "_ZTIN3art3dex7FieldIdE",
   "self_type" : "_ZTIN3art3dex7FieldIdE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type_",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "unused_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7MapItemE",
   "name" : "art::dex::MapItem",
   "referenced_type" : "_ZTIN3art3dex7MapItemE",
   "self_type" : "_ZTIN3art3dex7MapItemE",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_N3art3dex7MapItemE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7MapListE",
   "name" : "art::dex::MapList",
   "referenced_type" : "_ZTIN3art3dex7MapListE",
   "self_type" : "_ZTIN3art3dex7MapListE",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shorty_idx_",
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    },
    {
     "field_name" : "return_type_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "pad_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "parameters_off_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7ProtoIdE",
   "name" : "art::dex::ProtoId",
   "referenced_type" : "_ZTIN3art3dex7ProtoIdE",
   "self_type" : "_ZTIN3art3dex7ProtoIdE",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_addr_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "insn_count_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "handler_off_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7TryItemE",
   "name" : "art::dex::TryItem",
   "referenced_type" : "_ZTIN3art3dex7TryItemE",
   "self_type" : "_ZTIN3art3dex7TryItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "pad1_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "access_flags_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "superclass_idx_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "pad2_",
     "field_offset" : 80,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "interfaces_off_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "source_file_idx_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "class_data_off_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "static_values_off_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8ClassDefE",
   "name" : "art::dex::ClassDef",
   "referenced_type" : "_ZTIN3art3dex8ClassDefE",
   "self_type" : "_ZTIN3art3dex8ClassDefE",
   "size" : 32,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art3dex8CodeItemE",
   "name" : "art::dex::CodeItem",
   "referenced_type" : "_ZTIN3art3dex8CodeItemE",
   "self_type" : "_ZTIN3art3dex8CodeItemE",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8DexIndexIjEE",
   "name" : "art::dex::DexIndex<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex8DexIndexIjEE",
   "self_type" : "_ZTIN3art3dex8DexIndexIjEE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "index_",
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8DexIndexItEE",
   "name" : "art::dex::DexIndex<unsigned short>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex8DexIndexItEE",
   "self_type" : "_ZTIN3art3dex8DexIndexItEE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "proto_idx_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN3art3dex10ProtoIndexE"
    },
    {
     "field_name" : "name_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8MethodIdE",
   "name" : "art::dex::MethodId",
   "referenced_type" : "_ZTIN3art3dex8MethodIdE",
   "self_type" : "_ZTIN3art3dex8MethodIdE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "string_data_off_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8StringIdE",
   "name" : "art::dex::StringId",
   "referenced_type" : "_ZTIN3art3dex8StringIdE",
   "self_type" : "_ZTIN3art3dex8StringIdE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "type_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8TypeItemE",
   "name" : "art::dex::TypeItem",
   "referenced_type" : "_ZTIN3art3dex8TypeItemE",
   "self_type" : "_ZTIN3art3dex8TypeItemE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_N3art3dex8TypeItemE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8TypeListE",
   "name" : "art::dex::TypeList",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex8TypeListE",
   "self_type" : "_ZTIN3art3dex8TypeListE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8DexIndexItEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex9TypeIndexE",
   "name" : "art::dex::TypeIndex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex9TypeIndexE",
   "self_type" : "_ZTIN3art3dex9TypeIndexE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "name_",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "begin_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "base_begin_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "base_size_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "prot_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "reuse_",
     "field_offset" : 480,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "already_unmapped_",
     "field_offset" : 488,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "redzone_size_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3art6MemMapE",
   "name" : "art::MemMap",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art6MemMapE",
   "self_type" : "_ZTIN3art6MemMapE",
   "size" : 72,
   "source_file" : "art/libartbase/base/mem_map.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "address_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "line_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "source_file_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "prologue_end_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "epilogue_begin_",
     "field_offset" : 136,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFile12PositionInfoE",
   "name" : "art::DexFile::PositionInfo",
   "referenced_type" : "_ZTIN3art7DexFile12PositionInfoE",
   "self_type" : "_ZTIN3art7DexFile12PositionInfoE",
   "size" : 24,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic_",
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "checksum_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "signature_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA20_h"
    },
    {
     "field_name" : "file_size_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "header_size_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "endian_tag_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "link_size_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "link_off_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "map_off_",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "string_ids_size_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "string_ids_off_",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type_ids_size_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type_ids_off_",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "proto_ids_size_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "proto_ids_off_",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "field_ids_size_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "field_ids_off_",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "method_ids_size_",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "method_ids_off_",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "class_defs_size_",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "class_defs_off_",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data_size_",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data_off_",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFile6HeaderE",
   "name" : "art::DexFile::Header",
   "referenced_type" : "_ZTIN3art7DexFile6HeaderE",
   "self_type" : "_ZTIN3art7DexFile6HeaderE",
   "size" : 112,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "descriptor_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "signature_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "start_address_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "end_address_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reg_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "is_live_",
     "field_offset" : 272,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFile9LocalInfoE",
   "name" : "art::DexFile::LocalInfo",
   "referenced_type" : "_ZTIN3art7DexFile9LocalInfoE",
   "self_type" : "_ZTIN3art7DexFile9LocalInfoE",
   "size" : 40,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "begin_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPKh"
    },
    {
     "access" : "protected",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKm"
    },
    {
     "access" : "protected",
     "field_name" : "data_begin_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKPKh"
    },
    {
     "access" : "protected",
     "field_name" : "data_size_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKm"
    },
    {
     "access" : "protected",
     "field_name" : "location_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "location_checksum_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "header_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIKPKN3art7DexFile6HeaderE"
    },
    {
     "access" : "protected",
     "field_name" : "string_ids_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIKPKN3art3dex8StringIdE"
    },
    {
     "access" : "protected",
     "field_name" : "type_ids_",
     "field_offset" : 704,
     "referenced_type" : "_ZTIKPKN3art3dex6TypeIdE"
    },
    {
     "access" : "protected",
     "field_name" : "field_ids_",
     "field_offset" : 768,
     "referenced_type" : "_ZTIKPKN3art3dex7FieldIdE"
    },
    {
     "access" : "protected",
     "field_name" : "method_ids_",
     "field_offset" : 832,
     "referenced_type" : "_ZTIKPKN3art3dex8MethodIdE"
    },
    {
     "access" : "protected",
     "field_name" : "proto_ids_",
     "field_offset" : 896,
     "referenced_type" : "_ZTIKPKN3art3dex7ProtoIdE"
    },
    {
     "access" : "protected",
     "field_name" : "class_defs_",
     "field_offset" : 960,
     "referenced_type" : "_ZTIKPKN3art3dex8ClassDefE"
    },
    {
     "access" : "protected",
     "field_name" : "method_handles_",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPKN3art3dex16MethodHandleItemE"
    },
    {
     "access" : "protected",
     "field_name" : "num_method_handles_",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "call_site_ids_",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPKN3art3dex14CallSiteIdItemE"
    },
    {
     "access" : "protected",
     "field_name" : "num_call_site_ids_",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_class_data_",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPKN3art3dex18HiddenapiClassDataE"
    },
    {
     "access" : "protected",
     "field_name" : "oat_dex_file_",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPKN3art10OatDexFileE"
    },
    {
     "access" : "protected",
     "field_name" : "container_",
     "field_offset" : 1408,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN3art16DexFileContainerENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "is_compact_dex_",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_domain_",
     "field_offset" : 1480,
     "referenced_type" : "_ZTIN3art9hiddenapi6DomainE"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFileE",
   "name" : "art::DexFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art7DexFileE",
   "self_type" : "_ZTIN3art7DexFileE",
   "size" : 192,
   "source_file" : "art/libdexfile/dex/dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art7DexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art7DexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art7DexFileD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile12IsMagicValidEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile14IsVersionValidEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile22SupportsDefaultMethodsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile18GetDequickenedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art7DexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "handle_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP10ZipArchive"
    },
    {
     "access" : "private",
     "field_name" : "zip_entry_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKP8ZipEntry"
    },
    {
     "access" : "private",
     "field_name" : "entry_name_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art8ZipEntryE",
   "name" : "art::ZipEntry",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art8ZipEntryE",
   "self_type" : "_ZTIN3art8ZipEntryE",
   "size" : 48,
   "source_file" : "art/libartbase/base/zip_archive.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art8ZipEntryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art8ZipEntryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art8ZipEntryD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_20forward_iterator_tagEmmmmEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "count_",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3art9CountIterE",
   "name" : "art::CountIter",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art9CountIterE",
   "self_type" : "_ZTIN3art9CountIterE",
   "size" : 8,
   "source_file" : "art/libartbase/base/stl_util.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogMessageE",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogMessageE",
   "self_type" : "_ZTIN7android4base10LogMessageE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "_ZTIN7android4base5LogIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogdLoggerE",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogdLoggerE",
   "self_type" : "_ZTIN7android4base10LogdLoggerE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex6TypeIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::TypeId *, const art::dex::TypeId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex6TypeIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex6TypeIdES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex6TypeIdE", "_ZTIPKN3art3dex6TypeIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7FieldIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::FieldId *, const art::dex::FieldId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7FieldIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7FieldIdES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7FieldIdE", "_ZTIPKN3art3dex7FieldIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7ProtoIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::ProtoId *, const art::dex::ProtoId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7ProtoIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7ProtoIdES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7ProtoIdE", "_ZTIPKN3art3dex7ProtoIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8ClassDefES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::ClassDef *, const art::dex::ClassDef *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8ClassDefES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8ClassDefES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8ClassDefE", "_ZTIPKN3art3dex8ClassDefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8MethodIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::MethodId *, const art::dex::MethodId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8MethodIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8MethodIdES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8MethodIdE", "_ZTIPKN3art3dex8MethodIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8StringIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::StringId *, const art::dex::StringId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8StringIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8StringIdES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8StringIdE", "_ZTIPKN3art3dex8StringIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIjjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned int, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIjjEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIjjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIjmEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned int, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIjmEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIjmEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned long, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned long, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesItjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned short, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesItjEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesItjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesItmEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned short, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesItmEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesItmEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIttEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned short, unsigned short>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIttEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIttEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex6TypeIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::TypeId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex6TypeIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex6TypeIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex6TypeIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7FieldIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::FieldId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7FieldIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7FieldIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7FieldIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7ProtoIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::ProtoId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7ProtoIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7ProtoIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7ProtoIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8ClassDefEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::ClassDef *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8ClassDefEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8ClassDefEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8ClassDefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8MethodIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::MethodId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8MethodIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8MethodIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8MethodIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8StringIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::StringId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8StringIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8StringIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8StringIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerItEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned short>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerItEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerItEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex6TypeIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::TypeId *, const art::dex::TypeId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex6TypeIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex6TypeIdES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex6TypeIdE", "_ZTIPKN3art3dex6TypeIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7FieldIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::FieldId *, const art::dex::FieldId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7FieldIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7FieldIdES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7FieldIdE", "_ZTIPKN3art3dex7FieldIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7ProtoIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::ProtoId *, const art::dex::ProtoId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7ProtoIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7ProtoIdES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7ProtoIdE", "_ZTIPKN3art3dex7ProtoIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8ClassDefES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::ClassDef *, const art::dex::ClassDef *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8ClassDefES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8ClassDefES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8ClassDefE", "_ZTIPKN3art3dex8ClassDefE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8MethodIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::MethodId *, const art::dex::MethodId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8MethodIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8MethodIdES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8MethodIdE", "_ZTIPKN3art3dex8MethodIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8StringIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8StringIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8StringIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::StringId *, const art::dex::StringId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8StringIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8StringIdES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8StringIdE", "_ZTIPKN3art3dex8StringIdE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned int, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjjEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjjEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjmEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned int, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjmEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjmEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned long, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned long, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorItjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned short, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorItjEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorItjEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorItmEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned short, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorItmEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorItmEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIm" ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 16,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIttEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned short, unsigned short>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIttEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIttEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIt" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex6TypeIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::TypeId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex6TypeIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex7FieldIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::FieldId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7FieldIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex7ProtoIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::ProtoId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7ProtoIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex8ClassDefE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::ClassDef *>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8ClassDefE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex8MethodIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::MethodId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8MethodIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex8StringIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8StringIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::StringId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8StringIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8StringIdEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8StringIdE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIjEE",
   "name" : "android::base::log_detail::Storage<unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIjEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIjEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageImEE",
   "name" : "android::base::log_detail::Storage<unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageImEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageImEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageItEE",
   "name" : "android::base::log_detail::Storage<unsigned short>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageItEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageItEE",
   "size" : 2,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "name" : "android::base::LogNullGuard<std::nullptr_t>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIDn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex6TypeIdEEE",
   "name" : "android::base::LogNullGuard<const art::dex::TypeId *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex6TypeIdEEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex6TypeIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex6TypeIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex7FieldIdEEE",
   "name" : "android::base::LogNullGuard<const art::dex::FieldId *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex7FieldIdEEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex7FieldIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7FieldIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex7ProtoIdEEE",
   "name" : "android::base::LogNullGuard<const art::dex::ProtoId *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex7ProtoIdEEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex7ProtoIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7ProtoIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8ClassDefEEE",
   "name" : "android::base::LogNullGuard<const art::dex::ClassDef *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8ClassDefEEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8ClassDefEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8ClassDefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8MethodIdEEE",
   "name" : "android::base::LogNullGuard<const art::dex::MethodId *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8MethodIdEEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8MethodIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8MethodIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8StringIdEEE",
   "name" : "android::base::LogNullGuard<const art::dex::StringId *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8StringIdEEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8StringIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8StringIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "name" : "android::base::LogNullGuard<const char *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "name" : "android::base::LogNullGuard<char *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIjEE",
   "name" : "android::base::LogNullGuard<unsigned int>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIjEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardImEE",
   "name" : "android::base::LogNullGuard<unsigned long>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardImEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardImEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardItEE",
   "name" : "android::base::LogNullGuard<unsigned short>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardItEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardItEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "_ZTIKi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base13ErrnoRestorerE",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base13ErrnoRestorerE",
   "self_type" : "_ZTIN7android4base13ErrnoRestorerE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/errno_restorer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "_ZTIN7android4base11LogSeverityE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base17ScopedLogSeverityE",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base17ScopedLogSeverityE",
   "self_type" : "_ZTIN7android4base17ScopedLogSeverityE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base19ScopedLockAssertionE",
   "name" : "android::base::ScopedLockAssertion",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base19ScopedLockAssertionE",
   "self_type" : "_ZTIN7android4base19ScopedLockAssertionE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/thread_annotations.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN9unix_file16RandomAccessFileE",
   "name" : "unix_file::RandomAccessFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN9unix_file16RandomAccessFileE",
   "self_type" : "_ZTIN9unix_file16RandomAccessFileE",
   "size" : 8,
   "source_file" : "art/libartbase/base/unix_file/random_access_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9unix_file16RandomAccessFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFileD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFile5CloseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9unix_file16RandomAccessFile4ReadEPcll"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFile9SetLengthEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9unix_file16RandomAccessFile9GetLengthEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFile5WriteEPKcll"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFile5FlushEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN9unix_file16RandomAccessFileE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "guard_state_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN9unix_file6FdFile10GuardStateE"
    },
    {
     "access" : "private",
     "field_name" : "fd_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "file_path_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "read_only_mode_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN9unix_file6FdFileE",
   "name" : "unix_file::FdFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN9unix_file6FdFileE",
   "self_type" : "_ZTIN9unix_file6FdFileE",
   "size" : 48,
   "source_file" : "art/libartbase/base/unix_file/fd_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9unix_file6FdFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9unix_file6FdFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9unix_file6FdFileD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9unix_file6FdFile5CloseEv"
    },
    {
     "mangled_component_name" : "_ZNK9unix_file6FdFile4ReadEPcll"
    },
    {
     "mangled_component_name" : "_ZN9unix_file6FdFile9SetLengthEl"
    },
    {
     "mangled_component_name" : "_ZNK9unix_file6FdFile9GetLengthEv"
    },
    {
     "mangled_component_name" : "_ZN9unix_file6FdFile5WriteEPKcll"
    },
    {
     "mangled_component_name" : "_ZN9unix_file6FdFile5FlushEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN3art3dex10ProtoIndexEEE",
   "name" : "std::hash<art::dex::ProtoIndex>",
   "referenced_type" : "_ZTINSt3__14hashIN3art3dex10ProtoIndexEEE",
   "self_type" : "_ZTINSt3__14hashIN3art3dex10ProtoIndexEEE",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" : [ "_ZTIN3art3dex10ProtoIndexE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN3art3dex11StringIndexEEE",
   "name" : "std::hash<art::dex::StringIndex>",
   "referenced_type" : "_ZTINSt3__14hashIN3art3dex11StringIndexEEE",
   "self_type" : "_ZTINSt3__14hashIN3art3dex11StringIndexEEE",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" : [ "_ZTIN3art3dex11StringIndexE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN3art3dex9TypeIndexEEE",
   "name" : "std::hash<art::dex::TypeIndex>",
   "referenced_type" : "_ZTINSt3__14hashIN3art3dex9TypeIndexEEE",
   "self_type" : "_ZTINSt3__14hashIN3art3dex9TypeIndexEEE",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" : [ "_ZTIN3art3dex9TypeIndexE" ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION3art15SplitStringIterE",
   "name" : "art::SplitStringIter &&",
   "referenced_type" : "_ZTIN3art15SplitStringIterE",
   "self_type" : "_ZTION3art15SplitStringIterE",
   "size" : 8,
   "source_file" : "art/libartbase/base/stl_util.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION3art6MemMapE",
   "name" : "art::MemMap &&",
   "referenced_type" : "_ZTIN3art6MemMapE",
   "self_type" : "_ZTION3art6MemMapE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/art_dex_file_loader.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIOPKN3art3dex6TypeIdE",
   "name" : "const art::dex::TypeId *&&",
   "referenced_type" : "_ZTIPKN3art3dex6TypeIdE",
   "self_type" : "_ZTIOPKN3art3dex6TypeIdE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIOPKN3art3dex7FieldIdE",
   "name" : "const art::dex::FieldId *&&",
   "referenced_type" : "_ZTIPKN3art3dex7FieldIdE",
   "self_type" : "_ZTIOPKN3art3dex7FieldIdE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIOPKN3art3dex7ProtoIdE",
   "name" : "const art::dex::ProtoId *&&",
   "referenced_type" : "_ZTIPKN3art3dex7ProtoIdE",
   "self_type" : "_ZTIOPKN3art3dex7ProtoIdE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIOPKN3art3dex8ClassDefE",
