{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_N3art3dex20AnnotationSetRefItemE",
   "name" : "art::dex::AnnotationSetRefItem [1]",
   "referenced_type" : "_ZTIN3art3dex20AnnotationSetRefItemE",
   "self_type" : "_ZTIA1_N3art3dex20AnnotationSetRefItemE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_N3art3dex7MapItemE",
   "name" : "art::dex::MapItem [1]",
   "referenced_type" : "_ZTIN3art3dex7MapItemE",
   "self_type" : "_ZTIA1_N3art3dex7MapItemE",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA1_N3art3dex8TypeItemE",
   "name" : "art::dex::TypeItem [1]",
   "referenced_type" : "_ZTIN3art3dex8TypeItemE",
   "self_type" : "_ZTIA1_N3art3dex8TypeItemE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1_h",
   "name" : "unsigned char [1]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA1_h",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_j",
   "name" : "unsigned int [1]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA1_j",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA1_t",
   "name" : "unsigned short [1]",

   "source_file" : "art/libdexfile/dex/dex_file_loader.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKh",
   "name" : "const unsigned char *const",
   "referenced_type" : "_ZTIPKh",
   "self_type" : "_ZTIKPKh",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKj",
   "name" : "const unsigned int *const",
   "referenced_type" : "_ZTIPKj",
   "self_type" : "_ZTIKPKj",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/compact_offset_table.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKv",
   "name" : "const void *const",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIKPKv",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_loader.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_loader.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/errno_restorer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/libbase/include/android-base/logging.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI10_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI10_jintArray",
   "self_type" : "_ZTI10_jintArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jbyteArray",
   "self_type" : "_ZTI11_jbyteArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jcharArray",
   "self_type" : "_ZTI11_jcharArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jlongArray",
   "self_type" : "_ZTI11_jlongArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI11_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jthrowable",
   "self_type" : "_ZTI11_jthrowable",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12JavaVMOption",
   "name" : "JavaVMOption",
   "referenced_type" : "_ZTI12JavaVMOption",
   "self_type" : "_ZTI12JavaVMOption",
   "size" : 16,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12_jfloatArray",
   "self_type" : "_ZTI12_jfloatArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12_jshortArray",
   "self_type" : "_ZTI12_jshortArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13_jdoubleArray",
   "self_type" : "_ZTI13_jdoubleArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13_jobjectArray",
   "self_type" : "_ZTI13_jobjectArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12JavaVMOption"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI14JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "referenced_type" : "_ZTI14JavaVMInitArgs",
   "self_type" : "_ZTI14JavaVMInitArgs",
   "size" : 24,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI14_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI14_jbooleanArray",
   "self_type" : "_ZTI14_jbooleanArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "signature",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI15JNINativeMethod",
   "name" : "JNINativeMethod",
   "referenced_type" : "_ZTI15JNINativeMethod",
   "self_type" : "_ZTI15JNINativeMethod",
   "size" : 24,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "group",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI16JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "referenced_type" : "_ZTI16JavaVMAttachArgs",
   "self_type" : "_ZTI16JavaVMAttachArgs",
   "size" : 24,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFiP7_JavaVMPPviE"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    }
   ],
   "linker_set_key" : "_ZTI18JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "referenced_type" : "_ZTI18JNIInvokeInterface",
   "self_type" : "_ZTI18JNIInvokeInterface",
   "size" : 64,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP7_JNIEnvE"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcP8_jobjectPKaiE"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcE"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDhE"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvS0_E"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassS2_E"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP11_jthrowableE"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPKcE"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFP11_jthrowableP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFvP7_JNIEnvPKcE"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectS2_E"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassE"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDzE"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 2496,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 2816,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 2880,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 2944,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 3008,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 3200,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 3392,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 3456,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 3520,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 3584,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 3968,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 4352,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 4416,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 4480,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 4800,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 4864,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 4928,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 4992,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 5056,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 5120,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 5184,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 5248,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 5312,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 5376,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 5440,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 5504,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 5760,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 5824,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 5888,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 5952,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 6016,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 6080,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P9_jfieldIDE"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 6144,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 6208,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 6272,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 6336,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 6400,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 6464,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 6528,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 6592,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 6656,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDS2_E"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 6720,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDhE"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 6784,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDaE"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 6848,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDtE"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 6912,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDsE"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 6976,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDiE"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 7040,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDlE"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 7104,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDfE"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 7168,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDdE"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 7232,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 7296,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 7360,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 7424,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 7488,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 7552,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 7616,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 7680,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 7744,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 7808,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 7872,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 7936,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 8000,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 8064,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 8128,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 8192,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 8256,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 8320,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 8384,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 8448,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 8512,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 8576,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 8640,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 8704,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 8768,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 8832,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 8896,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 8960,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 9024,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 9088,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 9152,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 9216,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 9280,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 9344,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 9408,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 9472,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 9536,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 9600,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 9664,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 9728,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 9792,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 9856,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDP8_jobjectE"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 9920,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 9984,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDaE"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 10048,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDtE"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 10112,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDsE"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 10176,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDiE"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 10240,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDlE"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 10304,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDfE"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 10368,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDdE"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 10432,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKtiE"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 10496,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 10560,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 10624,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 10688,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKcE"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 10752,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 10816,
     "referenced_type" : "_ZTIPFPKcP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 10880,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKcE"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 10944,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jarrayE"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 11008,
     "referenced_type" : "_ZTIPFP13_jobjectArrayP7_JNIEnviP7_jclassP8_jobjectE"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 11072,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP13_jobjectArrayiE"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 11136,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jobjectArrayiP8_jobjectE"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 11200,
     "referenced_type" : "_ZTIPFP14_jbooleanArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 11264,
     "referenced_type" : "_ZTIPFP11_jbyteArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 11328,
     "referenced_type" : "_ZTIPFP11_jcharArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 11392,
     "referenced_type" : "_ZTIPFP12_jshortArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 11456,
     "referenced_type" : "_ZTIPFP10_jintArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 11520,
     "referenced_type" : "_ZTIPFP11_jlongArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 11584,
     "referenced_type" : "_ZTIPFP12_jfloatArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 11648,
     "referenced_type" : "_ZTIPFP13_jdoubleArrayP7_JNIEnviE"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 11712,
     "referenced_type" : "_ZTIPFPhP7_JNIEnvP14_jbooleanArrayS_E"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 11776,
     "referenced_type" : "_ZTIPFPaP7_JNIEnvP11_jbyteArrayPhE"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 11840,
     "referenced_type" : "_ZTIPFPtP7_JNIEnvP11_jcharArrayPhE"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 11904,
     "referenced_type" : "_ZTIPFPsP7_JNIEnvP12_jshortArrayPhE"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 11968,
     "referenced_type" : "_ZTIPFPiP7_JNIEnvP10_jintArrayPhE"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 12032,
     "referenced_type" : "_ZTIPFPlP7_JNIEnvP11_jlongArrayPhE"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 12096,
     "referenced_type" : "_ZTIPFPfP7_JNIEnvP12_jfloatArrayPhE"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 12160,
     "referenced_type" : "_ZTIPFPdP7_JNIEnvP13_jdoubleArrayPhE"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 12224,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayPhiE"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 12288,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayPaiE"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 12352,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayPtiE"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 12416,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayPsiE"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 12480,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayPiiE"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 12544,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayPliE"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 12608,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayPfiE"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 12672,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayPdiE"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 12736,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPhE"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 12800,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPaE"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 12864,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPtE"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 12928,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPsE"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 12992,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPiE"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 13056,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPlE"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 13120,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPfE"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 13184,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPdE"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 13248,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPKhE"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 13312,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPKaE"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 13376,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPKtE"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 13440,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPKsE"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 13504,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPKiE"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 13568,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPKlE"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 13632,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPKfE"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 13696,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPKdE"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 13760,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPK15JNINativeMethodiE"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 13824,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 13888,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 13952,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 14016,
     "referenced_type" : "_ZTIPFiP7_JNIEnvPP7_JavaVME"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 14080,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPtE"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 14144,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPcE"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 14208,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP7_jarrayPhE"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 14272,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jarrayPviE"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 14336,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 14400,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 14464,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 14528,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 14592,
     "referenced_type" : "_ZTIPFhP7_JNIEnvE"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 14656,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvPvlE"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 14720,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 14784,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 14848,
     "referenced_type" : "_ZTIPF14jobjectRefTypeP7_JNIEnvP8_jobjectE"
    }
   ],
   "linker_set_key" : "_ZTI18JNINativeInterface",
   "name" : "JNINativeInterface",
   "referenced_type" : "_ZTI18JNINativeInterface",
   "self_type" : "_ZTI18JNINativeInterface",
   "size" : 1864,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "b",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "c",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "i",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "j",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "d",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "l",
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI6jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6jvalue",
   "self_type" : "_ZTI6jvalue",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNINativeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JNIEnv",
   "name" : "_JNIEnv",
   "referenced_type" : "_ZTI7_JNIEnv",
   "self_type" : "_ZTI7_JNIEnv",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNIInvokeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JavaVM",
   "name" : "_JavaVM",
   "referenced_type" : "_ZTI7_JavaVM",
   "self_type" : "_ZTI7_JavaVM",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI7_jarray",
   "self_type" : "_ZTI7_jarray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "referenced_type" : "_ZTI7_jclass",
   "self_type" : "_ZTI7_jclass",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI8_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8_jobject",
   "self_type" : "_ZTI8_jobject",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI8_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8_jstring",
   "self_type" : "_ZTI8_jstring",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art10FreeDeleteE",
   "name" : "art::FreeDelete",
   "referenced_type" : "_ZTIN3art10FreeDeleteE",
   "self_type" : "_ZTIN3art10FreeDeleteE",
   "size" : 1,
   "source_file" : "art/libartbase/base/stl_util.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art11ValueObjectE",
   "name" : "art::ValueObject",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art11ValueObjectE",
   "self_type" : "_ZTIN3art11ValueObjectE",
   "size" : 1,
   "source_file" : "art/libartbase/base/value_object.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN3art13DexFileLoaderE",
   "name" : "art::DexFileLoader",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art13DexFileLoaderE",
   "self_type" : "_ZTIN3art13DexFileLoaderE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_loader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art13DexFileLoaderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art13DexFileLoaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art13DexFileLoaderD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader20GetMultiDexChecksumsEPKcPNSt3__16vectorIjNS3_9allocatorIjEEEEPNS4_INS3_12basic_stringIcNS3_11char_traitsIcEENS5_IcEEEENS5_ISD_EEEEPSD_iPb"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader4OpenEPKhmRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEjPKNS_10OatDexFileEbbPS9_NS3_10unique_ptrINS_16DexFileContainerENS3_14default_deleteISH_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader19OpenWithDataSectionEPKhmS2_mRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEjPKNS_10OatDexFileEbbPS9_"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader7OpenAllEPKhmRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEbbPNS_22DexFileLoaderErrorCodeEPS9_PNS3_6vectorINS3_10unique_ptrIKNS_7DexFileENS3_14default_deleteISI_EEEENS7_ISL_EEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFile6HeaderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "feature_flags_",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_pos_",
     "field_offset" : 928,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_table_offset_",
     "field_offset" : 960,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_base_",
     "field_offset" : 992,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "owned_data_begin_",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "owned_data_end_",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art14CompactDexFile6HeaderE",
   "name" : "art::CompactDexFile::Header",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art14CompactDexFile6HeaderE",
   "self_type" : "_ZTIN3art14CompactDexFile6HeaderE",
   "size" : 136,
   "source_file" : "art/libdexfile/dex/compact_dex_file.h"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8CodeItemE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fields_",
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "insns_count_and_flags_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "insns_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_t"
    }
   ],
   "linker_set_key" : "_ZTIN3art14CompactDexFile8CodeItemE",
   "name" : "art::CompactDexFile::CodeItem",
   "referenced_type" : "_ZTIN3art14CompactDexFile8CodeItemE",
   "self_type" : "_ZTIN3art14CompactDexFile8CodeItemE",
   "size" : 6,
   "source_file" : "art/libdexfile/dex/compact_dex_file.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFileE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIN3art18CompactOffsetTable8AccessorE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14CompactDexFileE",
   "name" : "art::CompactDexFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art14CompactDexFileE",
   "self_type" : "_ZTIN3art14CompactDexFileE",
   "size" : 216,
   "source_file" : "art/libdexfile/dex/compact_dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art14CompactDexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art14CompactDexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art14CompactDexFileD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile12IsMagicValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile14IsVersionValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile22SupportsDefaultMethodsEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile18GetDequickenedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "_ZTIN3art15SplitStringIterE"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3art15SplitStringIterE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14IterationRangeINS_15SplitStringIterEEE",
   "name" : "art::IterationRange<art::SplitStringIter>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art14IterationRangeINS_15SplitStringIterEEE",
   "self_type" : "_ZTIN3art14IterationRangeINS_15SplitStringIterEEE",
   "size" : 64,
   "source_file" : "art/libartbase/base/iteration_range.h",
   "template_args" : [ "_ZTIN3art15SplitStringIterE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "_ZTIN3art9CountIterE"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3art9CountIterE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14IterationRangeINS_9CountIterEEE",
   "name" : "art::IterationRange<art::CountIter>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art14IterationRangeINS_9CountIterEEE",
   "self_type" : "_ZTIN3art14IterationRangeINS_9CountIterEEE",
   "size" : 16,
   "source_file" : "art/libartbase/base/iteration_range.h",
   "template_args" : [ "_ZTIN3art9CountIterE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_20forward_iterator_tagENS_17basic_string_viewIcNS_11char_traitsIcEEEElPS5_RS5_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "cur_index_",
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "split_on_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "sv_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15SplitStringIterE",
   "name" : "art::SplitStringIter",
   "referenced_type" : "_ZTIN3art15SplitStringIterE",
   "self_type" : "_ZTIN3art15SplitStringIterE",
   "size" : 32,
   "source_file" : "art/libartbase/base/stl_util.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFile6HeaderE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15StandardDexFile6HeaderE",
   "name" : "art::StandardDexFile::Header",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art15StandardDexFile6HeaderE",
   "self_type" : "_ZTIN3art15StandardDexFile6HeaderE",
   "size" : 112,
   "source_file" : "art/libdexfile/dex/standard_dex_file.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8CodeItemE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "registers_size_",
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "ins_size_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "outs_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "tries_size_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_off_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "insns_size_in_code_units_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "insns_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_t"
    }
   ],
   "linker_set_key" : "_ZTIN3art15StandardDexFile8CodeItemE",
   "name" : "art::StandardDexFile::CodeItem",
   "referenced_type" : "_ZTIN3art15StandardDexFile8CodeItemE",
   "self_type" : "_ZTIN3art15StandardDexFile8CodeItemE",
   "size" : 20,
   "source_file" : "art/libdexfile/dex/standard_dex_file.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFileE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15StandardDexFileE",
   "name" : "art::StandardDexFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art15StandardDexFileE",
   "self_type" : "_ZTIN3art15StandardDexFileE",
   "size" : 192,
   "source_file" : "art/libdexfile/dex/standard_dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art15StandardDexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art15StandardDexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art15StandardDexFileD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile12IsMagicValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile14IsVersionValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile22SupportsDefaultMethodsEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile18GetDequickenedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art7DexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN3art16DexFileContainerE",
   "name" : "art::DexFileContainer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art16DexFileContainerE",
   "self_type" : "_ZTIN3art16DexFileContainerE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art16DexFileContainerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art16DexFileContainerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art16DexFileContainerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer14GetPermissionsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer10IsReadOnlyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer11EnableWriteEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer12DisableWriteEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "table_",
     "referenced_type" : "_ZTIKPKj"
    },
    {
     "access" : "private",
     "field_name" : "minimum_offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "data_begin_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKPKh"
    }
   ],
   "linker_set_key" : "_ZTIN3art18CompactOffsetTable8AccessorE",
   "name" : "art::CompactOffsetTable::Accessor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art18CompactOffsetTable8AccessorE",
   "self_type" : "_ZTIN3art18CompactOffsetTable8AccessorE",
   "size" : 24,
   "source_file" : "art/libdexfile/dex/compact_offset_table.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art18CompactOffsetTableE",
   "name" : "art::CompactOffsetTable",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art18CompactOffsetTableE",
   "self_type" : "_ZTIN3art18CompactOffsetTableE",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/compact_offset_table.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_file_",
     "referenced_type" : "_ZTIRKN3art7DexFileE"
    },
    {
     "access" : "private",
     "field_name" : "type_list_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKN3art3dex8TypeListE"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "pos_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art24DexFileParameterIteratorE",
   "name" : "art::DexFileParameterIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art24DexFileParameterIteratorE",
   "self_type" : "_ZTIN3art24DexFileParameterIteratorE",
   "size" : 24,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "dex_file_",
     "referenced_type" : "_ZTIRKN3art7DexFileE"
    },
    {
     "access" : "protected",
     "field_name" : "array_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "pos_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "ptr_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "protected",
     "field_name" : "type_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE"
    },
    {
     "access" : "protected",
     "field_name" : "jval_",
     "field_offset" : 320,
     "referenced_type" : "_ZTI6jvalue"
    }
   ],
   "linker_set_key" : "_ZTIN3art25EncodedArrayValueIteratorE",
   "name" : "art::EncodedArrayValueIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art25EncodedArrayValueIteratorE",
   "self_type" : "_ZTIN3art25EncodedArrayValueIteratorE",
   "size" : 48,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art25EncodedArrayValueIteratorE"
    }
   ],
   "linker_set_key" : "_ZTIN3art26CallSiteArrayValueIteratorE",
   "name" : "art::CallSiteArrayValueIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art26CallSiteArrayValueIteratorE",
   "self_type" : "_ZTIN3art26CallSiteArrayValueIteratorE",
   "size" : 48,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art25EncodedArrayValueIteratorE"
    }
   ],
   "linker_set_key" : "_ZTIN3art31EncodedStaticFieldValueIteratorE",
   "name" : "art::EncodedStaticFieldValueIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art31EncodedStaticFieldValueIteratorE",
   "self_type" : "_ZTIN3art31EncodedStaticFieldValueIteratorE",
   "size" : 48,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8DexIndexItEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex10ProtoIndexE",
   "name" : "art::dex::ProtoIndex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex10ProtoIndexE",
   "self_type" : "_ZTIN3art3dex10ProtoIndexE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8DexIndexIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex11StringIndexE",
   "name" : "art::dex::StringIndex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex11StringIndexE",
   "self_type" : "_ZTIN3art3dex11StringIndexE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "visibility_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "annotation_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex14AnnotationItemE",
   "name" : "art::dex::AnnotationItem",
   "referenced_type" : "_ZTIN3art3dex14AnnotationItemE",
   "self_type" : "_ZTIN3art3dex14AnnotationItemE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data_off_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex14CallSiteIdItemE",
   "name" : "art::dex::CallSiteIdItem",
   "referenced_type" : "_ZTIN3art3dex14CallSiteIdItemE",
   "self_type" : "_ZTIN3art3dex14CallSiteIdItemE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "method_handle_type_",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "reserved1_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "field_or_method_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "reserved2_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex16MethodHandleItemE",
   "name" : "art::dex::MethodHandleItem",
   "referenced_type" : "_ZTIN3art3dex16MethodHandleItemE",
   "self_type" : "_ZTIN3art3dex16MethodHandleItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "entries_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_j"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex17AnnotationSetItemE",
   "name" : "art::dex::AnnotationSetItem",
   "referenced_type" : "_ZTIN3art3dex17AnnotationSetItemE",
   "self_type" : "_ZTIN3art3dex17AnnotationSetItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags_offset_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_j"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex18HiddenapiClassDataE",
   "name" : "art::dex::HiddenapiClassData",
   "referenced_type" : "_ZTIN3art3dex18HiddenapiClassDataE",
   "self_type" : "_ZTIN3art3dex18HiddenapiClassDataE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "annotations_off_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex20AnnotationSetRefItemE",
   "name" : "art::dex::AnnotationSetRefItem",
   "referenced_type" : "_ZTIN3art3dex20AnnotationSetRefItemE",
   "self_type" : "_ZTIN3art3dex20AnnotationSetRefItemE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_N3art3dex20AnnotationSetRefItemE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex20AnnotationSetRefListE",
   "name" : "art::dex::AnnotationSetRefList",
   "referenced_type" : "_ZTIN3art3dex20AnnotationSetRefListE",
   "self_type" : "_ZTIN3art3dex20AnnotationSetRefListE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "field_idx_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex20FieldAnnotationsItemE",
   "name" : "art::dex::FieldAnnotationsItem",
   "referenced_type" : "_ZTIN3art3dex20FieldAnnotationsItemE",
   "self_type" : "_ZTIN3art3dex20FieldAnnotationsItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "method_idx_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex21MethodAnnotationsItemE",
   "name" : "art::dex::MethodAnnotationsItem",
   "referenced_type" : "_ZTIN3art3dex21MethodAnnotationsItemE",
   "self_type" : "_ZTIN3art3dex21MethodAnnotationsItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_annotations_off_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fields_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "methods_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "parameters_size_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex24AnnotationsDirectoryItemE",
   "name" : "art::dex::AnnotationsDirectoryItem",
   "referenced_type" : "_ZTIN3art3dex24AnnotationsDirectoryItemE",
   "self_type" : "_ZTIN3art3dex24AnnotationsDirectoryItemE",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "method_idx_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex24ParameterAnnotationsItemE",
   "name" : "art::dex::ParameterAnnotationsItem",
   "referenced_type" : "_ZTIN3art3dex24ParameterAnnotationsItemE",
   "self_type" : "_ZTIN3art3dex24ParameterAnnotationsItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "descriptor_idx_",
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex6TypeIdE",
   "name" : "art::dex::TypeId",
   "referenced_type" : "_ZTIN3art3dex6TypeIdE",
   "self_type" : "_ZTIN3art3dex6TypeIdE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "type_idx_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "name_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7FieldIdE",
   "name" : "art::dex::FieldId",
   "referenced_type" : "_ZTIN3art3dex7FieldIdE",
   "self_type" : "_ZTIN3art3dex7FieldIdE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type_",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "unused_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7MapItemE",
   "name" : "art::dex::MapItem",
   "referenced_type" : "_ZTIN3art3dex7MapItemE",
   "self_type" : "_ZTIN3art3dex7MapItemE",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_N3art3dex7MapItemE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7MapListE",
   "name" : "art::dex::MapList",
   "referenced_type" : "_ZTIN3art3dex7MapListE",
   "self_type" : "_ZTIN3art3dex7MapListE",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shorty_idx_",
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    },
    {
     "field_name" : "return_type_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "pad_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "parameters_off_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7ProtoIdE",
   "name" : "art::dex::ProtoId",
   "referenced_type" : "_ZTIN3art3dex7ProtoIdE",
   "self_type" : "_ZTIN3art3dex7ProtoIdE",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_addr_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "insn_count_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "handler_off_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7TryItemE",
   "name" : "art::dex::TryItem",
   "referenced_type" : "_ZTIN3art3dex7TryItemE",
   "self_type" : "_ZTIN3art3dex7TryItemE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "pad1_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "access_flags_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "superclass_idx_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "pad2_",
     "field_offset" : 80,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "interfaces_off_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "source_file_idx_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "class_data_off_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "static_values_off_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8ClassDefE",
   "name" : "art::dex::ClassDef",
   "referenced_type" : "_ZTIN3art3dex8ClassDefE",
   "self_type" : "_ZTIN3art3dex8ClassDefE",
   "size" : 32,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art3dex8CodeItemE",
   "name" : "art::dex::CodeItem",
   "referenced_type" : "_ZTIN3art3dex8CodeItemE",
   "self_type" : "_ZTIN3art3dex8CodeItemE",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8DexIndexIjEE",
   "name" : "art::dex::DexIndex<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex8DexIndexIjEE",
   "self_type" : "_ZTIN3art3dex8DexIndexIjEE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "index_",
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8DexIndexItEE",
   "name" : "art::dex::DexIndex<unsigned short>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex8DexIndexItEE",
   "self_type" : "_ZTIN3art3dex8DexIndexItEE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "proto_idx_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN3art3dex10ProtoIndexE"
    },
    {
     "field_name" : "name_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8MethodIdE",
   "name" : "art::dex::MethodId",
   "referenced_type" : "_ZTIN3art3dex8MethodIdE",
   "self_type" : "_ZTIN3art3dex8MethodIdE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "string_data_off_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8StringIdE",
   "name" : "art::dex::StringId",
   "referenced_type" : "_ZTIN3art3dex8StringIdE",
   "self_type" : "_ZTIN3art3dex8StringIdE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "type_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8TypeItemE",
   "name" : "art::dex::TypeItem",
   "referenced_type" : "_ZTIN3art3dex8TypeItemE",
   "self_type" : "_ZTIN3art3dex8TypeItemE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_N3art3dex8TypeItemE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8TypeListE",
   "name" : "art::dex::TypeList",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex8TypeListE",
   "self_type" : "_ZTIN3art3dex8TypeListE",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8DexIndexItEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex9TypeIndexE",
   "name" : "art::dex::TypeIndex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art3dex9TypeIndexE",
   "self_type" : "_ZTIN3art3dex9TypeIndexE",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "address_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "line_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "source_file_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "prologue_end_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "epilogue_begin_",
     "field_offset" : 136,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFile12PositionInfoE",
   "name" : "art::DexFile::PositionInfo",
   "referenced_type" : "_ZTIN3art7DexFile12PositionInfoE",
   "self_type" : "_ZTIN3art7DexFile12PositionInfoE",
   "size" : 24,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic_",
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "checksum_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "signature_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA20_h"
    },
    {
     "field_name" : "file_size_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "header_size_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "endian_tag_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "link_size_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "link_off_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "map_off_",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "string_ids_size_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "string_ids_off_",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type_ids_size_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type_ids_off_",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "proto_ids_size_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "proto_ids_off_",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "field_ids_size_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "field_ids_off_",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "method_ids_size_",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "method_ids_off_",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "class_defs_size_",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "class_defs_off_",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data_size_",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data_off_",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFile6HeaderE",
   "name" : "art::DexFile::Header",
   "referenced_type" : "_ZTIN3art7DexFile6HeaderE",
   "self_type" : "_ZTIN3art7DexFile6HeaderE",
   "size" : 112,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "descriptor_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "signature_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "start_address_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "end_address_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reg_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "is_live_",
     "field_offset" : 272,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFile9LocalInfoE",
   "name" : "art::DexFile::LocalInfo",
   "referenced_type" : "_ZTIN3art7DexFile9LocalInfoE",
   "self_type" : "_ZTIN3art7DexFile9LocalInfoE",
   "size" : 40,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "begin_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPKh"
    },
    {
     "access" : "protected",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKm"
    },
    {
     "access" : "protected",
     "field_name" : "data_begin_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKPKh"
    },
    {
     "access" : "protected",
     "field_name" : "data_size_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKm"
    },
    {
     "access" : "protected",
     "field_name" : "location_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "location_checksum_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "header_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIKPKN3art7DexFile6HeaderE"
    },
    {
     "access" : "protected",
     "field_name" : "string_ids_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIKPKN3art3dex8StringIdE"
    },
    {
     "access" : "protected",
     "field_name" : "type_ids_",
     "field_offset" : 704,
     "referenced_type" : "_ZTIKPKN3art3dex6TypeIdE"
    },
    {
     "access" : "protected",
     "field_name" : "field_ids_",
     "field_offset" : 768,
     "referenced_type" : "_ZTIKPKN3art3dex7FieldIdE"
    },
    {
     "access" : "protected",
     "field_name" : "method_ids_",
     "field_offset" : 832,
     "referenced_type" : "_ZTIKPKN3art3dex8MethodIdE"
    },
    {
     "access" : "protected",
     "field_name" : "proto_ids_",
     "field_offset" : 896,
     "referenced_type" : "_ZTIKPKN3art3dex7ProtoIdE"
    },
    {
     "access" : "protected",
     "field_name" : "class_defs_",
     "field_offset" : 960,
     "referenced_type" : "_ZTIKPKN3art3dex8ClassDefE"
    },
    {
     "access" : "protected",
     "field_name" : "method_handles_",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPKN3art3dex16MethodHandleItemE"
    },
    {
     "access" : "protected",
     "field_name" : "num_method_handles_",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "call_site_ids_",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPKN3art3dex14CallSiteIdItemE"
    },
    {
     "access" : "protected",
     "field_name" : "num_call_site_ids_",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_class_data_",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPKN3art3dex18HiddenapiClassDataE"
    },
    {
     "access" : "protected",
     "field_name" : "oat_dex_file_",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPKN3art10OatDexFileE"
    },
    {
     "access" : "protected",
     "field_name" : "container_",
     "field_offset" : 1408,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN3art16DexFileContainerENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "is_compact_dex_",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_domain_",
     "field_offset" : 1480,
     "referenced_type" : "_ZTIN3art9hiddenapi6DomainE"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFileE",
   "name" : "art::DexFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art7DexFileE",
   "self_type" : "_ZTIN3art7DexFileE",
   "size" : 192,
   "source_file" : "art/libdexfile/dex/dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art7DexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art7DexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art7DexFileD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile12IsMagicValidEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile14IsVersionValidEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile22SupportsDefaultMethodsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile18GetDequickenedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art7DexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_20forward_iterator_tagEmmmmEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "count_",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3art9CountIterE",
   "name" : "art::CountIter",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3art9CountIterE",
   "self_type" : "_ZTIN3art9CountIterE",
   "size" : 8,
   "source_file" : "art/libartbase/base/stl_util.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogMessageE",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogMessageE",
   "self_type" : "_ZTIN7android4base10LogMessageE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "_ZTIN7android4base5LogIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogdLoggerE",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogdLoggerE",
   "self_type" : "_ZTIN7android4base10LogdLoggerE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex6TypeIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::TypeId *, const art::dex::TypeId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex6TypeIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex6TypeIdES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex6TypeIdE", "_ZTIPKN3art3dex6TypeIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7FieldIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::FieldId *, const art::dex::FieldId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7FieldIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7FieldIdES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7FieldIdE", "_ZTIPKN3art3dex7FieldIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7ProtoIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::ProtoId *, const art::dex::ProtoId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7ProtoIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7ProtoIdES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7ProtoIdE", "_ZTIPKN3art3dex7ProtoIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8ClassDefES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::ClassDef *, const art::dex::ClassDef *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8ClassDefES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8ClassDefES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8ClassDefE", "_ZTIPKN3art3dex8ClassDefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8MethodIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::MethodId *, const art::dex::MethodId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8MethodIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8MethodIdES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8MethodIdE", "_ZTIPKN3art3dex8MethodIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8StringIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::StringId *, const art::dex::StringId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8StringIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8StringIdES7_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8StringIdE", "_ZTIPKN3art3dex8StringIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKcS4_EE",
   "name" : "android::base::log_detail::StorageTypes<const char *, const char *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKcS4_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKcS4_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKc", "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKhS4_EE",
   "name" : "android::base::log_detail::StorageTypes<const unsigned char *, const unsigned char *>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKhS4_EE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIPKhS4_EE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKh", "_ZTIPKh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIjjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned int, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIjjEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIjjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIjmEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned int, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIjmEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIjmEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned long, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesImjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned long, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesImmEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesItjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned short, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesItjEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesItjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesItmEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned short, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesItmEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesItmEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIttEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned short, unsigned short>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIttEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIttEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex6TypeIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::TypeId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex6TypeIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex6TypeIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex6TypeIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7FieldIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::FieldId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7FieldIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7FieldIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7FieldIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7ProtoIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::ProtoId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7ProtoIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7ProtoIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7ProtoIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8ClassDefEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::ClassDef *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8ClassDefEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8ClassDefEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8ClassDefE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8MethodIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::MethodId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8MethodIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8MethodIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8MethodIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8StringIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::StringId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8StringIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8StringIdEEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8StringIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKcEE",
   "name" : "android::base::log_detail::IsCharPointer<const char *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKcEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKcEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKhEE",
   "name" : "android::base::log_detail::IsCharPointer<const unsigned char *>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKhEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIPKhEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerImEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerItEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned short>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerItEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerItEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex6TypeIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::TypeId *, const art::dex::TypeId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex6TypeIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex6TypeIdES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex6TypeIdE", "_ZTIPKN3art3dex6TypeIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7FieldIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::FieldId *, const art::dex::FieldId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7FieldIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7FieldIdES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7FieldIdE", "_ZTIPKN3art3dex7FieldIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7ProtoIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::ProtoId *, const art::dex::ProtoId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7ProtoIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7ProtoIdES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7ProtoIdE", "_ZTIPKN3art3dex7ProtoIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8ClassDefES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::ClassDef *, const art::dex::ClassDef *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8ClassDefES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8ClassDefES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8ClassDefE", "_ZTIPKN3art3dex8ClassDefE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8MethodIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::MethodId *, const art::dex::MethodId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8MethodIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8MethodIdES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8MethodIdE", "_ZTIPKN3art3dex8MethodIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8StringIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8StringIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8StringIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::StringId *, const art::dex::StringId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8StringIdES7_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8StringIdES7_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8StringIdE", "_ZTIPKN3art3dex8StringIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKvEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKvEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKcS4_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const char *, const char *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKcS4_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKcS4_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKc", "_ZTIPKc" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKvEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKvEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKhS4_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKhS4_EE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKhS4_EE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKh", "_ZTIPKh" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned int, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjjEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjjEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjmEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned int, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjmEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjmEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIm" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned long, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImjEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned long, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorImmEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIm", "_ZTIm" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorItjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned short, unsigned int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorItjEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorItjEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageImEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorItmEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned short, unsigned long>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorItmEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorItmEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIm" ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 16,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIttEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned short, unsigned short>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIttEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIttEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIt", "_ZTIt" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex6TypeIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::TypeId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex6TypeIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex7FieldIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::FieldId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7FieldIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex7ProtoIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::ProtoId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex7ProtoIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex8ClassDefE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::ClassDef *>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8ClassDefE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex8MethodIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::MethodId *>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKN3art3dex8MethodIdE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex8StringIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8StringIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::StringId *>",
