#ifndef HIDL_GENERATED_ANDROID_HARDWARE_TV_CEC_V2_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_TV_CEC_V2_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace tv {
namespace cec {
namespace V2_0 {

// Forward declaration for forward reference support:
enum class CecDeviceType : int32_t;
enum class CecLogicalAddress : int32_t;
enum class CecMessageType : int32_t;
enum class AbortReason : int32_t;
enum class MaxLength : int32_t;
struct CecMessage;
enum class SendMessageResult : int32_t;
enum class CecAllDeviceTypeValue : uint8_t;
enum class CecVersion : int32_t;
enum class CecDeviceFeature : uint32_t;
enum class CecRcProfileId : uint8_t;
enum class CecRcProfileSource : uint8_t;
struct CecRcProfile1;
struct CecRcProfile;
enum class CecPowerState : int8_t;
struct CecDeviceInfo;
enum class CecTopologyEventType : int32_t;
struct CecTopologyEvent;
enum class CecUICommandCodes : int32_t;
enum class HdmiPortType : int32_t;
enum class OptionKey : int32_t;
struct HotplugEvent;
struct HdmiPortInfo;
enum class Result : int32_t;

/**
 * CEC device type as specified in CEC Table 11-7 of the CEC spec 2.0b.
 */
enum class CecDeviceType : int32_t {
    INACTIVE = -1 /* -1 */,
    TV = 0,
    RECORDER = 1,
    TUNER = 3,
    PLAYBACK = 4,
    AUDIO_SYSTEM = 5,
    PURE_CEC_SWITCH = 6,
    PROCESSOR = 7,
    MAX = 7 /* PROCESSOR */,
};

/**
 * CEC logical address as specified in CEC Table 11-9 of the CEC spec 2.0b.
 */
enum class CecLogicalAddress : int32_t {
    TV = 0,
    RECORDER_1 = 1,
    RECORDER_2 = 2,
    TUNER_1 = 3,
    PLAYBACK_1 = 4,
    AUDIO_SYSTEM = 5,
    TUNER_2 = 6,
    TUNER_3 = 7,
    PLAYBACK_2 = 8,
    RECORDER_3 = 9,
    TUNER_4 = 10,
    PLAYBACK_3 = 11,
    BACKUP_1 = 12,
    BACKUP_2 = 13,
    SPECIFIC_USE = 14,
    UNREGISTERED = 15,
    BROADCAST = 15,
};

/**
 * HDMI CEC message types.
 *
 * The assigned values represent opcode used in CEC frame as specified in
 * Section 11.10 of the CEC spec 2.0b on top of Section CEC 15 of the CEC
 * Spec 1.4b.
 */
enum class CecMessageType : int32_t {
    FEATURE_ABORT = 0 /* 0x00 */,
    IMAGE_VIEW_ON = 4 /* 0x04 */,
    TUNER_STEP_INCREMENT = 5 /* 0x05 */,
    TUNER_STEP_DECREMENT = 6 /* 0x06 */,
    TUNER_DEVICE_STATUS = 7 /* 0x07 */,
    GIVE_TUNER_DEVICE_STATUS = 8 /* 0x08 */,
    RECORD_ON = 9 /* 0x09 */,
    RECORD_STATUS = 10 /* 0x0A */,
    RECORD_OFF = 11 /* 0x0B */,
    TEXT_VIEW_ON = 13 /* 0x0D */,
    RECORD_TV_SCREEN = 15 /* 0x0F */,
    GIVE_DECK_STATUS = 26 /* 0x1A */,
    DECK_STATUS = 27 /* 0x1B */,
    SET_MENU_LANGUAGE = 50 /* 0x32 */,
    CLEAR_ANALOG_TIMER = 51 /* 0x33 */,
    SET_ANALOG_TIMER = 52 /* 0x34 */,
    TIMER_STATUS = 53 /* 0x35 */,
    STANDBY = 54 /* 0x36 */,
    PLAY = 65 /* 0x41 */,
    DECK_CONTROL = 66 /* 0x42 */,
    TIMER_CLEARED_STATUS = 67 /* 0x43 */,
    USER_CONTROL_PRESSED = 68 /* 0x44 */,
    USER_CONTROL_RELEASED = 69 /* 0x45 */,
    GIVE_OSD_NAME = 70 /* 0x46 */,
    SET_OSD_NAME = 71 /* 0x47 */,
    SET_OSD_STRING = 100 /* 0x64 */,
    SET_TIMER_PROGRAM_TITLE = 103 /* 0x67 */,
    SYSTEM_AUDIO_MODE_REQUEST = 112 /* 0x70 */,
    GIVE_AUDIO_STATUS = 113 /* 0x71 */,
    SET_SYSTEM_AUDIO_MODE = 114 /* 0x72 */,
    REPORT_AUDIO_STATUS = 122 /* 0x7A */,
    GIVE_SYSTEM_AUDIO_MODE_STATUS = 125 /* 0x7D */,
    SYSTEM_AUDIO_MODE_STATUS = 126 /* 0x7E */,
    ROUTING_CHANGE = 128 /* 0x80 */,
    ROUTING_INFORMATION = 129 /* 0x81 */,
    ACTIVE_SOURCE = 130 /* 0x82 */,
    GIVE_PHYSICAL_ADDRESS = 131 /* 0x83 */,
    REPORT_PHYSICAL_ADDRESS = 132 /* 0x84 */,
    REQUEST_ACTIVE_SOURCE = 133 /* 0x85 */,
    SET_STREAM_PATH = 134 /* 0x86 */,
    DEVICE_VENDOR_ID = 135 /* 0x87 */,
    VENDOR_COMMAND = 137 /* 0x89 */,
    VENDOR_REMOTE_BUTTON_DOWN = 138 /* 0x8A */,
    VENDOR_REMOTE_BUTTON_UP = 139 /* 0x8B */,
    GIVE_DEVICE_VENDOR_ID = 140 /* 0x8C */,
    MENU_REQUEST = 141 /* 0x8D */,
    MENU_STATUS = 142 /* 0x8E */,
    GIVE_DEVICE_POWER_STATUS = 143 /* 0x8F */,
    REPORT_POWER_STATUS = 144 /* 0x90 */,
    GET_MENU_LANGUAGE = 145 /* 0x91 */,
    SELECT_ANALOG_SERVICE = 146 /* 0x92 */,
    SELECT_DIGITAL_SERVICE = 147 /* 0x93 */,
    SET_DIGITAL_TIMER = 151 /* 0x97 */,
    CLEAR_DIGITAL_TIMER = 153 /* 0x99 */,
    SET_AUDIO_RATE = 154 /* 0x9A */,
    INACTIVE_SOURCE = 157 /* 0x9D */,
    CEC_VERSION = 158 /* 0x9E */,
    GET_CEC_VERSION = 159 /* 0x9F */,
    VENDOR_COMMAND_WITH_ID = 160 /* 0xA0 */,
    CLEAR_EXTERNAL_TIMER = 161 /* 0xA1 */,
    SET_EXTERNAL_TIMER = 162 /* 0xA2 */,
    REPORT_SHORT_AUDIO_DESCRIPTOR = 163 /* 0xA3 */,
    REQUEST_SHORT_AUDIO_DESCRIPTOR = 164 /* 0xA4 */,
    GIVE_FEATURES = 165 /* 0XA5 */,
    REPORT_FEATURES = 166 /* 0xA6 */,
    REQUEST_CURRENT_LATENCY = 167 /* 0xA7 */,
    REPORT_CURRENT_LATENCY = 168 /* 0xA8 */,
    INITIATE_ARC = 192 /* 0xC0 */,
    REPORT_ARC_INITIATED = 193 /* 0xC1 */,
    REPORT_ARC_TERMINATED = 194 /* 0xC2 */,
    REQUEST_ARC_INITIATION = 195 /* 0xC3 */,
    REQUEST_ARC_TERMINATION = 196 /* 0xC4 */,
    TERMINATE_ARC = 197 /* 0xC5 */,
    ABORT = 255 /* 0xFF */,
    POLLING_MESSAGE = -256 /* 0xFFFFFF00 */,
};

/**
 * Abort Reason as specified in CEC Table 29 of the CEC spec 1.4b.
 */
enum class AbortReason : int32_t {
    UNRECOGNIZED_MODE = 0,
    NOT_IN_CORRECT_MODE = 1,
    CANNOT_PROVIDE_SOURCE = 2,
    INVALID_OPERAND = 3,
    REFUSED = 4,
    UNABLE_TO_DETERMINE = 5,
};

enum class MaxLength : int32_t {
    MESSAGE_BODY = 14,
};

struct CecMessage final {
    /**
     * logical address of sender
     */
    ::android::hardware::tv::cec::V2_0::CecLogicalAddress initiator __attribute__ ((aligned(4)));
    /**
     * logical address of receiver
     */
    ::android::hardware::tv::cec::V2_0::CecLogicalAddress destination __attribute__ ((aligned(4)));
    /**
     * cec message type
     */
    ::android::hardware::tv::cec::V2_0::CecMessageType cecMessageType __attribute__ ((aligned(4)));
    /**
     * The maximum size of body is 14 (MaxLength::MESSAGE_BODY) as specified in
     * the section 6 of the CEC Spec 1.4b. Overflowed data must be ignored.
     */
    ::android::hardware::hidl_vec<uint8_t> body __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecMessage, initiator) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecMessage, destination) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecMessage, cecMessageType) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecMessage, body) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::tv::cec::V2_0::CecMessage) == 32, "wrong size");
static_assert(__alignof(::android::hardware::tv::cec::V2_0::CecMessage) == 8, "wrong alignment");

/**
 * error code used for send_message.
 */
enum class SendMessageResult : int32_t {
    SUCCESS = 0,
    NACK = 1,
    BUSY = 2,
    FAIL = 3,
};

/**
 * CEC All Device Type Value as specified in Table 11-30 of the CEC spec 2.0b.
 */
enum class CecAllDeviceTypeValue : uint8_t {
    RESERVED_DEVICE_2 = 1 /* 1 << 0 */,
    RESERVED_DEVICE_1 = 2 /* 1 << 1 */,
    CEC_SWITCH_DEVICE = 4 /* 1 << 2 */,
    AUDIO_DEVICE = 8 /* 1 << 3 */,
    PLAYBACK_DEVICE = 16 /* 1 << 4 */,
    TUNER_DEVICE = 32 /* 1 << 5 */,
    RECORDING_DEVICE = 64 /* 1 << 6 */,
    TV_DEVICE = 128 /* 1 << 7 */,
};

/**
 * CEC All Device Types
 *
 * It is a combination of all supported type from CecAllDeviceTypeValue.
 * For example a record with tuner functionalitye,
 * cecAllDeviceTypes = ((CecAllDeviceTypeValue::RECORDING_DEVICE)
 *                     |(CecAllDeviceTypeValue::TUNER_DEVICE))
 */
typedef ::android::hardware::hidl_bitfield<::android::hardware::tv::cec::V2_0::CecAllDeviceTypeValue> CecAllDeviceTypes;

/**
 * CEC Versions as specified in CEC Table 11-30 of the CEC spec 2.0b.
 */
enum class CecVersion : int32_t {
    V_1_3_A = 4 /* 0x04 */,
    V_1_4 = 5 /* 0x05 */,
    V_2_0 = 6 /* 0x06 */,
};

/**
 * Device Feature
 *
 * It is specified in CEC Table 11-30 of the CEC spec 2.0b. As a uint32 there
 * is room for future extensions aka DeviceFeature2 through DeviceFeature4.
 */
enum class CecDeviceFeature : uint32_t {
    RESERVED = 1u /* 1 << 0 */,
    SOURCE_SUPPORT_ARC_RX = 2u /* 1 << 1 */,
    SINK_SUPPORT_ARC_TX = 4u /* 1 << 2 */,
    SOURCE_SUPPORT_SET_AUDIO_RATE = 8u /* 1 << 3 */,
    SUPPORT_CONTROLLED_BY_DECK = 16u /* 1 << 4 */,
    TV_SUPPORT_SET_OSD_STRINGS = 32u /* 1 << 5 */,
    TV_SUPPORT_RECORD_TV_SCREEN = 64u /* 1 << 6 */,
};

/**
 * CEC Device Features
 *
 * It is a combination of all supported features from CecDeviceFeature.
 * For example a TV with OSD and ARC capabilities,
 *   CecDeviceFeatures = ((CecDeviceFeature::TV_SUPPORT_SET_OSD_STRINGS)
 *                       |(CecDeviceFeature::SINK_SUPPORT_ARC_TX))
 */
typedef ::android::hardware::hidl_bitfield<::android::hardware::tv::cec::V2_0::CecDeviceFeature> CecDeviceFeatures;

/**
 * Remote Control Profile
 *
 * It is specified in CEC Table 11-30 of the CEC spec 2.0b.
 */
enum class CecRcProfileId : uint8_t {
    NONE = 0,
    RC_PROFILE_1 = 2 /* 0x02 */,
    RC_PROFILE_2 = 6 /* 0x06 */,
    RC_PROFILE_3 = 10 /* 0x0A */,
    RC_PROFILE_4 = 14 /* 0x0E */,
};

/**
 * Remote Control Profile Source
 *
 * It is specified in CEC Table 11-30 of the CEC spec 2.0b.
 */
enum class CecRcProfileSource : uint8_t {
    MEDIA_CONTEXT_SENSITIVE = 1 /* 1 << 0 */,
    MEDIA_TO = 2 /* 1 << 1 */,
    CONTENTS = 4 /* 1 << 2 */,
    DEVICE_SETUP = 8 /* 1 << 3 */,
    DEVICE_ROOT = 16 /* 1 << 4 */,
    SOURCE_FLAG = 64 /* 1 << 6 */,
};

/**
 * Remote Control Profile for either TV or Source.
 */
struct CecRcProfile1 final {
    enum class hidl_discriminator : uint8_t {
        /**
         * CEC remote control profile for TV.
         */
        profileId = 0,  // ::android::hardware::tv::cec::V2_0::CecRcProfileId
        /*
         * CEC remote control profile for source
         *
         * It is a combination of all supported profiles from CecRcProfileSource.
         * For example a playback device support root menu and setup menu,
         * profileSource = ((CecRcProfileSource::DEVICE_ROOT)
         *                  |(CecRcProfileSource::DEVICE_SETUP)
         *                  |(CecRcProfileSource::SOURCE_FLAG))
         */
        profileSource = 1,  // ::android::hardware::hidl_bitfield<::android::hardware::tv::cec::V2_0::CecRcProfileSource>
    };

    CecRcProfile1();
    ~CecRcProfile1();
    CecRcProfile1(CecRcProfile1&&);
    CecRcProfile1(const CecRcProfile1&);
    CecRcProfile1& operator=(CecRcProfile1&&);
    CecRcProfile1& operator=(const CecRcProfile1&);

    void profileId(::android::hardware::tv::cec::V2_0::CecRcProfileId);
    ::android::hardware::tv::cec::V2_0::CecRcProfileId& profileId();
    ::android::hardware::tv::cec::V2_0::CecRcProfileId profileId() const;

    void profileSource(::android::hardware::hidl_bitfield<::android::hardware::tv::cec::V2_0::CecRcProfileSource>);
    ::android::hardware::hidl_bitfield<::android::hardware::tv::cec::V2_0::CecRcProfileSource>& profileSource();
    ::android::hardware::hidl_bitfield<::android::hardware::tv::cec::V2_0::CecRcProfileSource> profileSource() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::tv::cec::V2_0::CecRcProfile1, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hardware::tv::cec::V2_0::CecRcProfileId profileId __attribute__ ((aligned(1)));
        ::android::hardware::hidl_bitfield<::android::hardware::tv::cec::V2_0::CecRcProfileSource> profileSource __attribute__ ((aligned(1)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::tv::cec::V2_0::CecRcProfile1::hidl_union) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::tv::cec::V2_0::CecRcProfile1::hidl_union) == 1, "wrong alignment");
    static_assert(sizeof(::android::hardware::tv::cec::V2_0::CecRcProfile1::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::tv::cec::V2_0::CecRcProfile1::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::tv::cec::V2_0::CecRcProfile1) == 2, "wrong size");
static_assert(__alignof(::android::hardware::tv::cec::V2_0::CecRcProfile1) == 1, "wrong alignment");

/**
 * CEC Remote Control Profiles
 *
 * CEC 2.0 only use one byte to represent Remote Control Profile.
 */
struct CecRcProfile final {
    ::android::hardware::tv::cec::V2_0::CecRcProfile1 rcProfile1 __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecRcProfile, rcProfile1) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::tv::cec::V2_0::CecRcProfile) == 2, "wrong size");
static_assert(__alignof(::android::hardware::tv::cec::V2_0::CecRcProfile) == 1, "wrong alignment");

/**
 * CEC device power states as specified in CEC Table 11-10 of the CEC spec 2.0b
 */
enum class CecPowerState : int8_t {
    ON = 0,
    STANDBY = 1,
    ON_TO_STANDBY = 2,
    STANDBY_TO_ON = 4,
    UNKNOWN = -1 /* 0xFF */,
};

/**
 * CEC physical address of device
 */
typedef uint16_t CecPhysicalAddress;

/**
 * CEC device information
 *
 * It is initially built during addressing specified in CEC section 11.3 of
 * the CEC spec 2.0b. It may be updated with cec devices's status changed.
 */
struct CecDeviceInfo final {
    /**
     * CEC version which device supports
     */
    ::android::hardware::tv::cec::V2_0::CecVersion version __attribute__ ((aligned(4)));
    /**
     * CEC device primary type
     */
    ::android::hardware::tv::cec::V2_0::CecDeviceType devceType __attribute__ ((aligned(4)));
    /**
     * CEC all device types
     */
    ::android::hardware::hidl_bitfield<::android::hardware::tv::cec::V2_0::CecAllDeviceTypeValue> allDeviceTypes __attribute__ ((aligned(1)));
    /**
     * CEC device features
     */
    ::android::hardware::hidl_bitfield<::android::hardware::tv::cec::V2_0::CecDeviceFeature> deviceFeatures __attribute__ ((aligned(4)));
    /**
     * CEC Device Remote Control Profile
     */
    ::android::hardware::tv::cec::V2_0::CecRcProfile rcProfile __attribute__ ((aligned(1)));
    /**
     * CEC Device Vendor ID
     */
    uint32_t vendorId __attribute__ ((aligned(4)));
    /**
     * logical address of device
     */
    ::android::hardware::tv::cec::V2_0::CecLogicalAddress logicalAddress __attribute__ ((aligned(4)));
    /**
     * physical of device
     */
    uint16_t physicalAddress __attribute__ ((aligned(2)));
    /**
     * power status of device
     */
    ::android::hardware::tv::cec::V2_0::CecPowerState powerState __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecDeviceInfo, version) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecDeviceInfo, devceType) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecDeviceInfo, allDeviceTypes) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecDeviceInfo, deviceFeatures) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecDeviceInfo, rcProfile) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecDeviceInfo, vendorId) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecDeviceInfo, logicalAddress) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecDeviceInfo, physicalAddress) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecDeviceInfo, powerState) == 30, "wrong offset");
static_assert(sizeof(::android::hardware::tv::cec::V2_0::CecDeviceInfo) == 32, "wrong size");
static_assert(__alignof(::android::hardware::tv::cec::V2_0::CecDeviceInfo) == 4, "wrong alignment");

/**
 * Topology Event Type.
 */
enum class CecTopologyEventType : int32_t {
    DEVICE_ADDED = 0,
    DEVICE_REMOVED = 1 /* ::android::hardware::tv::cec::V2_0::CecTopologyEventType.DEVICE_ADDED implicitly + 1 */,
    DEVICE_UPDATED = 2 /* ::android::hardware::tv::cec::V2_0::CecTopologyEventType.DEVICE_REMOVED implicitly + 1 */,
};

/**
 * Topology Event.
 */
struct CecTopologyEvent final {
    ::android::hardware::tv::cec::V2_0::CecTopologyEventType eventType __attribute__ ((aligned(4)));
    ::android::hardware::tv::cec::V2_0::CecLogicalAddress logicalAddress __attribute__ ((aligned(4)));
    uint16_t physicalAddress __attribute__ ((aligned(2)));
    /**
     * true if the event is about the device which the system run on
     */
    bool isHostDevice __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecTopologyEvent, eventType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecTopologyEvent, logicalAddress) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecTopologyEvent, physicalAddress) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::CecTopologyEvent, isHostDevice) == 10, "wrong offset");
static_assert(sizeof(::android::hardware::tv::cec::V2_0::CecTopologyEvent) == 12, "wrong size");
static_assert(__alignof(::android::hardware::tv::cec::V2_0::CecTopologyEvent) == 4, "wrong alignment");

/**
 * CEC UI Command Codes as specified in CEC Table 11-31 of the CEC spec 2.0b
 */
enum class CecUICommandCodes : int32_t {
    SELECT_OK = 0 /* 0x00 */,
    UP = 1 /* 0x01 */,
    DOWN = 2 /* 0x02 */,
    LEFT = 3 /* 0x03 */,
    RIGHT = 4 /* 0x04 */,
    RIGHT_UP = 5 /* 0x05 */,
    RIGHT_DOWN = 6 /* 0x06 */,
    LEFT_UP = 7 /* 0x07 */,
    LEFT_DOWN = 8 /* 0x08 */,
    DEVICE_ROOT_MENU = 9 /* 0x09 */,
    DEVICE_SETUP_MENU = 10 /* 0x0A */,
    CONTENTS_MENU = 11 /* 0x0B */,
    FAVORITE_MENU = 12 /* 0x0C */,
    BACK = 13 /* 0x0D */,
    MEDIA_TOP_MENU = 16 /* 0x10 */,
    MEDIA_CONTEXT_SENSITIVE_MENU = 17 /* 0x11 */,
    NUMBER_ENTRY_MODE = 29 /* 0x1D */,
    NUMBER_11 = 30 /* 0x1E */,
    NUMBER_12 = 31 /* 0x1F */,
    NUMBER_0 = 32 /* 0x20 */,
    NUMBER_1 = 33 /* 0x21 */,
    NUMBER_2 = 34 /* 0x22 */,
    NUMBER_3 = 35 /* 0x23 */,
    NUMBER_4 = 36 /* 0x24 */,
    NUMBER_5 = 37 /* 0x25 */,
    NUMBER_6 = 38 /* 0x26 */,
    NUMBER_7 = 39 /* 0x27 */,
    NUMBER_8 = 40 /* 0x28 */,
    NUMBER_9 = 41 /* 0x29 */,
    DOT = 42 /* 0x2A */,
    ENTER = 43 /* 0x2B */,
    CLEAR = 44 /* 0x2C */,
    NEXT_FAVORITE = 47 /* 0x2F */,
    CHANNEL_UP = 48 /* 0x30 */,
    CHANNEL_DOWN = 49 /* 0x31 */,
    PREVIOUS_CHANNEL = 50 /* 0x32 */,
    SOUND_SELECT = 51 /* 0x33 */,
    INPUT_SELECT = 52 /* 0x34 */,
    DISPLAY_INFORMATION = 53 /* 0x35 */,
    HELP = 54 /* 0x36 */,
    PAGE_UP = 55 /* 0x37 */,
    PAGE_DOWN = 56 /* 0x38 */,
    POWER = 64 /* 0x40 */,
    VOLUME_UP = 65 /* 0x41 */,
    VOLUME_DOWN = 66 /* 0x42 */,
    MUTE = 67 /* 0x43 */,
    PLAY = 68 /* 0x44 */,
    STOP = 69 /* 0x45 */,
    PAUSE = 70 /* 0x46 */,
    RECORD = 71 /* 0x47 */,
    REWIND = 72 /* 0x48 */,
    FAST_FORWARD = 73 /* 0x49 */,
    EJECT = 74 /* 0x4A */,
    SKIP_FORWARD = 75 /* 0x4B */,
    SKIP_BACKWARD = 76 /* 0x4C */,
    STOP_RECORD = 77 /* 0x4D */,
    PAUSE_RECORD = 78 /* 0x4E */,
    ANGLE = 80 /* 0x50 */,
    SUB_PICTURE = 81 /* 0x51 */,
    VIDEO_ON_DEMAND = 82 /* 0x52 */,
    ELECTRONIC_PROGRAM_GUIDE = 83 /* 0x53 */,
    TIMER_PROGRAMMING = 84 /* 0x54 */,
    INITIAL_CONFIGURATION = 85 /* 0x55 */,
    SELECT_BROADCAST_TYPE = 86 /* 0x56 */,
    SELECT_SOUND_PRESENTATION = 87 /* 0x57 */,
    AUDIO_DESCRIPTION = 88 /* 0x58 */,
    INTERNET = 89 /* 0x59 */,
    THREE_DIMENSIONAL_MODE = 90 /* 0x5A */,
    PLAY_FUNCTION = 96 /* 0x60 */,
    PAUSE_PLAY_FUNCTION = 97 /* 0x61 */,
    RECORD_FUNCTION = 98 /* 0x62 */,
    PAUSE_RECORD_FUNCTION = 99 /* 0x63 */,
    STOP_FUNCTION = 100 /* 0x64 */,
    MUTE_FUNCTION = 101 /* 0x65 */,
    RESTORE_VOLUME_FUNCTION = 102 /* 0x66 */,
    TUNE_FUNCTION = 103 /* 0x67 */,
    SELECT_MEDIA_FUNCTION = 104 /* 0x68 */,
    SELECT_AV_INPUT_FUNCTION = 105 /* 0x69 */,
    SELECT_AUDIO_INPUT_FUNCTION = 106 /* 0x6A */,
    POWER_TOGGLE_FUNCTION = 107 /* 0x6B */,
    POWER_OFF_FUNCTION = 108 /* 0x6C */,
    POWER_ON_FUNCTION = 109 /* 0x6D */,
    F1 = 113 /* 0x71 */,
    F2 = 114 /* 0x72 */,
    F3 = 115 /* 0x73 */,
    F4 = 116 /* 0x74 */,
    F5 = 117 /* 0x75 */,
    DATA = 118 /* 0x76 */,
};

/**
 * HDMI port type.
 */
enum class HdmiPortType : int32_t {
    INPUT = 0,
    OUTPUT = 1,
};

/**
 * Options used for IHdmiCec.setOption()
 */
enum class OptionKey : int32_t {
    /**
     * When set to false, HAL does not wake up the system upon receiving <Image
     * View On> or <Text View On>. Used when user changes the TV settings to
     * disable the auto TV on functionality.
     * Deprecated since <Image View On> and <Text View On> become mandatory
     * featrues for CEC device. Use ENABLE_CEC OptionKey to disable CEC
     * functionality instead.
     * True by Default
     */
    WAKEUP = 1,
    /**
     * When set to false, all the CEC commands are discarded. if logical address
     * is ever used, it shall be released. Used when user changes the TV
     * settings to disable CEC functionality.
     * True by default.
     *
     */
    ENABLE_CEC = 2,
    /**
     * Setting this flag to false means Android system must stop handling CEC
     * service and yield the control over to the microprocessor that is powered
     * on through the standby mode.The microprocessor shall keep current logical
     * and physical address. It shall response POLLING_MESSAGE, GIVE_FEATURES,
     * GIVE_DEVICE_POWER_STATUS,GIVE_DEVICE_VENDOR_ID and GIVE_PHYSICAL_ADDRESS
     * to allow other CEC devices to build CEC devices map specified in CEC
     * section 11.3 of the CEC spec 2.0b.
     * When set to true, the system must gain the control over, hence telling
     * the microprocessor to start forwarding CEC messages to Android system.
     * For example, this may be called when system goes in and out of
     * standby mode to notify the microprocessor that it should start/stop
     * handling CEC commands on behalf of the system.
     * True by default.
     */
    SYSTEM_CEC_CONTROL = 3,
};

/**
 * Hdmi port ID.
 *
 * It shall start from 1 which corresponds to HDMI "port 1".
 */
typedef uint32_t HdmiPortId;

/**
 * Hdmi hotplug event
 */
struct HotplugEvent final {
    bool connected __attribute__ ((aligned(1)));
    uint32_t portId __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::cec::V2_0::HotplugEvent, connected) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::HotplugEvent, portId) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::tv::cec::V2_0::HotplugEvent) == 8, "wrong size");
static_assert(__alignof(::android::hardware::tv::cec::V2_0::HotplugEvent) == 4, "wrong alignment");

/**
 * HDMI port descriptor
 */
struct HdmiPortInfo final {
    ::android::hardware::tv::cec::V2_0::HdmiPortType type __attribute__ ((aligned(4)));
    uint32_t portId __attribute__ ((aligned(4)));
    bool cecSupported __attribute__ ((aligned(1)));
    bool arcSupported __attribute__ ((aligned(1)));
    uint16_t physicalAddress __attribute__ ((aligned(2)));
};

static_assert(offsetof(::android::hardware::tv::cec::V2_0::HdmiPortInfo, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::HdmiPortInfo, portId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::HdmiPortInfo, cecSupported) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::HdmiPortInfo, arcSupported) == 9, "wrong offset");
static_assert(offsetof(::android::hardware::tv::cec::V2_0::HdmiPortInfo, physicalAddress) == 10, "wrong offset");
static_assert(sizeof(::android::hardware::tv::cec::V2_0::HdmiPortInfo) == 12, "wrong size");
static_assert(__alignof(::android::hardware::tv::cec::V2_0::HdmiPortInfo) == 4, "wrong alignment");

enum class Result : int32_t {
    SUCCESS = 0,
    FAILURE_UNKNOWN = 1,
    FAILURE_INVALID_ARGS = 2,
    FAILURE_INVALID_STATE = 3,
    FAILURE_NOT_SUPPORTED = 4,
    FAILURE_BUSY = 5,
};

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::tv::cec::V2_0::CecDeviceType o);
static inline void PrintTo(::android::hardware::tv::cec::V2_0::CecDeviceType o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::tv::cec::V2_0::CecDeviceType lhs, const ::android::hardware::tv::cec::V2_0::CecDeviceType rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::tv::cec::V2_0::CecDeviceType rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
