#ifndef HIDL_GENERATED_ANDROID_HARDWARE_INPUT_COMMON_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_INPUT_COMMON_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace input {
namespace common {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class Axis : uint64_t;
enum class ToolType : uint8_t;
struct PointerProperties;
struct PointerCoords;
enum class SourceClass : uint8_t;
enum class Source : uint32_t;
enum class Action : int32_t;
enum class EdgeFlag : int32_t;
enum class PolicyFlag : uint32_t;
enum class Button : int32_t;
enum class Meta : int32_t;
enum class Flag : int32_t;
struct VideoFrame;
struct MotionEvent;
enum class Classification : uint8_t;

/**
 * Constants that identify each individual axis of a motion event.
 */
enum class Axis : uint64_t {
    /**
     * Axis constant: X axis of a motion event.
     *
     * - For a touch screen, reports the absolute X screen position of the center of
     * the touch contact area.  The units are display pixels.
     * - For a touch pad, reports the absolute X surface position of the center of the touch
     * contact area. The units are device-dependent.
     * - For a mouse, reports the absolute X screen position of the mouse pointer.
     * The units are display pixels.
     * - For a trackball, reports the relative horizontal displacement of the trackball.
     * The value is normalized to a range from -1.0 (left) to 1.0 (right).
     * - For a joystick, reports the absolute X position of the joystick.
     * The value is normalized to a range from -1.0 (left) to 1.0 (right).
     */
    X = 0ull,
    /**
     * Axis constant: Y axis of a motion event.
     *
     * - For a touch screen, reports the absolute Y screen position of the center of
     * the touch contact area.  The units are display pixels.
     * - For a touch pad, reports the absolute Y surface position of the center of the touch
     * contact area. The units are device-dependent.
     * - For a mouse, reports the absolute Y screen position of the mouse pointer.
     * The units are display pixels.
     * - For a trackball, reports the relative vertical displacement of the trackball.
     * The value is normalized to a range from -1.0 (up) to 1.0 (down).
     * - For a joystick, reports the absolute Y position of the joystick.
     * The value is normalized to a range from -1.0 (up or far) to 1.0 (down or near).
     */
    Y = 1ull,
    /**
     * Axis constant: Pressure axis of a motion event.
     *
     * - For a touch screen or touch pad, reports the approximate pressure applied to the surface
     * by a finger or other tool.  The value is normalized to a range from
     * 0 (no pressure at all) to 1 (normal pressure), although values higher than 1
     * may be generated depending on the calibration of the input device.
     * - For a trackball, the value is set to 1 if the trackball button is pressed
     * or 0 otherwise.
     * - For a mouse, the value is set to 1 if the primary mouse button is pressed
     * or 0 otherwise.
     */
    PRESSURE = 2ull,
    /**
     * Axis constant: Size axis of a motion event.
     *
     * - For a touch screen or touch pad, reports the approximate size of the contact area in
     * relation to the maximum detectable size for the device.  The value is normalized
     * to a range from 0 (smallest detectable size) to 1 (largest detectable size),
     * although it is not a linear scale. This value is of limited use.
     * To obtain calibrated size information, see
     * {@link TOUCH_MAJOR} or {@link TOOL_MAJOR}.
     */
    SIZE = 3ull,
    /**
     * Axis constant: TouchMajor axis of a motion event.
     *
     * - For a touch screen, reports the length of the major axis of an ellipse that
     * represents the touch area at the point of contact.
     * The units are display pixels.
     * - For a touch pad, reports the length of the major axis of an ellipse that
     * represents the touch area at the point of contact.
     * The units are device-dependent.
     */
    TOUCH_MAJOR = 4ull,
    /**
     * Axis constant: TouchMinor axis of a motion event.
     *
     * - For a touch screen, reports the length of the minor axis of an ellipse that
     * represents the touch area at the point of contact.
     * The units are display pixels.
     * - For a touch pad, reports the length of the minor axis of an ellipse that
     * represents the touch area at the point of contact.
     * The units are device-dependent.
     *
     * When the touch is circular, the major and minor axis lengths will be equal to one another.
     */
    TOUCH_MINOR = 5ull,
    /**
     * Axis constant: ToolMajor axis of a motion event.
     *
     * - For a touch screen, reports the length of the major axis of an ellipse that
     * represents the size of the approaching finger or tool used to make contact.
     * - For a touch pad, reports the length of the major axis of an ellipse that
     * represents the size of the approaching finger or tool used to make contact.
     * The units are device-dependent.
     *
     * When the touch is circular, the major and minor axis lengths will be equal to one another.
     *
     * The tool size may be larger than the touch size since the tool may not be fully
     * in contact with the touch sensor.
     */
    TOOL_MAJOR = 6ull,
    /**
     * Axis constant: ToolMinor axis of a motion event.
     *
     * - For a touch screen, reports the length of the minor axis of an ellipse that
     * represents the size of the approaching finger or tool used to make contact.
     * - For a touch pad, reports the length of the minor axis of an ellipse that
     * represents the size of the approaching finger or tool used to make contact.
     * The units are device-dependent.
     *
     * When the touch is circular, the major and minor axis lengths will be equal to one another.
     *
     * The tool size may be larger than the touch size since the tool may not be fully
     * in contact with the touch sensor.
     */
    TOOL_MINOR = 7ull,
    /**
     * Axis constant: Orientation axis of a motion event.
     *
     * - For a touch screen or touch pad, reports the orientation of the finger
     * or tool in radians relative to the vertical plane of the device.
     * An angle of 0 radians indicates that the major axis of contact is oriented
     * upwards, is perfectly circular or is of unknown orientation.  A positive angle
     * indicates that the major axis of contact is oriented to the right.  A negative angle
     * indicates that the major axis of contact is oriented to the left.
     * The full range is from -PI/2 radians (finger pointing fully left) to PI/2 radians
     * (finger pointing fully right).
     * - For a stylus, the orientation indicates the direction in which the stylus
     * is pointing in relation to the vertical axis of the current orientation of the screen.
     * The range is from -PI radians to PI radians, where 0 is pointing up,
     * -PI/2 radians is pointing left, -PI or PI radians is pointing down, and PI/2 radians
     * is pointing right.  See also {@link TILT}.
     */
    ORIENTATION = 8ull,
    /**
     * Axis constant: Vertical Scroll axis of a motion event.
     *
     * - For a mouse, reports the relative movement of the vertical scroll wheel.
     * The value is normalized to a range from -1.0 (down) to 1.0 (up).
     *
     * The framework may use this axis to scroll views vertically.
     */
    VSCROLL = 9ull,
    /**
     * Axis constant: Horizontal Scroll axis of a motion event.
     *
     * - For a mouse, reports the relative movement of the horizontal scroll wheel.
     * The value is normalized to a range from -1.0 (left) to 1.0 (right).
     *
     * The framework may use this axis to scroll views horizontally.
     */
    HSCROLL = 10ull,
    /**
     * Axis constant: Z axis of a motion event.
     *
     * - For a joystick, reports the absolute Z position of the joystick.
     * The value is normalized to a range from -1.0 (high) to 1.0 (low).
     * <em>On game pads with two analog joysticks, this axis is often reinterpreted
     * to report the absolute X position of the second joystick instead.</em>
     */
    Z = 11ull,
    /**
     * Axis constant: X Rotation axis of a motion event.
     *
     * - For a joystick, reports the absolute rotation angle about the X axis.
     * The value is normalized to a range from -1.0 (counter-clockwise) to 1.0 (clockwise).
     */
    RX = 12ull,
    /**
     * Axis constant: Y Rotation axis of a motion event.
     *
     * - For a joystick, reports the absolute rotation angle about the Y axis.
     * The value is normalized to a range from -1.0 (counter-clockwise) to 1.0 (clockwise).
     */
    RY = 13ull,
    /**
     * Axis constant: Z Rotation axis of a motion event.
     *
     * - For a joystick, reports the absolute rotation angle about the Z axis.
     * The value is normalized to a range from -1.0 (counter-clockwise) to 1.0 (clockwise).
     * On game pads with two analog joysticks, this axis is often reinterpreted
     * to report the absolute Y position of the second joystick instead.
     */
    RZ = 14ull,
    /**
     * Axis constant: Hat X axis of a motion event.
     *
     * - For a joystick, reports the absolute X position of the directional hat control.
     * The value is normalized to a range from -1.0 (left) to 1.0 (right).
     */
    HAT_X = 15ull,
    /**
     * Axis constant: Hat Y axis of a motion event.
     *
     * - For a joystick, reports the absolute Y position of the directional hat control.
     * The value is normalized to a range from -1.0 (up) to 1.0 (down).
     */
    HAT_Y = 16ull,
    /**
     * Axis constant: Left Trigger axis of a motion event.
     *
     * - For a joystick, reports the absolute position of the left trigger control.
     * The value is normalized to a range from 0.0 (released) to 1.0 (fully pressed).
     */
    LTRIGGER = 17ull,
    /**
     * Axis constant: Right Trigger axis of a motion event.
     *
     * - For a joystick, reports the absolute position of the right trigger control.
     * The value is normalized to a range from 0.0 (released) to 1.0 (fully pressed).
     */
    RTRIGGER = 18ull,
    /**
     * Axis constant: Throttle axis of a motion event.
     *
     * - For a joystick, reports the absolute position of the throttle control.
     * The value is normalized to a range from 0.0 (fully open) to 1.0 (fully closed).
     */
    THROTTLE = 19ull,
    /**
     * Axis constant: Rudder axis of a motion event.
     *
     * - For a joystick, reports the absolute position of the rudder control.
     * The value is normalized to a range from -1.0 (turn left) to 1.0 (turn right).
     */
    RUDDER = 20ull,
    /**
     * Axis constant: Wheel axis of a motion event.
     *
     * - For a joystick, reports the absolute position of the steering wheel control.
     * The value is normalized to a range from -1.0 (turn left) to 1.0 (turn right).
     */
    WHEEL = 21ull,
    /**
     * Axis constant: Gas axis of a motion event.
     *
     * - For a joystick, reports the absolute position of the gas (accelerator) control.
     * The value is normalized to a range from 0.0 (no acceleration)
     * to 1.0 (maximum acceleration).
     */
    GAS = 22ull,
    /**
     * Axis constant: Brake axis of a motion event.
     *
     * - For a joystick, reports the absolute position of the brake control.
     * The value is normalized to a range from 0.0 (no braking) to 1.0 (maximum braking).
     */
    BRAKE = 23ull,
    /**
     * Axis constant: Distance axis of a motion event.
     *
     * - For a stylus, reports the distance of the stylus from the screen.
     * A value of 0.0 indicates direct contact and larger values indicate increasing
     * distance from the surface.
     */
    DISTANCE = 24ull,
    /**
     * Axis constant: Tilt axis of a motion event.
     *
     * - For a stylus, reports the tilt angle of the stylus in radians where
     * 0 radians indicates that the stylus is being held perpendicular to the
     * surface, and PI/2 radians indicates that the stylus is being held flat
     * against the surface.
     */
    TILT = 25ull,
    /**
     * Axis constant:  Generic scroll axis of a motion event.
     *
     * - This is used for scroll axis motion events that can't be classified as strictly
     *   vertical or horizontal. The movement of a rotating scroller is an example of this.
     */
    SCROLL = 26ull,
    /**
     * Axis constant: The movement of x position of a motion event.
     *
     * - For a mouse, reports a difference of x position between the previous position.
     * This is useful when pointer is captured, in that case the mouse pointer doesn't
     * change the location but this axis reports the difference which allows the app
     * to see how the mouse is moved.
     */
    RELATIVE_X = 27ull,
    /**
     * Axis constant: The movement of y position of a motion event.
     *
     * Same as {@link RELATIVE_X}, but for y position.
     */
    RELATIVE_Y = 28ull,
    /**
     * Axis constant: Generic 1 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_1 = 32ull,
    /**
     * Axis constant: Generic 2 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_2 = 33ull,
    /**
     * Axis constant: Generic 3 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_3 = 34ull,
    /**
     * Axis constant: Generic 4 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_4 = 35ull,
    /**
     * Axis constant: Generic 5 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_5 = 36ull,
    /**
     * Axis constant: Generic 6 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_6 = 37ull,
    /**
     * Axis constant: Generic 7 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_7 = 38ull,
    /**
     * Axis constant: Generic 8 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_8 = 39ull,
    /**
     * Axis constant: Generic 9 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_9 = 40ull,
    /**
     * Axis constant: Generic 10 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_10 = 41ull,
    /**
     * Axis constant: Generic 11 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_11 = 42ull,
    /**
     * Axis constant: Generic 12 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_12 = 43ull,
    /**
     * Axis constant: Generic 13 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_13 = 44ull,
    /**
     * Axis constant: Generic 14 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_14 = 45ull,
    /**
     * Axis constant: Generic 15 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_15 = 46ull,
    /**
     * Axis constant: Generic 16 axis of a motion event.
     * The interpretation of a generic axis is device-specific.
     */
    GENERIC_16 = 47ull,
};

/**
 * Tool type of a pointer
 */
enum class ToolType : uint8_t {
    UNKNOWN = 0,
    FINGER = 1,
    STYLUS = 2,
    MOUSE = 3,
    ERASER = 4,
};

/**
 * Properties of a particular pointer. Analogous to Android's PointerProperties.
 */
struct PointerProperties final {
    /**
     * A number identifying a specific pointer. When a pointer is lifted,
     * this value may be reused by another new pointer, even during the
     * same gesture. For example, if there are two pointers touching the screen
     * at the same time, they might have pointer ID's of 0 and 1. If the
     * pointer with id = 0 is lifted, while the pointer with id = 1 remains, and
     * a new pointer is placed on the screen, then the new pointer may receive
     * an id of 0. While a pointer is active, it is guaranteed to keep the same
     * id.
     */
    int32_t id __attribute__ ((aligned(4)));
    /**
     * Type of tool used to make contact, such as a finger or stylus, if known.
     */
    ::android::hardware::input::common::V1_0::ToolType toolType __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::input::common::V1_0::PointerProperties, id) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::PointerProperties, toolType) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::input::common::V1_0::PointerProperties) == 8, "wrong size");
static_assert(__alignof(::android::hardware::input::common::V1_0::PointerProperties) == 4, "wrong alignment");

/**
 * Pointer coordinate data. Analogous to Android's PointerCoords.
 */
struct PointerCoords final {
    /**
     * Bitfield of axes that are present in this structure.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::input::common::V1_0::Axis> bits __attribute__ ((aligned(8)));
    /**
     * The values corresponding to each non-zero axis. This vector only
     * contains non-zero entries. If an axis that is not currently specified
     * in "bits" is requested, a zero value is returned.
     * There are only as many values stored here
     * as there are non-zero bits in the "bits" field.
     * The values are position-packed. So the first non-zero axis will be
     * at position 0, the next non-zero axis will be at position 1, and so on.
     */
    ::android::hardware::hidl_vec<float> values __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::input::common::V1_0::PointerCoords, bits) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::PointerCoords, values) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::input::common::V1_0::PointerCoords) == 24, "wrong size");
static_assert(__alignof(::android::hardware::input::common::V1_0::PointerCoords) == 8, "wrong alignment");

enum class SourceClass : uint8_t {
    NONE = 0 /* 0 << 0 */,
    BUTTON = 1 /* 1 << 0 */,
    POINTER = 2 /* 1 << 1 */,
    NAVIGATION = 4 /* 1 << 2 */,
    POSITION = 8 /* 1 << 3 */,
    JOYSTICK = 16 /* 1 << 4 */,
};

/**
 * Input sources
 */
enum class Source : uint32_t {
    UNKNOWN = 0u,
    KEYBOARD = 257u /* (1 << 8) | SourceClass:BUTTON */,
    DPAD = 513u /* (1 << 9) | SourceClass:BUTTON */,
    GAMEPAD = 1025u /* (1 << 10) | SourceClass:BUTTON */,
    TOUCHSCREEN = 4098u /* (1 << 12) | SourceClass:POINTER */,
    MOUSE = 8194u /* (1 << 13) | SourceClass:POINTER */,
    STYLUS = 16386u /* (1 << 14) | SourceClass:POINTER */,
    BLUETOOTH_STYLUS = 49154u /* (1 << 15) | STYLUS */,
    TRACKBALL = 65540u /* (1 << 16) | SourceClass:NAVIGATION */,
    MOUSE_RELATIVE = 131076u /* (1 << 17) | SourceClass:NAVIGATION */,
    TOUCHPAD = 1048584u /* (1 << 20) | SourceClass:POSITION */,
    TOUCH_NAVIGATION = 2097152u /* (1 << 21) | SourceClass:NONE */,
    ROTARY_ENCODER = 4194304u /* (1 << 22) | SourceClass:NONE */,
    JOYSTICK = 16777232u /* (1 << 24) | SourceClass:JOYSTICK */,
    ANY = 4294967040u /* 0xFFFFFF00 */,
};

/**
 * Motion event actions
 */
enum class Action : int32_t {
    /**
     * A pressed gesture has started, the motion contains the initial starting location.
     */
    DOWN = 0,
    /**
     * A pressed gesture has finished, the motion contains the final release location
     * as well as any intermediate points since the last down or move event.
     */
    UP = 1,
    /**
     * A change has happened during a press gesture (between AMOTION_EVENT_ACTION_DOWN and
     * AMOTION_EVENT_ACTION_UP). The motion contains the most recent point.
     */
    MOVE = 2,
    /**
     * The current gesture has been aborted.
     * You will not receive any more points in it. You must treat this as
     * an up event, but not perform any action that you normally would.
     */
    CANCEL = 3,
    /**
     * A movement has happened outside of the normal bounds of the UI element.
     * This does not provide a full gesture, but only the initial location of the movement/touch.
     */
    OUTSIDE = 4,
    /**
     * A non-primary pointer has gone down.
     */
    POINTER_DOWN = 5,
    /**
     * A non-primary pointer has gone up.
     */
    POINTER_UP = 6,
    /**
     * A change happened but the pointer is not down (unlike AMOTION_EVENT_ACTION_MOVE).
     * The motion contains the most recent point, as well as any intermediate points since
     * the last hover move event.
     */
    HOVER_MOVE = 7,
    /**
     * The motion event contains relative vertical and/or horizontal scroll offsets.
     * Use getAxisValue to retrieve the information from AMOTION_EVENT_AXIS_VSCROLL
     * and AMOTION_EVENT_AXIS_HSCROLL.
     * The pointer may or may not be down when this event is dispatched.
     * The framework will always deliver this action to the window under the pointer, which
     * may not be the window currently touched.
     */
    SCROLL = 8,
    /**
     * The pointer is not down but has entered the boundaries of a window or view.
     */
    HOVER_ENTER = 9,
    /**
     * The pointer is not down but has exited the boundaries of a window or view.
     */
    HOVER_EXIT = 10,
    /**
     * One or more buttons have been pressed.
     */
    BUTTON_PRESS = 11,
    /**
     * One or more buttons have been released.
     */
    BUTTON_RELEASE = 12,
};

/**
 * Edge flags
 */
enum class EdgeFlag : int32_t {
    /**
     * No edges are intersected
     */
    NONE = 0,
    /**
     * Motion intersected top edge of the screen
     */
    TOP = 1 /* 1 << 0 */,
    /**
     * Motion intersected bottom edge of the screen
     */
    BOTTOM = 2 /* 1 << 1 */,
    /**
     * Motion intersected left edge of the screen
     */
    LEFT = 4 /* 1 << 2 */,
    /**
     * Motion intersected right edge of the screen
     */
    RIGHT = 8 /* 1 << 3 */,
};

/**
 * Policy flags
 */
enum class PolicyFlag : uint32_t {
    /**
     * Event should wake the device
     */
    WAKE = 1u /* 1 << 0 */,
    /**
     * Key is virtual, and should generate haptic feedback
     */
    VIRTUAL = 2u /* 1 << 1 */,
    /**
     * Key is the special function modifier
     */
    FUNCTION = 4u /* 1 << 2 */,
    /**
     * Key represents a special gesture that has been detected
     * by the touch firmware or driver.
     */
    GESTURE = 8u /* 1 << 3 */,
    /**
     * Event was injected
     */
    INJECTED = 16777216u /* 1 << 24 */,
    /**
     * Event comes from a trusted source, such as a directly attached input
     * device or an application with system-wide event injection permission.
     */
    TRUSTED = 33554432u /* 1 << 25 */,
    /**
     * Event has passed through an input filter.
     */
    FILTERED = 67108864u /* 1 << 26 */,
    /**
     * Disable automatic key repeating behaviour.
     */
    DISABLE_KEY_REPEAT = 134217728u /* 1 << 27 */,
    /**
     * Device was in an interactive state when the event was intercepted
     */
    INTERACTIVE = 536870912u /* 1 << 29 */,
    /**
     * Event should be dispatched to applications
     */
    PASS_TO_USER = 1073741824u /* 1 << 30 */,
};

/**
 * Buttons that are associated with motion events.
 */
enum class Button : int32_t {
    NONE = 0,
    PRIMARY = 1 /* 1 << 0 */,
    SECONDARY = 2 /* 1 << 1 */,
    TERTIARY = 4 /* 1 << 2 */,
    BACK = 8 /* 1 << 3 */,
    FORWARD = 16 /* 1 << 4 */,
    STYLUS_PRIMARY = 32 /* 1 << 5 */,
    STYLUS_SECONDARY = 64 /* 1 << 6 */,
};

/**
 * Meta key / modifier state
 */
enum class Meta : int32_t {
    NONE = 0,
    /**
     * One of the ALT meta keys is pressed.
     */
    ALT_ON = 2 /* 1 << 1 */,
    /**
     * The left ALT meta key is pressed.
     */
    ALT_LEFT_ON = 16 /* 1 << 4 */,
    /**
     * The right ALT meta key is pressed.
     */
    ALT_RIGHT_ON = 32 /* 1 << 5 */,
    /**
     * One of the SHIFT meta keys is pressed.
     */
    SHIFT_ON = 1 /* 1 << 0 */,
    /**
     * The left SHIFT meta key is pressed.
     */
    SHIFT_LEFT_ON = 64 /* 1 << 6 */,
    /**
     * The right SHIFT meta key is pressed.
     */
    SHIFT_RIGHT_ON = 128 /* 1 << 7 */,
    /**
     * The SYM meta key is pressed.
     */
    SYM_ON = 4 /* 1 << 2 */,
    /**
     * The FUNCTION meta key is pressed.
     */
    FUNCTION_ON = 8 /* 1 << 3 */,
    /**
     * One of the CTRL meta keys is pressed.
     */
    CTRL_ON = 4096 /* 1 << 12 */,
    /**
     * The left CTRL meta key is pressed.
     */
    CTRL_LEFT_ON = 8192 /* 1 << 13 */,
    /**
     * The right CTRL meta key is pressed.
     */
    CTRL_RIGHT_ON = 16384 /* 1 << 14 */,
    /**
     * One of the META meta keys is pressed.
     */
    META_ON = 65536 /* 1 << 16 */,
    /**
     * The left META meta key is pressed.
     */
    META_LEFT_ON = 131072 /* 1 << 17 */,
    /**
     * The right META meta key is pressed.
     */
    META_RIGHT_ON = 262144 /* 1 << 18 */,
    /**
     * The CAPS LOCK meta key is on.
     */
    CAPS_LOCK_ON = 1048576 /* 1 << 20 */,
    /**
     * The NUM LOCK meta key is on.
     */
    NUM_LOCK_ON = 2097152 /* 1 << 21 */,
    /**
     * The SCROLL LOCK meta key is on.
     */
    SCROLL_LOCK_ON = 4194304 /* 1 << 22 */,
};

/**
 * Motion event flags
 */
enum class Flag : int32_t {
    /**
     * Indicates that the window that received this motion event is partly
     * or wholly obscured by another visible window above it. This flag is set to true
     * even if the event did not directly pass through the obscured area.
     * A security sensitive application can check this flag to identify situations in which
     * a malicious application may have covered up part of its content for the purpose
     * of misleading the user or hijacking touches. An appropriate response might be
     * to drop the suspect touches or to take additional precautions to confirm the user's
     * actual intent.
     */
    WINDOW_IS_OBSCURED = 1 /* 1 << 0 */,
    /**
     * This flag indicates that the event has been generated by a gesture generator. It
     * could be used, for example, to determine whether touch slop should be applied.
     */
    IS_GENERATED_GESTURE = 8 /* 1 << 3 */,
    /**
     * Motion event is inconsistent with previously sent motion events.
     */
    TAINTED = -2147483648 /* 1 << 31 */,
};

/**
 * Touch heatmap.
 *
 * The array is a 2-D row-major matrix with dimensions (height, width).
 * The heatmap data is rotated when device orientation changes.
 *
 * Example:
 *
 * If the data in the array is:
 * data[i] = i for i in 0 .. 59,
 * then it can be represented as a 10 x 6 matrix:
 *
 *  <--   width   -->
 *   0  1  2  3  4  5   ^
 *   6  7  8  9 10 11   |
 *  12 13 14 15 16 17   |
 *  18    ...      23   |
 *  24    ...      29   | height
 *  30    ...      35   |
 *  36    ...      41   |
 *  42    ...      47   |
 *  48    ...      53   |
 *  54    ...      59   v
 *
 * Looking at the device in standard portrait orientation,
 * the element "0" is the top left of the screen,
 * "5" is at the top right, and "59" is the bottom right.
 * Here height=10 and width=6.
 *
 * If the screen orientation changes to landscape (a 90 degree orientation
 * change), the frame's dimensions will become 6 x 10
 * and the data will look as follows:
 * 54 48 42 36 30 24 18 12  6  0     ^
 * ...                  13  7  1     |
 * ...                  14  8  2     | height
 * ...                  15  9  3     |
 * ...                  16 10  4     |
 * 59 53 47 41 35 29 23 17 11  5     v
 * <--        width          -->
 *
 * Here the element "0" is at the physical top left of the unrotated screen.
 *
 * Since the coordinates of a MotionEvent are also adjusted based on the
 * orientation, the rotation of the video frame data ensures that
 * the axes for MotionEvent and VideoFrame data are consistent.
 */
struct VideoFrame final {
    /**
     * Video frame data.
     * Size of the data is height * width.
     */
    ::android::hardware::hidl_vec<int16_t> data __attribute__ ((aligned(8)));
    uint32_t height __attribute__ ((aligned(4)));
    uint32_t width __attribute__ ((aligned(4)));
    /**
     * Time at which the frame was collected, in nanoseconds.
     * Measured with the same clock that is used to populate MotionEvent times.
     */
    uint64_t timestamp __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::input::common::V1_0::VideoFrame, data) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::VideoFrame, height) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::VideoFrame, width) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::VideoFrame, timestamp) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::input::common::V1_0::VideoFrame) == 32, "wrong size");
static_assert(__alignof(::android::hardware::input::common::V1_0::VideoFrame) == 8, "wrong alignment");

/**
 * Analogous to Android's native MotionEvent / NotifyMotionArgs.
 * Stores the basic information about pointer movements.
 */
struct MotionEvent final {
    /**
     * The id of the device which produced this event.
     */
    int32_t deviceId __attribute__ ((aligned(4)));
    /**
     * The source type of this event.
     */
    ::android::hardware::input::common::V1_0::Source source __attribute__ ((aligned(4)));
    /**
     * The display id associated with this event.
     */
    int32_t displayId __attribute__ ((aligned(4)));
    /**
     * Time when the initial touch down occurred, in nanoseconds.
     */
    int64_t downTime __attribute__ ((aligned(8)));
    /**
     * Time when this event occurred, in nanoseconds.
     */
    int64_t eventTime __attribute__ ((aligned(8)));
    /**
     * The kind of action being performed.
     */
    ::android::hardware::input::common::V1_0::Action action __attribute__ ((aligned(4)));
    /**
     * For ACTION_POINTER_DOWN or ACTION_POINTER_UP, this contains the associated pointer index.
     * The index may be used to get information about the pointer that has gone down or up.
     */
    uint8_t actionIndex __attribute__ ((aligned(1)));
    /**
     * The button that has been modified during a press or release action.
     */
    ::android::hardware::input::common::V1_0::Button actionButton __attribute__ ((aligned(4)));
    /**
     * The motion event flags.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::input::common::V1_0::Flag> flags __attribute__ ((aligned(4)));
    /**
     * The motion event policy flags.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::input::common::V1_0::PolicyFlag> policyFlags __attribute__ ((aligned(4)));
    /**
     * The edges, if any, that were touched by this motion event.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::input::common::V1_0::EdgeFlag> edgeFlags __attribute__ ((aligned(4)));
    /**
     * The state of any meta / modifier keys that were in effect when the event was generated.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::input::common::V1_0::Meta> metaState __attribute__ ((aligned(4)));
    /**
     * The state of buttons that are pressed.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::input::common::V1_0::Button> buttonState __attribute__ ((aligned(4)));
    /**
     * The precision of the X coordinate being reported.
     */
    float xPrecision __attribute__ ((aligned(4)));
    /**
     * The precision of the Y coordinate being reported.
     */
    float yPrecision __attribute__ ((aligned(4)));
    /**
     * The properties of each pointer present in this motion event.
     */
    ::android::hardware::hidl_vec<::android::hardware::input::common::V1_0::PointerProperties> pointerProperties __attribute__ ((aligned(8)));
    /**
     * The coordinates of each pointer.
     */
    ::android::hardware::hidl_vec<::android::hardware::input::common::V1_0::PointerCoords> pointerCoords __attribute__ ((aligned(8)));
    /**
     * Device time at which the event occurred, in microseconds.
     * Will wrap after a little over an hour.
     */
    uint32_t deviceTimestamp __attribute__ ((aligned(4)));
    /**
     * The video frames, if any, associated with the current or previous motion events.
     */
    ::android::hardware::hidl_vec<::android::hardware::input::common::V1_0::VideoFrame> frames __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, deviceId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, source) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, displayId) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, downTime) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, eventTime) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, action) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, actionIndex) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, actionButton) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, flags) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, policyFlags) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, edgeFlags) == 52, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, metaState) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, buttonState) == 60, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, xPrecision) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, yPrecision) == 68, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, pointerProperties) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, pointerCoords) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, deviceTimestamp) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::input::common::V1_0::MotionEvent, frames) == 112, "wrong offset");
static_assert(sizeof(::android::hardware::input::common::V1_0::MotionEvent) == 128, "wrong size");
static_assert(__alignof(::android::hardware::input::common::V1_0::MotionEvent) == 8, "wrong alignment");

enum class Classification : uint8_t {
    NONE = 0,
    /**
     * Too early to classify the gesture, need more events.
     */
    AMBIGUOUS_GESTURE = 1,
    /**
     * User is force-pressing the screen.
     */
    DEEP_PRESS = 2,
};

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint64_t o);
static inline std::string toString(::android::hardware::input::common::V1_0::Axis o);
static inline void PrintTo(::android::hardware::input::common::V1_0::Axis o, ::std::ostream* os);
constexpr uint64_t operator|(const ::android::hardware::input::common::V1_0::Axis lhs, const ::android::hardware::input::common::V1_0::Axis rhs) {
    return static_cast<uint64_t>(static_cast<uint64_t>(lhs) | static_cast<uint64_t>(rhs));
}
constexpr uint64_t operator|(const uint64_t lhs, const ::android::hardware::input::common::V1_0::Axis rhs) {
