{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",

   "self_type" : "_ZTIKN4Json12StaticStringE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4Json17CharReaderBuilderE",
   "name" : "const Json::CharReaderBuilder",
   "referenced_type" : "_ZTIN4Json17CharReaderBuilderE",
   "self_type" : "_ZTIKN4Json17CharReaderBuilderE",
   "size" : 48,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4Json17ValueIteratorBaseE",
   "name" : "const Json::ValueIteratorBase",
   "referenced_type" : "_ZTIN4Json17ValueIteratorBaseE",
   "self_type" : "_ZTIKN4Json17ValueIteratorBaseE",
   "size" : 16,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4Json18ValueConstIteratorE",
   "name" : "const Json::ValueConstIterator",
   "referenced_type" : "_ZTIN4Json18ValueConstIteratorE",
   "self_type" : "_ZTIKN4Json18ValueConstIteratorE",
   "size" : 16,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4Json5ValueE",
   "name" : "const Json::Value",
   "referenced_type" : "_ZTIN4Json5ValueE",
   "self_type" : "_ZTIKN4Json5ValueE",
   "size" : 40,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4Json6ReaderE",
   "name" : "const Json::Reader",
   "referenced_type" : "_ZTIN4Json6ReaderE",
   "self_type" : "_ZTIKN4Json6ReaderE",
   "size" : 192,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4Json8FeaturesE",
   "name" : "const Json::Features",
   "referenced_type" : "_ZTIN4Json8FeaturesE",
   "self_type" : "_ZTIKN4Json8FeaturesE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN4Json10CharReader7FactoryE",
   "name" : "Json::CharReader::Factory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json10CharReader7FactoryE",
   "self_type" : "_ZTIN4Json10CharReader7FactoryE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/reader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json10CharReader7FactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json10CharReader7FactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json10CharReader7FactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK4Json10CharReader7Factory13newCharReaderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN4Json10CharReaderE",
   "name" : "Json::CharReader",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json10CharReaderE",
   "self_type" : "_ZTIN4Json10CharReaderE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/reader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json10CharReaderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json10CharReaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json10CharReaderD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4Json10CharReader5parseEPKcS2_PNS_5ValueEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "key_",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "index_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "kind_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN4Json12PathArgument4KindE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json12PathArgumentE",
   "name" : "Json::PathArgument",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json12PathArgumentE",
   "self_type" : "_ZTIN4Json12PathArgumentE",
   "size" : 32,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "c_str_",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4Json12StaticStringE",
   "name" : "Json::StaticString",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json12StaticStringE",
   "self_type" : "_ZTIN4Json12StaticStringE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4Json17ValueIteratorBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json13ValueIteratorE",
   "name" : "Json::ValueIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json13ValueIteratorE",
   "self_type" : "_ZTIN4Json13ValueIteratorE",
   "size" : 16,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4Json10CharReader7FactoryE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "settings_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4Json5ValueE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json17CharReaderBuilderE",
   "name" : "Json::CharReaderBuilder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json17CharReaderBuilderE",
   "self_type" : "_ZTIN4Json17CharReaderBuilderE",
   "size" : 48,
   "source_file" : "external/jsoncpp/include/json/reader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4Json17CharReaderBuilderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4Json17CharReaderBuilderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4Json17CharReaderBuilderD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK4Json17CharReaderBuilder13newCharReaderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_",
     "referenced_type" : "_ZTINSt3__114__map_iteratorINS_15__tree_iteratorINS_12__value_typeIN4Json5Value8CZStringES4_EEPNS_11__tree_nodeIS6_PvEElEEEE"
    },
    {
     "access" : "private",
     "field_name" : "isNull_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4Json17ValueIteratorBaseE",
   "name" : "Json::ValueIteratorBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json17ValueIteratorBaseE",
   "self_type" : "_ZTIN4Json17ValueIteratorBaseE",
   "size" : 16,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4Json17ValueIteratorBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json18ValueConstIteratorE",
   "name" : "Json::ValueConstIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json18ValueConstIteratorE",
   "self_type" : "_ZTIN4Json18ValueConstIteratorE",
   "size" : 16,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "args_",
     "referenced_type" : "_ZTINSt3__16vectorIN4Json12PathArgumentENS_9allocatorIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json4PathE",
   "name" : "Json::Path",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json4PathE",
   "self_type" : "_ZTIN4Json4PathE",
   "size" : 24,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "int_",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "uint_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "real_",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "bool_",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "string_",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "map_",
     "referenced_type" : "_ZTIPNSt3__13mapIN4Json5Value8CZStringES2_NS_4lessIS3_EENS_9allocatorINS_4pairIKS3_S2_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json5Value11ValueHolderE",
   "name" : "Json::Value::ValueHolder",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4Json5Value11ValueHolderE",
   "self_type" : "_ZTIN4Json5Value11ValueHolderE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "policy_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "length_",
     "field_offset" : 2,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN4Json5Value8CZString13StringStorageE",
   "name" : "Json::Value::CZString::StringStorage",
   "referenced_type" : "_ZTIN4Json5Value8CZString13StringStorageE",
   "self_type" : "_ZTIN4Json5Value8CZString13StringStorageE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "cstr_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4Json5Value8CZStringUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN4Json5Value8CZStringE",
   "name" : "Json::Value::CZString",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json5Value8CZStringE",
   "self_type" : "_ZTIN4Json5Value8CZStringE",
   "size" : 16,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "storage_",
     "referenced_type" : "_ZTIN4Json5Value8CZString13StringStorageE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN4Json5Value8CZStringUt_E",
   "name" : "Json::Value::CZString::(anonymous union at external/jsoncpp/include/json/value.h:288:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4Json5Value8CZStringUt_E",
   "self_type" : "_ZTIN4Json5Value8CZStringUt_E",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "referenced_type" : "_ZTINSt3__110unique_ptrINS_5arrayINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEELm3EEENS_14default_deleteIS8_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json5Value8CommentsE",
   "name" : "Json::Value::Comments",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json5Value8CommentsE",
   "self_type" : "_ZTIN4Json5Value8CommentsE",
   "size" : 8,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value_",
     "referenced_type" : "_ZTIN4Json5Value11ValueHolderE"
    },
    {
     "access" : "private",
     "field_name" : "bits_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4Json5ValueUt_E"
    },
    {
     "access" : "private",
     "field_name" : "comments_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4Json5Value8CommentsE"
    },
    {
     "access" : "private",
     "field_name" : "start_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "access" : "private",
     "field_name" : "limit_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4Json5ValueE",
   "name" : "Json::Value",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json5ValueE",
   "self_type" : "_ZTIN4Json5ValueE",
   "size" : 40,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value_type_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "allocated_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN4Json5ValueUt_E",
   "name" : "Json::Value::(anonymous struct at external/jsoncpp/include/json/value.h:627:3)",
   "referenced_type" : "_ZTIN4Json5ValueUt_E",
   "self_type" : "_ZTIN4Json5ValueUt_E",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/value.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "offset_start",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "offset_limit",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "message",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4Json6Reader15StructuredErrorE",
   "name" : "Json::Reader::StructuredError",
   "referenced_type" : "_ZTIN4Json6Reader15StructuredErrorE",
   "self_type" : "_ZTIN4Json6Reader15StructuredErrorE",
   "size" : 40,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type_",
     "referenced_type" : "_ZTIN4Json6Reader9TokenTypeE"
    },
    {
     "field_name" : "start_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "end_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4Json6Reader5TokenE",
   "name" : "Json::Reader::Token",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json6Reader5TokenE",
   "self_type" : "_ZTIN4Json6Reader5TokenE",
   "size" : 24,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "token_",
     "referenced_type" : "_ZTIN4Json6Reader5TokenE"
    },
    {
     "field_name" : "message_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "extra_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN4Json6Reader9ErrorInfoE",
   "name" : "Json::Reader::ErrorInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json6Reader9ErrorInfoE",
   "self_type" : "_ZTIN4Json6Reader9ErrorInfoE",
   "size" : 56,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "nodes_",
     "referenced_type" : "_ZTINSt3__15stackIPN4Json5ValueENS_5dequeIS3_NS_9allocatorIS3_EEEEEE"
    },
    {
     "access" : "private",
     "field_name" : "errors_",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__15dequeIN4Json6Reader9ErrorInfoENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "document_",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "begin_",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "end_",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "current_",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "lastValueEnd_",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "lastValue_",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPN4Json5ValueE"
    },
    {
     "access" : "private",
     "field_name" : "commentsBefore_",
     "field_offset" : 1280,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "features_",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIN4Json8FeaturesE"
    },
    {
     "access" : "private",
     "field_name" : "collectComments_",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4Json6ReaderE",
   "name" : "Json::Reader",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json6ReaderE",
   "self_type" : "_ZTIN4Json6ReaderE",
   "size" : 192,
   "source_file" : "external/jsoncpp/include/json/reader.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "allowComments_",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "strictRoot_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "allowDroppedNullPlaceholders_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "allowNumericKeys_",
     "field_offset" : 24,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4Json8FeaturesE",
   "name" : "Json::Features",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4Json8FeaturesE",
   "self_type" : "_ZTIN4Json8FeaturesE",
   "size" : 4,
   "source_file" : "external/jsoncpp/include/json/json_features.h"
  }
 ],
 "rvalue_reference_types" : []
}
