{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_h",
   "name" : "unsigned char [128]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA128_h",
   "size" : 128,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA56_h",
   "name" : "unsigned char [56]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA56_h",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA580_h",
   "name" : "unsigned char [580]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA580_h",
   "size" : 580,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA5_j",
   "name" : "unsigned int [5]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA5_j",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA60_j",
   "name" : "unsigned int [60]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA60_j",
   "size" : 240,
   "source_file" : "external/boringssl/src/include/openssl/aes.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA64_h",
   "name" : "unsigned char [64]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA64_h",
   "size" : 64,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA8_j",
   "name" : "unsigned int [8]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA8_j",
   "size" : 32,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA8_y",
   "name" : "unsigned long long [8]",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIA8_y",
   "size" : 64,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIy",
   "name" : "unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIy",
   "size" : 8
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" :
 [
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 0,
     "name" : "evp_aead_open"
    },
    {
     "enum_field_value" : 1,
     "name" : "evp_aead_seal"
    }
   ],
   "linker_set_key" : "_ZTI20evp_aead_direction_t",
   "name" : "evp_aead_direction_t",
   "referenced_type" : "_ZTI20evp_aead_direction_t",
   "self_type" : "_ZTI20evp_aead_direction_t",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/aead.h",
   "underlying_type" : "_ZTIj"
  }
 ],
 "function_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPPKvS1_E",
   "name" : "int (const void **, const void **)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPPKv"
    },
    {
     "referenced_type" : "_ZTIPPKv"
    }
   ],
   "referenced_type" : "_ZTIFiPPKvS1_E",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPPKvS1_E",
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "functions" : [],
 "global_vars" : [],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP13stack_st_void",
   "name" : "stack_st_void *",
   "referenced_type" : "_ZTI13stack_st_void",
   "self_type" : "_ZTIP13stack_st_void",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP15evp_pkey_ctx_st",
   "name" : "evp_pkey_ctx_st *",
   "referenced_type" : "_ZTI15evp_pkey_ctx_st",
   "self_type" : "_ZTIP15evp_pkey_ctx_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP20CRYPTO_dynlock_value",
   "name" : "CRYPTO_dynlock_value *",
   "referenced_type" : "_ZTI20CRYPTO_dynlock_value",
   "self_type" : "_ZTIP20CRYPTO_dynlock_value",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiPPKvS1_E",
   "name" : "int (*)(const void **, const void **)",
   "referenced_type" : "_ZTIFiPPKvS1_E",
   "self_type" : "_ZTIPFiPPKvS1_E",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK11evp_aead_st",
   "name" : "const evp_aead_st *",
   "referenced_type" : "_ZTIK11evp_aead_st",
   "self_type" : "_ZTIPK11evp_aead_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK15evp_md_pctx_ops",
   "name" : "const evp_md_pctx_ops *",
   "referenced_type" : "_ZTIK15evp_md_pctx_ops",
   "self_type" : "_ZTIPK15evp_md_pctx_ops",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK9env_md_st",
   "name" : "const env_md_st *",
   "referenced_type" : "_ZTIK9env_md_st",
   "self_type" : "_ZTIPK9env_md_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPKv",
   "name" : "const void **",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIPPKv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK11evp_aead_st",
   "name" : "const evp_aead_st",
   "referenced_type" : "_ZTI11evp_aead_st",
   "self_type" : "_ZTIK11evp_aead_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK15evp_md_pctx_ops",
   "name" : "const evp_md_pctx_ops",
   "referenced_type" : "_ZTI15evp_md_pctx_ops",
   "self_type" : "_ZTIK15evp_md_pctx_ops",
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK9env_md_st",
   "name" : "const env_md_st",
   "referenced_type" : "_ZTI9env_md_st",
   "self_type" : "_ZTIK9env_md_st",
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rd_key",
     "referenced_type" : "_ZTIA60_j"
    },
    {
     "field_name" : "rounds",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10aes_key_st",
   "name" : "aes_key_st",
   "referenced_type" : "_ZTI10aes_key_st",
   "self_type" : "_ZTI10aes_key_st",
   "size" : 244,
   "source_file" : "external/boringssl/src/include/openssl/aes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN12sha_state_stUt_E"
    },
    {
     "field_name" : "Nl",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Nh",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA64_h"
    },
    {
     "field_name" : "num",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12sha_state_st",
   "name" : "sha_state_st",
   "referenced_type" : "_ZTI12sha_state_st",
   "self_type" : "_ZTI12sha_state_st",
   "size" : 96,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "digest",
     "referenced_type" : "_ZTIPK9env_md_st"
    },
    {
     "field_name" : "md_data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pctx",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15evp_pkey_ctx_st"
    },
    {
     "field_name" : "pctx_ops",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK15evp_md_pctx_ops"
    }
   ],
   "linker_set_key" : "_ZTI13env_md_ctx_st",
   "name" : "env_md_ctx_st",
   "referenced_type" : "_ZTI13env_md_ctx_st",
   "self_type" : "_ZTI13env_md_ctx_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
    }
   ],
   "linker_set_key" : "_ZTI14CRYPTO_dynlock",
   "name" : "CRYPTO_dynlock",
   "referenced_type" : "_ZTI14CRYPTO_dynlock",
   "self_type" : "_ZTI14CRYPTO_dynlock",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTIA56_h"
    }
   ],
   "linker_set_key" : "_ZTI15crypto_mutex_st",
   "name" : "crypto_mutex_st",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15crypto_mutex_st",
   "self_type" : "_ZTI15crypto_mutex_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "aead",
     "referenced_type" : "_ZTIPK11evp_aead_st"
    },
    {
     "field_name" : "state",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21evp_aead_ctx_st_state"
    },
    {
     "field_name" : "tag_len",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI15evp_aead_ctx_st",
   "name" : "evp_aead_ctx_st",
   "referenced_type" : "_ZTI15evp_aead_ctx_st",
   "self_type" : "_ZTI15evp_aead_ctx_st",
   "size" : 600,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h",
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "Nl",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Nh",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA64_h"
    },
    {
     "field_name" : "num",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "md_len",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15sha256_state_st",
   "name" : "sha256_state_st",
   "referenced_type" : "_ZTI15sha256_state_st",
   "self_type" : "_ZTI15sha256_state_st",
   "size" : 112,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "h",
     "referenced_type" : "_ZTIA8_y"
    },
    {
     "field_name" : "Nl",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "Nh",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "p",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "num",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "md_len",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15sha512_state_st",
   "name" : "sha512_state_st",
   "referenced_type" : "_ZTI15sha512_state_st",
   "self_type" : "_ZTI15sha512_state_st",
   "size" : 216,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sk",
     "referenced_type" : "_ZTIP13stack_st_void"
    }
   ],
   "linker_set_key" : "_ZTI17crypto_ex_data_st",
   "name" : "crypto_ex_data_st",
   "referenced_type" : "_ZTI17crypto_ex_data_st",
   "self_type" : "_ZTI17crypto_ex_data_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "opaque",
     "referenced_type" : "_ZTIA580_h"
    },
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI21evp_aead_ctx_st_state",
   "name" : "evp_aead_ctx_st_state",
   "record_kind" : "union",
   "referenced_type" : "_ZTI21evp_aead_ctx_st_state",
   "self_type" : "_ZTI21evp_aead_ctx_st_state",
   "size" : 584,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPv"
    },
    {
     "field_name" : "sorted",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_alloc",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "comp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPPKvS1_E"
    }
   ],
   "linker_set_key" : "_ZTI8stack_st",
   "name" : "stack_st",
   "referenced_type" : "_ZTI8stack_st",
   "self_type" : "_ZTI8stack_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h",
     "referenced_type" : "_ZTIA5_j"
    },
    {
     "referenced_type" : "_ZTIN12sha_state_stUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12sha_state_stUt_E",
   "name" : "sha_state_st::(anonymous union at external/boringssl/src/include/openssl/sha.h:105:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN12sha_state_stUt_E",
   "self_type" : "_ZTIN12sha_state_stUt_E",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h0",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h3",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h4",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12sha_state_stUt_Ut_E",
   "name" : "sha_state_st::(anonymous union at external/boringssl/src/include/openssl/sha.h:105:3)::(anonymous struct at external/boringssl/src/include/openssl/sha.h:107:5)",
   "referenced_type" : "_ZTIN12sha_state_stUt_Ut_E",
   "self_type" : "_ZTIN12sha_state_stUt_Ut_E",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  }
 ],
 "rvalue_reference_types" : []
}
