{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA16_Ds",
   "name" : "char16_t [16]",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIA16_Ds",
   "size" : 32,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA18_Ds",
   "name" : "char16_t [18]",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIA18_Ds",
   "size" : 36,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_PKc",
   "name" : "const char *[1]",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIA1_PKc",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA20_Ds",
   "name" : "char16_t [20]",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIA20_Ds",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA21_Ds",
   "name" : "char16_t [21]",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIA21_Ds",
   "size" : 42,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 2,

   "linker_set_key" : "_ZTIKNSt3__18optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "const std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorINS0_INS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEENS5_IS8_EEEEEE",
   "name" : "const std::optional<std::vector<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, std::allocator<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorINS0_INS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEENS5_IS8_EEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorINS0_INS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEENS5_IS8_EEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7IBinderE",
   "name" : "android::IBinder *const",
   "referenced_type" : "_ZTIPN7android7IBinderE",
   "self_type" : "_ZTIKPN7android7IBinderE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Binder.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/logging/liblog/include/android/log.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/av/media/libaaudio/include/aaudio/AAudio.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "_ZTI13android_ycbcr",
   "self_type" : "_ZTI13android_ycbcr",
   "size" : 80,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "_ZTI16android_xy_color",
   "self_type" : "_ZTI16android_xy_color",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "component",
     "field_offset" : 64,
     "referenced_type" : "_ZTI22android_flex_component"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "_ZTI18android_flex_plane",
   "self_type" : "_ZTI18android_flex_plane",
   "size" : 40,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19android_flex_format"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP18android_flex_plane"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "_ZTI19android_flex_layout",
   "self_type" : "_ZTI19android_flex_layout",
   "size" : 16,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "_ZTI20android_depth_points",
   "self_type" : "_ZTI20android_depth_points",
   "size" : 36,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 48,
   "source_file" : "system/logging/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "_ZTI25android_cta861_3_metadata",
   "self_type" : "_ZTI25android_cta861_3_metadata",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "_ZTI26android_smpte2086_metadata",
   "self_type" : "_ZTI26android_smpte2086_metadata",
   "size" : 40,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10ParcelableE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "readCounterParcelable",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN6aaudio12SharedRegionE"
    },
    {
     "field_name" : "writeCounterParcelable",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN6aaudio12SharedRegionE"
    },
    {
     "field_name" : "dataParcelable",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN6aaudio12SharedRegionE"
    },
    {
     "field_name" : "bytesPerFrame",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "framesPerBurst",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "capacityInFrames",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 736,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6aaudio10RingBufferE",
   "name" : "aaudio::RingBuffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6aaudio10RingBufferE",
   "self_type" : "_ZTIN6aaudio10RingBufferE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/frameworks/av/media/libaaudio/src/aaudio-aidl-cpp-source/gen/include/aaudio/RingBuffer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio10RingBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio10RingBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio10RingBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio10RingBuffer13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio10RingBuffer14readFromParcelEPKN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10ParcelableE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "sharedMemoryIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "offsetInBytes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sizeInBytes",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6aaudio12SharedRegionE",
   "name" : "aaudio::SharedRegion",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6aaudio12SharedRegionE",
   "self_type" : "_ZTIN6aaudio12SharedRegionE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/frameworks/av/media/libaaudio/src/aaudio-aidl-cpp-source/gen/include/aaudio/SharedRegion.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio12SharedRegionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio12SharedRegionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio12SharedRegionD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio12SharedRegion13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio12SharedRegion14readFromParcelEPKN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN6aaudio13IAAudioClientE",
   "name" : "aaudio::IAAudioClient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6aaudio13IAAudioClientE",
   "self_type" : "_ZTIN6aaudio13IAAudioClientE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/frameworks/av/media/libaaudio/src/aaudio-aidl-cpp-source/gen/include/aaudio/IAAudioClient.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio13IAAudioClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio13IAAudioClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio13IAAudioClientD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio13IAAudioClient22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio13IAAudioClient14onStreamChangeEiii"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio13IAAudioClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N6aaudio13IAAudioClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N6aaudio13IAAudioClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10ParcelableE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN6aaudio16StreamParametersE"
    },
    {
     "field_name" : "attributionSource",
     "field_offset" : 640,
     "referenced_type" : "_ZTIN7android7content22AttributionSourceStateE"
    },
    {
     "field_name" : "sharingModeMatchRequired",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "inService",
     "field_offset" : 1800,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6aaudio13StreamRequestE",
   "name" : "aaudio::StreamRequest",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6aaudio13StreamRequestE",
   "self_type" : "_ZTIN6aaudio13StreamRequestE",
   "size" : 232,
   "source_file" : "out/soong/.intermediates/frameworks/av/media/libaaudio/src/aaudio-aidl-cpp-source/gen/include/aaudio/StreamRequest.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio13StreamRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio13StreamRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio13StreamRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio13StreamRequest13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio13StreamRequest14readFromParcelEPKN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10ParcelableE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "channelMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sampleRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "deviceId",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sharingMode",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "audioFormat",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android5media5audio6common11AudioFormatE"
    },
    {
     "field_name" : "direction",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "usage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "contentType",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "spatializationBehavior",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "isContentSpatialized",
     "field_offset" : 352,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "inputPreset",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bufferCapacity",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "allowedCapturePolicy",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sessionId",
     "field_offset" : 480,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "isPrivacySensitive",
     "field_offset" : 512,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6aaudio16StreamParametersE",
   "name" : "aaudio::StreamParameters",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6aaudio16StreamParametersE",
   "self_type" : "_ZTIN6aaudio16StreamParametersE",
   "size" : 72,
   "source_file" : "out/soong/.intermediates/frameworks/av/media/libaaudio/src/aaudio-aidl-cpp-source/gen/include/aaudio/StreamParameters.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio16StreamParametersE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio16StreamParametersD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio16StreamParametersD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio16StreamParameters13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16StreamParameters14readFromParcelEPKN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6aaudio13IAAudioClientE"
    }
   ],
   "linker_set_key" : "_ZTIN6aaudio20IAAudioClientDefaultE",
   "name" : "aaudio::IAAudioClientDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6aaudio20IAAudioClientDefaultE",
   "self_type" : "_ZTIN6aaudio20IAAudioClientDefaultE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/frameworks/av/media/libaaudio/src/aaudio-aidl-cpp-source/gen/include/aaudio/IAAudioClient.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio20IAAudioClientDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio20IAAudioClientDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio20IAAudioClientDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6aaudio20IAAudioClientDefault10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio13IAAudioClient22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio20IAAudioClientDefault14onStreamChangeEiii"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio20IAAudioClientDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N6aaudio20IAAudioClientDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N6aaudio20IAAudioClientDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10ParcelableE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "upMessageQueueParcelable",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN6aaudio10RingBufferE"
    },
    {
     "field_name" : "downMessageQueueParcelable",
     "field_offset" : 832,
     "referenced_type" : "_ZTIN6aaudio10RingBufferE"
    },
    {
     "field_name" : "upDataQueueParcelable",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIN6aaudio10RingBufferE"
    },
    {
     "field_name" : "downDataQueueParcelable",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIN6aaudio10RingBufferE"
    },
    {
     "field_name" : "sharedMemories",
     "field_offset" : 3136,
     "referenced_type" : "_ZTINSt3__16vectorIN7android5media16SharedFileRegionENS_9allocatorIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN6aaudio8EndpointE",
   "name" : "aaudio::Endpoint",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6aaudio8EndpointE",
   "self_type" : "_ZTIN6aaudio8EndpointE",
   "size" : 416,
   "source_file" : "out/soong/.intermediates/frameworks/av/media/libaaudio/src/aaudio-aidl-cpp-source/gen/include/aaudio/Endpoint.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio8EndpointE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio8EndpointD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio8EndpointD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio8Endpoint13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio8Endpoint14readFromParcelEPKN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10IInterfaceE",
   "name" : "android::IInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10IInterfaceE",
   "self_type" : "_ZTIN7android10IInterfaceE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android10ParcelableE",
   "name" : "android::Parcelable",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10ParcelableE",
   "self_type" : "_ZTIN7android10ParcelableE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcelable.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10ParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTO",
     "referenced_type" : "_ZTIRN7android10TextOutputE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10TextOutput6BundleE",
   "name" : "android::TextOutput::Bundle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10TextOutput6BundleE",
   "self_type" : "_ZTIN7android10TextOutput6BundleE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android10TextOutputE",
   "name" : "android::TextOutput",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10TextOutputE",
   "self_type" : "_ZTIN7android10TextOutputE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/TextOutput.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10TextOutputE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10TextOutputD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10TextOutputD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput5printEPKcm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput10moveIndentEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput10pushBundleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput9popBundleEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKm"
    }
   ],
   "linker_set_key" : "_ZTIN7android10VectorImplE",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10VectorImplE",
   "self_type" : "_ZTIN7android10VectorImplE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android5media19IAudioFlingerClientE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_5media19IAudioFlingerClientEEE",
   "name" : "android::BnInterface<android::media::IAudioFlingerClient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_5media19IAudioFlingerClientEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_5media19IAudioFlingerClientEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android5media19IAudioFlingerClientE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_5media19IAudioFlingerClientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media19IAudioFlingerClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media19IAudioFlingerClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media19IAudioFlingerClientEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_5media19IAudioFlingerClientEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media19IAudioFlingerClient15ioConfigChangedENS0_18AudioIoConfigEventERKNS0_17AudioIoDescriptorE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media19IAudioFlingerClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_5media19IAudioFlingerClientEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_5media19IAudioFlingerClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_5media19IAudioFlingerClientEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_5media19IAudioFlingerClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_5media19IAudioFlingerClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_5media19IAudioFlingerClientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_5media19IAudioFlingerClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_5media19IAudioFlingerClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android5media25IAudioPolicyServiceClientE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEEE",
   "name" : "android::BnInterface<android::media::IAudioPolicyServiceClient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android5media25IAudioPolicyServiceClientE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media25IAudioPolicyServiceClient25onAudioVolumeGroupChangedEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media25IAudioPolicyServiceClient21onAudioPortListUpdateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media25IAudioPolicyServiceClient22onAudioPatchListUpdateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media25IAudioPolicyServiceClient29onDynamicPolicyMixStateUpdateERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media25IAudioPolicyServiceClient30onRecordingConfigurationUpdateEiRKNS0_16RecordClientInfoERKNS0_15AudioConfigBaseERKNSt3__16vectorINS0_16EffectDescriptorENS8_9allocatorISA_EEEES7_SF_iNS0_15AudioSourceTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media25IAudioPolicyServiceClient16onRoutingUpdatedEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_5media25IAudioPolicyServiceClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android5media7IPlayerE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_5media7IPlayerEEE",
   "name" : "android::BnInterface<android::media::IPlayer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_5media7IPlayerEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_5media7IPlayerEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android5media7IPlayerE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_5media7IPlayerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media7IPlayerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media7IPlayerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media7IPlayerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_5media7IPlayerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media7IPlayer5startEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media7IPlayer5pauseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media7IPlayer4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media7IPlayer9setVolumeEf"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media7IPlayer6setPanEf"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media7IPlayer15setStartDelayMsEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media7IPlayer17applyVolumeShaperERKNS0_25VolumeShaperConfigurationERKNS0_21VolumeShaperOperationE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media7IPlayerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_5media7IPlayerEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_5media7IPlayerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_5media7IPlayerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_5media7IPlayerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_5media7IPlayerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_5media7IPlayerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_5media7IPlayerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_5media7IPlayerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorINS_7String8ES1_EE",
   "name" : "android::KeyedVector<android::String8, android::String8>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorINS_7String8ES1_EE",
   "self_type" : "_ZTIN7android11KeyedVectorINS_7String8ES1_EE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIN7android7String8E", "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "name" : "android::KeyedVector<int, android::sp<android::AudioIoDescriptor>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "self_type" : "_ZTIN7android11KeyedVectorIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIi", "_ZTIN7android2spINS_17AudioIoDescriptorEEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android19VirtualLightRefBaseE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String8, android::String8>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE10do_compareEPKvS6_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEE10do_compareEPKvS8_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_22AudioMixMatchCriterionEEE",
   "name" : "android::SortedVector<android::AudioMixMatchCriterion>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_22AudioMixMatchCriterionEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_22AudioMixMatchCriterionEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIN7android22AudioMixMatchCriterionE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_22AudioMixMatchCriterionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_22AudioMixMatchCriterionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_22AudioMixMatchCriterionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22AudioMixMatchCriterionEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22AudioMixMatchCriterionEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22AudioMixMatchCriterionEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22AudioMixMatchCriterionEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22AudioMixMatchCriterionEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22AudioMixMatchCriterionEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22AudioMixMatchCriterionEE10do_compareEPKvS4_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor>>>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_22AudioMixMatchCriterionEEE",
   "name" : "android::trait_pointer<android::AudioMixMatchCriterion>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_22AudioMixMatchCriterionEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_22AudioMixMatchCriterionEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android22AudioMixMatchCriterionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "name" : "android::trait_pointer<android::sp<android::AudioSystem::AudioPortCallback>>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem17AudioPortCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "name" : "android::trait_pointer<android::sp<android::AudioSystem::AudioVolumeGroupCallback>>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem24AudioVolumeGroupCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_2spINS_17AudioIoDescriptorEEEEE",
   "name" : "android::trait_pointer<android::sp<android::AudioIoDescriptor>>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_2spINS_17AudioIoDescriptorEEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_2spINS_17AudioIoDescriptorEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_17AudioIoDescriptorEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_7String8EEE",
   "name" : "android::trait_pointer<android::String8>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_7String8EEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIiEE",
   "name" : "android::trait_pointer<int>",
   "referenced_type" : "_ZTIN7android13trait_pointerIiEE",
   "self_type" : "_ZTIN7android13trait_pointerIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14ReferenceMoverE",
   "self_type" : "_ZTIN7android14ReferenceMoverE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm16EEE",
   "name" : "android::StaticString16<16>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm16EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm16EEE",
   "size" : 48,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm18EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm18EEE",
   "name" : "android::StaticString16<18>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm18EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm18EEE",
   "size" : 48,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm20EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm20EEE",
   "name" : "android::StaticString16<20>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm20EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm20EEE",
   "size" : 56,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm21EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm21EEE",
   "name" : "android::StaticString16<21>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm21EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm21EEE",
   "size" : 56,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm24EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm24EEE",
   "name" : "android::StaticString16<24>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm24EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm24EEE",
   "size" : 64,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm25EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm25EEE",
   "name" : "android::StaticString16<25>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm25EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm25EEE",
   "size" : 64,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm26EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm26EEE",
   "name" : "android::StaticString16<26>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm26EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm26EEE",
   "size" : 64,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm27EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm27EEE",
   "name" : "android::StaticString16<27>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm27EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm27EEE",
   "size" : 72,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm30EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm30EEE",
   "name" : "android::StaticString16<30>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm30EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm30EEE",
   "size" : 72,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm31EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm31EEE",
   "name" : "android::StaticString16<31>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm31EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm31EEE",
   "size" : 80,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm32EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm32EEE",
   "name" : "android::StaticString16<32>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm32EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm32EEE",
   "size" : 80,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm33EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm33EEE",
   "name" : "android::StaticString16<33>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm33EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm33EEE",
   "size" : 80,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm35EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm35EEE",
   "name" : "android::StaticString16<35>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm35EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm35EEE",
   "size" : 88,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm36EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm36EEE",
   "name" : "android::StaticString16<36>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm36EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm36EEE",
   "size" : 88,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm38EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm38EEE",
   "name" : "android::StaticString16<38>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm38EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm38EEE",
   "size" : 88,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm39EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm39EEE",
   "name" : "android::StaticString16<39>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm39EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm39EEE",
   "size" : 96,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm40EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm40EEE",
   "name" : "android::StaticString16<40>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm40EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm40EEE",
   "size" : 96,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android8String1610StaticDataILm43EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android14StaticString16ILm43EEE",
   "name" : "android::StaticString16<43>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14StaticString16ILm43EEE",
   "self_type" : "_ZTIN7android14StaticString16ILm43EEE",
   "size" : 104,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android15IServiceManagerE",
   "name" : "android::IServiceManager",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android15IServiceManagerE",
   "self_type" : "_ZTIN7android15IServiceManagerE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IServiceManager.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15IServiceManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android15IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android15IServiceManagerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android15IServiceManager22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IServiceManager10getServiceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IServiceManager12checkServiceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager10addServiceERKNS_8String16ERKNS_2spINS_7IBinderEEEbi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager12listServicesEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager14waitForServiceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager10isDeclaredERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager20getDeclaredInstancesERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager16updatableViaApexERKNS_8String16E"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15IServiceManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15IServiceManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16FlattenableUtilsE",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16FlattenableUtilsE",
   "self_type" : "_ZTIN7android16FlattenableUtilsE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16ReferenceRenamerE",
   "self_type" : "_ZTIN7android16ReferenceRenamerE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16SortedVectorImplE",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16SortedVectorImplE",
   "self_type" : "_ZTIN7android16SortedVectorImplE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16aggregate_traitsINS_7String8ES1_EE",
   "name" : "android::aggregate_traits<android::String8, android::String8>",
   "referenced_type" : "_ZTIN7android16aggregate_traitsINS_7String8ES1_EE",
   "self_type" : "_ZTIN7android16aggregate_traitsINS_7String8ES1_EE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E", "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16aggregate_traitsIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "name" : "android::aggregate_traits<int, android::sp<android::AudioIoDescriptor>>",
   "referenced_type" : "_ZTIN7android16aggregate_traitsIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "self_type" : "_ZTIN7android16aggregate_traitsIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi", "_ZTIN7android2spINS_17AudioIoDescriptorEEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIN7android7String8E"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android7String8E"
    }
   ],
   "linker_set_key" : "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE",
   "name" : "android::key_value_pair_t<android::String8, android::String8>",
   "referenced_type" : "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE",
   "self_type" : "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E", "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2spINS_17AudioIoDescriptorEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "name" : "android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor>>",
   "referenced_type" : "_ZTIN7android16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "self_type" : "_ZTIN7android16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi", "_ZTIN7android2spINS_17AudioIoDescriptorEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::use_trivial_move<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "name" : "android::use_trivial_move<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor>>>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_22AudioMixMatchCriterionEEE",
   "name" : "android::use_trivial_move<android::AudioMixMatchCriterion>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_22AudioMixMatchCriterionEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_22AudioMixMatchCriterionEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android22AudioMixMatchCriterionE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "name" : "android::use_trivial_move<android::sp<android::AudioSystem::AudioPortCallback>>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem17AudioPortCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "name" : "android::use_trivial_move<android::sp<android::AudioSystem::AudioVolumeGroupCallback>>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem24AudioVolumeGroupCallbackEEE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11KeyedVectorIiNS_2spINS_17AudioIoDescriptorEEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDefault",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android2spINS_17AudioIoDescriptorEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android18DefaultKeyedVectorIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "name" : "android::DefaultKeyedVector<int, android::sp<android::AudioIoDescriptor>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android18DefaultKeyedVectorIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "self_type" : "_ZTIN7android18DefaultKeyedVectorIiNS_2spINS_17AudioIoDescriptorEEEEE",
   "size" : 48,
   "source_file" : "system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIi", "_ZTIN7android2spINS_17AudioIoDescriptorEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor>>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_22AudioMixMatchCriterionEEE",
   "name" : "android::trait_trivial_copy<android::AudioMixMatchCriterion>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_22AudioMixMatchCriterionEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_22AudioMixMatchCriterionEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android22AudioMixMatchCriterionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "name" : "android::trait_trivial_copy<android::sp<android::AudioSystem::AudioPortCallback>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem17AudioPortCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "name" : "android::trait_trivial_copy<android::sp<android::AudioSystem::AudioVolumeGroupCallback>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem24AudioVolumeGroupCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_2spINS_17AudioIoDescriptorEEEEE",
   "name" : "android::trait_trivial_copy<android::sp<android::AudioIoDescriptor>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_2spINS_17AudioIoDescriptorEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_2spINS_17AudioIoDescriptorEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_17AudioIoDescriptorEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_7String8EEE",
   "name" : "android::trait_trivial_copy<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor>>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_22AudioMixMatchCriterionEEE",
   "name" : "android::trait_trivial_ctor<android::AudioMixMatchCriterion>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_22AudioMixMatchCriterionEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_22AudioMixMatchCriterionEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android22AudioMixMatchCriterionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "name" : "android::trait_trivial_ctor<android::sp<android::AudioSystem::AudioPortCallback>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem17AudioPortCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "name" : "android::trait_trivial_ctor<android::sp<android::AudioSystem::AudioVolumeGroupCallback>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem24AudioVolumeGroupCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_17AudioIoDescriptorEEEEE",
   "name" : "android::trait_trivial_ctor<android::sp<android::AudioIoDescriptor>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_17AudioIoDescriptorEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_17AudioIoDescriptorEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_17AudioIoDescriptorEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_7String8EEE",
   "name" : "android::trait_trivial_ctor<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor>>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_22AudioMixMatchCriterionEEE",
   "name" : "android::trait_trivial_dtor<android::AudioMixMatchCriterion>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_22AudioMixMatchCriterionEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_22AudioMixMatchCriterionEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android22AudioMixMatchCriterionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "name" : "android::trait_trivial_dtor<android::sp<android::AudioSystem::AudioPortCallback>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem17AudioPortCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "name" : "android::trait_trivial_dtor<android::sp<android::AudioSystem::AudioVolumeGroupCallback>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem24AudioVolumeGroupCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_17AudioIoDescriptorEEEEE",
   "name" : "android::trait_trivial_dtor<android::sp<android::AudioIoDescriptor>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_17AudioIoDescriptorEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_17AudioIoDescriptorEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_17AudioIoDescriptorEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_7String8EEE",
   "name" : "android::trait_trivial_dtor<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor>>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_22AudioMixMatchCriterionEEE",
   "name" : "android::trait_trivial_move<android::AudioMixMatchCriterion>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_22AudioMixMatchCriterionEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_22AudioMixMatchCriterionEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android22AudioMixMatchCriterionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "name" : "android::trait_trivial_move<android::sp<android::AudioSystem::AudioPortCallback>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem17AudioPortCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "name" : "android::trait_trivial_move<android::sp<android::AudioSystem::AudioVolumeGroupCallback>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem24AudioVolumeGroupCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_2spINS_17AudioIoDescriptorEEEEE",
   "name" : "android::trait_trivial_move<android::sp<android::AudioIoDescriptor>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_2spINS_17AudioIoDescriptorEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_2spINS_17AudioIoDescriptorEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_17AudioIoDescriptorEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String8.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String16.h",
   "template_args" : [ "_ZTIN7android8String16E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "self_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10ParcelableE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcelable",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN7android10ParcelableEEE"
    },
    {
     "access" : "private",
     "field_name" : "mParcelableName",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__18optionalIN7android8String16EEE"
    },
    {
     "access" : "private",
     "field_name" : "mParcelPtr",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android6ParcelENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 384,
     "referenced_type" : "_ZTIN7android10Parcelable9StabilityE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2os16ParcelableHolderE",
   "name" : "android::os::ParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2os16ParcelableHolderE",
   "self_type" : "_ZTIN7android2os16ParcelableHolderE",
   "size" : 56,
   "source_file" : "frameworks/native/libs/binder/include/binder/ParcelableHolder.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android2os16ParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android2os16ParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android2os16ParcelableHolderD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android2os16ParcelableHolder13writeToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android2os16ParcelableHolder14readFromParcelEPKNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android2os16ParcelableHolder12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10ParcelableE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2os20ParcelFileDescriptorE",
   "name" : "android::os::ParcelFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2os20ParcelFileDescriptorE",
   "self_type" : "_ZTIN7android2os20ParcelFileDescriptorE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/include/binder/ParcelFileDescriptor.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android2os20ParcelFileDescriptorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android2os20ParcelFileDescriptorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android2os20ParcelFileDescriptorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android2os20ParcelFileDescriptor13writeToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android2os20ParcelFileDescriptor14readFromParcelEPKNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN6aaudio11AudioStream12MyPlayerBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spIN6aaudio11AudioStream12MyPlayerBaseEEE",
   "name" : "android::sp<aaudio::AudioStream::MyPlayerBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spIN6aaudio11AudioStream12MyPlayerBaseEEE",
   "self_type" : "_ZTIN7android2spIN6aaudio11AudioStream12MyPlayerBaseEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN6aaudio11AudioStream12MyPlayerBaseE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN6aaudio11AudioStreamE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spIN6aaudio11AudioStreamEEE",
   "name" : "android::sp<aaudio::AudioStream>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spIN6aaudio11AudioStreamEEE",
   "self_type" : "_ZTIN7android2spIN6aaudio11AudioStreamEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN6aaudio11AudioStreamE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "name" : "android::sp<android::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "self_type" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android10IInterfaceE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android10RpcSessionE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "name" : "android::sp<android::RpcSession>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "self_type" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android10RpcSessionE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android11AudioSystem17AudioPortCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_11AudioSystem17AudioPortCallbackEEE",
   "name" : "android::sp<android::AudioSystem::AudioPortCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_11AudioSystem17AudioPortCallbackEEE",
   "self_type" : "_ZTIN7android2spINS_11AudioSystem17AudioPortCallbackEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android11AudioSystem17AudioPortCallbackE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android11AudioSystem19AudioDeviceCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_11AudioSystem19AudioDeviceCallbackEEE",
   "name" : "android::sp<android::AudioSystem::AudioDeviceCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_11AudioSystem19AudioDeviceCallbackEEE",
   "self_type" : "_ZTIN7android2spINS_11AudioSystem19AudioDeviceCallbackEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android11AudioSystem19AudioDeviceCallbackE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android11AudioSystem24AudioVolumeGroupCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_11AudioSystem24AudioVolumeGroupCallbackEEE",
   "name" : "android::sp<android::AudioSystem::AudioVolumeGroupCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_11AudioSystem24AudioVolumeGroupCallbackEEE",
   "self_type" : "_ZTIN7android2spINS_11AudioSystem24AudioVolumeGroupCallbackEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android11AudioSystem24AudioVolumeGroupCallbackE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android13IAudioManagerE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_13IAudioManagerEEE",
   "name" : "android::sp<android::IAudioManager>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_13IAudioManagerEEE",
   "self_type" : "_ZTIN7android2spINS_13IAudioManagerEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android13IAudioManagerE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android15IServiceManagerE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_15IServiceManagerEEE",
   "name" : "android::sp<android::IServiceManager>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_15IServiceManagerEEE",
   "self_type" : "_ZTIN7android2spINS_15IServiceManagerEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android15IServiceManagerE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android17AudioIoDescriptorE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_17AudioIoDescriptorEEE",
   "name" : "android::sp<android::AudioIoDescriptor>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_17AudioIoDescriptorEEE",
   "self_type" : "_ZTIN7android2spINS_17AudioIoDescriptorEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android17AudioIoDescriptorE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android5media12VolumeShaper13ConfigurationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_5media12VolumeShaper13ConfigurationEEE",
   "name" : "android::sp<android::media::VolumeShaper::Configuration>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_5media12VolumeShaper13ConfigurationEEE",
   "self_type" : "_ZTIN7android2spINS_5media12VolumeShaper13ConfigurationEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android5media12VolumeShaper13ConfigurationE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android5media12VolumeShaper5StateE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_5media12VolumeShaper5StateEEE",
   "name" : "android::sp<android::media::VolumeShaper::State>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_5media12VolumeShaper5StateEEE",
   "self_type" : "_ZTIN7android2spINS_5media12VolumeShaper5StateEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android5media12VolumeShaper5StateE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android5media12VolumeShaper9OperationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_5media12VolumeShaper9OperationEEE",
   "name" : "android::sp<android::media::VolumeShaper::Operation>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_5media12VolumeShaper9OperationEEE",
   "self_type" : "_ZTIN7android2spINS_5media12VolumeShaper9OperationEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android5media12VolumeShaper9OperationE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7IBinderEEE",
   "name" : "android::sp<android::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7IBinderEEE",
   "self_type" : "_ZTIN7android2spINS_7IBinderEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7IBinderE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN6aaudio11AudioStreamE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpIN6aaudio11AudioStreamEEE",
   "name" : "android::wp<aaudio::AudioStream>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpIN6aaudio11AudioStreamEEE",
   "self_type" : "_ZTIN7android2wpIN6aaudio11AudioStreamEEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN6aaudio11AudioStreamE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android11AudioSystem19AudioDeviceCallbackE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_11AudioSystem19AudioDeviceCallbackEEE",
   "name" : "android::wp<android::AudioSystem::AudioDeviceCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_11AudioSystem19AudioDeviceCallbackEEE",
   "self_type" : "_ZTIN7android2wpINS_11AudioSystem19AudioDeviceCallbackEEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android11AudioSystem19AudioDeviceCallbackE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10unexpect_tE",
   "name" : "android::base::unexpect_t",
   "referenced_type" : "_ZTIN7android4base10unexpect_tE",
   "self_type" : "_ZTIN7android4base10unexpect_tE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/expected.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "val_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10unexpectedIiEE",
   "name" : "android::base::unexpected<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10unexpectedIiEE",
   "self_type" : "_ZTIN7android4base10unexpectedIiEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base11borrowed_fdE",
   "name" : "android::base::borrowed_fd",
   "referenced_type" : "_ZTIN7android4base11borrowed_fdE",
   "self_type" : "_ZTIN7android4base11borrowed_fdE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base13DefaultCloserE",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "_ZTIN7android4base13DefaultCloserE",
   "self_type" : "_ZTIN7android4base13DefaultCloserE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h",
   "template_args" : [ "_ZTIN7android4base13DefaultCloserE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base19ScopedLockAssertionE",
   "name" : "android::base::ScopedLockAssertion",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base19ScopedLockAssertionE",
   "self_type" : "_ZTIN7android4base19ScopedLockAssertionE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/thread_annotations.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "var_",
     "referenced_type" : "_ZTINSt3__17variantIJN7android5media14MicrophoneInfoENS1_4base10unexpectedIiEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base8expectedINS_5media14MicrophoneInfoEiEE",
   "name" : "android::base::expected<android::media::MicrophoneInfo, int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base8expectedINS_5media14MicrophoneInfoEiEE",
   "self_type" : "_ZTIN7android4base8expectedINS_5media14MicrophoneInfoEiEE",
   "size" : 200,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" : [ "_ZTIN7android5media14MicrophoneInfoE", "_ZTIi" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "var_",
     "referenced_type" : "_ZTINSt3__17variantIJN7android5media18MicrophoneInfoDataENS1_4base10unexpectedIiEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base8expectedINS_5media18MicrophoneInfoDataEiEE",
   "name" : "android::base::expected<android::media::MicrophoneInfoData, int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base8expectedINS_5media18MicrophoneInfoDataEiEE",
   "self_type" : "_ZTIN7android4base8expectedINS_5media18MicrophoneInfoDataEiEE",
   "size" : 224,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" : [ "_ZTIN7android5media18MicrophoneInfoDataE", "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "var_",
     "referenced_type" : "_ZTINSt3__17variantIJiN7android4base10unexpectedIiEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base8expectedIiiEE",
   "name" : "android::base::expected<int, int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base8expectedIiiEE",
   "self_type" : "_ZTIN7android4base8expectedIiiEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" : [ "_ZTIi", "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "var_",
     "referenced_type" : "_ZTINSt3__17variantIJjN7android4base10unexpectedIiEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base8expectedIjiEE",
   "name" : "android::base::expected<unsigned int, int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base8expectedIjiEE",
   "self_type" : "_ZTIN7android4base8expectedIjiEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/expected.h",
   "template_args" : [ "_ZTIj", "_ZTIi" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android5MutexE"
    }
   ],
   "linker_set_key" : "_ZTIN7android5Mutex8AutolockE",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5Mutex8AutolockE",
   "self_type" : "_ZTIN7android5Mutex8AutolockE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTI15pthread_mutex_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android5MutexE",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5MutexE",
   "self_type" : "_ZTIN7android5MutexE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10ParcelableE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "fd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2os20ParcelFileDescriptorE"
    },
    {
     "field_name" : "offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "size",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "writeable",
     "field_offset" : 320,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android5media16SharedFileRegionE",
   "name" : "android::media::SharedFileRegion",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5media16SharedFileRegionE",
   "self_type" : "_ZTIN7android5media16SharedFileRegionE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/frameworks/av/media/libshmem/shared-file-region-aidl-cpp-source/gen/include/android/media/SharedFileRegion.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android5media16SharedFileRegionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android5media16SharedFileRegionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android5media16SharedFileRegionD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android5media16SharedFileRegion13writeToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android5media16SharedFileRegion14readFromParcelEPKNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android6Parcel4BlobE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel12ReadableBlobE",
   "name" : "android::Parcel::ReadableBlob",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel12ReadableBlobE",
   "self_type" : "_ZTIN7android6Parcel12ReadableBlobE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android6Parcel4BlobE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel12WritableBlobE",
   "name" : "android::Parcel::WritableBlob",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel12WritableBlobE",
   "self_type" : "_ZTIN7android6Parcel12WritableBlobE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNS_2spEEE",
   "name" : "android::Parcel::is_specialization<int, android::sp>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNS_2spEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNS_2spEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110shared_ptrEEE",
   "name" : "android::Parcel::is_specialization<int, std::shared_ptr>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110shared_ptrEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110shared_ptrEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110unique_ptrEEE",
   "name" : "android::Parcel::is_specialization<int, std::unique_ptr>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110unique_ptrEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110unique_ptrEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__16vectorEEE",
   "name" : "android::Parcel::is_specialization<int, std::vector>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__16vectorEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__16vectorEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__18optionalEEE",
   "name" : "android::Parcel::is_specialization<int, std::optional>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__18optionalEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__18optionalEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE",
   "name" : "android::Parcel::FlattenableHelperInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE",
   "self_type" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface16getFlattenedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface10getFdCountEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface7flattenEPvmPim"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Parcel26FlattenableHelperInterface9unflattenEPKvmPKim"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFd",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "mMutable",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel4BlobE",
   "name" : "android::Parcel::Blob",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel4BlobE",
   "self_type" : "_ZTIN7android6Parcel4BlobE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mError",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPy"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSorted",
     "field_offset" : 576,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mRequestHeaderPresent",
     "field_offset" : 584,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mWorkSourceRequestHeaderPosition",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 704,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 712,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 720,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mDeallocZero",
     "field_offset" : 728,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvPN7android6ParcelEPKhmPKymE"
    },
    {
     "access" : "private",
     "field_name" : "mSession",
     "field_offset" : 832,
     "referenced_type" : "_ZTIN7android2spINS_10RpcSessionEEE"
    },
    {
     "access" : "private",
     "field_name" : "mOpenAshmemSize",
     "field_offset" : 896,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android6ParcelE",
   "name" : "android::Parcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6ParcelE",
   "self_type" : "_ZTIN7android6ParcelE",
   "size" : 120,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorINS_22AudioMixMatchCriterionEEE",
   "name" : "android::Vector<android::AudioMixMatchCriterion>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorINS_22AudioMixMatchCriterionEEE",
   "self_type" : "_ZTIN7android6VectorINS_22AudioMixMatchCriterionEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIN7android22AudioMixMatchCriterionE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_22AudioMixMatchCriterionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_22AudioMixMatchCriterionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_22AudioMixMatchCriterionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22AudioMixMatchCriterionEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22AudioMixMatchCriterionEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22AudioMixMatchCriterionEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22AudioMixMatchCriterionEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22AudioMixMatchCriterionEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22AudioMixMatchCriterionEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "name" : "android::Vector<android::sp<android::AudioSystem::AudioPortCallback>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "self_type" : "_ZTIN7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem17AudioPortCallbackEEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem17AudioPortCallbackEEEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "name" : "android::Vector<android::sp<android::AudioSystem::AudioVolumeGroupCallback>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "self_type" : "_ZTIN7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem24AudioVolumeGroupCallbackEEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android7String8E"
    }
   ],
   "linker_set_key" : "_ZTIN7android6binder6StatusE",
   "name" : "android::binder::Status",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6binder6StatusE",
   "self_type" : "_ZTIN7android6binder6StatusE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/include/binder/Status.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::traits<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android6traitsINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android6traitsINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "name" : "android::traits<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor>>>",
   "referenced_type" : "_ZTIN7android6traitsINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "self_type" : "_ZTIN7android6traitsINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_22AudioMixMatchCriterionEEE",
   "name" : "android::traits<android::AudioMixMatchCriterion>",
   "referenced_type" : "_ZTIN7android6traitsINS_22AudioMixMatchCriterionEEE",
   "self_type" : "_ZTIN7android6traitsINS_22AudioMixMatchCriterionEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android22AudioMixMatchCriterionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "name" : "android::traits<android::sp<android::AudioSystem::AudioPortCallback>>",
   "referenced_type" : "_ZTIN7android6traitsINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "self_type" : "_ZTIN7android6traitsINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem17AudioPortCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "name" : "android::traits<android::sp<android::AudioSystem::AudioVolumeGroupCallback>>",
   "referenced_type" : "_ZTIN7android6traitsINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "self_type" : "_ZTIN7android6traitsINS_2spINS_11AudioSystem24AudioVolumeGroupCallbackEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_11AudioSystem24AudioVolumeGroupCallbackEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_2spINS_17AudioIoDescriptorEEEEE",
   "name" : "android::traits<android::sp<android::AudioIoDescriptor>>",
   "referenced_type" : "_ZTIN7android6traitsINS_2spINS_17AudioIoDescriptorEEEEE",
   "self_type" : "_ZTIN7android6traitsINS_2spINS_17AudioIoDescriptorEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_17AudioIoDescriptorEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_7String8EEE",
   "name" : "android::traits<android::String8>",
   "referenced_type" : "_ZTIN7android6traitsINS_7String8EEE",
   "self_type" : "_ZTIN7android6traitsINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsIiEE",
   "name" : "android::traits<int>",
   "referenced_type" : "_ZTIN7android6traitsIiEE",
   "self_type" : "_ZTIN7android6traitsIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7IBinderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16atomicIPN7android7BBinder6ExtrasEEE"
    },
    {
     "access" : "private",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android7BBinderUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android7BBinderE",
   "name" : "android::BBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7BBinderE",
   "self_type" : "_ZTIN7android7BBinderE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/include/binder/Binder.h",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mStability",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mReserved0",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7BBinderUt_E",
   "name" : "android::BBinder::(anonymous union at frameworks/native/libs/binder/include/binder/Binder.h:117:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android7BBinderUt_E",
   "self_type" : "_ZTIN7android7BBinderUt_E",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Binder.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mBytesPerLine",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mSingleLineCutoff",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mAlignment",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mCArrayStyle",
     "field_offset" : 320,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android7HexDumpE",
   "name" : "android::HexDump",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7HexDumpE",
   "self_type" : "_ZTIN7android7HexDumpE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7IBinder14DeathRecipientE",
   "name" : "android::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7IBinder14DeathRecipientE",
   "self_type" : "_ZTIN7android7IBinder14DeathRecipientE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IBinder.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipient10binderDiedERKNS_2wpIS0_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7IBinderE",
   "name" : "android::IBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7IBinderE",
   "self_type" : "_ZTIN7android7IBinderE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IBinder.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder13isBinderAliveEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder10pingBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder11linkToDeathERKNS_2spINS0_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder13unlinkToDeathERKNS_2wpINS0_14DeathRecipientEEEPvjPS3_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIN7android7RefBaseE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN7android7String8E",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7String8E",
   "self_type" : "_ZTIN7android7String8E",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/String8.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10ParcelableE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "pid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "packageName",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE"
    },
    {
     "field_name" : "attributionTag",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__18optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE"
    },
    {
     "field_name" : "token",
     "field_offset" : 640,
     "referenced_type" : "_ZTIN7android2spINS_7IBinderEEE"
    },
    {
     "field_name" : "renouncedPermissions",
     "field_offset" : 704,
     "referenced_type" : "_ZTINSt3__18optionalINS_6vectorINS0_INS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEENS5_IS8_EEEEEE"
    },
    {
     "field_name" : "next",
     "field_offset" : 960,
     "referenced_type" : "_ZTINSt3__16vectorIN7android7content22AttributionSourceStateENS_9allocatorIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7content22AttributionSourceStateE",
   "name" : "android::content::AttributionSourceState",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7content22AttributionSourceStateE",
   "self_type" : "_ZTIN7android7content22AttributionSourceStateE",
   "size" : 144,
   "source_file" : "out/soong/.intermediates/frameworks/native/libs/permission/framework-permission-aidl-cpp-source/gen/include/android/content/AttributionSourceState.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7content22AttributionSourceStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7content22AttributionSourceStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7content22AttributionSourceStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android7content22AttributionSourceState13writeToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android7content22AttributionSourceState14readFromParcelEPKNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA16_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm16EEE",
   "name" : "android::String16::StaticData<16>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm16EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm16EEE",
   "size" : 36,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA18_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm18EEE",
   "name" : "android::String16::StaticData<18>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm18EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm18EEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA20_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm20EEE",
   "name" : "android::String16::StaticData<20>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm20EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm20EEE",
   "size" : 44,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA21_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm21EEE",
   "name" : "android::String16::StaticData<21>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm21EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm21EEE",
   "size" : 48,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA24_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm24EEE",
   "name" : "android::String16::StaticData<24>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm24EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm24EEE",
   "size" : 52,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA25_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm25EEE",
   "name" : "android::String16::StaticData<25>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm25EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm25EEE",
   "size" : 56,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA26_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm26EEE",
   "name" : "android::String16::StaticData<26>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm26EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm26EEE",
   "size" : 56,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA27_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm27EEE",
   "name" : "android::String16::StaticData<27>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm27EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm27EEE",
   "size" : 60,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA30_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm30EEE",
   "name" : "android::String16::StaticData<30>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm30EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm30EEE",
   "size" : 64,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA31_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm31EEE",
   "name" : "android::String16::StaticData<31>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm31EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm31EEE",
   "size" : 68,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA32_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm32EEE",
   "name" : "android::String16::StaticData<32>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm32EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm32EEE",
   "size" : 68,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA33_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm33EEE",
   "name" : "android::String16::StaticData<33>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm33EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm33EEE",
   "size" : 72,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA35_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm35EEE",
   "name" : "android::String16::StaticData<35>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm35EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm35EEE",
   "size" : 76,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA36_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm36EEE",
   "name" : "android::String16::StaticData<36>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm36EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm36EEE",
   "size" : 76,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA38_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm38EEE",
   "name" : "android::String16::StaticData<38>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm38EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm38EEE",
   "size" : 80,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA39_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm39EEE",
   "name" : "android::String16::StaticData<39>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm39EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm39EEE",
   "size" : 84,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA40_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm40EEE",
   "name" : "android::String16::StaticData<40>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm40EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm40EEE",
   "size" : 84,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA43_Ds"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String1610StaticDataILm43EEE",
   "name" : "android::String16::StaticData<43>",
   "referenced_type" : "_ZTIN7android8String1610StaticDataILm43EEE",
   "self_type" : "_ZTIN7android8String1610StaticDataILm43EEE",
   "size" : 92,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKDs"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String16E",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8String16E",
   "self_type" : "_ZTIN7android8String16E",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCode",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8TypeCodeE",
   "name" : "android::TypeCode",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8TypeCodeE",
   "self_type" : "_ZTIN7android8TypeCodeE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, std::allocator<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorINS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEENS5_IS8_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<android::media::AudioPortConfig, std::allocator<android::media::AudioPortConfig>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media15AudioPortConfigENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<android::media::AudioStreamType, std::allocator<android::media::AudioStreamType>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media15AudioStreamTypeENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<android::media::SharedFileRegion, std::allocator<android::media::SharedFileRegion>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media16SharedFileRegionENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<android::media::AudioAttributesEx, std::allocator<android::media::AudioAttributesEx>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media17AudioAttributesExENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<android::media::AudioAttributesInternal, std::allocator<android::media::AudioAttributesInternal>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media23AudioAttributesInternalENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<android::content::AttributionSourceState, std::allocator<android::content::AttributionSourceState>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android7content22AttributionSourceStateENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<float, std::allocator<float>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<unsigned char, std::allocator<unsigned char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<int, std::allocator<int>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN6aaudio10RingBufferEEE",
   "name" : "android::internal::details::IsPointerLike<aaudio::RingBuffer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeIN6aaudio10RingBufferEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeIN6aaudio10RingBufferEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio10RingBufferE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN6aaudio12SharedRegionEEE",
   "name" : "android::internal::details::IsPointerLike<aaudio::SharedRegion>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeIN6aaudio12SharedRegionEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeIN6aaudio12SharedRegionEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio12SharedRegionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN6aaudio16StreamParametersEEE",
   "name" : "android::internal::details::IsPointerLike<aaudio::StreamParameters>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeIN6aaudio16StreamParametersEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeIN6aaudio16StreamParametersEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio16StreamParametersE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_2spINS_7IBinderEEEEE",
   "name" : "android::internal::details::IsPointerLike<android::sp<android::IBinder>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_2spINS_7IBinderEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_2spINS_7IBinderEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android2spINS_7IBinderEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media10AudioPatchEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioPatch>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media10AudioPatchEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media10AudioPatchEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media10AudioPatchE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media10AudioUsageEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioUsage>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media10AudioUsageEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media10AudioUsageEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media10AudioUsageE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media12AudioIoFlagsEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioIoFlags>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media12AudioIoFlagsEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media12AudioIoFlagsEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media12AudioIoFlagsE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media13AudioPortRoleEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioPortRole>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media13AudioPortRoleEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media13AudioPortRoleEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media13AudioPortRoleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media13AudioPortTypeEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioPortType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media13AudioPortTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media13AudioPortTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media13AudioPortTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioGainConfigEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioGainConfig>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioGainConfigEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioGainConfigEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioGainConfigE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioPortConfigEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioPortConfig>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioPortConfigEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioPortConfigEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioPortConfigE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioSourceTypeEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioSourceType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioSourceTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioSourceTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioSourceTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioStreamTypeEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioStreamType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioStreamTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media15AudioStreamTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioStreamTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media16AudioContentTypeEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioContentType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media16AudioContentTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media16AudioContentTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media16AudioContentTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media16InterpolatorTypeEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::InterpolatorType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media16InterpolatorTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media16InterpolatorTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media16InterpolatorTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media16SharedFileRegionEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::SharedFileRegion>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media16SharedFileRegionEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media16SharedFileRegionEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media16SharedFileRegionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media17AudioAttributesExEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioAttributesEx>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media17AudioAttributesExEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media17AudioAttributesExEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media17AudioAttributesExE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media18AudioPortConfigExtEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioPortConfigExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media18AudioPortConfigExtEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media18AudioPortConfigExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media18AudioPortConfigExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media18InterpolatorConfigEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::InterpolatorConfig>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media18InterpolatorConfigEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media18InterpolatorConfigEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media18InterpolatorConfigE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media21AudioPortConfigMixExtEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioPortConfigMixExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media21AudioPortConfigMixExtEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media21AudioPortConfigMixExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media21AudioPortConfigMixExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media23AudioAttributesInternalEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioAttributesInternal>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media23AudioAttributesInternalEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media23AudioAttributesInternalEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media23AudioAttributesInternalE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media24AudioPortConfigDeviceExtEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioPortConfigDeviceExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media24AudioPortConfigDeviceExtEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media24AudioPortConfigDeviceExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media24AudioPortConfigDeviceExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media25AudioPortConfigSessionExtEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioPortConfigSessionExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media25AudioPortConfigSessionExtEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media25AudioPortConfigSessionExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media25AudioPortConfigSessionExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media28AudioPortConfigMixExtUseCaseEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioPortConfigMixExtUseCase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media28AudioPortConfigMixExtUseCaseEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media28AudioPortConfigMixExtUseCaseEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media28AudioPortConfigMixExtUseCaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media29VolumeShaperConfigurationTypeEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::VolumeShaperConfigurationType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media29VolumeShaperConfigurationTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media29VolumeShaperConfigurationTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media29VolumeShaperConfigurationTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media5audio6common11AudioFormatEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::audio::common::AudioFormat>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media5audio6common11AudioFormatEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media5audio6common11AudioFormatEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media5audio6common11AudioFormatE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media9AudioUuidEEE",
   "name" : "android::internal::details::IsPointerLike<android::media::AudioUuid>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media9AudioUuidEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_5media9AudioUuidEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media9AudioUuidE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINS_7content22AttributionSourceStateEEE",
   "name" : "android::internal::details::IsPointerLike<android::content::AttributionSourceState>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_7content22AttributionSourceStateEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINS_7content22AttributionSourceStateEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android7content22AttributionSourceStateE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::vector<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, std::allocator<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorINS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEENS5_IS8_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::vector<android::media::AudioPortConfig, std::allocator<android::media::AudioPortConfig>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media15AudioPortConfigENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::vector<android::media::AudioStreamType, std::allocator<android::media::AudioStreamType>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media15AudioStreamTypeENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::vector<android::media::SharedFileRegion, std::allocator<android::media::SharedFileRegion>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media16SharedFileRegionENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::vector<android::media::AudioAttributesEx, std::allocator<android::media::AudioAttributesEx>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media17AudioAttributesExENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::vector<android::media::AudioAttributesInternal, std::allocator<android::media::AudioAttributesInternal>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media23AudioAttributesInternalENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::vector<android::content::AttributionSourceState, std::allocator<android::content::AttributionSourceState>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android7content22AttributionSourceStateENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::vector<float, std::allocator<float>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::vector<unsigned char, std::allocator<unsigned char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::vector<int, std::allocator<int>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__18optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__18optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__18optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__18optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__18optionalINS3_6vectorINS4_INS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::optional<std::vector<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, std::allocator<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__18optionalINS3_6vectorINS4_INS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__18optionalINS3_6vectorINS4_INS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__18optionalINS_6vectorINS0_INS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEENS5_IS8_EEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__18optionalINS_5media18InterpolatorConfigEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::optional<android::media::InterpolatorConfig>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__18optionalINS_5media18InterpolatorConfigEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__18optionalINS_5media18InterpolatorConfigEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__18optionalIN7android5media18InterpolatorConfigEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringIN6aaudio10RingBufferEEE",
   "name" : "android::internal::details::ToEmptyString<aaudio::RingBuffer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringIN6aaudio10RingBufferEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringIN6aaudio10RingBufferEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio10RingBufferE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringIN6aaudio12SharedRegionEEE",
   "name" : "android::internal::details::ToEmptyString<aaudio::SharedRegion>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringIN6aaudio12SharedRegionEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringIN6aaudio12SharedRegionEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio12SharedRegionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringIN6aaudio16StreamParametersEEE",
   "name" : "android::internal::details::ToEmptyString<aaudio::StreamParameters>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringIN6aaudio16StreamParametersEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringIN6aaudio16StreamParametersEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio16StreamParametersE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_2os20ParcelFileDescriptorEEE",
   "name" : "android::internal::details::ToEmptyString<android::os::ParcelFileDescriptor>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_2os20ParcelFileDescriptorEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_2os20ParcelFileDescriptorEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android2os20ParcelFileDescriptorE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_2spINS_7IBinderEEEEE",
   "name" : "android::internal::details::ToEmptyString<android::sp<android::IBinder>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_2spINS_7IBinderEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_2spINS_7IBinderEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android2spINS_7IBinderEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media10AudioPatchEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioPatch>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media10AudioPatchEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media10AudioPatchEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media10AudioPatchE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media10AudioUsageEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioUsage>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media10AudioUsageEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media10AudioUsageEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media10AudioUsageE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media12AudioIoFlagsEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioIoFlags>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media12AudioIoFlagsEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media12AudioIoFlagsEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media12AudioIoFlagsE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media13AudioPortRoleEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioPortRole>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media13AudioPortRoleEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media13AudioPortRoleEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media13AudioPortRoleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media13AudioPortTypeEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioPortType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media13AudioPortTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media13AudioPortTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media13AudioPortTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioGainConfigEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioGainConfig>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioGainConfigEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioGainConfigEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioGainConfigE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioPortConfigEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioPortConfig>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioPortConfigEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioPortConfigEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioPortConfigE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioSourceTypeEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioSourceType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioSourceTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioSourceTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioSourceTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioStreamTypeEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioStreamType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioStreamTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media15AudioStreamTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioStreamTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media16AudioContentTypeEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioContentType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media16AudioContentTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media16AudioContentTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media16AudioContentTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media16InterpolatorTypeEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::InterpolatorType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media16InterpolatorTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media16InterpolatorTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media16InterpolatorTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media16SharedFileRegionEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::SharedFileRegion>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media16SharedFileRegionEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media16SharedFileRegionEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media16SharedFileRegionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media17AudioAttributesExEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioAttributesEx>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media17AudioAttributesExEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media17AudioAttributesExEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media17AudioAttributesExE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media18AudioPortConfigExtEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioPortConfigExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media18AudioPortConfigExtEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media18AudioPortConfigExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media18AudioPortConfigExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media18InterpolatorConfigEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::InterpolatorConfig>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media18InterpolatorConfigEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media18InterpolatorConfigEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media18InterpolatorConfigE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media21AudioPortConfigMixExtEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioPortConfigMixExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media21AudioPortConfigMixExtEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media21AudioPortConfigMixExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media21AudioPortConfigMixExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media23AudioAttributesInternalEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioAttributesInternal>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media23AudioAttributesInternalEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media23AudioAttributesInternalEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media23AudioAttributesInternalE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media24AudioPortConfigDeviceExtEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioPortConfigDeviceExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media24AudioPortConfigDeviceExtEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media24AudioPortConfigDeviceExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media24AudioPortConfigDeviceExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media25AudioPortConfigSessionExtEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioPortConfigSessionExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media25AudioPortConfigSessionExtEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media25AudioPortConfigSessionExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media25AudioPortConfigSessionExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media28AudioPortConfigMixExtUseCaseEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioPortConfigMixExtUseCase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media28AudioPortConfigMixExtUseCaseEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media28AudioPortConfigMixExtUseCaseEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media28AudioPortConfigMixExtUseCaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media29VolumeShaperConfigurationTypeEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::VolumeShaperConfigurationType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media29VolumeShaperConfigurationTypeEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media29VolumeShaperConfigurationTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media29VolumeShaperConfigurationTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media5audio6common11AudioFormatEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::audio::common::AudioFormat>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media5audio6common11AudioFormatEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media5audio6common11AudioFormatEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media5audio6common11AudioFormatE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media9AudioUuidEEE",
   "name" : "android::internal::details::ToEmptyString<android::media::AudioUuid>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media9AudioUuidEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_5media9AudioUuidEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media9AudioUuidE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_7IBinderEEE",
   "name" : "android::internal::details::ToEmptyString<android::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_7IBinderEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_7IBinderEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android7IBinderE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINS_7content22AttributionSourceStateEEE",
   "name" : "android::internal::details::ToEmptyString<android::content::AttributionSourceState>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_7content22AttributionSourceStateEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINS_7content22AttributionSourceStateEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android7content22AttributionSourceStateE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::vector<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, std::allocator<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorINS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEENS5_IS8_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::vector<android::media::AudioPortConfig, std::allocator<android::media::AudioPortConfig>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media15AudioPortConfigENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::vector<android::media::AudioStreamType, std::allocator<android::media::AudioStreamType>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media15AudioStreamTypeENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::vector<android::media::SharedFileRegion, std::allocator<android::media::SharedFileRegion>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media16SharedFileRegionENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::vector<android::media::AudioAttributesEx, std::allocator<android::media::AudioAttributesEx>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media17AudioAttributesExENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::vector<android::media::AudioAttributesInternal, std::allocator<android::media::AudioAttributesInternal>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media23AudioAttributesInternalENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::vector<android::content::AttributionSourceState, std::allocator<android::content::AttributionSourceState>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android7content22AttributionSourceStateENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::vector<float, std::allocator<float>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::vector<unsigned char, std::allocator<unsigned char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::vector<int, std::allocator<int>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__18optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__18optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__18optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__18optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__18optionalINS3_6vectorINS4_INS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::optional<std::vector<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, std::allocator<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__18optionalINS3_6vectorINS4_INS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__18optionalINS3_6vectorINS4_INS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__18optionalINS_6vectorINS0_INS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEENS5_IS8_EEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__18optionalINS_5media18InterpolatorConfigEEEEE",
   "name" : "android::internal::details::ToEmptyString<std::optional<android::media::InterpolatorConfig>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__18optionalINS_5media18InterpolatorConfigEEEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringINSt3__18optionalINS_5media18InterpolatorConfigEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__18optionalIN7android5media18InterpolatorConfigEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringIbEE",
   "name" : "android::internal::details::ToEmptyString<bool>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringIbEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringIbEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringIdEE",
   "name" : "android::internal::details::ToEmptyString<double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringIdEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringIdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringIfEE",
   "name" : "android::internal::details::ToEmptyString<float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringIfEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringIfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringIhEE",
   "name" : "android::internal::details::ToEmptyString<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringIhEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringIhEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringIiEE",
   "name" : "android::internal::details::ToEmptyString<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringIiEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringIiEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringIlEE",
   "name" : "android::internal::details::ToEmptyString<long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringIlEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringIlEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodIN6aaudio10RingBufferEEE",
   "name" : "android::internal::details::HasToStringMethod<aaudio::RingBuffer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodIN6aaudio10RingBufferEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodIN6aaudio10RingBufferEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio10RingBufferE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodIN6aaudio12SharedRegionEEE",
   "name" : "android::internal::details::HasToStringMethod<aaudio::SharedRegion>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodIN6aaudio12SharedRegionEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodIN6aaudio12SharedRegionEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio12SharedRegionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodIN6aaudio16StreamParametersEEE",
   "name" : "android::internal::details::HasToStringMethod<aaudio::StreamParameters>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodIN6aaudio16StreamParametersEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodIN6aaudio16StreamParametersEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio16StreamParametersE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media10AudioPatchEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioPatch>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media10AudioPatchEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media10AudioPatchEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media10AudioPatchE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media10AudioUsageEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioUsage>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media10AudioUsageEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media10AudioUsageEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media10AudioUsageE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media12AudioIoFlagsEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioIoFlags>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media12AudioIoFlagsEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media12AudioIoFlagsEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media12AudioIoFlagsE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media13AudioPortRoleEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioPortRole>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media13AudioPortRoleEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media13AudioPortRoleEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media13AudioPortRoleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media13AudioPortTypeEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioPortType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media13AudioPortTypeEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media13AudioPortTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media13AudioPortTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioGainConfigEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioGainConfig>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioGainConfigEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioGainConfigEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioGainConfigE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioPortConfigEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioPortConfig>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioPortConfigEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioPortConfigEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioPortConfigE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioSourceTypeEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioSourceType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioSourceTypeEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioSourceTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioSourceTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioStreamTypeEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioStreamType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioStreamTypeEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media15AudioStreamTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media15AudioStreamTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media16AudioContentTypeEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioContentType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media16AudioContentTypeEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media16AudioContentTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media16AudioContentTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media16InterpolatorTypeEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::InterpolatorType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media16InterpolatorTypeEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media16InterpolatorTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media16InterpolatorTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media16SharedFileRegionEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::SharedFileRegion>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media16SharedFileRegionEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media16SharedFileRegionEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media16SharedFileRegionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media17AudioAttributesExEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioAttributesEx>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media17AudioAttributesExEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media17AudioAttributesExEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media17AudioAttributesExE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media18AudioPortConfigExtEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioPortConfigExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media18AudioPortConfigExtEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media18AudioPortConfigExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media18AudioPortConfigExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media18InterpolatorConfigEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::InterpolatorConfig>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media18InterpolatorConfigEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media18InterpolatorConfigEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media18InterpolatorConfigE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media21AudioPortConfigMixExtEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioPortConfigMixExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media21AudioPortConfigMixExtEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media21AudioPortConfigMixExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media21AudioPortConfigMixExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media23AudioAttributesInternalEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioAttributesInternal>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media23AudioAttributesInternalEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media23AudioAttributesInternalEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media23AudioAttributesInternalE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media24AudioPortConfigDeviceExtEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioPortConfigDeviceExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media24AudioPortConfigDeviceExtEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media24AudioPortConfigDeviceExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media24AudioPortConfigDeviceExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media25AudioPortConfigSessionExtEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioPortConfigSessionExt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media25AudioPortConfigSessionExtEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media25AudioPortConfigSessionExtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media25AudioPortConfigSessionExtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media28AudioPortConfigMixExtUseCaseEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioPortConfigMixExtUseCase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media28AudioPortConfigMixExtUseCaseEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media28AudioPortConfigMixExtUseCaseEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media28AudioPortConfigMixExtUseCaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media29VolumeShaperConfigurationTypeEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::VolumeShaperConfigurationType>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media29VolumeShaperConfigurationTypeEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media29VolumeShaperConfigurationTypeEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media29VolumeShaperConfigurationTypeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media5audio6common11AudioFormatEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::audio::common::AudioFormat>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media5audio6common11AudioFormatEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media5audio6common11AudioFormatEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media5audio6common11AudioFormatE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media9AudioUuidEEE",
   "name" : "android::internal::details::HasToStringMethod<android::media::AudioUuid>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media9AudioUuidEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_5media9AudioUuidEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android5media9AudioUuidE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINS_7content22AttributionSourceStateEEE",
   "name" : "android::internal::details::HasToStringMethod<android::content::AttributionSourceState>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_7content22AttributionSourceStateEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINS_7content22AttributionSourceStateEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN7android7content22AttributionSourceStateE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "name" : "android::internal::details::HasToStringMethod<std::vector<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, std::allocator<std::optional<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS3_8optionalINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEENS9_ISC_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorINS_8optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEENS5_IS8_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::HasToStringMethod<std::vector<android::media::AudioPortConfig, std::allocator<android::media::AudioPortConfig>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media15AudioPortConfigENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media15AudioPortConfigENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::HasToStringMethod<std::vector<android::media::AudioStreamType, std::allocator<android::media::AudioStreamType>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media15AudioStreamTypeENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media15AudioStreamTypeENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::HasToStringMethod<std::vector<android::media::SharedFileRegion, std::allocator<android::media::SharedFileRegion>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media16SharedFileRegionENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media16SharedFileRegionENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::HasToStringMethod<std::vector<android::media::AudioAttributesEx, std::allocator<android::media::AudioAttributesEx>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media17AudioAttributesExENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media17AudioAttributesExENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::HasToStringMethod<std::vector<android::media::AudioAttributesInternal, std::allocator<android::media::AudioAttributesInternal>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_5media23AudioAttributesInternalENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android5media23AudioAttributesInternalENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::HasToStringMethod<std::vector<android::content::AttributionSourceState, std::allocator<android::content::AttributionSourceState>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorINS_7content22AttributionSourceStateENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN7android7content22AttributionSourceStateENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "name" : "android::internal::details::HasToStringMethod<std::vector<float, std::allocator<float>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorIfNS3_9allocatorIfEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "name" : "android::internal::details::HasToStringMethod<std::vector<unsigned char, std::allocator<unsigned char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "name" : "android::internal::details::HasToStringMethod<std::vector<int, std::allocator<int>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "self_type" : "_ZTIN7android8internal7details17HasToStringMethodINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio10RingBufferENS_2spEEE",
   "name" : "android::internal::details::IsInstantiationOf<aaudio::RingBuffer, android::sp>",
   "referenced_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio10RingBufferENS_2spEEE",
   "self_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio10RingBufferENS_2spEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio10RingBufferE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio10RingBufferENSt3__110shared_ptrEEE",
   "name" : "android::internal::details::IsInstantiationOf<aaudio::RingBuffer, std::shared_ptr>",
   "referenced_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio10RingBufferENSt3__110shared_ptrEEE",
   "self_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio10RingBufferENSt3__110shared_ptrEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio10RingBufferE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio10RingBufferENSt3__18optionalEEE",
   "name" : "android::internal::details::IsInstantiationOf<aaudio::RingBuffer, std::optional>",
   "referenced_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio10RingBufferENSt3__18optionalEEE",
   "self_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio10RingBufferENSt3__18optionalEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio10RingBufferE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio12SharedRegionENS_2spEEE",
   "name" : "android::internal::details::IsInstantiationOf<aaudio::SharedRegion, android::sp>",
   "referenced_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio12SharedRegionENS_2spEEE",
   "self_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio12SharedRegionENS_2spEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio12SharedRegionE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio12SharedRegionENSt3__110shared_ptrEEE",
   "name" : "android::internal::details::IsInstantiationOf<aaudio::SharedRegion, std::shared_ptr>",
   "referenced_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio12SharedRegionENSt3__110shared_ptrEEE",
   "self_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio12SharedRegionENSt3__110shared_ptrEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio12SharedRegionE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio12SharedRegionENSt3__18optionalEEE",
   "name" : "android::internal::details::IsInstantiationOf<aaudio::SharedRegion, std::optional>",
   "referenced_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio12SharedRegionENSt3__18optionalEEE",
   "self_type" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio12SharedRegionENSt3__18optionalEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN6aaudio12SharedRegionE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8internal7details17IsInstantiationOfIN6aaudio16StreamParametersENS_2spEEE",
