#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GNSS_V1_0_IGNSSNICALLBACK_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GNSS_V1_0_IGNSSNICALLBACK_H

#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace gnss {
namespace V1_0 {

/**
 * GNSS Network Initiated callback interface.
 */
struct IGnssNiCallback : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.gnss@1.0::IGnssNiCallback"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class GnssNiType : uint8_t;
    enum class GnssNiNotifyFlags : uint32_t;
    enum class GnssUserResponseType : uint8_t;
    enum class GnssNiEncodingType : int32_t;
    struct GnssNiNotification;

    /**
     * GnssNiType constants
     */
    enum class GnssNiType : uint8_t {
        VOICE = 1,
        UMTS_SUPL = 2,
        UMTS_CTRL_PLANE = 3,
        EMERGENCY_SUPL = 4,
    };

    /**
     * GnssNiNotifyFlags constants
     */
    enum class GnssNiNotifyFlags : uint32_t {
        /**
         * NI requires notification
         */
        NEED_NOTIFY = 1u /* 0x0001 */,
        /**
         * NI requires verification
         */
        NEED_VERIFY = 2u /* 0x0002 */,
        /**
         * NI requires privacy override, no notification/minimal trace
         */
        PRIVACY_OVERRIDE = 4u /* 0x0004 */,
    };

    /**
     * GNSS NI responses, used to define the response in
     * NI structures
     */
    enum class GnssUserResponseType : uint8_t {
        RESPONSE_ACCEPT = 1,
        RESPONSE_DENY = 2,
        RESPONSE_NORESP = 3,
    };

    /**
     * NI data encoding scheme
     */
    enum class GnssNiEncodingType : int32_t {
        ENC_NONE = 0,
        ENC_SUPL_GSM_DEFAULT = 1,
        ENC_SUPL_UTF8 = 2,
        ENC_SUPL_UCS2 = 3,
        ENC_UNKNOWN = -1 /* -1 */,
    };

    /**
     * Represents an NI request
     */
    struct GnssNiNotification final {
        /**
         * An ID generated by HAL to associate NI notifications and UI
         * responses.
         */
        int32_t notificationId __attribute__ ((aligned(4)));
        /**
         * A type used to distinguish different categories of NI
         * events, such as VOICE, UMTS_SUPL etc.
         */
        ::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiType niType __attribute__ ((aligned(1)));
        /**
         * Notification/verification options, combinations of GnssNiNotifyFlags
         * constants.
         */
        ::android::hardware::hidl_bitfield<::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotifyFlags> notifyFlags __attribute__ ((aligned(4)));
        /**
         * Timeout period to wait for user response.
         * Set to 0 for no timeout limit. Specified in seconds.
         */
        uint32_t timeoutSec __attribute__ ((aligned(4)));
        /**
         * Default response when timeout.
         */
        ::android::hardware::gnss::V1_0::IGnssNiCallback::GnssUserResponseType defaultResponse __attribute__ ((aligned(1)));
        /**
         * String representing the requester of the network inititated location
         * request.
         */
        ::android::hardware::hidl_string requestorId __attribute__ ((aligned(8)));
        /**
         * Notification message. String representing the service(for eg. SUPL-service)
         * who sent the network initiated location request.
         */
        ::android::hardware::hidl_string notificationMessage __attribute__ ((aligned(8)));
        /**
         * requestorId decoding scheme.
         */
        ::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiEncodingType requestorIdEncoding __attribute__ ((aligned(4)));
        /**
         * notificationId decoding scheme
         */
        ::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiEncodingType notificationIdEncoding __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification, notificationId) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification, niType) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification, notifyFlags) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification, timeoutSec) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification, defaultResponse) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification, requestorId) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification, notificationMessage) == 40, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification, requestorIdEncoding) == 56, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification, notificationIdEncoding) == 60, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification) == 64, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Callback with a network initiated request.
     *
     * @param notification network initiated request.
     */
    virtual ::android::hardware::Return<void> niNotifyCb(const ::android::hardware::gnss::V1_0::IGnssNiCallback::GnssNiNotification& notification) = 0;

    /**
     * Return callback for interfaceChain
     */
    using interfaceChain_cb = std::function<void(const ::android::hardware::hidl_vec<::android::hardware::hidl_string>& descriptors)>;
    /*
     * Provides run-time type information for this object.
     * For example, for the following interface definition:
     *     package android.hardware.foo@1.0;
     *     interface IParent {};
