{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIDn",
   "name" : "nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",

   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long, std::allocator<unsigned long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP13AIBinder_Weak" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP23AIBinder_DeathRecipient" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP7AParcel" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP7AStatus" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "satPosEcef",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21SatellitePositionEcefE"
    },
    {
     "field_name" : "satVelEcef",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21SatelliteVelocityEcefE"
    },
    {
     "field_name" : "satClockInfo",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18SatelliteClockInfoE"
    },
    {
     "field_name" : "ionoDelayMeters",
     "field_offset" : 768,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "tropoDelayMeters",
     "field_offset" : 832,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE",
   "name" : "aidl::android::hardware::gnss::SatellitePvt",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/SatellitePvt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "constellation",
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21GnssConstellationTypeE"
    },
    {
     "field_name" : "carrierFrequencyHz",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "codeType",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE",
   "name" : "aidl::android::hardware::gnss::GnssSignalType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/GnssSignalType.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timestampNs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "timeUncertaintyNs",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE",
   "name" : "aidl::android::hardware::gnss::ElapsedRealtime",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/ElapsedRealtime.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "svid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "signalType",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE"
    },
    {
     "field_name" : "timeOffsetNs",
     "field_offset" : 384,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "state",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "receivedSvTimeInNs",
     "field_offset" : 512,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "receivedSvTimeUncertaintyInNs",
     "field_offset" : 576,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "antennaCN0DbHz",
     "field_offset" : 640,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "basebandCN0DbHz",
     "field_offset" : 704,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "pseudorangeRateMps",
     "field_offset" : 768,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "pseudorangeRateUncertaintyMps",
     "field_offset" : 832,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "accumulatedDeltaRangeState",
     "field_offset" : 896,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "accumulatedDeltaRangeM",
     "field_offset" : 960,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "accumulatedDeltaRangeUncertaintyM",
     "field_offset" : 1024,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "carrierCycles",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "carrierPhase",
     "field_offset" : 1152,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "carrierPhaseUncertainty",
     "field_offset" : 1216,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "multipathIndicator",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss22GnssMultipathIndicatorE"
    },
    {
     "field_name" : "snrDb",
     "field_offset" : 1344,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "agcLevelDb",
     "field_offset" : 1408,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "fullInterSignalBiasNs",
     "field_offset" : 1472,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "fullInterSignalBiasUncertaintyNs",
     "field_offset" : 1536,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satelliteInterSignalBiasNs",
     "field_offset" : 1600,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satelliteInterSignalBiasUncertaintyNs",
     "field_offset" : 1664,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satellitePvt",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE"
    },
    {
     "field_name" : "correlationVectors",
     "field_offset" : 2624,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware4gnss17CorrelationVectorENS_9allocatorIS5_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss15GnssMeasurementE",
   "name" : "aidl::android::hardware::gnss::GnssMeasurement",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15GnssMeasurementE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss15GnssMeasurementE",
   "size" : 352,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/GnssMeasurement.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frequencyOffsetMps",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "samplingWidthM",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "samplingStartM",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "magnitude",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss17CorrelationVectorE",
   "name" : "aidl::android::hardware::gnss::CorrelationVector",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17CorrelationVectorE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss17CorrelationVectorE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/CorrelationVector.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "satHardwareCodeBiasMeters",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satTimeCorrectionMeters",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satClkDriftMps",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss18SatelliteClockInfoE",
   "name" : "aidl::android::hardware::gnss::SatelliteClockInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18SatelliteClockInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss18SatelliteClockInfoE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/SatelliteClockInfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "posXMeters",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "posYMeters",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "posZMeters",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "ureMeters",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss21SatellitePositionEcefE",
   "name" : "aidl::android::hardware::gnss::SatellitePositionEcef",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21SatellitePositionEcefE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss21SatellitePositionEcefE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/SatellitePositionEcef.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "velXMps",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "velYMps",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "velZMps",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "ureRateMps",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss21SatelliteVelocityEcefE",
   "name" : "aidl::android::hardware::gnss::SatelliteVelocityEcef",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21SatelliteVelocityEcefE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss21SatelliteVelocityEcefE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/SatelliteVelocityEcef.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "measurements",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware4gnss15GnssMeasurementENS_9allocatorIS5_EEEE"
    },
    {
     "field_name" : "clock",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9GnssClockE"
    },
    {
     "field_name" : "elapsedRealtime",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss8GnssDataE",
   "name" : "aidl::android::hardware::gnss::GnssData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss8GnssDataE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss8GnssDataE",
   "size" : 160,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/GnssData.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "gnssClockFlags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "leapSecond",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timeNs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "timeUncertaintyNs",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "fullBiasNs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "biasNs",
     "field_offset" : 256,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "biasUncertaintyNs",
     "field_offset" : 320,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "driftNsps",
     "field_offset" : 384,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "driftUncertaintyNsps",
     "field_offset" : 448,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "hwClockDiscontinuityCount",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "referenceSignalTypeForIsb",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss9GnssClockE",
   "name" : "aidl::android::hardware::gnss::GnssClock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9GnssClockE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss9GnssClockE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V1-ndk_platform-source/gen/include/aidl/android/hardware/gnss/GnssClock.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4gnss15GnssMeasurementENS3_9allocatorIS9_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::gnss::GnssMeasurement, std::allocator<aidl::android::hardware::gnss::GnssMeasurement>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4gnss15GnssMeasurementENS3_9allocatorIS9_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4gnss15GnssMeasurementENS3_9allocatorIS9_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware4gnss15GnssMeasurementENS_9allocatorIS5_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4gnss17CorrelationVectorENS3_9allocatorIS9_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::gnss::CorrelationVector, std::allocator<aidl::android::hardware::gnss::CorrelationVector>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4gnss17CorrelationVectorENS3_9allocatorIS9_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4gnss17CorrelationVectorENS3_9allocatorIS9_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware4gnss17CorrelationVectorENS_9allocatorIS5_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<int, std::allocator<int>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware4gnss12SatellitePvtEEE",
   "name" : "android::internal::details::IsPointerLike<aidl::android::hardware::gnss::SatellitePvt>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware4gnss12SatellitePvtEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware4gnss12SatellitePvtEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware4gnss14GnssSignalTypeEEE",
