{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA11_Ds",
   "name" : "char16_t [11]",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIA11_Ds",
   "size" : 22,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA12_i",
   "name" : "int [12]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA12_i",
   "size" : 48,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA14_i",
   "name" : "int [14]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA14_i",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 16,
   "linker_set_key" : "_ZTIA16_11__Int32x4_t",
   "name" : "__attribute__((neon_vector_type(4))) int [16]",
   "referenced_type" : "_ZTI11__Int32x4_t",
   "self_type" : "_ZTIA16_11__Int32x4_t",
   "size" : 256,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h"
  },
  {
   "alignment" : 1,

   "name" : "const std::nothrow_t",
   "referenced_type" : "_ZTISt9nothrow_t",
   "self_type" : "_ZTIKSt9nothrow_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "self_type" : "_ZTIKSt9type_info",
   "size" : 16,
   "source_file" : "external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "external/libcxx/include/algorithm"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "_ZTIKe",
   "name" : "const long double",
   "referenced_type" : "_ZTIe",
   "self_type" : "_ZTIKe",
   "size" : 16,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/gemmlowp/internal/common.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/kernel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/libcxx/include/algorithm"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "_ZTIKn",
   "name" : "const __int128",
   "referenced_type" : "_ZTIn",
   "self_type" : "_ZTIKn",
   "size" : 16,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTIVNSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_mPKvE",
   "name" : "void *(*volatile)(void *, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvS_mPKvE",
   "self_type" : "_ZTIVPFPvS_mPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmPKvE",
   "name" : "void *(*volatile)(unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmPKvE",
   "self_type" : "_ZTIVPFPvmPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmmPKvE",
   "name" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmmPKvE",
   "self_type" : "_ZTIVPFPvmmPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "inputs",
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "outputs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "intermediates",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "temporaries",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "user_data",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "builtin_data",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "custom_initial_data",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "custom_initial_data_size",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "delegate",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP14TfLiteDelegate"
    }
   ],
   "linker_set_key" : "_ZTI10TfLiteNode",
   "name" : "TfLiteNode",
   "referenced_type" : "_ZTI10TfLiteNode",
   "self_type" : "_ZTI10TfLiteNode",
   "size" : 72,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cgroup",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "referenced_type" : "_ZTI10clone_args",
   "self_type" : "_ZTI10clone_args",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_10__Int8x8_t"
    }
   ],
   "linker_set_key" : "_ZTI10int8x8x2_t",
   "name" : "int8x8x2_t",
   "referenced_type" : "_ZTI10int8x8x2_t",
   "self_type" : "_ZTI10int8x8x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_10__Int8x8_t"
    }
   ],
   "linker_set_key" : "_ZTI10int8x8x3_t",
   "name" : "int8x8x3_t",
   "referenced_type" : "_ZTI10int8x8x3_t",
   "self_type" : "_ZTI10int8x8x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_10__Int8x8_t"
    }
   ],
   "linker_set_key" : "_ZTI10int8x8x4_t",
   "name" : "int8x8x4_t",
   "referenced_type" : "_ZTI10int8x8x4_t",
   "self_type" : "_ZTI10int8x8x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA31_y"
    },
    {
     "field_name" : "sp",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIA4096_h"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 4384,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "esr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI11esr_context",
   "name" : "esr_context",
   "referenced_type" : "_ZTI11esr_context",
   "self_type" : "_ZTI11esr_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_11__Int16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x4x2_t",
   "name" : "int16x4x2_t",
   "referenced_type" : "_ZTI11int16x4x2_t",
   "self_type" : "_ZTI11int16x4x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_11__Int16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x4x3_t",
   "name" : "int16x4x3_t",
   "referenced_type" : "_ZTI11int16x4x3_t",
   "self_type" : "_ZTI11int16x4x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_11__Int16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x4x4_t",
   "name" : "int16x4x4_t",
   "referenced_type" : "_ZTI11int16x4x4_t",
   "self_type" : "_ZTI11int16x4x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_11__Int16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x8x2_t",
   "name" : "int16x8x2_t",
   "referenced_type" : "_ZTI11int16x8x2_t",
   "self_type" : "_ZTI11int16x8x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_11__Int16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x8x3_t",
   "name" : "int16x8x3_t",
   "referenced_type" : "_ZTI11int16x8x3_t",
   "self_type" : "_ZTI11int16x8x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_11__Int16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x8x4_t",
   "name" : "int16x8x4_t",
   "referenced_type" : "_ZTI11int16x8x4_t",
   "self_type" : "_ZTI11int16x8x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_11__Int32x2_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x2x2_t",
   "name" : "int32x2x2_t",
   "referenced_type" : "_ZTI11int32x2x2_t",
   "self_type" : "_ZTI11int32x2x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_11__Int32x2_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x2x3_t",
   "name" : "int32x2x3_t",
   "referenced_type" : "_ZTI11int32x2x3_t",
   "self_type" : "_ZTI11int32x2x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_11__Int32x2_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x2x4_t",
   "name" : "int32x2x4_t",
   "referenced_type" : "_ZTI11int32x2x4_t",
   "self_type" : "_ZTI11int32x2x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_11__Int32x4_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x4x2_t",
   "name" : "int32x4x2_t",
   "referenced_type" : "_ZTI11int32x4x2_t",
   "self_type" : "_ZTI11int32x4x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_11__Int32x4_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x4x3_t",
   "name" : "int32x4x3_t",
   "referenced_type" : "_ZTI11int32x4x3_t",
   "self_type" : "_ZTI11int32x4x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_11__Int32x4_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x4x4_t",
   "name" : "int32x4x4_t",
   "referenced_type" : "_ZTI11int32x4x4_t",
   "self_type" : "_ZTI11int32x4x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_11__Int64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x1x2_t",
   "name" : "int64x1x2_t",
   "referenced_type" : "_ZTI11int64x1x2_t",
   "self_type" : "_ZTI11int64x1x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_11__Int64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x1x3_t",
   "name" : "int64x1x3_t",
   "referenced_type" : "_ZTI11int64x1x3_t",
   "self_type" : "_ZTI11int64x1x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_11__Int64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x1x4_t",
   "name" : "int64x1x4_t",
   "referenced_type" : "_ZTI11int64x1x4_t",
   "self_type" : "_ZTI11int64x1x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_11__Int64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x2x2_t",
   "name" : "int64x2x2_t",
   "referenced_type" : "_ZTI11int64x2x2_t",
   "self_type" : "_ZTI11int64x2x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_11__Int64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x2x3_t",
   "name" : "int64x2x3_t",
   "referenced_type" : "_ZTI11int64x2x3_t",
   "self_type" : "_ZTI11int64x2x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_11__Int64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x2x4_t",
   "name" : "int64x2x4_t",
   "referenced_type" : "_ZTI11int64x2x4_t",
   "self_type" : "_ZTI11int64x2x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_11__Int8x16_t"
    }
   ],
   "linker_set_key" : "_ZTI11int8x16x2_t",
   "name" : "int8x16x2_t",
   "referenced_type" : "_ZTI11int8x16x2_t",
   "self_type" : "_ZTI11int8x16x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_11__Int8x16_t"
    }
   ],
   "linker_set_key" : "_ZTI11int8x16x3_t",
   "name" : "int8x16x3_t",
   "referenced_type" : "_ZTI11int8x16x3_t",
   "self_type" : "_ZTI11int8x16x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_11__Int8x16_t"
    }
   ],
   "linker_set_key" : "_ZTI11int8x16x4_t",
   "name" : "int8x16x4_t",
   "referenced_type" : "_ZTI11int8x16x4_t",
   "self_type" : "_ZTI11int8x16x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_11__Poly8x8_t"
    }
   ],
   "linker_set_key" : "_ZTI11poly8x8x2_t",
   "name" : "poly8x8x2_t",
   "referenced_type" : "_ZTI11poly8x8x2_t",
   "self_type" : "_ZTI11poly8x8x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_11__Poly8x8_t"
    }
   ],
   "linker_set_key" : "_ZTI11poly8x8x3_t",
   "name" : "poly8x8x3_t",
   "referenced_type" : "_ZTI11poly8x8x3_t",
   "self_type" : "_ZTI11poly8x8x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_11__Poly8x8_t"
    }
   ],
   "linker_set_key" : "_ZTI11poly8x8x4_t",
   "name" : "poly8x8x4_t",
   "referenced_type" : "_ZTI11poly8x8x4_t",
   "self_type" : "_ZTI11poly8x8x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "referenced_type" : "_ZTI11sched_param",
   "self_type" : "_ZTI11sched_param",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "vl",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA3_t"
    }
   ],
   "linker_set_key" : "_ZTI11sve_context",
   "name" : "sve_context",
   "referenced_type" : "_ZTI11sve_context",
   "self_type" : "_ZTI11sve_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_11__Uint8x8_t"
    }
   ],
   "linker_set_key" : "_ZTI11uint8x8x2_t",
   "name" : "uint8x8x2_t",
   "referenced_type" : "_ZTI11uint8x8x2_t",
   "self_type" : "_ZTI11uint8x8x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_11__Uint8x8_t"
    }
   ],
   "linker_set_key" : "_ZTI11uint8x8x3_t",
   "name" : "uint8x8x3_t",
   "referenced_type" : "_ZTI11uint8x8x3_t",
   "self_type" : "_ZTI11uint8x8x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_11__Uint8x8_t"
    }
   ],
   "linker_set_key" : "_ZTI11uint8x8x4_t",
   "name" : "uint8x8x4_t",
   "referenced_type" : "_ZTI11uint8x8x4_t",
   "self_type" : "_ZTI11uint8x8x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI10TfLiteType"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14TfLitePtrUnion"
    },
    {
     "field_name" : "dims",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "params",
     "field_offset" : 192,
     "referenced_type" : "_ZTI24TfLiteQuantizationParams"
    },
    {
     "field_name" : "allocation_type",
     "field_offset" : 256,
     "referenced_type" : "_ZTI20TfLiteAllocationType"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "allocation",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "name",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "delegate",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP14TfLiteDelegate"
    },
    {
     "field_name" : "buffer_handle",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data_is_stale",
     "field_offset" : 608,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "is_variable",
     "field_offset" : 616,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "quantization",
     "field_offset" : 640,
     "referenced_type" : "_ZTI18TfLiteQuantization"
    },
    {
     "field_name" : "sparsity",
     "field_offset" : 768,
     "referenced_type" : "_ZTIP14TfLiteSparsity"
    },
    {
     "field_name" : "dims_signature",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPK14TfLiteIntArray"
    }
   ],
   "linker_set_key" : "_ZTI12TfLiteTensor",
   "name" : "TfLiteTensor",
   "referenced_type" : "_ZTI12TfLiteTensor",
   "self_type" : "_ZTI12TfLiteTensor",
   "size" : 112,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12_aarch64_ctx",
   "name" : "_aarch64_ctx",
   "referenced_type" : "_ZTI12_aarch64_ctx",
   "self_type" : "_ZTI12_aarch64_ctx",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Poly16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x4x2_t",
   "name" : "poly16x4x2_t",
   "referenced_type" : "_ZTI12poly16x4x2_t",
   "self_type" : "_ZTI12poly16x4x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Poly16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x4x3_t",
   "name" : "poly16x4x3_t",
   "referenced_type" : "_ZTI12poly16x4x3_t",
   "self_type" : "_ZTI12poly16x4x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Poly16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x4x4_t",
   "name" : "poly16x4x4_t",
   "referenced_type" : "_ZTI12poly16x4x4_t",
   "self_type" : "_ZTI12poly16x4x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Poly16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x8x2_t",
   "name" : "poly16x8x2_t",
   "referenced_type" : "_ZTI12poly16x8x2_t",
   "self_type" : "_ZTI12poly16x8x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Poly16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x8x3_t",
   "name" : "poly16x8x3_t",
   "referenced_type" : "_ZTI12poly16x8x3_t",
   "self_type" : "_ZTI12poly16x8x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Poly16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x8x4_t",
   "name" : "poly16x8x4_t",
   "referenced_type" : "_ZTI12poly16x8x4_t",
   "self_type" : "_ZTI12poly16x8x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Poly64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x1x2_t",
   "name" : "poly64x1x2_t",
   "referenced_type" : "_ZTI12poly64x1x2_t",
   "self_type" : "_ZTI12poly64x1x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Poly64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x1x3_t",
   "name" : "poly64x1x3_t",
   "referenced_type" : "_ZTI12poly64x1x3_t",
   "self_type" : "_ZTI12poly64x1x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Poly64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x1x4_t",
   "name" : "poly64x1x4_t",
   "referenced_type" : "_ZTI12poly64x1x4_t",
   "self_type" : "_ZTI12poly64x1x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Poly64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x2x2_t",
   "name" : "poly64x2x2_t",
   "referenced_type" : "_ZTI12poly64x2x2_t",
   "self_type" : "_ZTI12poly64x2x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Poly64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x2x3_t",
   "name" : "poly64x2x3_t",
   "referenced_type" : "_ZTI12poly64x2x3_t",
   "self_type" : "_ZTI12poly64x2x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Poly64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x2x4_t",
   "name" : "poly64x2x4_t",
   "referenced_type" : "_ZTI12poly64x2x4_t",
   "self_type" : "_ZTI12poly64x2x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Poly8x16_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly8x16x2_t",
   "name" : "poly8x16x2_t",
   "referenced_type" : "_ZTI12poly8x16x2_t",
   "self_type" : "_ZTI12poly8x16x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Poly8x16_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly8x16x3_t",
   "name" : "poly8x16x3_t",
   "referenced_type" : "_ZTI12poly8x16x3_t",
   "self_type" : "_ZTI12poly8x16x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Poly8x16_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly8x16x4_t",
   "name" : "poly8x16x4_t",
   "referenced_type" : "_ZTI12poly8x16x4_t",
   "self_type" : "_ZTI12poly8x16x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Uint16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x4x2_t",
   "name" : "uint16x4x2_t",
   "referenced_type" : "_ZTI12uint16x4x2_t",
   "self_type" : "_ZTI12uint16x4x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Uint16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x4x3_t",
   "name" : "uint16x4x3_t",
   "referenced_type" : "_ZTI12uint16x4x3_t",
   "self_type" : "_ZTI12uint16x4x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Uint16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x4x4_t",
   "name" : "uint16x4x4_t",
   "referenced_type" : "_ZTI12uint16x4x4_t",
   "self_type" : "_ZTI12uint16x4x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Uint16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x8x2_t",
   "name" : "uint16x8x2_t",
   "referenced_type" : "_ZTI12uint16x8x2_t",
   "self_type" : "_ZTI12uint16x8x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Uint16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x8x3_t",
   "name" : "uint16x8x3_t",
   "referenced_type" : "_ZTI12uint16x8x3_t",
   "self_type" : "_ZTI12uint16x8x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Uint16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x8x4_t",
   "name" : "uint16x8x4_t",
   "referenced_type" : "_ZTI12uint16x8x4_t",
   "self_type" : "_ZTI12uint16x8x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Uint32x2_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x2x2_t",
   "name" : "uint32x2x2_t",
   "referenced_type" : "_ZTI12uint32x2x2_t",
   "self_type" : "_ZTI12uint32x2x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Uint32x2_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x2x3_t",
   "name" : "uint32x2x3_t",
   "referenced_type" : "_ZTI12uint32x2x3_t",
   "self_type" : "_ZTI12uint32x2x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Uint32x2_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x2x4_t",
   "name" : "uint32x2x4_t",
   "referenced_type" : "_ZTI12uint32x2x4_t",
   "self_type" : "_ZTI12uint32x2x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Uint32x4_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x4x2_t",
   "name" : "uint32x4x2_t",
   "referenced_type" : "_ZTI12uint32x4x2_t",
   "self_type" : "_ZTI12uint32x4x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Uint32x4_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x4x3_t",
   "name" : "uint32x4x3_t",
   "referenced_type" : "_ZTI12uint32x4x3_t",
   "self_type" : "_ZTI12uint32x4x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Uint32x4_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x4x4_t",
   "name" : "uint32x4x4_t",
   "referenced_type" : "_ZTI12uint32x4x4_t",
   "self_type" : "_ZTI12uint32x4x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Uint64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x1x2_t",
   "name" : "uint64x1x2_t",
   "referenced_type" : "_ZTI12uint64x1x2_t",
   "self_type" : "_ZTI12uint64x1x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Uint64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x1x3_t",
   "name" : "uint64x1x3_t",
   "referenced_type" : "_ZTI12uint64x1x3_t",
   "self_type" : "_ZTI12uint64x1x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Uint64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x1x4_t",
   "name" : "uint64x1x4_t",
   "referenced_type" : "_ZTI12uint64x1x4_t",
   "self_type" : "_ZTI12uint64x1x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Uint64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x2x2_t",
   "name" : "uint64x2x2_t",
   "referenced_type" : "_ZTI12uint64x2x2_t",
   "self_type" : "_ZTI12uint64x2x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Uint64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x2x3_t",
   "name" : "uint64x2x3_t",
   "referenced_type" : "_ZTI12uint64x2x3_t",
   "self_type" : "_ZTI12uint64x2x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Uint64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x2x4_t",
   "name" : "uint64x2x4_t",
   "referenced_type" : "_ZTI12uint64x2x4_t",
   "self_type" : "_ZTI12uint64x2x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_12__Uint8x16_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint8x16x2_t",
   "name" : "uint8x16x2_t",
   "referenced_type" : "_ZTI12uint8x16x2_t",
   "self_type" : "_ZTI12uint8x16x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_12__Uint8x16_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint8x16x3_t",
   "name" : "uint8x16x3_t",
   "referenced_type" : "_ZTI12uint8x16x3_t",
   "self_type" : "_ZTI12uint8x16x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_12__Uint8x16_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint8x16x4_t",
   "name" : "uint8x16x4_t",
   "referenced_type" : "_ZTI12uint8x16x4_t",
   "self_type" : "_ZTI12uint8x16x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tensors_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "GetExecutionPlan",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextPP14TfLiteIntArrayE"
    },
    {
     "field_name" : "tensors",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP12TfLiteTensor"
    },
    {
     "field_name" : "impl_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ResizeTensor",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP12TfLiteTensorP14TfLiteIntArrayE"
    },
    {
     "field_name" : "ReportError",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFvP13TfLiteContextPKczE"
    },
    {
     "field_name" : "AddTensors",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextiPiE"
    },
    {
     "field_name" : "GetNodeAndRegistration",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextiPP10TfLiteNodePP18TfLiteRegistrationE"
    },
    {
     "field_name" : "ReplaceNodeSubsetsWithDelegateKernels",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContext18TfLiteRegistrationPK14TfLiteIntArrayP14TfLiteDelegateE"
    },
    {
     "field_name" : "recommended_num_threads",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "GetExternalContext",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFP21TfLiteExternalContextP13TfLiteContext25TfLiteExternalContextTypeE"
    },
    {
     "field_name" : "SetExternalContext",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFvP13TfLiteContext25TfLiteExternalContextTypeP21TfLiteExternalContextE"
    },
    {
     "field_name" : "allow_fp32_relax_to_fp16",
     "field_offset" : 768,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "profiler",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "AllocatePersistentBuffer",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFPvP13TfLiteContextmE"
    },
    {
     "field_name" : "AllocateBufferForEval",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextmPPvE"
    },
    {
     "field_name" : "RequestScratchBufferInArena",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextmPiE"
    },
    {
     "field_name" : "GetScratchBuffer",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFPvP13TfLiteContextiE"
    },
    {
     "field_name" : "ResizeTensorExplicit",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP12TfLiteTensoriPKiE"
    },
    {
     "field_name" : "PreviewDelegatePartitioning",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextPK14TfLiteIntArrayPP20TfLiteDelegateParamsPiE"
    },
    {
     "field_name" : "GetTensor",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFP12TfLiteTensorPK13TfLiteContextiE"
    },
    {
     "field_name" : "GetEvalTensor",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFP16TfLiteEvalTensorPK13TfLiteContextiE"
    }
   ],
   "linker_set_key" : "_ZTI13TfLiteContext",
   "name" : "TfLiteContext",
   "referenced_type" : "_ZTI13TfLiteContext",
   "self_type" : "_ZTI13TfLiteContext",
   "size" : 176,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI13TfLiteFloat16",
   "name" : "TfLiteFloat16",
   "referenced_type" : "_ZTI13TfLiteFloat16",
   "self_type" : "_ZTI13TfLiteFloat16",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "datap",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI13extra_context",
   "name" : "extra_context",
   "referenced_type" : "_ZTI13extra_context",
   "self_type" : "_ZTI13extra_context",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_13__Float16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x4x2_t",
   "name" : "float16x4x2_t",
   "referenced_type" : "_ZTI13float16x4x2_t",
   "self_type" : "_ZTI13float16x4x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_13__Float16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x4x3_t",
   "name" : "float16x4x3_t",
   "referenced_type" : "_ZTI13float16x4x3_t",
   "self_type" : "_ZTI13float16x4x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_13__Float16x4_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x4x4_t",
   "name" : "float16x4x4_t",
   "referenced_type" : "_ZTI13float16x4x4_t",
   "self_type" : "_ZTI13float16x4x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_13__Float16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x8x2_t",
   "name" : "float16x8x2_t",
   "referenced_type" : "_ZTI13float16x8x2_t",
   "self_type" : "_ZTI13float16x8x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_13__Float16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x8x3_t",
   "name" : "float16x8x3_t",
   "referenced_type" : "_ZTI13float16x8x3_t",
   "self_type" : "_ZTI13float16x8x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_13__Float16x8_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x8x4_t",
   "name" : "float16x8x4_t",
   "referenced_type" : "_ZTI13float16x8x4_t",
   "self_type" : "_ZTI13float16x8x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_13__Float32x2_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x2x2_t",
   "name" : "float32x2x2_t",
   "referenced_type" : "_ZTI13float32x2x2_t",
   "self_type" : "_ZTI13float32x2x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_13__Float32x2_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x2x3_t",
   "name" : "float32x2x3_t",
   "referenced_type" : "_ZTI13float32x2x3_t",
   "self_type" : "_ZTI13float32x2x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_13__Float32x2_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x2x4_t",
   "name" : "float32x2x4_t",
   "referenced_type" : "_ZTI13float32x2x4_t",
   "self_type" : "_ZTI13float32x2x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_13__Float32x4_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x4x2_t",
   "name" : "float32x4x2_t",
   "referenced_type" : "_ZTI13float32x4x2_t",
   "self_type" : "_ZTI13float32x4x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_13__Float32x4_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x4x3_t",
   "name" : "float32x4x3_t",
   "referenced_type" : "_ZTI13float32x4x3_t",
   "self_type" : "_ZTI13float32x4x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_13__Float32x4_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x4x4_t",
   "name" : "float32x4x4_t",
   "referenced_type" : "_ZTI13float32x4x4_t",
   "self_type" : "_ZTI13float32x4x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_13__Float64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI13float64x1x2_t",
   "name" : "float64x1x2_t",
   "referenced_type" : "_ZTI13float64x1x2_t",
   "self_type" : "_ZTI13float64x1x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_13__Float64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI13float64x1x3_t",
   "name" : "float64x1x3_t",
   "referenced_type" : "_ZTI13float64x1x3_t",
   "self_type" : "_ZTI13float64x1x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_13__Float64x1_t"
    }
   ],
   "linker_set_key" : "_ZTI13float64x1x4_t",
   "name" : "float64x1x4_t",
   "referenced_type" : "_ZTI13float64x1x4_t",
   "self_type" : "_ZTI13float64x1x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_13__Float64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI13float64x2x2_t",
   "name" : "float64x2x2_t",
   "referenced_type" : "_ZTI13float64x2x2_t",
   "self_type" : "_ZTI13float64x2x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_13__Float64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI13float64x2x3_t",
   "name" : "float64x2x3_t",
   "referenced_type" : "_ZTI13float64x2x3_t",
   "self_type" : "_ZTI13float64x2x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_13__Float64x2_t"
    }
   ],
   "linker_set_key" : "_ZTI13float64x2x4_t",
   "name" : "float64x2x4_t",
   "referenced_type" : "_ZTI13float64x2x4_t",
   "self_type" : "_ZTI13float64x2x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data_",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "Prepare",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP14TfLiteDelegateE"
    },
    {
     "field_name" : "CopyFromBufferHandle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP14TfLiteDelegateiP12TfLiteTensorE"
    },
    {
     "field_name" : "CopyToBufferHandle",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP14TfLiteDelegateiP12TfLiteTensorE"
    },
    {
     "field_name" : "FreeBufferHandle",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFvP13TfLiteContextP14TfLiteDelegatePiE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI14TfLiteDelegate",
   "name" : "TfLiteDelegate",
   "referenced_type" : "_ZTI14TfLiteDelegate",
   "self_type" : "_ZTI14TfLiteDelegate",
   "size" : 48,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA_i"
    }
   ],
   "linker_set_key" : "_ZTI14TfLiteIntArray",
   "name" : "TfLiteIntArray",
   "referenced_type" : "_ZTI14TfLiteIntArray",
   "self_type" : "_ZTI14TfLiteIntArray",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "i32",
     "referenced_type" : "_ZTIPi"
    },
    {
     "field_name" : "u32",
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "i64",
     "referenced_type" : "_ZTIPl"
    },
    {
     "field_name" : "u64",
     "referenced_type" : "_ZTIPm"
    },
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIPf"
    },
    {
     "field_name" : "f16",
     "referenced_type" : "_ZTIP13TfLiteFloat16"
    },
    {
     "field_name" : "f64",
     "referenced_type" : "_ZTIPd"
    },
    {
     "field_name" : "raw",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "raw_const",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "uint8",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "b",
     "referenced_type" : "_ZTIPb"
    },
    {
     "field_name" : "i16",
     "referenced_type" : "_ZTIPs"
    },
    {
     "field_name" : "c64",
     "referenced_type" : "_ZTIP15TfLiteComplex64"
    },
    {
     "field_name" : "c128",
     "referenced_type" : "_ZTIP16TfLiteComplex128"
    },
    {
     "field_name" : "int8",
     "referenced_type" : "_ZTIPa"
    },
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI14TfLitePtrUnion",
   "name" : "TfLitePtrUnion",
   "record_kind" : "union",
   "referenced_type" : "_ZTI14TfLitePtrUnion",
   "self_type" : "_ZTI14TfLitePtrUnion",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "traversal_order",
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "block_map",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "dim_metadata",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP23TfLiteDimensionMetadata"
    },
    {
     "field_name" : "dim_metadata_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14TfLiteSparsity",
   "name" : "TfLiteSparsity",
   "referenced_type" : "_ZTI14TfLiteSparsity",
   "self_type" : "_ZTI14TfLiteSparsity",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vregs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA32_o"
    }
   ],
   "linker_set_key" : "_ZTI14fpsimd_context",
   "name" : "fpsimd_context",
   "referenced_type" : "_ZTI14fpsimd_context",
   "self_type" : "_ZTI14fpsimd_context",
   "size" : 528,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA12_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 48,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "re",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "im",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI15TfLiteComplex64",
   "name" : "TfLiteComplex64",
   "referenced_type" : "_ZTI15TfLiteComplex64",
   "self_type" : "_ZTI15TfLiteComplex64",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "re",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "im",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTI16TfLiteComplex128",
   "name" : "TfLiteComplex128",
   "referenced_type" : "_ZTI16TfLiteComplex128",
   "self_type" : "_ZTI16TfLiteComplex128",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTI14TfLitePtrUnion"
    },
    {
     "field_name" : "dims",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "type",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10TfLiteType"
    }
   ],
   "linker_set_key" : "_ZTI16TfLiteEvalTensor",
   "name" : "TfLiteEvalTensor",
   "referenced_type" : "_ZTI16TfLiteEvalTensor",
   "self_type" : "_ZTI16TfLiteEvalTensor",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI16TfLiteFloatArray",
   "name" : "TfLiteFloatArray",
   "referenced_type" : "_ZTI16TfLiteFloatArray",
   "self_type" : "_ZTI16TfLiteFloatArray",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA14_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTIA31_m"
    },
    {
     "field_name" : "sp",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI16user_regs_struct",
   "name" : "user_regs_struct",
   "referenced_type" : "_ZTI16user_regs_struct",
   "self_type" : "_ZTI16user_regs_struct",
   "size" : 272,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA4_l"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI22TfLiteQuantizationType"
    },
    {
     "field_name" : "params",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteQuantization",
   "name" : "TfLiteQuantization",
   "referenced_type" : "_ZTI18TfLiteQuantization",
   "self_type" : "_ZTI18TfLiteQuantization",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "_ZTIPFPvP13TfLiteContextPKcmE"
    },
    {
     "field_name" : "free",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvP13TfLiteContextPvE"
    },
    {
     "field_name" : "prepare",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP10TfLiteNodeE"
    },
    {
     "field_name" : "invoke",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP10TfLiteNodeE"
    },
    {
     "field_name" : "profiling_string",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFPKcPK13TfLiteContextPK10TfLiteNodeE"
    },
    {
     "field_name" : "builtin_code",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "custom_name",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "version",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteRegistration",
   "name" : "TfLiteRegistration",
   "referenced_type" : "_ZTI18TfLiteRegistration",
   "self_type" : "_ZTI18TfLiteRegistration",
   "size" : 64,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "vregs",
     "referenced_type" : "_ZTIA32_o"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18user_fpsimd_struct",
   "name" : "user_fpsimd_struct",
   "referenced_type" : "_ZTI18user_fpsimd_struct",
   "self_type" : "_ZTI18user_fpsimd_struct",
   "size" : 528,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "_ZTI19__pthread_cleanup_t",
   "self_type" : "_ZTI19__pthread_cleanup_t",
   "size" : 24,
   "source_file" : "bionic/libc/include/pthread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "delegate",
     "referenced_type" : "_ZTIP14TfLiteDelegate"
    },
    {
     "field_name" : "nodes_to_replace",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "input_tensors",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "output_tensors",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    }
   ],
   "linker_set_key" : "_ZTI20TfLiteDelegateParams",
   "name" : "TfLiteDelegateParams",
   "referenced_type" : "_ZTI20TfLiteDelegateParams",
   "self_type" : "_ZTI20TfLiteDelegateParams",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI25TfLiteExternalContextType"
    },
    {
     "field_name" : "Refresh",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextE"
    }
   ],
   "linker_set_key" : "_ZTI21TfLiteExternalContext",
   "name" : "TfLiteExternalContext",
   "referenced_type" : "_ZTI21TfLiteExternalContext",
   "self_type" : "_ZTI21TfLiteExternalContext",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI22TfLiteCustomAllocation",
   "name" : "TfLiteCustomAllocation",
   "referenced_type" : "_ZTI22TfLiteCustomAllocation",
   "self_type" : "_ZTI22TfLiteCustomAllocation",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19TfLiteDimensionType"
    },
    {
     "field_name" : "dense_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "array_segments",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "array_indices",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    }
   ],
   "linker_set_key" : "_ZTI23TfLiteDimensionMetadata",
   "name" : "TfLiteDimensionMetadata",
   "referenced_type" : "_ZTI23TfLiteDimensionMetadata",
   "self_type" : "_ZTI23TfLiteDimensionMetadata",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "scale",
     "referenced_type" : "_ZTIP16TfLiteFloatArray"
    },
    {
     "field_name" : "zero_point",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "quantized_dimension",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI24TfLiteAffineQuantization",
   "name" : "TfLiteAffineQuantization",
   "referenced_type" : "_ZTI24TfLiteAffineQuantization",
   "self_type" : "_ZTI24TfLiteAffineQuantization",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "scale",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "zero_point",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI24TfLiteQuantizationParams",
   "name" : "TfLiteQuantizationParams",
   "referenced_type" : "_ZTI24TfLiteQuantizationParams",
   "self_type" : "_ZTI24TfLiteQuantizationParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/c_api_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 56,
   "source_file" : "bionic/libc/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 80,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI8sigset_t",
   "name" : "sigset_t",
   "referenced_type" : "_ZTI8sigset_t",
   "self_type" : "_ZTI8sigset_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_offset" : 320,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI10sigcontext"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 4560,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "_ZTI9cpu_set_t",
   "self_type" : "_ZTI9cpu_set_t",
   "size" : 128,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt0_E",
   "self_type" : "_ZTIN10__sifieldsUt0_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt1_E",
   "self_type" : "_ZTIN10__sifieldsUt1_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt2_E",
   "self_type" : "_ZTIN10__sifieldsUt2_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_E",
   "self_type" : "_ZTIN10__sifieldsUt3_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt4_E",
   "self_type" : "_ZTIN10__sifieldsUt4_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt5_E",
   "self_type" : "_ZTIN10__sifieldsUt5_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:79:22)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "impl_",
     "referenced_type" : "_ZTIKPN3ruy7CtxImplE"
    }
   ],
   "linker_set_key" : "_ZTIN3ruy7ContextE",
   "name" : "ruy::Context",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ruy7ContextE",
   "self_type" : "_ZTIN3ruy7ContextE",
   "size" : 8,
   "source_file" : "external/ruy/ruy/context.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "init_status_",
     "referenced_type" : "_ZTIN6tflite17CpuBackendContext7CpuInfo10InitStatusE"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite17CpuBackendContext7CpuInfoE",
   "name" : "tflite::CpuBackendContext::CpuInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6tflite17CpuBackendContext7CpuInfoE",
   "self_type" : "_ZTIN6tflite17CpuBackendContext7CpuInfoE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/cpu_backend_context.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6tflite28TfLiteInternalBackendContextE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ruy_context_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN3ruy7ContextENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "gemmlowp_context_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN8gemmlowp11GemmContextENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "cpuinfo_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN6tflite17CpuBackendContext7CpuInfoE"
    },
    {
     "access" : "private",
     "field_name" : "max_num_threads_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "use_caching_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite17CpuBackendContextE",
   "name" : "tflite::CpuBackendContext",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6tflite17CpuBackendContextE",
   "self_type" : "_ZTIN6tflite17CpuBackendContextE",
   "size" : 40,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/cpu_backend_context.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6tflite17CpuBackendContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6tflite17CpuBackendContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6tflite17CpuBackendContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6tflite17CpuBackendContext16SetMaxNumThreadsEi"
    },
    {
     "mangled_component_name" : "_ZN6tflite17CpuBackendContext11ClearCachesEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI21TfLiteExternalContext"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "internal_backend_context_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN6tflite28TfLiteInternalBackendContextENS_14default_deleteIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite25ExternalCpuBackendContextE",
   "name" : "tflite::ExternalCpuBackendContext",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6tflite25ExternalCpuBackendContextE",
   "self_type" : "_ZTIN6tflite25ExternalCpuBackendContextE",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/external_cpu_backend_context.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN6tflite28TfLiteInternalBackendContextE",
   "name" : "tflite::TfLiteInternalBackendContext",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6tflite28TfLiteInternalBackendContextE",
   "self_type" : "_ZTIN6tflite28TfLiteInternalBackendContextE",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/external_cpu_backend_context.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6tflite28TfLiteInternalBackendContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6tflite28TfLiteInternalBackendContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6tflite28TfLiteInternalBackendContextD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6tflite28TfLiteInternalBackendContext16SetMaxNumThreadsEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6tflite28TfLiteInternalBackendContext11ClearCachesEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN8gemmlowp10KernelBaseE",
   "name" : "gemmlowp::KernelBase",
   "referenced_type" : "_ZTIN8gemmlowp10KernelBaseE",
   "self_type" : "_ZTIN8gemmlowp10KernelBaseE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/kernel.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8gemmlowp10KernelBaseE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8gemmlowp10KernelBase4NameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8gemmlowp10KernelBase3RunEPimmPKhS3_mm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp10KernelBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp10KernelBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_m",
     "referenced_type" : "_ZTIPN8gemmlowp5MutexE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp10ScopedLockE",
   "name" : "gemmlowp::ScopedLock",
   "referenced_type" : "_ZTIN8gemmlowp10ScopedLockE",
   "self_type" : "_ZTIN8gemmlowp10ScopedLockE",
   "size" : 8,
   "source_file" : "external/gemmlowp/profiling/instrumentation.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l1_rows",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l1_cols",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l1_depth",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l2_rows",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l2_cols",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l2_depth",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp11BlockParamsE",
   "name" : "gemmlowp::BlockParams",
   "referenced_type" : "_ZTIN8gemmlowp11BlockParamsE",
   "self_type" : "_ZTIN8gemmlowp11BlockParamsE",
   "size" : 24,
   "source_file" : "external/gemmlowp/internal/block_params.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8gemmlowp22MultiThreadGemmContextE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp11GemmContextE",
   "name" : "gemmlowp::GemmContext",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp11GemmContextE",
   "self_type" : "_ZTIN8gemmlowp11GemmContextE",
   "size" : 224,
   "source_file" : "external/gemmlowp/public/gemmlowp.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "workers_",
     "referenced_type" : "_ZTINSt3__16vectorIPN8gemmlowp6WorkerENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "counter_to_decrement_when_ready_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN8gemmlowp15BlockingCounterE"
    },
    {
     "access" : "private",
     "field_name" : "main_thread_task_allocator_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN8gemmlowp9AllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp11WorkersPoolE",
   "name" : "gemmlowp::WorkersPool",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp11WorkersPoolE",
   "self_type" : "_ZTIN8gemmlowp11WorkersPoolE",
   "size" : 120,
   "source_file" : "external/gemmlowp/internal/multi_thread_gemm.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "allocator_",
     "referenced_type" : "_ZTIPN8gemmlowp9AllocatorE"
    },
    {
     "access" : "private",
     "field_name" : "matrix_handle_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN8gemmlowp9Allocator6HandleE"
    },
    {
     "access" : "private",
     "field_name" : "block_params_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIRKN8gemmlowp11BlockParamsE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp12PackedResultE",
   "name" : "gemmlowp::PackedResult",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp12PackedResultE",
   "self_type" : "_ZTIN8gemmlowp12PackedResultE",
   "size" : 40,
   "source_file" : "external/gemmlowp/internal/unpack.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIaLi16EEE",
   "name" : "gemmlowp::RegisterType<signed char, 16>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIaLi16EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIaLi16EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIaLi32EEE",
   "name" : "gemmlowp::RegisterType<signed char, 32>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIaLi32EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIaLi32EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIaLi4EEE",
   "name" : "gemmlowp::RegisterType<signed char, 4>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIaLi4EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIaLi4EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIaLi64EEE",
   "name" : "gemmlowp::RegisterType<signed char, 64>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIaLi64EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIaLi64EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIaLi8EEE",
   "name" : "gemmlowp::RegisterType<signed char, 8>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIaLi8EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIaLi8EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIhLi16EEE",
   "name" : "gemmlowp::RegisterType<unsigned char, 16>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIhLi16EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIhLi16EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIhLi32EEE",
   "name" : "gemmlowp::RegisterType<unsigned char, 32>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIhLi32EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIhLi32EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIhLi4EEE",
   "name" : "gemmlowp::RegisterType<unsigned char, 4>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIhLi4EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIhLi4EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIhLi64EEE",
   "name" : "gemmlowp::RegisterType<unsigned char, 64>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIhLi64EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIhLi64EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIhLi8EEE",
   "name" : "gemmlowp::RegisterType<unsigned char, 8>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIhLi8EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIhLi8EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIiLi16EEE",
   "name" : "gemmlowp::RegisterType<int, 16>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi16EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi16EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIiLi1EEE",
   "name" : "gemmlowp::RegisterType<int, 1>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi1EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi1EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIiLi32EEE",
   "name" : "gemmlowp::RegisterType<int, 32>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi32EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi32EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIiLi4EEE",
   "name" : "gemmlowp::RegisterType<int, 4>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi4EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi4EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIiLi64EEE",
   "name" : "gemmlowp::RegisterType<int, 64>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi64EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi64EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIiLi8EEE",
   "name" : "gemmlowp::RegisterType<int, 8>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi8EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIiLi8EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIsLi16EEE",
   "name" : "gemmlowp::RegisterType<short, 16>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIsLi16EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIsLi16EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIsLi32EEE",
   "name" : "gemmlowp::RegisterType<short, 32>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIsLi32EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIsLi32EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIsLi4EEE",
   "name" : "gemmlowp::RegisterType<short, 4>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIsLi4EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIsLi4EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIsLi64EEE",
   "name" : "gemmlowp::RegisterType<short, 64>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIsLi64EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIsLi64EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp12RegisterTypeIsLi8EEE",
   "name" : "gemmlowp::RegisterType<short, 8>",
   "referenced_type" : "_ZTIN8gemmlowp12RegisterTypeIsLi8EEE",
   "self_type" : "_ZTIN8gemmlowp12RegisterTypeIsLi8EEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp13GetTypeIdImplIaEE",
   "name" : "gemmlowp::GetTypeIdImpl<std::int8_t>",
   "referenced_type" : "_ZTIN8gemmlowp13GetTypeIdImplIaEE",
   "self_type" : "_ZTIN8gemmlowp13GetTypeIdImplIaEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/allocator.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp13GetTypeIdImplIhEE",
   "name" : "gemmlowp::GetTypeIdImpl<std::uint8_t>",
   "referenced_type" : "_ZTIN8gemmlowp13GetTypeIdImplIhEE",
   "self_type" : "_ZTIN8gemmlowp13GetTypeIdImplIhEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/allocator.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp13GetTypeIdImplIiEE",
   "name" : "gemmlowp::GetTypeIdImpl<std::int32_t>",
   "referenced_type" : "_ZTIN8gemmlowp13GetTypeIdImplIiEE",
   "self_type" : "_ZTIN8gemmlowp13GetTypeIdImplIiEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/allocator.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp13GetTypeIdImplIjEE",
   "name" : "gemmlowp::GetTypeIdImpl<std::uint32_t>",
   "referenced_type" : "_ZTIN8gemmlowp13GetTypeIdImplIjEE",
   "self_type" : "_ZTIN8gemmlowp13GetTypeIdImplIjEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/allocator.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp13GetTypeIdImplIsEE",
   "name" : "gemmlowp::GetTypeIdImpl<std::int16_t>",
   "referenced_type" : "_ZTIN8gemmlowp13GetTypeIdImplIsEE",
   "self_type" : "_ZTIN8gemmlowp13GetTypeIdImplIsEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/allocator.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp13GetTypeIdImplItEE",
   "name" : "gemmlowp::GetTypeIdImpl<std::uint16_t>",
   "referenced_type" : "_ZTIN8gemmlowp13GetTypeIdImplItEE",
   "self_type" : "_ZTIN8gemmlowp13GetTypeIdImplItEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/allocator.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp13GlobalMutexesE",
   "name" : "gemmlowp::GlobalMutexes",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp13GlobalMutexesE",
   "self_type" : "_ZTIN8gemmlowp13GlobalMutexesE",
   "size" : 1,
   "source_file" : "external/gemmlowp/profiling/instrumentation.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIaLi1ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<signed char, 1, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi1ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi1ELi4EEE",
   "size" : 4,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIaLi4ELi1EEE",
   "name" : "gemmlowp::RegisterBlock<signed char, 4, 1>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi4ELi1EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi4ELi1EEE",
   "size" : 4,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIaLi4ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<signed char, 4, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi4ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi4ELi4EEE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIaLi8ELi1EEE",
   "name" : "gemmlowp::RegisterBlock<signed char, 8, 1>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi8ELi1EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi8ELi1EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi32EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIaLi8ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<signed char, 8, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi8ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi8ELi4EEE",
   "size" : 32,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi64EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIaLi8ELi8EEE",
   "name" : "gemmlowp::RegisterBlock<signed char, 8, 8>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi8ELi8EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIaLi8ELi8EEE",
   "size" : 64,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIhLi1ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<unsigned char, 1, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi1ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi1ELi4EEE",
   "size" : 4,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIhLi4ELi1EEE",
   "name" : "gemmlowp::RegisterBlock<unsigned char, 4, 1>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi4ELi1EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi4ELi1EEE",
   "size" : 4,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIhLi4ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<unsigned char, 4, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi4ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi4ELi4EEE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIhLi8ELi1EEE",
   "name" : "gemmlowp::RegisterBlock<unsigned char, 8, 1>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi8ELi1EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi8ELi1EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi32EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIhLi8ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<unsigned char, 8, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi8ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi8ELi4EEE",
   "size" : 32,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi64EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIhLi8ELi8EEE",
   "name" : "gemmlowp::RegisterBlock<unsigned char, 8, 8>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi8ELi8EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIhLi8ELi8EEE",
   "size" : 64,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE",
   "name" : "gemmlowp::RegisterBlock<int, 1, 1>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE",
   "size" : 4,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<int, 1, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE",
   "name" : "gemmlowp::RegisterBlock<int, 1, 8>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE",
   "size" : 32,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
   "name" : "gemmlowp::RegisterBlock<int, 4, 1>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<int, 4, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
   "size" : 64,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
   "name" : "gemmlowp::RegisterBlock<int, 8, 1>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
   "size" : 32,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi32EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<int, 8, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
   "size" : 128,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi64EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi8EEE",
   "name" : "gemmlowp::RegisterBlock<int, 8, 8>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi8EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi8EEE",
   "size" : 256,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIsLi1ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<short, 1, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi1ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi1ELi4EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIsLi4ELi1EEE",
   "name" : "gemmlowp::RegisterBlock<short, 4, 1>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi4ELi1EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi4ELi1EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIsLi4ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<short, 4, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi4ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi4ELi4EEE",
   "size" : 32,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIsLi8ELi1EEE",
   "name" : "gemmlowp::RegisterBlock<short, 8, 1>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi8ELi1EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi8ELi1EEE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi32EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIsLi8ELi4EEE",
   "name" : "gemmlowp::RegisterBlock<short, 8, 4>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi8ELi4EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi8ELi4EEE",
   "size" : 64,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi64EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp13RegisterBlockIsLi8ELi8EEE",
   "name" : "gemmlowp::RegisterBlock<short, 8, 8>",
   "referenced_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi8ELi8EEE",
   "self_type" : "_ZTIN8gemmlowp13RegisterBlockIsLi8ELi8EEE",
   "size" : 128,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA2_10__Int8x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIaLi16EEE",
   "name" : "gemmlowp::RegisterBuffer<signed char, 16>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi16EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi16EEE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA4_10__Int8x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIaLi32EEE",
   "name" : "gemmlowp::RegisterBuffer<signed char, 32>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi32EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi32EEE",
   "size" : 32,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIaLi4EEE",
   "name" : "gemmlowp::RegisterBuffer<signed char, 4>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi4EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi4EEE",
   "size" : 4,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA8_10__Int8x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIaLi64EEE",
   "name" : "gemmlowp::RegisterBuffer<signed char, 64>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi64EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi64EEE",
   "size" : 64,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA1_10__Int8x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIaLi8EEE",
   "name" : "gemmlowp::RegisterBuffer<signed char, 8>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi8EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIaLi8EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA2_11__Uint8x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIhLi16EEE",
   "name" : "gemmlowp::RegisterBuffer<unsigned char, 16>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi16EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi16EEE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA4_11__Uint8x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIhLi32EEE",
   "name" : "gemmlowp::RegisterBuffer<unsigned char, 32>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi32EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi32EEE",
   "size" : 32,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA1_j"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIhLi4EEE",
   "name" : "gemmlowp::RegisterBuffer<unsigned char, 4>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi4EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi4EEE",
   "size" : 4,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA8_11__Uint8x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIhLi64EEE",
   "name" : "gemmlowp::RegisterBuffer<unsigned char, 64>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi64EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi64EEE",
   "size" : 64,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA1_11__Uint8x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIhLi8EEE",
   "name" : "gemmlowp::RegisterBuffer<unsigned char, 8>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi8EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIhLi8EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA4_11__Int32x4_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIiLi16EEE",
   "name" : "gemmlowp::RegisterBuffer<int, 16>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi16EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi16EEE",
   "size" : 64,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIiLi1EEE",
   "name" : "gemmlowp::RegisterBuffer<int, 1>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi1EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi1EEE",
   "size" : 4,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA8_11__Int32x4_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIiLi32EEE",
   "name" : "gemmlowp::RegisterBuffer<int, 32>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi32EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi32EEE",
   "size" : 128,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA1_11__Int32x4_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIiLi4EEE",
   "name" : "gemmlowp::RegisterBuffer<int, 4>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi4EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi4EEE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA16_11__Int32x4_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIiLi64EEE",
   "name" : "gemmlowp::RegisterBuffer<int, 64>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi64EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi64EEE",
   "size" : 256,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA2_11__Int32x4_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIiLi8EEE",
   "name" : "gemmlowp::RegisterBuffer<int, 8>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi8EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIiLi8EEE",
   "size" : 32,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA2_11__Int16x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIsLi16EEE",
   "name" : "gemmlowp::RegisterBuffer<short, 16>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi16EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi16EEE",
   "size" : 32,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA4_11__Int16x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIsLi32EEE",
   "name" : "gemmlowp::RegisterBuffer<short, 32>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi32EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi32EEE",
   "size" : 64,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA1_11__Int16x4_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIsLi4EEE",
   "name" : "gemmlowp::RegisterBuffer<short, 4>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi4EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi4EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA8_11__Int16x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIsLi64EEE",
   "name" : "gemmlowp::RegisterBuffer<short, 64>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi64EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi64EEE",
   "size" : 128,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "reg",
     "referenced_type" : "_ZTIA1_11__Int16x8_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp14RegisterBufferIsLi8EEE",
   "name" : "gemmlowp::RegisterBuffer<short, 8>",
   "referenced_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi8EEE",
   "self_type" : "_ZTIN8gemmlowp14RegisterBufferIsLi8EEE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/simd_wrappers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "count_",
     "referenced_type" : "_ZTINSt3__16atomicImEE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp15BlockingCounterE",
   "name" : "gemmlowp::BlockingCounter",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp15BlockingCounterE",
   "self_type" : "_ZTIN8gemmlowp15BlockingCounterE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/multi_thread_gemm.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "real_zero_as_int32",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "real_amplitude_as_int32",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp15OutputStageTanhE",
   "name" : "gemmlowp::OutputStageTanh",
   "referenced_type" : "_ZTIN8gemmlowp15OutputStageTanhE",
   "self_type" : "_ZTIN8gemmlowp15OutputStageTanhE",
   "size" : 8,
   "source_file" : "external/gemmlowp/public/output_stages.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l1_width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l1_depth",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l2_width",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l2_depth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp15SideBlockParamsE",
   "name" : "gemmlowp::SideBlockParams",
   "referenced_type" : "_ZTIN8gemmlowp15SideBlockParamsE",
   "self_type" : "_ZTIN8gemmlowp15SideBlockParamsE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/block_params.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 1, 4>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 1, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 1, 8>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 1, 8>, gemmlowp::RegisterBlock<int, 1, 8>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 4, 1>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 4, 1>, gemmlowp::RegisterBlock<int, 4, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 4, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 4, 4>, gemmlowp::RegisterBlock<int, 4, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 8, 1>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 8, 1>, gemmlowp::RegisterBlock<int, 8, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 8, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "name" : "gemmlowp::BroadcastAddImpl<gemmlowp::RegisterBlock<int, 8, 4>, gemmlowp::RegisterBlock<int, 8, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastAddImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastMulImpl<gemmlowp::RegisterBlock<int, 1, 4>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "name" : "gemmlowp::BroadcastMulImpl<gemmlowp::RegisterBlock<int, 1, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastMulImpl<gemmlowp::RegisterBlock<int, 4, 1>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastMulImpl<gemmlowp::RegisterBlock<int, 4, 1>, gemmlowp::RegisterBlock<int, 4, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "name" : "gemmlowp::BroadcastMulImpl<gemmlowp::RegisterBlock<int, 4, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "name" : "gemmlowp::BroadcastMulImpl<gemmlowp::RegisterBlock<int, 4, 4>, gemmlowp::RegisterBlock<int, 4, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastMulImpl<gemmlowp::RegisterBlock<int, 8, 1>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastMulImpl<gemmlowp::RegisterBlock<int, 8, 1>, gemmlowp::RegisterBlock<int, 8, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "name" : "gemmlowp::BroadcastMulImpl<gemmlowp::RegisterBlock<int, 8, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "name" : "gemmlowp::BroadcastMulImpl<gemmlowp::RegisterBlock<int, 8, 4>, gemmlowp::RegisterBlock<int, 8, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp16BroadcastMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "min",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "max",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp16OutputStageClampE",
   "name" : "gemmlowp::OutputStageClamp",
   "referenced_type" : "_ZTIN8gemmlowp16OutputStageClampE",
   "self_type" : "_ZTIN8gemmlowp16OutputStageClampE",
   "size" : 8,
   "source_file" : "external/gemmlowp/public/output_stages.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8gemmlowp50NEON_64bit_GEMM_Int8Operands_LhsNonzero_Int8InputsE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb0ELb1EEE",
   "name" : "gemmlowp::DefaultKernelImpl<false, false, true>",
   "referenced_type" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb0ELb1EEE",
   "self_type" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb0ELb1EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/kernel_default.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb0ELb1EEE"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzero4NameEv"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzero3RunEPimmPKhS3_mm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp17DefaultKernelImplILb0ELb0ELb1EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp17DefaultKernelImplILb0ELb0ELb1EED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8gemmlowp24NEON_64_Kernel12x8Depth2E"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb1ELb0EEE",
   "name" : "gemmlowp::DefaultKernelImpl<false, true, false>",
   "referenced_type" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb1ELb0EEE",
   "self_type" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb1ELb0EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/kernel_default.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb1ELb0EEE"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp24NEON_64_Kernel12x8Depth24NameEv"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp24NEON_64_Kernel12x8Depth23RunEPimmPKhS3_mm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp17DefaultKernelImplILb0ELb1ELb0EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp17DefaultKernelImplILb0ELb1ELb0EED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzeroE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb1ELb1EEE",
   "name" : "gemmlowp::DefaultKernelImpl<false, true, true>",
   "referenced_type" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb1ELb1EEE",
   "self_type" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb1ELb1EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/kernel_default.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8gemmlowp17DefaultKernelImplILb0ELb1ELb1EEE"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzero4NameEv"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzero3RunEPimmPKhS3_mm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp17DefaultKernelImplILb0ELb1ELb1EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp17DefaultKernelImplILb0ELb1ELb1EED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_row",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "start_col",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rows",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cols",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp17MatrixBlockBoundsE",
   "name" : "gemmlowp::MatrixBlockBounds",
   "referenced_type" : "_ZTIN8gemmlowp17MatrixBlockBoundsE",
   "self_type" : "_ZTIN8gemmlowp17MatrixBlockBoundsE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/unpack.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIaLi8ELi8EEEEE",
   "name" : "gemmlowp::LoadContiguousImpl<gemmlowp::RegisterBlock<signed char, 8, 8>>",
   "referenced_type" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIaLi8ELi8EEEEE",
   "self_type" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIaLi8ELi8EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIN8gemmlowp13RegisterBlockIaLi8ELi8EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIhLi8ELi8EEEEE",
   "name" : "gemmlowp::LoadContiguousImpl<gemmlowp::RegisterBlock<unsigned char, 8, 8>>",
   "referenced_type" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIhLi8ELi8EEEEE",
   "self_type" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIhLi8ELi8EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIN8gemmlowp13RegisterBlockIhLi8ELi8EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIiLi8ELi8EEEEE",
   "name" : "gemmlowp::LoadContiguousImpl<gemmlowp::RegisterBlock<int, 8, 8>>",
   "referenced_type" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIiLi8ELi8EEEEE",
   "self_type" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIiLi8ELi8EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi8EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIsLi8ELi8EEEEE",
   "name" : "gemmlowp::LoadContiguousImpl<gemmlowp::RegisterBlock<short, 8, 8>>",
   "referenced_type" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIsLi8ELi8EEEEE",
   "self_type" : "_ZTIN8gemmlowp18LoadContiguousImplINS_13RegisterBlockIsLi8ELi8EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" : [ "_ZTIN8gemmlowp13RegisterBlockIsLi8ELi8EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp19BroadcastMulAddImplINS_13RegisterBlockIiLi1ELi1EEES2_S2_EE",
   "name" : "gemmlowp::BroadcastMulAddImpl<gemmlowp::RegisterBlock<int, 1, 1>, gemmlowp::RegisterBlock<int, 1, 1>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp19BroadcastMulAddImplINS_13RegisterBlockIiLi1ELi1EEES2_S2_EE",
   "self_type" : "_ZTIN8gemmlowp19BroadcastMulAddImplINS_13RegisterBlockIiLi1ELi1EEES2_S2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp19BroadcastMulAddImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastMulAddImpl<gemmlowp::RegisterBlock<int, 1, 4>, gemmlowp::RegisterBlock<int, 1, 1>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp19BroadcastMulAddImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp19BroadcastMulAddImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp19BroadcastMulAddImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastMulAddImpl<gemmlowp::RegisterBlock<int, 4, 1>, gemmlowp::RegisterBlock<int, 1, 1>, gemmlowp::RegisterBlock<int, 4, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp19BroadcastMulAddImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp19BroadcastMulAddImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp19ZeroPointInputValueIaaEE",
   "name" : "gemmlowp::ZeroPointInputValue<std::int8_t, std::int8_t>",
   "referenced_type" : "_ZTIN8gemmlowp19ZeroPointInputValueIaaEE",
   "self_type" : "_ZTIN8gemmlowp19ZeroPointInputValueIaaEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/kernel.h",
   "template_args" : [ "_ZTIa", "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp19ZeroPointInputValueIhaEE",
   "name" : "gemmlowp::ZeroPointInputValue<std::uint8_t, std::int8_t>",
   "referenced_type" : "_ZTIN8gemmlowp19ZeroPointInputValueIhaEE",
   "self_type" : "_ZTIN8gemmlowp19ZeroPointInputValueIhaEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/kernel.h",
   "template_args" : [ "_ZTIh", "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp19ZeroPointInputValueIhhEE",
   "name" : "gemmlowp::ZeroPointInputValue<std::uint8_t, std::uint8_t>",
   "referenced_type" : "_ZTIN8gemmlowp19ZeroPointInputValueIhhEE",
   "self_type" : "_ZTIN8gemmlowp19ZeroPointInputValueIhhEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/kernel.h",
   "template_args" : [ "_ZTIh", "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp20ScopedProfilingLabelE",
   "name" : "gemmlowp::ScopedProfilingLabel",
   "referenced_type" : "_ZTIN8gemmlowp20ScopedProfilingLabelE",
   "self_type" : "_ZTIN8gemmlowp20ScopedProfilingLabelE",
   "size" : 1,
   "source_file" : "external/gemmlowp/profiling/instrumentation.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 1, 4>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 1, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 1, 8>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 1, 8>, gemmlowp::RegisterBlock<int, 1, 8>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 4, 1>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 4, 1>, gemmlowp::RegisterBlock<int, 4, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 4, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 4, 4>, gemmlowp::RegisterBlock<int, 4, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 8, 1>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 8, 1>, gemmlowp::RegisterBlock<int, 8, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 8, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "name" : "gemmlowp::BroadcastShiftLeftImpl<gemmlowp::RegisterBlock<int, 8, 4>, gemmlowp::RegisterBlock<int, 8, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp22BroadcastShiftLeftImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8gemmlowp26MultiThreadGemmContextBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "workers_pool_",
     "field_offset" : 832,
     "referenced_type" : "_ZTIN8gemmlowp11WorkersPoolE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp22MultiThreadGemmContextE",
   "name" : "gemmlowp::MultiThreadGemmContext",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp22MultiThreadGemmContextE",
   "self_type" : "_ZTIN8gemmlowp22MultiThreadGemmContextE",
   "size" : 224,
   "source_file" : "external/gemmlowp/internal/multi_thread_gemm.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsI11__Int16x8_tEE",
   "name" : "gemmlowp::FixedPointRawTypeTraits<int16x8_t>",
   "referenced_type" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsI11__Int16x8_tEE",
   "self_type" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsI11__Int16x8_tEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/fixedpoint/fixedpoint_neon.h",
   "template_args" : [ "_ZTI11__Int16x8_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsI11__Int32x4_tEE",
   "name" : "gemmlowp::FixedPointRawTypeTraits<int32x4_t>",
   "referenced_type" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsI11__Int32x4_tEE",
   "self_type" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsI11__Int32x4_tEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/fixedpoint/fixedpoint_neon.h",
   "template_args" : [ "_ZTI11__Int32x4_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsIiEE",
   "name" : "gemmlowp::FixedPointRawTypeTraits<std::int32_t>",
   "referenced_type" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsIiEE",
   "self_type" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsIiEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/fixedpoint/fixedpoint.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsIsEE",
   "name" : "gemmlowp::FixedPointRawTypeTraits<std::int16_t>",
   "referenced_type" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsIsEE",
   "self_type" : "_ZTIN8gemmlowp23FixedPointRawTypeTraitsIsEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/fixedpoint/fixedpoint.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "allocator_",
     "referenced_type" : "_ZTIN8gemmlowp9AllocatorE"
    },
    {
     "access" : "protected",
     "field_name" : "l1_bytes_to_use_",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "l2_bytes_to_use_",
     "field_offset" : 736,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "l2_rhs_factor_",
     "field_offset" : 768,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp23SingleThreadGemmContextE",
   "name" : "gemmlowp::SingleThreadGemmContext",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp23SingleThreadGemmContextE",
   "self_type" : "_ZTIN8gemmlowp23SingleThreadGemmContextE",
   "size" : 104,
   "source_file" : "external/gemmlowp/internal/single_thread_gemm.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8gemmlowp10KernelBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp24NEON_64_Kernel12x8Depth2E",
   "name" : "gemmlowp::NEON_64_Kernel12x8Depth2",
   "referenced_type" : "_ZTIN8gemmlowp24NEON_64_Kernel12x8Depth2E",
   "self_type" : "_ZTIN8gemmlowp24NEON_64_Kernel12x8Depth2E",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/kernel_neon.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8gemmlowp24NEON_64_Kernel12x8Depth2E"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp24NEON_64_Kernel12x8Depth24NameEv"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp24NEON_64_Kernel12x8Depth23RunEPimmPKhS3_mm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp24NEON_64_Kernel12x8Depth2D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp24NEON_64_Kernel12x8Depth2D0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi16EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToInt8, gemmlowp::RegisterBuffer<int, 16>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi16EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi16EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp31OutputStageSaturatingCastToInt8E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi16EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi32EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToInt8, gemmlowp::RegisterBuffer<int, 32>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi32EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi32EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp31OutputStageSaturatingCastToInt8E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi32EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi4EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToInt8, gemmlowp::RegisterBuffer<int, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp31OutputStageSaturatingCastToInt8E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi8EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToInt8, gemmlowp::RegisterBuffer<int, 8>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi8EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_31OutputStageSaturatingCastToInt8ENS_14RegisterBufferIiLi8EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp31OutputStageSaturatingCastToInt8E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi8EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi16EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToInt16, gemmlowp::RegisterBuffer<int, 16>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi16EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi16EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp32OutputStageSaturatingCastToInt16E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi16EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi32EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToInt16, gemmlowp::RegisterBuffer<int, 32>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi32EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi32EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp32OutputStageSaturatingCastToInt16E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi32EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi4EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToInt16, gemmlowp::RegisterBuffer<int, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp32OutputStageSaturatingCastToInt16E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi8EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToInt16, gemmlowp::RegisterBuffer<int, 8>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi8EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToInt16ENS_14RegisterBufferIiLi8EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp32OutputStageSaturatingCastToInt16E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi8EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi16EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToUint8, gemmlowp::RegisterBuffer<int, 16>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi16EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi16EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp32OutputStageSaturatingCastToUint8E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi16EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi32EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToUint8, gemmlowp::RegisterBuffer<int, 32>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi32EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi32EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp32OutputStageSaturatingCastToUint8E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi32EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi4EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToUint8, gemmlowp::RegisterBuffer<int, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp32OutputStageSaturatingCastToUint8E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi8EEEEE",
   "name" : "gemmlowp::OutputStageEvalBufferImpl<gemmlowp::OutputStageSaturatingCastToUint8, gemmlowp::RegisterBuffer<int, 8>>",
   "referenced_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi8EEEEE",
   "self_type" : "_ZTIN8gemmlowp25OutputStageEvalBufferImplINS_32OutputStageSaturatingCastToUint8ENS_14RegisterBufferIiLi8EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/output_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp32OutputStageSaturatingCastToUint8E",
    "_ZTIN8gemmlowp14RegisterBufferIiLi8EEE"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8gemmlowp23SingleThreadGemmContextE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "max_num_threads_",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp26MultiThreadGemmContextBaseE",
   "name" : "gemmlowp::MultiThreadGemmContextBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp26MultiThreadGemmContextBaseE",
   "self_type" : "_ZTIN8gemmlowp26MultiThreadGemmContextBaseE",
   "size" : 104,
   "source_file" : "external/gemmlowp/internal/multi_thread_gemm.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp31OutputStageSaturatingCastToInt8E",
   "name" : "gemmlowp::OutputStageSaturatingCastToInt8",
   "referenced_type" : "_ZTIN8gemmlowp31OutputStageSaturatingCastToInt8E",
   "self_type" : "_ZTIN8gemmlowp31OutputStageSaturatingCastToInt8E",
   "size" : 1,
   "source_file" : "external/gemmlowp/public/output_stages.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 1, 4>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 1, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 1, 8>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 1, 8>, gemmlowp::RegisterBlock<int, 1, 8>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 4, 1>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 4, 1>, gemmlowp::RegisterBlock<int, 4, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 4, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 4, 4>, gemmlowp::RegisterBlock<int, 4, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 8, 1>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 8, 1>, gemmlowp::RegisterBlock<int, 8, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 8, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "name" : "gemmlowp::BroadcastRoundingDivideByPOTImpl<gemmlowp::RegisterBlock<int, 8, 4>, gemmlowp::RegisterBlock<int, 8, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp32BroadcastRoundingDivideByPOTImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_neon.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32OutputStageSaturatingCastToInt16E",
   "name" : "gemmlowp::OutputStageSaturatingCastToInt16",
   "referenced_type" : "_ZTIN8gemmlowp32OutputStageSaturatingCastToInt16E",
   "self_type" : "_ZTIN8gemmlowp32OutputStageSaturatingCastToInt16E",
   "size" : 1,
   "source_file" : "external/gemmlowp/public/output_stages.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32OutputStageSaturatingCastToUint8E",
   "name" : "gemmlowp::OutputStageSaturatingCastToUint8",
   "referenced_type" : "_ZTIN8gemmlowp32OutputStageSaturatingCastToUint8E",
   "self_type" : "_ZTIN8gemmlowp32OutputStageSaturatingCastToUint8E",
   "size" : 1,
   "source_file" : "external/gemmlowp/public/output_stages.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp32OutputStageTruncatingCastToUint8E",
   "name" : "gemmlowp::OutputStageTruncatingCastToUint8",
   "referenced_type" : "_ZTIN8gemmlowp32OutputStageTruncatingCastToUint8E",
   "self_type" : "_ZTIN8gemmlowp32OutputStageTruncatingCastToUint8E",
   "size" : 1,
   "source_file" : "external/gemmlowp/public/output_stages.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8gemmlowp10KernelBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzeroE",
   "name" : "gemmlowp::NEON_64bit_GEMM_Int8Operands_LhsNonzero",
   "referenced_type" : "_ZTIN8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzeroE",
   "self_type" : "_ZTIN8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzeroE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/kernel_neon.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzeroE"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzero4NameEv"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzero3RunEPimmPKhS3_mm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzeroD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzeroD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "result_fixedpoint_multiplier",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "result_shift",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "result_offset_after_shift",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp40OutputStageQuantizeDownInt32ByFixedPointE",
   "name" : "gemmlowp::OutputStageQuantizeDownInt32ByFixedPoint",
   "referenced_type" : "_ZTIN8gemmlowp40OutputStageQuantizeDownInt32ByFixedPointE",
   "self_type" : "_ZTIN8gemmlowp40OutputStageQuantizeDownInt32ByFixedPointE",
   "size" : 12,
   "source_file" : "external/gemmlowp/public/output_stages.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "result_offset",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "result_mult_int",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "result_shift",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleE",
   "name" : "gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale",
   "referenced_type" : "_ZTIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleE",
   "self_type" : "_ZTIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleE",
   "size" : 12,
   "source_file" : "external/gemmlowp/public/output_stages.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "result_fixedpoint_multiplier",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "result_exponent",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "result_offset_after_shift",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp44OutputStageScaleInt32ByFixedPointAndExponentE",
   "name" : "gemmlowp::OutputStageScaleInt32ByFixedPointAndExponent",
   "referenced_type" : "_ZTIN8gemmlowp44OutputStageScaleInt32ByFixedPointAndExponentE",
   "self_type" : "_ZTIN8gemmlowp44OutputStageScaleInt32ByFixedPointAndExponentE",
   "size" : 12,
   "source_file" : "external/gemmlowp/public/output_stages.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 1, 4>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi4EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 1, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi4EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 1, 8>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi8EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 1, 8>, gemmlowp::RegisterBlock<int, 1, 8>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi1ELi8EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi8EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 4, 1>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi1EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 4, 1>, gemmlowp::RegisterBlock<int, 4, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 4, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi1ELi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 4, 4>, gemmlowp::RegisterBlock<int, 4, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi4ELi4EEENS1_IiLi4ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi4ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 8, 1>, gemmlowp::RegisterBlock<int, 1, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi1EEENS1_IiLi1ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 8, 1>, gemmlowp::RegisterBlock<int, 8, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi1EEES2_EE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 8, 4>, gemmlowp::RegisterBlock<int, 1, 4>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi1ELi4EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi1ELi4EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "name" : "gemmlowp::BroadcastSaturatingRoundingDoublingHighMulImpl<gemmlowp::RegisterBlock<int, 8, 4>, gemmlowp::RegisterBlock<int, 8, 1>>",
   "referenced_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "self_type" : "_ZTIN8gemmlowp46BroadcastSaturatingRoundingDoublingHighMulImplINS_13RegisterBlockIiLi8ELi4EEENS1_IiLi8ELi1EEEEE",
   "size" : 1,
   "source_file" : "external/gemmlowp/internal/simd_wrappers_common_neon_sse.h",
   "template_args" :
   [
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi4EEE",
    "_ZTIN8gemmlowp13RegisterBlockIiLi8ELi1EEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "local_allocator",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN8gemmlowp9AllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp4TaskE",
   "name" : "gemmlowp::Task",
   "referenced_type" : "_ZTIN8gemmlowp4TaskE",
   "self_type" : "_ZTIN8gemmlowp4TaskE",
   "size" : 16,
   "source_file" : "external/gemmlowp/internal/multi_thread_gemm.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8gemmlowp4TaskE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp4TaskD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp4TaskD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8gemmlowp4Task3RunEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzeroE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp50NEON_64bit_GEMM_Int8Operands_LhsNonzero_Int8InputsE",
   "name" : "gemmlowp::NEON_64bit_GEMM_Int8Operands_LhsNonzero_Int8Inputs",
   "referenced_type" : "_ZTIN8gemmlowp50NEON_64bit_GEMM_Int8Operands_LhsNonzero_Int8InputsE",
   "self_type" : "_ZTIN8gemmlowp50NEON_64bit_GEMM_Int8Operands_LhsNonzero_Int8InputsE",
   "size" : 8,
   "source_file" : "external/gemmlowp/internal/kernel_neon.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8gemmlowp50NEON_64bit_GEMM_Int8Operands_LhsNonzero_Int8InputsE"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzero4NameEv"
    },
    {
     "mangled_component_name" : "_ZNK8gemmlowp39NEON_64bit_GEMM_Int8Operands_LhsNonzero3RunEPimmPKhS3_mm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp50NEON_64bit_GEMM_Int8Operands_LhsNonzero_Int8InputsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8gemmlowp50NEON_64bit_GEMM_Int8Operands_LhsNonzero_Int8InputsD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m",
     "referenced_type" : "_ZTI15pthread_mutex_t"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp5MutexE",
   "name" : "gemmlowp::Mutex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp5MutexE",
   "self_type" : "_ZTIN8gemmlowp5MutexE",
   "size" : 40,
   "source_file" : "external/gemmlowp/profiling/instrumentation.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "thread_",
     "referenced_type" : "_ZTIl"
    },
    {
     "access" : "private",
     "field_name" : "task_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN8gemmlowp4TaskE"
    },
    {
     "access" : "private",
     "field_name" : "state_cond_",
     "field_offset" : 128,
     "referenced_type" : "_ZTI14pthread_cond_t"
    },
    {
     "access" : "private",
     "field_name" : "state_mutex_",
     "field_offset" : 512,
     "referenced_type" : "_ZTI15pthread_mutex_t"
    },
    {
     "access" : "private",
     "field_name" : "state_",
     "field_offset" : 832,
     "referenced_type" : "_ZTINSt3__16atomicIN8gemmlowp6Worker5StateEEE"
    },
    {
     "access" : "private",
     "field_name" : "local_allocator_",
     "field_offset" : 896,
     "referenced_type" : "_ZTIN8gemmlowp9AllocatorE"
    },
    {
     "access" : "private",
     "field_name" : "counter_to_decrement_when_ready_",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIKPN8gemmlowp15BlockingCounterE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp6WorkerE",
   "name" : "gemmlowp::Worker",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp6WorkerE",
   "self_type" : "_ZTIN8gemmlowp6WorkerE",
   "size" : 208,
   "source_file" : "external/gemmlowp/internal/multi_thread_gemm.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "index_",
     "referenced_type" : "_ZTIh"
    },
    {
     "access" : "private",
     "field_name" : "generation_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "type_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN8gemmlowp6TypeIdE"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp9Allocator6HandleE",
   "name" : "gemmlowp::Allocator::Handle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp9Allocator6HandleE",
   "self_type" : "_ZTIN8gemmlowp9Allocator6HandleE",
   "size" : 24,
   "source_file" : "external/gemmlowp/internal/allocator.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "committed_",
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "storage_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "storage_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "reserved_blocks_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "reserved_bytes_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "reserved_blocks_offsets_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA5_m"
    },
    {
     "access" : "private",
     "field_name" : "generation_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp9AllocatorE",
   "name" : "gemmlowp::Allocator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp9AllocatorE",
   "self_type" : "_ZTIN8gemmlowp9AllocatorE",
   "size" : 88,
   "source_file" : "external/gemmlowp/internal/allocator.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKi"
    },
    {
     "access" : "protected",
     "field_name" : "rows_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "cols_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "stride_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp9MatrixMapIKiLNS_8MapOrderE0EEE",
   "name" : "gemmlowp::MatrixMap<const int, gemmlowp::MapOrder::ColMajor>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp9MatrixMapIKiLNS_8MapOrderE0EEE",
   "self_type" : "_ZTIN8gemmlowp9MatrixMapIKiLNS_8MapOrderE0EEE",
   "size" : 24,
   "source_file" : "external/gemmlowp/public/map.h",
   "template_args" : [ "_ZTIKi" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPi"
    },
    {
     "access" : "protected",
     "field_name" : "rows_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "cols_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "stride_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp9MatrixMapIiLNS_8MapOrderE0EEE",
   "name" : "gemmlowp::MatrixMap<int, gemmlowp::MapOrder::ColMajor>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp9MatrixMapIiLNS_8MapOrderE0EEE",
   "self_type" : "_ZTIN8gemmlowp9MatrixMapIiLNS_8MapOrderE0EEE",
   "size" : 24,
   "source_file" : "external/gemmlowp/public/map.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "data_",
     "referenced_type" : "_ZTIKi"
    },
    {
     "access" : "protected",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp9VectorDupIKiLNS_11VectorShapeE0EEE",
   "name" : "gemmlowp::VectorDup<const int, gemmlowp::VectorShape::Col>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp9VectorDupIKiLNS_11VectorShapeE0EEE",
   "self_type" : "_ZTIN8gemmlowp9VectorDupIKiLNS_11VectorShapeE0EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/public/map.h",
   "template_args" : [ "_ZTIKi" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "data_",
     "referenced_type" : "_ZTIKi"
    },
    {
     "access" : "protected",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp9VectorDupIKiLNS_11VectorShapeE1EEE",
   "name" : "gemmlowp::VectorDup<const int, gemmlowp::VectorShape::Row>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp9VectorDupIKiLNS_11VectorShapeE1EEE",
   "self_type" : "_ZTIN8gemmlowp9VectorDupIKiLNS_11VectorShapeE1EEE",
   "size" : 8,
   "source_file" : "external/gemmlowp/public/map.h",
   "template_args" : [ "_ZTIKi" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKi"
    },
    {
     "access" : "protected",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp9VectorMapIKiLNS_11VectorShapeE0EEE",
   "name" : "gemmlowp::VectorMap<const int, gemmlowp::VectorShape::Col>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp9VectorMapIKiLNS_11VectorShapeE0EEE",
   "self_type" : "_ZTIN8gemmlowp9VectorMapIKiLNS_11VectorShapeE0EEE",
   "size" : 16,
   "source_file" : "external/gemmlowp/public/map.h",
   "template_args" : [ "_ZTIKi" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKi"
    },
    {
     "access" : "protected",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8gemmlowp9VectorMapIKiLNS_11VectorShapeE1EEE",
   "name" : "gemmlowp::VectorMap<const int, gemmlowp::VectorShape::Row>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8gemmlowp9VectorMapIKiLNS_11VectorShapeE1EEE",
   "self_type" : "_ZTIN8gemmlowp9VectorMapIKiLNS_11VectorShapeE1EEE",
   "size" : 16,
   "source_file" : "external/gemmlowp/public/map.h",
   "template_args" : [ "_ZTIKi" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA12_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:232:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:117:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:78:20)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__110__function16__policy_storageE",
   "self_type" : "_ZTINSt3__110__function16__policy_storageE",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "referenced_type" : "_ZTINSt3__110__function8__policyE",
   "self_type" : "_ZTINSt3__110__function8__policyE",
   "size" : 32,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm0EEE",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "_ZTINSt3__110__get_pairILm0EEE",
   "self_type" : "_ZTINSt3__110__get_pairILm0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm1EEE",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "_ZTINSt3__110__get_pairILm1EEE",
   "self_type" : "_ZTINSt3__110__get_pairILm1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEEEE",
   "name" : "std::__identity<std::default_delete<tflite::TfLiteInternalBackendContext>>",
   "referenced_type" : "_ZTINSt3__110__identityINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEEEE",
   "self_type" : "_ZTINSt3__110__identityINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteIN6tflite28TfLiteInternalBackendContextEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteINS_15__thread_structEEEEE",
   "name" : "std::__identity<std::default_delete<std::__thread_struct>>",
   "referenced_type" : "_ZTINSt3__110__identityINS_14default_deleteINS_15__thread_structEEEEE",
   "self_type" : "_ZTINSt3__110__identityINS_14default_deleteINS_15__thread_structEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteINS_15__thread_structEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "_ZTINSt3__110__ignore_tIhEE",
   "self_type" : "_ZTINSt3__110__ignore_tIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000000>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000000000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000000000EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILl1ELl1000000000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000000EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILl1ELl1000000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILl1ELl1000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILl1ELl1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl3600ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<3600, 1>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl3600ELl1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl3600ELl1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILl3600ELl1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl60ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<60, 1>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl60ELl1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILl60ELl1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILl60ELl1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIN8gemmlowp32OutputStageSaturatingCastToUint8EJRS3_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIN8gemmlowp32OutputStageSaturatingCastToUint8ENS_12__tuple_leafILm1ES4_Lb1EEEEEEEJNS_16is_constructibleIS4_JRS4_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<gemmlowp::OutputStageSaturatingCastToUint8, std::__tuple_leaf<1, gemmlowp::OutputStageSaturatingCastToUint8, true>>>, is_constructible<OutputStageSaturatingCastToUint8, OutputStageSaturatingCastToUint8 &>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIN8gemmlowp32OutputStageSaturatingCastToUint8ENS_12__tuple_leafILm1ES4_Lb1EEEEEEEJNS_16is_constructibleIS4_JRS4_EEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIN8gemmlowp32OutputStageSaturatingCastToUint8ENS_12__tuple_leafILm1ES4_Lb1EEEEEEEJNS_16is_constructibleIS4_JRS4_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameIN8gemmlowp32OutputStageSaturatingCastToUint8ENS_12__tuple_leafILm1ES3_Lb1EEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_16is_constructibleIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleEJRS3_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS_12__tuple_leafILm0ES4_Lb0EEEEEEEJNS_16is_constructibleIS4_JRS4_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale, std::__tuple_leaf<0, gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale, false>>>, is_constructible<OutputStageQuantizeDownInt32ToUint8Scale, OutputStageQuantizeDownInt32ToUint8Scale &>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS_12__tuple_leafILm0ES4_Lb0EEEEEEEJNS_16is_constructibleIS4_JRS4_EEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS_12__tuple_leafILm0ES4_Lb0EEEEEEEJNS_16is_constructibleIS4_JRS4_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS_12__tuple_leafILm0ES3_Lb0EEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleEJRKNS_12__tuple_leafILm0ES3_Lb0EEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES6_EEEEJNS_16is_constructibleIS5_JRKS6_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::__tuple_leaf<0, gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale, false>, std::__tuple_leaf<0, gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale, false>>>, is_constructible<OutputStageQuantizeDownInt32ToUint8Scale, const __tuple_leaf<0, OutputStageQuantizeDownInt32ToUint8Scale, false> &>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES6_EEEEJNS_16is_constructibleIS5_JRKS6_EEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES6_EEEEJNS_16is_constructibleIS5_JRKS6_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES5_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleEJNS_12__tuple_leafILm0ES3_Lb0EEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES6_EEEEJNS_16is_constructibleIS5_JS6_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::__tuple_leaf<0, gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale, false>, std::__tuple_leaf<0, gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale, false>>>, is_constructible<OutputStageQuantizeDownInt32ToUint8Scale, __tuple_leaf<0, OutputStageQuantizeDownInt32ToUint8Scale, false>>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES6_EEEEJNS_16is_constructibleIS5_JS6_EEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES6_EEEEJNS_16is_constructibleIS5_JS6_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES5_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleIN8gemmlowp32OutputStageSaturatingCastToUint8EJRKNS_12__tuple_leafILm1ES3_Lb1EEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES6_EEEEJNS_16is_constructibleIS5_JRKS6_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::__tuple_leaf<1, gemmlowp::OutputStageSaturatingCastToUint8, true>, std::__tuple_leaf<1, gemmlowp::OutputStageSaturatingCastToUint8, true>>>, is_constructible<OutputStageSaturatingCastToUint8, const __tuple_leaf<1, OutputStageSaturatingCastToUint8, true> &>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES6_EEEEJNS_16is_constructibleIS5_JRKS6_EEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES6_EEEEJNS_16is_constructibleIS5_JRKS6_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES5_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleIN8gemmlowp32OutputStageSaturatingCastToUint8EJNS_12__tuple_leafILm1ES3_Lb1EEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES6_EEEEJNS_16is_constructibleIS5_JS6_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::__tuple_leaf<1, gemmlowp::OutputStageSaturatingCastToUint8, true>, std::__tuple_leaf<1, gemmlowp::OutputStageSaturatingCastToUint8, true>>>, is_constructible<OutputStageSaturatingCastToUint8, __tuple_leaf<1, OutputStageSaturatingCastToUint8, true>>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES6_EEEEJNS_16is_constructibleIS5_JS6_EEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES6_EEEEJNS_16is_constructibleIS5_JS6_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES5_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_10__lazy_allIJNS_16__dependent_typeINS_24is_default_constructibleIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleEEELb1EEENS2_INS3_INS4_32OutputStageSaturatingCastToUint8EEELb1EEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_7is_sameINS_15allocator_arg_tEN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleEEEJNS_10__lazy_allIJNS_16__dependent_typeINS_24is_default_constructibleIS4_EELb1EEENS7_INS8_INS3_32OutputStageSaturatingCastToUint8EEELb1EEEEEEEEE",
   "name" : "std::__lazy_and<std::is_same<std::allocator_arg_t, gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale>, __lazy_all<__dependent_type<is_default_constructible<OutputStageQuantizeDownInt32ToUint8Scale>, true>, __dependent_type<is_default_constructible<OutputStageSaturatingCastToUint8>, true>>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_7is_sameINS_15allocator_arg_tEN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleEEEJNS_10__lazy_allIJNS_16__dependent_typeINS_24is_default_constructibleIS4_EELb1EEENS7_INS8_INS3_32OutputStageSaturatingCastToUint8EEELb1EEEEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_7is_sameINS_15allocator_arg_tEN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleEEEJNS_10__lazy_allIJNS_16__dependent_typeINS_24is_default_constructibleIS4_EELb1EEENS7_INS8_INS3_32OutputStageSaturatingCastToUint8EEELb1EEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__17is_sameINS_15allocator_arg_tEN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameIN8gemmlowp32OutputStageSaturatingCastToUint8ENS_12__tuple_leafILm1ES3_Lb1EEEEEEE",
   "name" : "std::__lazy_not<std::is_same<gemmlowp::OutputStageSaturatingCastToUint8, std::__tuple_leaf<1, gemmlowp::OutputStageSaturatingCastToUint8, true>>>",
   "referenced_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIN8gemmlowp32OutputStageSaturatingCastToUint8ENS_12__tuple_leafILm1ES3_Lb1EEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIN8gemmlowp32OutputStageSaturatingCastToUint8ENS_12__tuple_leafILm1ES3_Lb1EEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__17is_sameIN8gemmlowp32OutputStageSaturatingCastToUint8ENS_12__tuple_leafILm1ES2_Lb1EEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS_12__tuple_leafILm0ES3_Lb0EEEEEEE",
   "name" : "std::__lazy_not<std::is_same<gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale, std::__tuple_leaf<0, gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale, false>>>",
   "referenced_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS_12__tuple_leafILm0ES3_Lb0EEEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_notINS_7is_sameIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS_12__tuple_leafILm0ES3_Lb0EEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__17is_sameIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS_12__tuple_leafILm0ES2_Lb0EEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES5_EEEE",
   "name" : "std::__lazy_not<std::is_same<std::__tuple_leaf<0, gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale, false>, std::__tuple_leaf<0, gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale, false>>>",
   "referenced_type" : "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES5_EEEE",
   "self_type" : "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES5_EEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__17is_sameINS_12__tuple_leafILm0EN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEES4_EE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES5_EEEE",
   "name" : "std::__lazy_not<std::is_same<std::__tuple_leaf<1, gemmlowp::OutputStageSaturatingCastToUint8, true>, std::__tuple_leaf<1, gemmlowp::OutputStageSaturatingCastToUint8, true>>>",
   "referenced_type" : "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES5_EEEE",
   "self_type" : "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES5_EEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__17is_sameINS_12__tuple_leafILm1EN8gemmlowp32OutputStageSaturatingCastToUint8ELb1EEES4_EE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__val_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "__cat_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKNSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110error_codeE",
   "name" : "std::error_code",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110error_codeE",
   "self_type" : "_ZTINSt3__110error_codeE",
   "size" : 16,
   "source_file" : "external/libcxx/include/system_error"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "referenced_type" : "_ZTINSt3__110in_place_tE",
   "self_type" : "_ZTINSt3__110in_place_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEEEE",
   "name" : "std::is_pointer<std::default_delete<tflite::TfLiteInternalBackendContext>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteIN6tflite28TfLiteInternalBackendContextEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteINS_15__thread_structEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteINS_15__thread_structEEEEE",
   "name" : "std::is_pointer<std::default_delete<std::__thread_struct>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_14default_deleteINS_15__thread_structEEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_14default_deleteINS_15__thread_structEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteINS_15__thread_structEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDiEE",
   "name" : "std::is_trivial<char32_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDiEE",
   "self_type" : "_ZTINSt3__110is_trivialIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDsEE",
   "name" : "std::is_trivial<char16_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDsEE",
   "self_type" : "_ZTINSt3__110is_trivialIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "referenced_type" : "_ZTINSt3__110is_trivialIcEE",
   "self_type" : "_ZTINSt3__110is_trivialIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIwEE",
   "self_type" : "_ZTINSt3__110is_trivialIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110less_equalIvEE",
   "name" : "std::less_equal<void>",
   "referenced_type" : "_ZTINSt3__110less_equalIvEE",
   "self_type" : "_ZTINSt3__110less_equalIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110logical_orIvEE",
   "name" : "std::logical_or<void>",
   "referenced_type" : "_ZTINSt3__110logical_orIvEE",
   "self_type" : "_ZTINSt3__110logical_orIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110multipliesIvEE",
   "name" : "std::multiplies<void>",
   "referenced_type" : "_ZTINSt3__110multipliesIvEE",
   "self_type" : "_ZTINSt3__110multipliesIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "referenced_type" : "_ZTINSt3__110owner_lessIvEE",
   "self_type" : "_ZTINSt3__110owner_lessIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_13__tuple_typesIJN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "name" : "std::tuple_size<std::__tuple_types<OutputStageQuantizeDownInt32ToUint8Scale, OutputStageSaturatingCastToUint8>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_13__tuple_typesIJN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_13__tuple_typesIJN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" :
   [
    "_ZTINSt3__113__tuple_typesIJN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS1_32OutputStageSaturatingCastToUint8EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "name" : "std::tuple_size<std::pair<unsigned long, unsigned long>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__14pairImmEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_5tupleIJN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "name" : "std::tuple_size<std::tuple<OutputStageQuantizeDownInt32ToUint8Scale, OutputStageSaturatingCastToUint8>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_5tupleIJN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_5tupleIJN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" :
   [
    "_ZTINSt3__15tupleIJN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleENS1_32OutputStageSaturatingCastToUint8EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_5tupleIJRKN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleERKNS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "name" : "std::tuple_size<std::tuple<const OutputStageQuantizeDownInt32ToUint8Scale &, const OutputStageSaturatingCastToUint8 &>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_5tupleIJRKN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleERKNS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_5tupleIJRKN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleERKNS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" :
   [
    "_ZTINSt3__15tupleIJRKN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleERKNS1_32OutputStageSaturatingCastToUint8EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_5tupleIJRN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleERNS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "name" : "std::tuple_size<std::tuple<OutputStageQuantizeDownInt32ToUint8Scale &, OutputStageSaturatingCastToUint8 &>>",
   "referenced_type" : "_ZTINSt3__110tuple_sizeINS_5tupleIJRN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleERNS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "self_type" : "_ZTINSt3__110tuple_sizeINS_5tupleIJRN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleERNS2_32OutputStageSaturatingCastToUint8EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" :
   [
    "_ZTINSt3__15tupleIJRN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleERNS1_32OutputStageSaturatingCastToUint8EEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPN3ruy7ContextENS_14default_deleteIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIN3ruy7ContextENS_14default_deleteIS2_EEEE",
   "name" : "std::unique_ptr<ruy::Context, std::default_delete<ruy::Context>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIN3ruy7ContextENS_14default_deleteIS2_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIN3ruy7ContextENS_14default_deleteIS2_EEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIN3ruy7ContextE", "_ZTINSt3__114default_deleteIN3ruy7ContextEEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPN6tflite28TfLiteInternalBackendContextENS_14default_deleteIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIN6tflite28TfLiteInternalBackendContextENS_14default_deleteIS2_EEEE",
   "name" : "std::unique_ptr<tflite::TfLiteInternalBackendContext, std::default_delete<tflite::TfLiteInternalBackendContext>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIN6tflite28TfLiteInternalBackendContextENS_14default_deleteIS2_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIN6tflite28TfLiteInternalBackendContextENS_14default_deleteIS2_EEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIN6tflite28TfLiteInternalBackendContextE",
    "_ZTINSt3__114default_deleteIN6tflite28TfLiteInternalBackendContextEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPN8gemmlowp11GemmContextENS_14default_deleteIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIN8gemmlowp11GemmContextENS_14default_deleteIS2_EEEE",
   "name" : "std::unique_ptr<gemmlowp::GemmContext, std::default_delete<gemmlowp::GemmContext>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIN8gemmlowp11GemmContextENS_14default_deleteIS2_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIN8gemmlowp11GemmContextENS_14default_deleteIS2_EEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIN8gemmlowp11GemmContextE",
    "_ZTINSt3__114default_deleteIN8gemmlowp11GemmContextEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPNS_15__thread_structENS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrINS_15__thread_structENS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<std::__thread_struct, std::default_delete<std::__thread_struct>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrINS_15__thread_structENS_14default_deleteIS1_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrINS_15__thread_structENS_14default_deleteIS1_EEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__115__thread_structE",
    "_ZTINSt3__114default_deleteINS_15__thread_structEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIN8gemmlowp32OutputStageSaturatingCastToUint8ELb0EEE",
   "name" : "std::__add_const<gemmlowp::OutputStageSaturatingCastToUint8, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIN8gemmlowp32OutputStageSaturatingCastToUint8ELb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIN8gemmlowp32OutputStageSaturatingCastToUint8ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN8gemmlowp32OutputStageSaturatingCastToUint8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEE",
   "name" : "std::__add_const<gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale, false>",
   "referenced_type" : "_ZTINSt3__111__add_constIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEE",
   "self_type" : "_ZTINSt3__111__add_constIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constImLb0EEE",
   "name" : "std::__add_const<unsigned long, false>",
   "referenced_type" : "_ZTINSt3__111__add_constImLb0EEE",
   "self_type" : "_ZTINSt3__111__add_constImLb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEENS1_ILl1ELl1000EEEEE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1000>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEENS1_ILl1ELl1000EEEEE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEENS1_ILl1ELl1000EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000000EEE",
    "_ZTINSt3__15ratioILl1ELl1000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEENS1_ILl1ELl1EEEEE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEENS1_ILl1ELl1EEEEE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEENS1_ILl1ELl1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000000EEE",
    "_ZTINSt3__15ratioILl1ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1000000000>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000000EEE",
    "_ZTINSt3__15ratioILl1ELl1000000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000>, std::ratio<1, 1000000>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000EEE",
    "_ZTINSt3__15ratioILl1ELl1000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000EEENS1_ILl1ELl1EEEEE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000>, std::ratio<1, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000EEENS1_ILl1ELl1EEEEE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000EEENS1_ILl1ELl1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILl1ELl1000EEE", "_ZTINSt3__15ratioILl1ELl1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000>, std::ratio<1, 1000>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILl1ELl1000EEE", "_ZTINSt3__15ratioILl1ELl1000EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1>, std::ratio<1, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILl1ELl1EEE", "_ZTINSt3__15ratioILl1ELl1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl3600ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<3600, 1>, std::ratio<3600, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl3600ELl1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl3600ELl1EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILl3600ELl1EEE", "_ZTINSt3__15ratioILl3600ELl1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl60ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<60, 1>, std::ratio<60, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl60ELl1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl60ELl1EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILl60ELl1EEE", "_ZTINSt3__15ratioILl60ELl1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char32_t>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDiEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char16_t>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDsEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIPN8gemmlowp4TaskEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<gemmlowp::Task *>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIPN8gemmlowp4TaskEEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIPN8gemmlowp4TaskEEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIPN8gemmlowp4TaskEEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIPN8gemmlowp6WorkerEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<gemmlowp::Worker *>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIPN8gemmlowp6WorkerEEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIPN8gemmlowp6WorkerEEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIPN8gemmlowp6WorkerEEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, long, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIl" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__id_",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__thread_idE",
   "name" : "std::__thread_id",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__thread_idE",
   "self_type" : "_ZTINSt3__111__thread_idE",
   "size" : 8,
   "source_file" : "external/libcxx/include/thread"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__type_list<__int128, std::__nat>>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__type_list<unsigned __int128, std::__nat>>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__i",
     "referenced_type" : "_ZTIPKPN8gemmlowp4TaskE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__wrap_iterIPKPN8gemmlowp4TaskEEE",
   "name" : "std::__wrap_iter<gemmlowp::Task *const *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__wrap_iterIPKPN8gemmlowp4TaskEEE",
   "self_type" : "_ZTINSt3__111__wrap_iterIPKPN8gemmlowp4TaskEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPKPN8gemmlowp4TaskE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__i",
     "referenced_type" : "_ZTIPPN8gemmlowp6WorkerE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__wrap_iterIPPN8gemmlowp6WorkerEEE",
   "name" : "std::__wrap_iter<gemmlowp::Worker **>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__wrap_iterIPPN8gemmlowp6WorkerEEE",
   "self_type" : "_ZTINSt3__111__wrap_iterIPPN8gemmlowp6WorkerEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPPN8gemmlowp6WorkerE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIDnEE",
   "name" : "std::add_pointer<nullptr_t>",
   "referenced_type" : "_ZTINSt3__111add_pointerIDnEE",
   "self_type" : "_ZTINSt3__111add_pointerIDnEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN3ruy7ContextENS_14default_deleteIS3_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<ruy::Context *, std::default_delete<ruy::Context>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN3ruy7ContextENS_14default_deleteIS3_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN3ruy7ContextENS_14default_deleteIS3_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPN3ruy7ContextENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN6tflite28TfLiteInternalBackendContextENS_14default_deleteIS3_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<tflite::TfLiteInternalBackendContext *, std::default_delete<tflite::TfLiteInternalBackendContext>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN6tflite28TfLiteInternalBackendContextENS_14default_deleteIS3_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN6tflite28TfLiteInternalBackendContextENS_14default_deleteIS3_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPN6tflite28TfLiteInternalBackendContextENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN8gemmlowp11GemmContextENS_14default_deleteIS3_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<gemmlowp::GemmContext *, std::default_delete<gemmlowp::GemmContext>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN8gemmlowp11GemmContextENS_14default_deleteIS3_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN8gemmlowp11GemmContextENS_14default_deleteIS3_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPN8gemmlowp11GemmContextENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPNS_15__thread_structENS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<std::__thread_struct *, std::default_delete<std::__thread_struct>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPNS_15__thread_structENS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPNS_15__thread_structENS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPNS_15__thread_structENS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPPN8gemmlowp6WorkerENS_9allocatorIS4_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<gemmlowp::Worker **, std::allocator<gemmlowp::Worker *>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPPN8gemmlowp6WorkerENS_9allocatorIS4_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPPN8gemmlowp6WorkerENS_9allocatorIS4_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPPN8gemmlowp6WorkerENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN3ruy7ContextEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<ruy::Context>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN3ruy7ContextEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN3ruy7ContextEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIN3ruy7ContextEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<tflite::TfLiteInternalBackendContext>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN8gemmlowp11GemmContextEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<gemmlowp::GemmContext>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN8gemmlowp11GemmContextEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN8gemmlowp11GemmContextEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIN8gemmlowp11GemmContextEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteINS_15__thread_structEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<std::__thread_struct>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteINS_15__thread_structEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteINS_15__thread_structEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteINS_15__thread_structEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<gemmlowp::Worker *>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN3ruy7ContextELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<ruy::Context *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN3ruy7ContextELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN3ruy7ContextELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPN3ruy7ContextELi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN6tflite28TfLiteInternalBackendContextELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<tflite::TfLiteInternalBackendContext *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN6tflite28TfLiteInternalBackendContextELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN6tflite28TfLiteInternalBackendContextELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPN6tflite28TfLiteInternalBackendContextELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN8gemmlowp11GemmContextELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<gemmlowp::GemmContext *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN8gemmlowp11GemmContextELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN8gemmlowp11GemmContextELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPN8gemmlowp11GemmContextELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPNS_15__thread_structELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::__thread_struct *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPNS_15__thread_structELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPNS_15__thread_structELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPNS_15__thread_structELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPPN8gemmlowp6WorkerELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<gemmlowp::Worker **, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPPN8gemmlowp6WorkerELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPPN8gemmlowp6WorkerELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPPN8gemmlowp6WorkerELi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIRNS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<gemmlowp::Worker *> &, 1, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIRNS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIRNS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIRNS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIN8gemmlowp32OutputStageSaturatingCastToUint8EEE",
   "name" : "std::add_pointer<gemmlowp::OutputStageSaturatingCastToUint8>",
   "referenced_type" : "_ZTINSt3__111add_pointerIN8gemmlowp32OutputStageSaturatingCastToUint8EEE",
   "self_type" : "_ZTINSt3__111add_pointerIN8gemmlowp32OutputStageSaturatingCastToUint8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN8gemmlowp32OutputStageSaturatingCastToUint8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleEEE",
   "name" : "std::add_pointer<gemmlowp::OutputStageQuantizeDownInt32ToUint8Scale>",
   "referenced_type" : "_ZTINSt3__111add_pointerIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleEEE",
   "self_type" : "_ZTINSt3__111add_pointerIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN8gemmlowp40OutputStageQuantizeDownInt32ToUint8ScaleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN3ruy7ContextEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<ruy::Context>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN3ruy7ContextEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN3ruy7ContextEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIN3ruy7ContextEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<tflite::TfLiteInternalBackendContext>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIN6tflite28TfLiteInternalBackendContextEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN8gemmlowp11GemmContextEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<gemmlowp::GemmContext>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN8gemmlowp11GemmContextEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN8gemmlowp11GemmContextEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIN8gemmlowp11GemmContextEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteINS_15__thread_structEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<std::__thread_struct>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteINS_15__thread_structEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteINS_15__thread_structEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteINS_15__thread_structEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<gemmlowp::Worker *>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIPN8gemmlowp6WorkerEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
