#ifndef HIDL_GENERATED_ANDROID_HARDWARE_THERMAL_V2_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_THERMAL_V2_0_TYPES_H

#include <android/hardware/thermal/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace thermal {
namespace V2_0 {

// Forward declaration for forward reference support:
enum class TemperatureType : int32_t;
enum class CoolingType : uint32_t;
enum class ThrottlingSeverity : uint32_t;
struct TemperatureThreshold;
struct Temperature;
struct CoolingDevice;

/**
 * Device temperature types
 */
enum class TemperatureType : int32_t {
    UNKNOWN = -1 /* -1 */,
    CPU = 0,
    GPU = 1,
    BATTERY = 2,
    SKIN = 3,
    USB_PORT = 4,
    POWER_AMPLIFIER = 5,
    /**
     * Battery Charge Limit - virtual thermal sensors
     */
    BCL_VOLTAGE = 6,
    BCL_CURRENT = 7,
    BCL_PERCENTAGE = 8,
    /**
     * Neural Processing Unit
     */
    NPU = 9,
};

/**
 * Device cooling device types
 */
enum class CoolingType : uint32_t {
    FAN = 0u,
    BATTERY = 1u /* ::android::hardware::thermal::V2_0::CoolingType.FAN implicitly + 1 */,
    CPU = 2u /* ::android::hardware::thermal::V2_0::CoolingType.BATTERY implicitly + 1 */,
    GPU = 3u /* ::android::hardware::thermal::V2_0::CoolingType.CPU implicitly + 1 */,
    MODEM = 4u /* ::android::hardware::thermal::V2_0::CoolingType.GPU implicitly + 1 */,
    NPU = 5u /* ::android::hardware::thermal::V2_0::CoolingType.MODEM implicitly + 1 */,
    COMPONENT = 6u /* ::android::hardware::thermal::V2_0::CoolingType.NPU implicitly + 1 */,
};

/**
 * Device throttling severity
 */
enum class ThrottlingSeverity : uint32_t {
    /**
     * Not under throttling.
     */
    NONE = 0u,
    /**
     * Light throttling where UX is not impacted.
     */
    LIGHT = 1u /* ::android::hardware::thermal::V2_0::ThrottlingSeverity.NONE implicitly + 1 */,
    /**
     * Moderate throttling where UX is not largely impacted.
     */
    MODERATE = 2u /* ::android::hardware::thermal::V2_0::ThrottlingSeverity.LIGHT implicitly + 1 */,
    /**
     * Severe throttling where UX is largely impacted.
     * Similar to 1.0 throttlingThreshold.
     */
    SEVERE = 3u /* ::android::hardware::thermal::V2_0::ThrottlingSeverity.MODERATE implicitly + 1 */,
    /**
     * Platform has done everything to reduce power.
     */
    CRITICAL = 4u /* ::android::hardware::thermal::V2_0::ThrottlingSeverity.SEVERE implicitly + 1 */,
    /**
     * Key components in platform are shutting down due to thermal condition.
     * Device functionalities will be limited.
     */
    EMERGENCY = 5u /* ::android::hardware::thermal::V2_0::ThrottlingSeverity.CRITICAL implicitly + 1 */,
    /**
     * Need shutdown immediately.
     */
    SHUTDOWN = 6u /* ::android::hardware::thermal::V2_0::ThrottlingSeverity.EMERGENCY implicitly + 1 */,
};

struct TemperatureThreshold final {
    /**
     * This temperature's type.
     */
    ::android::hardware::thermal::V2_0::TemperatureType type __attribute__ ((aligned(4)));
    /**
     * Name of this temperature matching the Temperature struct.
     * All temperatures of the same "type" must have a different "name",
     * e.g., cpu0, battery. Clients use it to match Temperature struct.
     */
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    /**
     * Hot throttling temperature constant for this temperature sensor in
     * level defined in ThrottlingSeverity including shutdown. Throttling
     * happens when temperature >= threshold. If not available, set to NAN.
     * Unit is same as Temperature's value.
     */
    ::android::hardware::hidl_array<float, 7 /* ThrottlingSeverity#len */> hotThrottlingThresholds __attribute__ ((aligned(4)));
    /**
     * Cold throttling temperature constant for this temperature sensor in
     * level defined in ThrottlingSeverity including shutdown. Throttling
     * happens when temperature <= threshold. If not available, set to NAN.
     * Unit is same as Temperature's value.
     */
    ::android::hardware::hidl_array<float, 7 /* ThrottlingSeverity#len */> coldThrottlingThresholds __attribute__ ((aligned(4)));
    /**
     * Threshold temperature above which the VR mode clockrate minimums cannot
     * be maintained for this device. If not available, set by HAL to NAN.
     * Unit is same as Temperature's value.
     */
    float vrThrottlingThreshold __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::thermal::V2_0::TemperatureThreshold, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::thermal::V2_0::TemperatureThreshold, name) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::thermal::V2_0::TemperatureThreshold, hotThrottlingThresholds) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::thermal::V2_0::TemperatureThreshold, coldThrottlingThresholds) == 52, "wrong offset");
static_assert(offsetof(::android::hardware::thermal::V2_0::TemperatureThreshold, vrThrottlingThreshold) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::thermal::V2_0::TemperatureThreshold) == 88, "wrong size");
static_assert(__alignof(::android::hardware::thermal::V2_0::TemperatureThreshold) == 8, "wrong alignment");

struct Temperature final {
    /**
     * This temperature's type.
     */
    ::android::hardware::thermal::V2_0::TemperatureType type __attribute__ ((aligned(4)));
    /**
     * Name of this temperature matching the TemperatureThreshold.
     * All temperatures of the same "type" must have a different "name",
     * e.g., cpu0, battery. Clients use it to match with TemperatureThreshold
     * struct.
     */
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    /**
     * For BCL, this is the current reading of the virtual sensor and the unit is
     * millivolt, milliamp, percentage for BCL_VOLTAGE, BCL_CURRENT and BCL_PERCENTAGE
     * respectively. For everything else, this is the current temperature in Celsius.
     * If not available set by HAL to NAN.
     */
    float value __attribute__ ((aligned(4)));
    /**
     * The current throttling level of the sensor.
     */
    ::android::hardware::thermal::V2_0::ThrottlingSeverity throttlingStatus __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::thermal::V2_0::Temperature, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::thermal::V2_0::Temperature, name) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::thermal::V2_0::Temperature, value) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::thermal::V2_0::Temperature, throttlingStatus) == 28, "wrong offset");
static_assert(sizeof(::android::hardware::thermal::V2_0::Temperature) == 32, "wrong size");
static_assert(__alignof(::android::hardware::thermal::V2_0::Temperature) == 8, "wrong alignment");

struct CoolingDevice final {
    /**
     * This cooling device type, CPU, GPU, BATTERY, and etc.
     */
    ::android::hardware::thermal::V2_0::CoolingType type __attribute__ ((aligned(4)));
    /**
     * Name of this cooling device.
     * All cooling devices of the same "type" must have a different "name".
     * The name is usually defined in kernel device tree, and this is for client
     * logging purpose.
     */
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    /**
     * Current throttle state of the cooling device. The value can any unsigned integer
     * numbers between 0 and max_state defined in its driver, usually representing the
     * associated device's power state. 0 means device is not in throttling, higher value
     * means deeper throttling.
     */
    uint64_t value __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::thermal::V2_0::CoolingDevice, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::thermal::V2_0::CoolingDevice, name) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::thermal::V2_0::CoolingDevice, value) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::thermal::V2_0::CoolingDevice) == 32, "wrong size");
static_assert(__alignof(::android::hardware::thermal::V2_0::CoolingDevice) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::thermal::V2_0::TemperatureType o);
static inline void PrintTo(::android::hardware::thermal::V2_0::TemperatureType o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::thermal::V2_0::TemperatureType lhs, const ::android::hardware::thermal::V2_0::TemperatureType rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::thermal::V2_0::TemperatureType rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::thermal::V2_0::TemperatureType lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
