{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_h",
   "name" : "unsigned char [128]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA128_h",
   "size" : 128,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",
   "name" : "unsigned char [16]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA16_h",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA20_h",
   "name" : "unsigned char [20]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA20_h",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA2_j",
   "name" : "unsigned int [2]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA2_j",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA32_h",
   "name" : "unsigned char [32]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA32_h",
   "size" : 32,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA48_h",
   "name" : "unsigned char [48]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA48_h",
   "size" : 48,
   "source_file" : "external/boringssl/src/include/openssl/base64.h"
  },
  {

   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/buf.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK11evp_aead_st",
   "name" : "const evp_aead_st",
   "referenced_type" : "_ZTI11evp_aead_st",
   "self_type" : "_ZTIK11evp_aead_st",
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK12ASN1_ITEM_st",
   "name" : "const ASN1_ITEM_st",
   "referenced_type" : "_ZTI12ASN1_ITEM_st",
   "self_type" : "_ZTIK12ASN1_ITEM_st",
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13bio_method_st",
   "name" : "const bio_method_st",
   "referenced_type" : "_ZTI13bio_method_st",
   "self_type" : "_ZTIK13bio_method_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13evp_cipher_st",
   "name" : "const evp_cipher_st",
   "referenced_type" : "_ZTI13evp_cipher_st",
   "self_type" : "_ZTIK13evp_cipher_st",
   "size" : 44,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13v3_ext_method",
   "name" : "const v3_ext_method",
   "referenced_type" : "_ZTI13v3_ext_method",
   "self_type" : "_ZTIK13v3_ext_method",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK15evp_md_pctx_ops",
   "name" : "const evp_md_pctx_ops",
   "referenced_type" : "_ZTI15evp_md_pctx_ops",
   "self_type" : "_ZTIK15evp_md_pctx_ops",
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK15x509_purpose_st",
   "name" : "const x509_purpose_st",
   "referenced_type" : "_ZTI15x509_purpose_st",
   "self_type" : "_ZTIK15x509_purpose_st",
   "size" : 28,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK18x509_crl_method_st",
   "name" : "const x509_crl_method_st",
   "referenced_type" : "_ZTI18x509_crl_method_st",
   "self_type" : "_ZTIK18x509_crl_method_st",
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK21X509V3_CONF_METHOD_st",
   "name" : "const X509V3_CONF_METHOD_st",
   "referenced_type" : "_ZTI21X509V3_CONF_METHOD_st",
   "self_type" : "_ZTIK21X509V3_CONF_METHOD_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK23evp_pkey_asn1_method_st",
   "name" : "const evp_pkey_asn1_method_st",
   "referenced_type" : "_ZTI23evp_pkey_asn1_method_st",
   "self_type" : "_ZTIK23evp_pkey_asn1_method_st",
   "source_file" : "external/boringssl/src/include/openssl/evp.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK6rsa_st",
   "name" : "const rsa_st",
   "referenced_type" : "_ZTI6rsa_st",
   "self_type" : "_ZTIK6rsa_st",
   "size" : 160,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7x509_st",
   "name" : "const x509_st",
   "referenced_type" : "_ZTI7x509_st",
   "self_type" : "_ZTIK7x509_st",
   "size" : 152,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK9ec_key_st",
   "name" : "const ec_key_st",
   "referenced_type" : "_ZTI9ec_key_st",
   "self_type" : "_ZTIK9ec_key_st",
   "source_file" : "external/boringssl/src/include/openssl/ec_key.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK9env_md_st",
   "name" : "const env_md_st",
   "referenced_type" : "_ZTI9env_md_st",
   "self_type" : "_ZTIK9env_md_st",
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "s",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9bignum_st"
    }
   ],
   "linker_set_key" : "_ZTI10DSA_SIG_st",
   "name" : "DSA_SIG_st",
   "referenced_type" : "_ZTI10DSA_SIG_st",
   "self_type" : "_ZTI10DSA_SIG_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/dsa.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "length",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "max",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10buf_mem_st",
   "name" : "buf_mem_st",
   "referenced_type" : "_ZTI10buf_mem_st",
   "self_type" : "_ZTI10buf_mem_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/buf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "issuer_cert",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7x509_st"
    },
    {
     "field_name" : "subject_cert",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP7x509_st"
    },
    {
     "field_name" : "subject_req",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP11X509_req_st"
    },
    {
     "field_name" : "crl",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP11X509_crl_st"
    },
    {
     "field_name" : "db_meth",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPK21X509V3_CONF_METHOD_st"
    },
    {
     "field_name" : "db",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI10v3_ext_ctx",
   "name" : "v3_ext_ctx",
   "referenced_type" : "_ZTI10v3_ext_ctx",
   "self_type" : "_ZTI10v3_ext_ctx",
   "size" : 28,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "crl",
     "referenced_type" : "_ZTIP16X509_crl_info_st"
    },
    {
     "field_name" : "sig_alg",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13X509_algor_st"
    },
    {
     "field_name" : "signature",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "references",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "akid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP18AUTHORITY_KEYID_st"
    },
    {
     "field_name" : "idp",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP21ISSUING_DIST_POINT_st"
    },
    {
     "field_name" : "idp_flags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "idp_reasons",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "crl_number",
     "field_offset" : 288,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "base_crl_number",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "sha1_hash",
     "field_offset" : 352,
     "referenced_type" : "_ZTIA20_h"
    },
    {
     "field_name" : "issuers",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP22stack_st_GENERAL_NAMES"
    },
    {
     "field_name" : "meth",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPK18x509_crl_method_st"
    },
    {
     "field_name" : "meth_data",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI11X509_crl_st",
   "name" : "X509_crl_st",
   "referenced_type" : "_ZTI11X509_crl_st",
   "self_type" : "_ZTI11X509_crl_st",
   "size" : 76,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "req_info",
     "referenced_type" : "_ZTIP16X509_req_info_st"
    },
    {
     "field_name" : "sig_alg",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13X509_algor_st"
    },
    {
     "field_name" : "signature",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "references",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11X509_req_st",
   "name" : "X509_req_st",
   "referenced_type" : "_ZTI11X509_req_st",
   "self_type" : "_ZTI11X509_req_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "algor",
     "referenced_type" : "_ZTIP13X509_algor_st"
    },
    {
     "field_name" : "digest",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI11X509_sig_st",
   "name" : "X509_sig_st",
   "referenced_type" : "_ZTI11X509_sig_st",
   "self_type" : "_ZTI11X509_sig_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "notBefore",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "notAfter",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI11X509_val_st",
   "name" : "X509_val_st",
   "referenced_type" : "_ZTI11X509_val_st",
   "self_type" : "_ZTI11X509_val_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arg",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "callback",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiiiP11bn_gencb_stE"
    }
   ],
   "linker_set_key" : "_ZTI11bn_gencb_st",
   "name" : "bn_gencb_st",
   "referenced_type" : "_ZTI11bn_gencb_st",
   "self_type" : "_ZTI11bn_gencb_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11evp_pkey_stUt_E"
    },
    {
     "field_name" : "ameth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK23evp_pkey_asn1_method_st"
    }
   ],
   "linker_set_key" : "_ZTI11evp_pkey_st",
   "name" : "evp_pkey_st",
   "referenced_type" : "_ZTI11evp_pkey_st",
   "self_type" : "_ZTI11evp_pkey_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/evp.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "alias",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI11obj_name_st",
   "name" : "obj_name_st",
   "referenced_type" : "_ZTI11obj_name_st",
   "self_type" : "_ZTI11obj_name_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/obj.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI24openssl_method_common_st"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "init",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP6rsa_stE"
    },
    {
     "field_name" : "finish",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP6rsa_stE"
    },
    {
     "field_name" : "size",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPK6rsa_stE"
    },
    {
     "field_name" : "sign",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiiPKhjPhPjPK6rsa_stE"
    },
    {
     "field_name" : "sign_raw",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP6rsa_stPjPhjPKhjiE"
    },
    {
     "field_name" : "decrypt",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP6rsa_stPjPhjPKhjiE"
    },
    {
     "field_name" : "private_transform",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFiP6rsa_stPhPKhjE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11rsa_meth_st",
   "name" : "rsa_meth_st",
   "referenced_type" : "_ZTI11rsa_meth_st",
   "self_type" : "_ZTI11rsa_meth_st",
   "size" : 44,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "organization",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "noticenos",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP21stack_st_ASN1_INTEGER"
    }
   ],
   "linker_set_key" : "_ZTI12NOTICEREF_st",
   "name" : "NOTICEREF_st",
   "referenced_type" : "_ZTI12NOTICEREF_st",
   "self_type" : "_ZTI12NOTICEREF_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cert",
     "referenced_type" : "_ZTIP13stack_st_X509"
    },
    {
     "field_name" : "crl",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP17stack_st_X509_CRL"
    }
   ],
   "linker_set_key" : "_ZTI12PKCS7_SIGNED",
   "name" : "PKCS7_SIGNED",
   "referenced_type" : "_ZTI12PKCS7_SIGNED",
   "self_type" : "_ZTI12PKCS7_SIGNED",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/pkcs7.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x509",
     "referenced_type" : "_ZTIP7x509_st"
    },
    {
     "field_name" : "crl",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP11X509_crl_st"
    },
    {
     "field_name" : "x_pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14private_key_st"
    },
    {
     "field_name" : "enc_cipher",
     "field_offset" : 96,
     "referenced_type" : "_ZTI18evp_cipher_info_st"
    },
    {
     "field_name" : "enc_len",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "enc_data",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI12X509_info_st",
   "name" : "X509_info_st",
   "referenced_type" : "_ZTI12X509_info_st",
   "self_type" : "_ZTI12X509_info_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "entries",
     "referenced_type" : "_ZTIP24stack_st_X509_NAME_ENTRY"
    },
    {
     "field_name" : "modified",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP10buf_mem_st"
    },
    {
     "field_name" : "canon_enc",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "canon_enclen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI12X509_name_st",
   "name" : "X509_name_st",
   "referenced_type" : "_ZTI12X509_name_st",
   "self_type" : "_ZTI12X509_name_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN12asn1_type_stUt_E"
    }
   ],
   "linker_set_key" : "_ZTI12asn1_type_st",
   "name" : "asn1_type_st",
   "referenced_type" : "_ZTI12asn1_type_st",
   "self_type" : "_ZTI12asn1_type_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "s",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9bignum_st"
    }
   ],
   "linker_set_key" : "_ZTI12ecdsa_sig_st",
   "name" : "ecdsa_sig_st",
   "referenced_type" : "_ZTI12ecdsa_sig_st",
   "self_type" : "_ZTI12ecdsa_sig_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/ecdsa.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type_id",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP12asn1_type_st"
    }
   ],
   "linker_set_key" : "_ZTI12otherName_st",
   "name" : "otherName_st",
   "referenced_type" : "_ZTI12otherName_st",
   "self_type" : "_ZTI12otherName_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN12sha_state_stUt_E"
    },
    {
     "field_name" : "Nl",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Nh",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA64_h"
    },
    {
     "field_name" : "num",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12sha_state_st",
   "name" : "sha_state_st",
   "referenced_type" : "_ZTI12sha_state_st",
   "self_type" : "_ZTI12sha_state_st",
   "size" : 96,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "serialNumber",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "signature",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP13X509_algor_st"
    },
    {
     "field_name" : "issuer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP12X509_name_st"
    },
    {
     "field_name" : "validity",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP11X509_val_st"
    },
    {
     "field_name" : "subject",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP12X509_name_st"
    },
    {
     "field_name" : "key",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP14X509_pubkey_st"
    },
    {
     "field_name" : "issuerUID",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "subjectUID",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "extensions",
     "field_offset" : 288,
     "referenced_type" : "_ZTIP23stack_st_X509_EXTENSION"
    },
    {
     "field_name" : "enc",
     "field_offset" : 320,
     "referenced_type" : "_ZTI16ASN1_ENCODING_st"
    }
   ],
   "linker_set_key" : "_ZTI12x509_cinf_st",
   "name" : "x509_cinf_st",
   "referenced_type" : "_ZTI12x509_cinf_st",
   "self_type" : "_ZTI12x509_cinf_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "distpoint",
     "referenced_type" : "_ZTIP18DIST_POINT_NAME_st"
    },
    {
     "field_name" : "reasons",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "CRLissuer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP21stack_st_GENERAL_NAME"
    },
    {
     "field_name" : "dp_reasons",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI13DIST_POINT_st",
   "name" : "DIST_POINT_st",
   "referenced_type" : "_ZTI13DIST_POINT_st",
   "self_type" : "_ZTI13DIST_POINT_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "policyid",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "qualifiers",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP23stack_st_POLICYQUALINFO"
    }
   ],
   "linker_set_key" : "_ZTI13POLICYINFO_st",
   "name" : "POLICYINFO_st",
   "referenced_type" : "_ZTI13POLICYINFO_st",
   "self_type" : "_ZTI13POLICYINFO_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "noticeref",
     "referenced_type" : "_ZTIP12NOTICEREF_st"
    },
    {
     "field_name" : "exptext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI13USERNOTICE_st",
   "name" : "USERNOTICE_st",
   "referenced_type" : "_ZTI13USERNOTICE_st",
   "self_type" : "_ZTI13USERNOTICE_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "parameter",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP12asn1_type_st"
    }
   ],
   "linker_set_key" : "_ZTI13X509_algor_st",
   "name" : "X509_algor_st",
   "referenced_type" : "_ZTI13X509_algor_st",
   "self_type" : "_ZTI13X509_algor_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "bwrite",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiP6bio_stPKciE"
    },
    {
     "field_name" : "bread",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP6bio_stPciE"
    },
    {
     "field_name" : "bputs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP6bio_stPKcE"
    },
    {
     "field_name" : "bgets",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiP6bio_stPciE"
    },
    {
     "field_name" : "ctrl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFlP6bio_stilPvE"
    },
    {
     "field_name" : "create",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP6bio_stE"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP6bio_stE"
    },
    {
     "field_name" : "callback_ctrl",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFlP6bio_stiPFlS0_iPKcillEE"
    }
   ],
   "linker_set_key" : "_ZTI13bio_method_st",
   "name" : "bio_method_st",
   "referenced_type" : "_ZTI13bio_method_st",
   "self_type" : "_ZTI13bio_method_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cap",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "can_resize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "error",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI13cbb_buffer_st",
   "name" : "cbb_buffer_st",
   "referenced_type" : "_ZTI13cbb_buffer_st",
   "self_type" : "_ZTI13cbb_buffer_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "section",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI13conf_value_st",
   "name" : "conf_value_st",
   "referenced_type" : "_ZTI13conf_value_st",
   "self_type" : "_ZTI13conf_value_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/conf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "digest",
     "referenced_type" : "_ZTIPK9env_md_st"
    },
    {
     "field_name" : "md_data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pctx",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15evp_pkey_ctx_st"
    },
    {
     "field_name" : "pctx_ops",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK15evp_md_pctx_ops"
    }
   ],
   "linker_set_key" : "_ZTI13env_md_ctx_st",
   "name" : "env_md_ctx_st",
   "referenced_type" : "_ZTI13env_md_ctx_st",
   "self_type" : "_ZTI13env_md_ctx_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "block_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "key_len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "iv_len",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ctx_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "init",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP17evp_cipher_ctx_stPKhS2_iE"
    },
    {
     "field_name" : "cipher",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP17evp_cipher_ctx_stPhPKhjE"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFvP17evp_cipher_ctx_stE"
    },
    {
     "field_name" : "ctrl",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP17evp_cipher_ctx_stiiPvE"
    }
   ],
   "linker_set_key" : "_ZTI13evp_cipher_st",
   "name" : "evp_cipher_st",
   "referenced_type" : "_ZTI13evp_cipher_st",
   "self_type" : "_ZTI13evp_cipher_st",
   "size" : 44,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "next",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13lhash_item_st"
    },
    {
     "field_name" : "hash",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13lhash_item_st",
   "name" : "lhash_item_st",
   "referenced_type" : "_ZTI13lhash_item_st",
   "self_type" : "_ZTI13lhash_item_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/lhash.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ext_nid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ext_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "it",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
    },
    {
     "field_name" : "ext_new",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFPvvE"
    },
    {
     "field_name" : "ext_free",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "d2i",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFPvS_PPKhlE"
    },
    {
     "field_name" : "i2d",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPvPPhE"
    },
    {
     "field_name" : "i2s",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFPcPK13v3_ext_methodPvE"
    },
    {
     "field_name" : "s2i",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFPvPK13v3_ext_methodP10v3_ext_ctxPKcE"
    },
    {
     "field_name" : "i2v",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFP19stack_st_CONF_VALUEPK13v3_ext_methodPvS0_E"
    },
    {
     "field_name" : "v2i",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFPvPK13v3_ext_methodP10v3_ext_ctxP19stack_st_CONF_VALUEE"
    },
    {
     "field_name" : "i2r",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFiPK13v3_ext_methodPvP6bio_stiE"
    },
    {
     "field_name" : "r2i",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFPvPK13v3_ext_methodP10v3_ext_ctxPKcE"
    },
    {
     "field_name" : "usr_data",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI13v3_ext_method",
   "name" : "v3_ext_method",
   "referenced_type" : "_ZTI13v3_ext_method",
   "self_type" : "_ZTI13v3_ext_method",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cache",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "objs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP20stack_st_X509_OBJECT"
    },
    {
     "field_name" : "objs_lock",
     "field_offset" : 64,
     "referenced_type" : "_ZTI15crypto_mutex_st"
    },
    {
     "field_name" : "additional_untrusted",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP13stack_st_X509"
    },
    {
     "field_name" : "get_cert_methods",
     "field_offset" : 544,
     "referenced_type" : "_ZTIP20stack_st_X509_LOOKUP"
    },
    {
     "field_name" : "param",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP20X509_VERIFY_PARAM_st"
    },
    {
     "field_name" : "verify",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stE"
    },
    {
     "field_name" : "verify_cb",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFiiP17x509_store_ctx_stE"
    },
    {
     "field_name" : "get_issuer",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPFiPP7x509_stP17x509_store_ctx_stS0_E"
    },
    {
     "field_name" : "check_issued",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stP7x509_stS2_E"
    },
    {
     "field_name" : "check_revocation",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stE"
    },
    {
     "field_name" : "get_crl",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stPP11X509_crl_stP7x509_stE"
    },
    {
     "field_name" : "check_crl",
     "field_offset" : 800,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stP11X509_crl_stE"
    },
    {
     "field_name" : "cert_crl",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stP11X509_crl_stP7x509_stE"
    },
    {
     "field_name" : "lookup_certs",
     "field_offset" : 864,
     "referenced_type" : "_ZTIPFP13stack_st_X509P17x509_store_ctx_stP12X509_name_stE"
    },
    {
     "field_name" : "lookup_crls",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFP17stack_st_X509_CRLP17x509_store_ctx_stP12X509_name_stE"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 928,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stE"
    },
    {
     "field_name" : "references",
     "field_offset" : 960,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13x509_store_st",
   "name" : "x509_store_st",
   "referenced_type" : "_ZTI13x509_store_st",
   "self_type" : "_ZTI13x509_store_st",
   "size" : 128,
   "source_file" : "external/boringssl/src/include/openssl/x509_vfy.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trust",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "check_trust",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiP13x509_trust_stP7x509_stiE"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "arg1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "arg2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI13x509_trust_st",
   "name" : "x509_trust_st",
   "referenced_type" : "_ZTI13x509_trust_st",
   "self_type" : "_ZTI13x509_trust_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
    }
   ],
   "linker_set_key" : "_ZTI14CRYPTO_dynlock",
   "name" : "CRYPTO_dynlock",
   "referenced_type" : "_ZTI14CRYPTO_dynlock",
   "self_type" : "_ZTI14CRYPTO_dynlock",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "algor",
     "referenced_type" : "_ZTIP13X509_algor_st"
    },
    {
     "field_name" : "public_key",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP11evp_pkey_st"
    }
   ],
   "linker_set_key" : "_ZTI14X509_pubkey_st",
   "name" : "X509_pubkey_st",
   "referenced_type" : "_ZTI14X509_pubkey_st",
   "self_type" : "_ZTI14X509_pubkey_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sn",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "ln",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "nid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "length",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14asn1_object_st",
   "name" : "asn1_object_st",
   "referenced_type" : "_ZTI14asn1_object_st",
   "self_type" : "_ZTI14asn1_object_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "length",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI14asn1_string_st",
   "name" : "asn1_string_st",
   "referenced_type" : "_ZTI14asn1_string_st",
   "self_type" : "_ZTI14asn1_string_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "RR",
     "referenced_type" : "_ZTI9bignum_st"
    },
    {
     "field_name" : "N",
     "field_offset" : 160,
     "referenced_type" : "_ZTI9bignum_st"
    },
    {
     "field_name" : "n0",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA2_j"
    }
   ],
   "linker_set_key" : "_ZTI14bn_mont_ctx_st",
   "name" : "bn_mont_ctx_st",
   "referenced_type" : "_ZTI14bn_mont_ctx_st",
   "self_type" : "_ZTI14bn_mont_ctx_st",
   "size" : 48,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "enc_algor",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13X509_algor_st"
    },
    {
     "field_name" : "enc_pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "dec_pkey",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP11evp_pkey_st"
    },
    {
     "field_name" : "key_length",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "key_data",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "key_free",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cipher",
     "field_offset" : 224,
     "referenced_type" : "_ZTI18evp_cipher_info_st"
    }
   ],
   "linker_set_key" : "_ZTI14private_key_st",
   "name" : "private_key_st",
   "referenced_type" : "_ZTI14private_key_st",
   "self_type" : "_ZTI14private_key_st",
   "size" : 48,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "skip",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "method",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP21x509_lookup_method_st"
    },
    {
     "field_name" : "method_data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "store_ctx",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP13x509_store_st"
    }
   ],
   "linker_set_key" : "_ZTI14x509_lookup_st",
   "name" : "x509_lookup_st",
   "referenced_type" : "_ZTI14x509_lookup_st",
   "self_type" : "_ZTI14x509_lookup_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/x509_vfy.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN14x509_object_stUt_E"
    }
   ],
   "linker_set_key" : "_ZTI14x509_object_st",
   "name" : "x509_object_st",
   "referenced_type" : "_ZTI14x509_object_st",
   "self_type" : "_ZTI14x509_object_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509_vfy.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nameAssigner",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "partyName",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI15EDIPartyName_st",
   "name" : "EDIPartyName_st",
   "referenced_type" : "_ZTI15EDIPartyName_st",
   "self_type" : "_ZTI15EDIPartyName_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "d",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN15GENERAL_NAME_stUt_E"
    }
   ],
   "linker_set_key" : "_ZTI15GENERAL_NAME_st",
   "name" : "GENERAL_NAME_st",
   "referenced_type" : "_ZTI15GENERAL_NAME_st",
   "self_type" : "_ZTI15GENERAL_NAME_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "policyLanguage",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "policy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI15PROXY_POLICY_st",
   "name" : "PROXY_POLICY_st",
   "referenced_type" : "_ZTI15PROXY_POLICY_st",
   "self_type" : "_ZTI15PROXY_POLICY_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTIA56_h"
    }
   ],
   "linker_set_key" : "_ZTI15crypto_mutex_st",
   "name" : "crypto_mutex_st",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15crypto_mutex_st",
   "self_type" : "_ZTI15crypto_mutex_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI24openssl_method_common_st"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "init",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP9ec_key_stE"
    },
    {
     "field_name" : "finish",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP9ec_key_stE"
    },
    {
     "field_name" : "group_order_size",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPK9ec_key_stE"
    },
    {
     "field_name" : "sign",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPKhjPhPjP9ec_key_stE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI15ecdsa_method_st",
   "name" : "ecdsa_method_st",
   "referenced_type" : "_ZTI15ecdsa_method_st",
   "self_type" : "_ZTI15ecdsa_method_st",
   "size" : 32,
   "source_file" : "external/boringssl/src/include/openssl/ec_key.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "aead",
     "referenced_type" : "_ZTIPK11evp_aead_st"
    },
    {
     "field_name" : "state",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21evp_aead_ctx_st_state"
    },
    {
     "field_name" : "tag_len",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI15evp_aead_ctx_st",
   "name" : "evp_aead_ctx_st",
   "referenced_type" : "_ZTI15evp_aead_ctx_st",
   "self_type" : "_ZTI15evp_aead_ctx_st",
   "size" : 600,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h",
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "Nl",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Nh",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA64_h"
    },
    {
     "field_name" : "num",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "md_len",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15sha256_state_st",
   "name" : "sha256_state_st",
   "referenced_type" : "_ZTI15sha256_state_st",
   "self_type" : "_ZTI15sha256_state_st",
   "size" : 112,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "h",
     "referenced_type" : "_ZTIA8_y"
    },
    {
     "field_name" : "Nl",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "Nh",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "p",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "num",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "md_len",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15sha512_state_st",
   "name" : "sha512_state_st",
   "referenced_type" : "_ZTI15sha512_state_st",
   "self_type" : "_ZTI15sha512_state_st",
   "size" : 216,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "purpose",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "trust",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "check_purpose",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiPK15x509_purpose_stPK7x509_stiE"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "sname",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "usr_data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI15x509_purpose_st",
   "name" : "x509_purpose_st",
   "referenced_type" : "_ZTI15x509_purpose_st",
   "self_type" : "_ZTI15x509_purpose_st",
   "size" : 28,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "serialNumber",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "revocationDate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "extensions",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP23stack_st_X509_EXTENSION"
    },
    {
     "field_name" : "issuer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP21stack_st_GENERAL_NAME"
    },
    {
     "field_name" : "reason",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sequence",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI15x509_revoked_st",
   "name" : "x509_revoked_st",
   "referenced_type" : "_ZTI15x509_revoked_st",
   "self_type" : "_ZTI15x509_revoked_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "enc",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "modified",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "alias_only",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alias_only_on_next_parse",
     "field_offset" : 97,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16ASN1_ENCODING_st",
   "name" : "ASN1_ENCODING_st",
   "referenced_type" : "_ZTI16ASN1_ENCODING_st",
   "self_type" : "_ZTI16ASN1_ENCODING_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "comment",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI16EC_builtin_curve",
   "name" : "EC_builtin_curve",
   "referenced_type" : "_ZTI16EC_builtin_curve",
   "self_type" : "_ZTI16EC_builtin_curve",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/ec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "spkac",
     "referenced_type" : "_ZTIP17Netscape_spkac_st"
    },
    {
     "field_name" : "sig_algor",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13X509_algor_st"
    },
    {
     "field_name" : "signature",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI16Netscape_spki_st",
   "name" : "Netscape_spki_st",
   "referenced_type" : "_ZTI16Netscape_spki_st",
   "self_type" : "_ZTI16Netscape_spki_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "sig_alg",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13X509_algor_st"
    },
    {
     "field_name" : "issuer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12X509_name_st"
    },
    {
     "field_name" : "lastUpdate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "nextUpdate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "revoked",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP21stack_st_X509_REVOKED"
    },
    {
     "field_name" : "extensions",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP23stack_st_X509_EXTENSION"
    },
    {
     "field_name" : "enc",
     "field_offset" : 224,
     "referenced_type" : "_ZTI16ASN1_ENCODING_st"
    }
   ],
   "linker_set_key" : "_ZTI16X509_crl_info_st",
   "name" : "X509_crl_info_st",
   "referenced_type" : "_ZTI16X509_crl_info_st",
   "self_type" : "_ZTI16X509_crl_info_st",
   "size" : 44,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "enc",
     "referenced_type" : "_ZTI16ASN1_ENCODING_st"
    },
    {
     "field_name" : "version",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "subject",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP12X509_name_st"
    },
    {
     "field_name" : "pubkey",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP14X509_pubkey_st"
    },
    {
     "field_name" : "attributes",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP23stack_st_X509_ATTRIBUTE"
    }
   ],
   "linker_set_key" : "_ZTI16X509_req_info_st",
   "name" : "X509_req_info_st",
   "referenced_type" : "_ZTI16X509_req_info_st",
   "self_type" : "_ZTI16X509_req_info_st",
   "size" : 32,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trust",
     "referenced_type" : "_ZTIP20stack_st_ASN1_OBJECT"
    },
    {
     "field_name" : "reject",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP20stack_st_ASN1_OBJECT"
    },
    {
     "field_name" : "alias",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "keyid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "other",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP19stack_st_X509_ALGOR"
    }
   ],
   "linker_set_key" : "_ZTI16x509_cert_aux_st",
   "name" : "x509_cert_aux_st",
   "referenced_type" : "_ZTI16x509_cert_aux_st",
   "self_type" : "_ZTI16x509_cert_aux_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pubkey",
     "referenced_type" : "_ZTIP14X509_pubkey_st"
    },
    {
     "field_name" : "challenge",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI17Netscape_spkac_st",
   "name" : "Netscape_spkac_st",
   "referenced_type" : "_ZTI17Netscape_spkac_st",
   "self_type" : "_ZTI17Netscape_spkac_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pqualid",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "d",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN17POLICYQUALINFO_stUt_E"
    }
   ],
   "linker_set_key" : "_ZTI17POLICYQUALINFO_st",
   "name" : "POLICYQUALINFO_st",
   "referenced_type" : "_ZTI17POLICYQUALINFO_st",
   "self_type" : "_ZTI17POLICYQUALINFO_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "issuerDomainPolicy",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "subjectDomainPolicy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_object_st"
    }
   ],
   "linker_set_key" : "_ZTI17POLICY_MAPPING_st",
   "name" : "POLICY_MAPPING_st",
   "referenced_type" : "_ZTI17POLICY_MAPPING_st",
   "self_type" : "_ZTI17POLICY_MAPPING_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "object",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "critical",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI17X509_extension_st",
   "name" : "X509_extension_st",
   "referenced_type" : "_ZTI17X509_extension_st",
   "self_type" : "_ZTI17X509_extension_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sk",
     "referenced_type" : "_ZTIP13stack_st_void"
    }
   ],
   "linker_set_key" : "_ZTI17crypto_ex_data_st",
   "name" : "crypto_ex_data_st",
   "referenced_type" : "_ZTI17crypto_ex_data_st",
   "self_type" : "_ZTI17crypto_ex_data_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cipher",
     "referenced_type" : "_ZTIPK13evp_cipher_st"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cipher_data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "key_len",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "encrypt",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "oiv",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "iv",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "buf",
     "field_offset" : 448,
     "referenced_type" : "_ZTIA32_h"
    },
    {
     "field_name" : "buf_len",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "final_used",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "block_mask",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "final",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA32_h"
    }
   ],
   "linker_set_key" : "_ZTI17evp_cipher_ctx_st",
   "name" : "evp_cipher_ctx_st",
   "referenced_type" : "_ZTI17evp_cipher_ctx_st",
   "self_type" : "_ZTI17evp_cipher_ctx_st",
   "size" : 136,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data_used",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA48_h"
    },
    {
     "field_name" : "eof_seen",
     "field_offset" : 416,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "error_encountered",
     "field_offset" : 424,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI17evp_encode_ctx_st",
   "name" : "evp_encode_ctx_st",
   "referenced_type" : "_ZTI17evp_encode_ctx_st",
   "self_type" : "_ZTI17evp_encode_ctx_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/base64.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hashAlgorithm",
     "referenced_type" : "_ZTIP13X509_algor_st"
    },
    {
     "field_name" : "maskGenAlgorithm",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13X509_algor_st"
    },
    {
     "field_name" : "saltLength",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "trailerField",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI17rsa_pss_params_st",
   "name" : "rsa_pss_params_st",
   "referenced_type" : "_ZTI17rsa_pss_params_st",
   "self_type" : "_ZTI17rsa_pss_params_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ctx",
     "referenced_type" : "_ZTIP13x509_store_st"
    },
    {
     "field_name" : "cert",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7x509_st"
    },
    {
     "field_name" : "untrusted",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP13stack_st_X509"
    },
    {
     "field_name" : "crls",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP17stack_st_X509_CRL"
    },
    {
     "field_name" : "param",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP20X509_VERIFY_PARAM_st"
    },
    {
     "field_name" : "other_ctx",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "verify",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stE"
    },
    {
     "field_name" : "verify_cb",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiiP17x509_store_ctx_stE"
    },
    {
     "field_name" : "get_issuer",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiPP7x509_stP17x509_store_ctx_stS0_E"
    },
    {
     "field_name" : "check_issued",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stP7x509_stS2_E"
    },
    {
     "field_name" : "check_revocation",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stE"
    },
    {
     "field_name" : "get_crl",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stPP11X509_crl_stP7x509_stE"
    },
    {
     "field_name" : "check_crl",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stP11X509_crl_stE"
    },
    {
     "field_name" : "cert_crl",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stP11X509_crl_stP7x509_stE"
    },
    {
     "field_name" : "check_policy",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stE"
    },
    {
     "field_name" : "lookup_certs",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFP13stack_st_X509P17x509_store_ctx_stP12X509_name_stE"
    },
    {
     "field_name" : "lookup_crls",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFP17stack_st_X509_CRLP17x509_store_ctx_stP12X509_name_stE"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFiP17x509_store_ctx_stE"
    },
    {
     "field_name" : "valid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "last_untrusted",
     "field_offset" : 608,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "chain",
     "field_offset" : 640,
     "referenced_type" : "_ZTIP13stack_st_X509"
    },
    {
     "field_name" : "tree",
     "field_offset" : 672,
     "referenced_type" : "_ZTIP19X509_POLICY_TREE_st"
    },
    {
     "field_name" : "explicit_policy",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "error_depth",
     "field_offset" : 736,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "error",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "current_cert",
     "field_offset" : 800,
     "referenced_type" : "_ZTIP7x509_st"
    },
    {
     "field_name" : "current_issuer",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP7x509_st"
    },
    {
     "field_name" : "current_crl",
     "field_offset" : 864,
     "referenced_type" : "_ZTIP11X509_crl_st"
    },
    {
     "field_name" : "current_crl_score",
     "field_offset" : 896,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "current_reasons",
     "field_offset" : 928,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "parent",
     "field_offset" : 960,
     "referenced_type" : "_ZTIP17x509_store_ctx_st"
    },
    {
     "field_name" : "ex_data",
     "field_offset" : 992,
     "referenced_type" : "_ZTI17crypto_ex_data_st"
    }
   ],
   "linker_set_key" : "_ZTI17x509_store_ctx_st",
   "name" : "x509_store_ctx_st",
   "referenced_type" : "_ZTI17x509_store_ctx_st",
   "self_type" : "_ZTI17x509_store_ctx_st",
   "size" : 128,
   "source_file" : "external/boringssl/src/include/openssl/x509_vfy.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "keyid",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "issuer",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP21stack_st_GENERAL_NAME"
    },
    {
     "field_name" : "serial",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI18AUTHORITY_KEYID_st",
   "name" : "AUTHORITY_KEYID_st",
   "referenced_type" : "_ZTI18AUTHORITY_KEYID_st",
   "self_type" : "_ZTI18AUTHORITY_KEYID_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN18DIST_POINT_NAME_stUt_E"
    },
    {
     "field_name" : "dpname",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12X509_name_st"
    }
   ],
   "linker_set_key" : "_ZTI18DIST_POINT_NAME_st",
   "name" : "DIST_POINT_NAME_st",
   "referenced_type" : "_ZTI18DIST_POINT_NAME_st",
   "self_type" : "_ZTI18DIST_POINT_NAME_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIP15GENERAL_NAME_st"
    },
    {
     "field_name" : "minimum",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "maximum",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI18GENERAL_SUBTREE_st",
   "name" : "GENERAL_SUBTREE_st",
   "referenced_type" : "_ZTI18GENERAL_SUBTREE_st",
   "self_type" : "_ZTI18GENERAL_SUBTREE_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "object",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "set",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18X509_name_entry_st",
   "name" : "X509_name_entry_st",
   "referenced_type" : "_ZTI18X509_name_entry_st",
   "self_type" : "_ZTI18X509_name_entry_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cipher",
     "referenced_type" : "_ZTIPK13evp_cipher_st"
    },
    {
     "field_name" : "iv",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA16_h"
    }
   ],
   "linker_set_key" : "_ZTI18evp_cipher_info_st",
   "name" : "evp_cipher_info_st",
   "referenced_type" : "_ZTI18evp_cipher_info_st",
   "self_type" : "_ZTI18evp_cipher_info_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "object",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "single",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN18x509_attributes_stUt_E"
    }
   ],
   "linker_set_key" : "_ZTI18x509_attributes_st",
   "name" : "x509_attributes_st",
   "referenced_type" : "_ZTI18x509_attributes_st",
   "self_type" : "_ZTI18x509_attributes_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "permittedSubtrees",
     "referenced_type" : "_ZTIP24stack_st_GENERAL_SUBTREE"
    },
    {
     "field_name" : "excludedSubtrees",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP24stack_st_GENERAL_SUBTREE"
    }
   ],
   "linker_set_key" : "_ZTI19NAME_CONSTRAINTS_st",
   "name" : "NAME_CONSTRAINTS_st",
   "referenced_type" : "_ZTI19NAME_CONSTRAINTS_st",
   "self_type" : "_ZTI19NAME_CONSTRAINTS_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cert",
     "referenced_type" : "_ZTIP13stack_st_X509"
    },
    {
     "field_name" : "crl",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP17stack_st_X509_CRL"
    }
   ],
   "linker_set_key" : "_ZTI19PKCS7_SIGN_ENVELOPE",
   "name" : "PKCS7_SIGN_ENVELOPE",
   "referenced_type" : "_ZTI19PKCS7_SIGN_ENVELOPE",
   "self_type" : "_ZTI19PKCS7_SIGN_ENVELOPE",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/pkcs7.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ca",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pathlen",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI20BASIC_CONSTRAINTS_st",
   "name" : "BASIC_CONSTRAINTS_st",
   "referenced_type" : "_ZTI20BASIC_CONSTRAINTS_st",
   "self_type" : "_ZTI20BASIC_CONSTRAINTS_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "check_time",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "inh_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "purpose",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "trust",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "depth",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "policies",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP20stack_st_ASN1_OBJECT"
    },
    {
     "field_name" : "id",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP23X509_VERIFY_PARAM_ID_st"
    }
   ],
   "linker_set_key" : "_ZTI20X509_VERIFY_PARAM_st",
   "name" : "X509_VERIFY_PARAM_st",
   "referenced_type" : "_ZTI20X509_VERIFY_PARAM_st",
   "self_type" : "_ZTI20X509_VERIFY_PARAM_st",
   "size" : 36,
   "source_file" : "external/boringssl/src/include/openssl/x509_vfy.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "minsize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "maxsize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI20asn1_string_table_st",
   "name" : "asn1_string_table_st",
   "referenced_type" : "_ZTI20asn1_string_table_st",
   "self_type" : "_ZTI20asn1_string_table_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "method",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "location",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP15GENERAL_NAME_st"
    }
   ],
   "linker_set_key" : "_ZTI21ACCESS_DESCRIPTION_st",
   "name" : "ACCESS_DESCRIPTION_st",
   "referenced_type" : "_ZTI21ACCESS_DESCRIPTION_st",
   "self_type" : "_ZTI21ACCESS_DESCRIPTION_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitnum",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lname",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "sname",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21BIT_STRING_BITNAME_st",
   "name" : "BIT_STRING_BITNAME_st",
   "referenced_type" : "_ZTI21BIT_STRING_BITNAME_st",
   "self_type" : "_ZTI21BIT_STRING_BITNAME_st",
   "size" : 12,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "distpoint",
     "referenced_type" : "_ZTIP18DIST_POINT_NAME_st"
    },
    {
     "field_name" : "onlyuser",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "onlyCA",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "onlysomereasons",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "indirectCRL",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "onlyattr",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI21ISSUING_DIST_POINT_st",
   "name" : "ISSUING_DIST_POINT_st",
   "referenced_type" : "_ZTI21ISSUING_DIST_POINT_st",
   "self_type" : "_ZTI21ISSUING_DIST_POINT_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "requireExplicitPolicy",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "inhibitPolicyMapping",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14asn1_string_st"
    }
   ],
   "linker_set_key" : "_ZTI21POLICY_CONSTRAINTS_st",
   "name" : "POLICY_CONSTRAINTS_st",
   "referenced_type" : "_ZTI21POLICY_CONSTRAINTS_st",
   "self_type" : "_ZTI21POLICY_CONSTRAINTS_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_string",
     "referenced_type" : "_ZTIPFPcPvPKcS2_E"
    },
    {
     "field_name" : "get_section",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFP19stack_st_CONF_VALUEPvPKcE"
    },
    {
     "field_name" : "free_string",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvPcE"
    },
    {
     "field_name" : "free_section",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvPvP19stack_st_CONF_VALUEE"
    }
   ],
   "linker_set_key" : "_ZTI21X509V3_CONF_METHOD_st",
   "name" : "X509V3_CONF_METHOD_st",
   "referenced_type" : "_ZTI21X509V3_CONF_METHOD_st",
   "self_type" : "_ZTI21X509V3_CONF_METHOD_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "opaque",
     "referenced_type" : "_ZTIA580_h"
    },
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI21evp_aead_ctx_st_state",
   "name" : "evp_aead_ctx_st_state",
   "record_kind" : "union",
   "referenced_type" : "_ZTI21evp_aead_ctx_st_state",
   "self_type" : "_ZTI21evp_aead_ctx_st_state",
   "size" : 584,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "new_item",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiP14x509_lookup_stE"
    },
    {
     "field_name" : "free",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvP14x509_lookup_stE"
    },
    {
     "field_name" : "init",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP14x509_lookup_stE"
    },
    {
     "field_name" : "shutdown",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP14x509_lookup_stE"
    },
    {
     "field_name" : "ctrl",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiP14x509_lookup_stiPKclPPcE"
    },
    {
     "field_name" : "get_by_subject",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP14x509_lookup_stiP12X509_name_stP14x509_object_stE"
    },
    {
     "field_name" : "get_by_issuer_serial",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP14x509_lookup_stiP12X509_name_stP14asn1_string_stP14x509_object_stE"
    },
    {
     "field_name" : "get_by_fingerprint",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP14x509_lookup_stiPhiP14x509_object_stE"
    },
    {
     "field_name" : "get_by_alias",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFiP14x509_lookup_stiPciP14x509_object_stE"
    }
   ],
   "linker_set_key" : "_ZTI21x509_lookup_method_st",
   "name" : "x509_lookup_method_st",
   "referenced_type" : "_ZTI21x509_lookup_method_st",
   "self_type" : "_ZTI21x509_lookup_method_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/x509_vfy.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "is_static",
     "field_offset" : 32,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI24openssl_method_common_st",
   "name" : "openssl_method_common_st",
   "referenced_type" : "_ZTI24openssl_method_common_st",
   "self_type" : "_ZTI24openssl_method_common_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/engine.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pcPathLengthConstraint",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "proxyPolicy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP15PROXY_POLICY_st"
    }
   ],
   "linker_set_key" : "_ZTI28PROXY_CERT_INFO_EXTENSION_st",
   "name" : "PROXY_CERT_INFO_EXTENSION_st",
   "referenced_type" : "_ZTI28PROXY_CERT_INFO_EXTENSION_st",
   "self_type" : "_ZTI28PROXY_CERT_INFO_EXTENSION_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ber_bytes",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "ber_len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "d",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN5PKCS7Ut_E"
    }
   ],
   "linker_set_key" : "_ZTI5PKCS7",
   "name" : "PKCS7",
   "referenced_type" : "_ZTI5PKCS7",
   "self_type" : "_ZTI5PKCS7",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/pkcs7.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "g",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "pub_key",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "priv_key",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "priv_length",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "method_mont_p_lock",
     "field_offset" : 192,
     "referenced_type" : "_ZTI15crypto_mutex_st"
    },
    {
     "field_name" : "method_mont_p",
     "field_offset" : 640,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "q",
     "field_offset" : 672,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "j",
     "field_offset" : 704,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "seed",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "seedlen",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "counter",
     "field_offset" : 800,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "flags",
     "field_offset" : 832,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "references",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI5dh_st",
   "name" : "dh_st",
   "referenced_type" : "_ZTI5dh_st",
   "self_type" : "_ZTI5dh_st",
   "size" : 112,
   "source_file" : "external/boringssl/src/include/openssl/dh.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "method",
     "referenced_type" : "_ZTIPK13bio_method_st"
    },
    {
     "field_name" : "init",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shutdown",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "retry_reason",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "references",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "next_bio",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP6bio_st"
    },
    {
     "field_name" : "num_read",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_write",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6bio_st",
   "name" : "bio_st",
   "referenced_type" : "_ZTI6bio_st",
   "self_type" : "_ZTI6bio_st",
   "size" : 44,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIP13cbb_buffer_st"
    },
    {
     "field_name" : "child",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP6cbb_st"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pending_len_len",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pending_is_asn1",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "is_child",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI6cbb_st",
   "name" : "cbb_st",
   "referenced_type" : "_ZTI6cbb_st",
   "self_type" : "_ZTI6cbb_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6cbs_st",
   "name" : "cbs_st",
   "referenced_type" : "_ZTI6cbs_st",
   "self_type" : "_ZTI6cbs_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "p",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "q",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "g",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "pub_key",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "priv_key",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "method_mont_lock",
     "field_offset" : 256,
     "referenced_type" : "_ZTI15crypto_mutex_st"
    },
    {
     "field_name" : "method_mont_p",
     "field_offset" : 704,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "method_mont_q",
     "field_offset" : 736,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "references",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ex_data",
     "field_offset" : 800,
     "referenced_type" : "_ZTI17crypto_ex_data_st"
    }
   ],
   "linker_set_key" : "_ZTI6dsa_st",
   "name" : "dsa_st",
   "referenced_type" : "_ZTI6dsa_st",
   "self_type" : "_ZTI6dsa_st",
   "size" : 104,
   "source_file" : "external/boringssl/src/include/openssl/dsa.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "meth",
     "referenced_type" : "_ZTIP11rsa_meth_st"
    },
    {
     "field_name" : "n",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "e",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "d",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "p",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "q",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmp1",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmq1",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "iqmp",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "ex_data",
     "field_offset" : 288,
     "referenced_type" : "_ZTI17crypto_ex_data_st"
    },
    {
     "field_name" : "references",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lock",
     "field_offset" : 384,
     "referenced_type" : "_ZTI15crypto_mutex_st"
    },
    {
     "field_name" : "mont_n",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "mont_p",
     "field_offset" : 864,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "mont_q",
     "field_offset" : 896,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "d_fixed",
     "field_offset" : 928,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmp1_fixed",
     "field_offset" : 960,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmq1_fixed",
     "field_offset" : 992,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "inv_small_mod_large_mont",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "num_blindings",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "blindings",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPP14bn_blinding_st"
    },
    {
     "field_name" : "blindings_inuse",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "blinding_fork_generation",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "private_key_frozen",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6rsa_st",
   "name" : "rsa_st",
   "referenced_type" : "_ZTI6rsa_st",
   "self_type" : "_ZTI6rsa_st",
   "size" : 160,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cert_info",
     "referenced_type" : "_ZTIP12x509_cinf_st"
    },
    {
     "field_name" : "sig_alg",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13X509_algor_st"
    },
    {
     "field_name" : "signature",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "references",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ex_data",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17crypto_ex_data_st"
    },
    {
     "field_name" : "ex_pathlen",
     "field_offset" : 160,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ex_pcpathlen",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ex_flags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ex_kusage",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ex_xkusage",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ex_nscert",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "skid",
     "field_offset" : 352,
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "akid",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP18AUTHORITY_KEYID_st"
    },
    {
     "field_name" : "policy_cache",
     "field_offset" : 416,
     "referenced_type" : "_ZTIP20X509_POLICY_CACHE_st"
    },
    {
     "field_name" : "crldp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP19stack_st_DIST_POINT"
    },
    {
     "field_name" : "altname",
     "field_offset" : 480,
     "referenced_type" : "_ZTIP21stack_st_GENERAL_NAME"
    },
    {
     "field_name" : "nc",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP19NAME_CONSTRAINTS_st"
    },
    {
     "field_name" : "sha1_hash",
     "field_offset" : 544,
     "referenced_type" : "_ZTIA20_h"
    },
    {
     "field_name" : "aux",
     "field_offset" : 704,
     "referenced_type" : "_ZTIP16x509_cert_aux_st"
    },
    {
     "field_name" : "buf",
     "field_offset" : 736,
     "referenced_type" : "_ZTIP16crypto_buffer_st"
    },
    {
     "field_name" : "lock",
     "field_offset" : 768,
     "referenced_type" : "_ZTI15crypto_mutex_st"
    }
   ],
   "linker_set_key" : "_ZTI7x509_st",
   "name" : "x509_st",
   "referenced_type" : "_ZTI7x509_st",
   "self_type" : "_ZTI7x509_st",
   "size" : 152,
   "source_file" : "external/boringssl/src/include/openssl/x509.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPv"
    },
    {
     "field_name" : "sorted",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_alloc",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "comp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPPKvS1_E"
    }
   ],
   "linker_set_key" : "_ZTI8stack_st",
   "name" : "stack_st",
   "referenced_type" : "_ZTI8stack_st",
   "self_type" : "_ZTI8stack_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d",
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dmax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "neg",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI9bignum_st",
   "name" : "bignum_st",
   "referenced_type" : "_ZTI9bignum_st",
   "self_type" : "_ZTI9bignum_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "rsa",
     "referenced_type" : "_ZTIP6rsa_st"
    },
    {
     "field_name" : "dsa",
     "referenced_type" : "_ZTIP6dsa_st"
    },
    {
     "field_name" : "dh",
     "referenced_type" : "_ZTIP5dh_st"
    },
    {
     "field_name" : "ec",
     "referenced_type" : "_ZTIP9ec_key_st"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11evp_pkey_stUt_E",
   "name" : "evp_pkey_st::(anonymous union at external/boringssl/src/include/openssl/evp.h:1064:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11evp_pkey_stUt_E",
   "self_type" : "_ZTIN11evp_pkey_stUt_E",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/evp.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "boolean",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "asn1_string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "object",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "integer",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "enumerated",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "bit_string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "octet_string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "printablestring",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "t61string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "ia5string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "generalstring",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "bmpstring",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "universalstring",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "utctime",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "generalizedtime",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "visiblestring",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "utf8string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "set",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "sequence",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "asn1_value",
     "referenced_type" : "_ZTIP13ASN1_VALUE_st"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12asn1_type_stUt_E",
   "name" : "asn1_type_st::(anonymous union at external/boringssl/src/include/openssl/asn1.h:586:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN12asn1_type_stUt_E",
   "self_type" : "_ZTIN12asn1_type_stUt_E",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h",
     "referenced_type" : "_ZTIA5_j"
    },
    {
     "referenced_type" : "_ZTIN12sha_state_stUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12sha_state_stUt_E",
   "name" : "sha_state_st::(anonymous union at external/boringssl/src/include/openssl/sha.h:105:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN12sha_state_stUt_E",
   "self_type" : "_ZTIN12sha_state_stUt_E",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h0",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h3",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h4",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12sha_state_stUt_Ut_E",
   "name" : "sha_state_st::(anonymous union at external/boringssl/src/include/openssl/sha.h:105:3)::(anonymous struct at external/boringssl/src/include/openssl/sha.h:107:5)",
   "referenced_type" : "_ZTIN12sha_state_stUt_Ut_E",
   "self_type" : "_ZTIN12sha_state_stUt_Ut_E",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "x509",
     "referenced_type" : "_ZTIP7x509_st"
    },
    {
     "field_name" : "crl",
     "referenced_type" : "_ZTIP11X509_crl_st"
    },
    {
     "field_name" : "pkey",
     "referenced_type" : "_ZTIP11evp_pkey_st"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN14x509_object_stUt_E",
   "name" : "x509_object_st::(anonymous union at external/boringssl/src/include/openssl/x509_vfy.h:107:2)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN14x509_object_stUt_E",
   "self_type" : "_ZTIN14x509_object_stUt_E",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/x509_vfy.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "otherName",
     "referenced_type" : "_ZTIP12otherName_st"
    },
    {
     "field_name" : "rfc822Name",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "dNSName",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "x400Address",
     "referenced_type" : "_ZTIP12asn1_type_st"
    },
    {
     "field_name" : "directoryName",
     "referenced_type" : "_ZTIP12X509_name_st"
    },
    {
     "field_name" : "ediPartyName",
     "referenced_type" : "_ZTIP15EDIPartyName_st"
    },
    {
     "field_name" : "uniformResourceIdentifier",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "iPAddress",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "registeredID",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "ip",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "dirn",
     "referenced_type" : "_ZTIP12X509_name_st"
    },
    {
     "field_name" : "ia5",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "rid",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "other",
     "referenced_type" : "_ZTIP12asn1_type_st"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN15GENERAL_NAME_stUt_E",
   "name" : "GENERAL_NAME_st::(anonymous union at external/boringssl/src/include/openssl/x509v3.h:187:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN15GENERAL_NAME_stUt_E",
   "self_type" : "_ZTIN15GENERAL_NAME_stUt_E",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cpsuri",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "usernotice",
     "referenced_type" : "_ZTIP13USERNOTICE_st"
    },
    {
     "field_name" : "other",
     "referenced_type" : "_ZTIP12asn1_type_st"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN17POLICYQUALINFO_stUt_E",
   "name" : "POLICYQUALINFO_st::(anonymous union at external/boringssl/src/include/openssl/x509v3.h:281:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN17POLICYQUALINFO_stUt_E",
   "self_type" : "_ZTIN17POLICYQUALINFO_stUt_E",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fullname",
