#ifndef HIDL_GENERATED_ANDROID_HARDWARE_RENDERSCRIPT_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_RENDERSCRIPT_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace renderscript {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class ContextType : int32_t;
enum class AllocationUsageType : int32_t;
enum class AllocationMipmapControl : int32_t;
enum class AllocationCubemapFace : int32_t;
enum class DataType : int32_t;
enum class DataKind : int32_t;
enum class YuvFormat : int32_t;
enum class SamplerValue : int32_t;
enum class ForEachStrategy : int32_t;
struct ScriptCall;
enum class ContextFlags : int32_t;
enum class MessageToClientType : int32_t;
enum class ScriptIntrinsicID : int32_t;
enum class ThreadPriorities : int32_t;
enum class MetadataSignatureBitval : int32_t;

typedef uint64_t OpaqueHandle;

typedef void* Ptr;

typedef uint64_t Size;

typedef uint64_t Allocation;

typedef uint64_t AllocationAdapter;

typedef uint64_t Closure;

typedef uint64_t Element;

typedef uint64_t NativeWindow;

typedef uint64_t ObjectBase;

typedef uint64_t Sampler;

typedef uint64_t Script;

typedef uint64_t ScriptFieldID;

typedef uint64_t ScriptGroup;

typedef uint64_t ScriptGroup2;

typedef uint64_t ScriptInvokeID;

typedef uint64_t ScriptKernelID;

typedef uint64_t Type;

enum class ContextType : int32_t {
    NORMAL = 0,
    DEBUG = 1 /* ::android::hardware::renderscript::V1_0::ContextType.NORMAL implicitly + 1 */,
    PROFILE = 2 /* ::android::hardware::renderscript::V1_0::ContextType.DEBUG implicitly + 1 */,
};

enum class AllocationUsageType : int32_t {
    SCRIPT = 1 /* 0x0001 */,
    GRAPHICS_TEXTURE = 2 /* 0x0002 */,
    GRAPHICS_VERTEX = 4 /* 0x0004 */,
    GRAPHICS_CONSTANTS = 8 /* 0x0008 */,
    GRAPHICS_RENDER_TARGET = 16 /* 0x0010 */,
    IO_INPUT = 32 /* 0x0020 */,
    IO_OUTPUT = 64 /* 0x0040 */,
    SHARED = 128 /* 0x0080 */,
    OEM = 32768 /* 0x8000 */,
    ALL = 33023 /* 0x80FF */,
};

enum class AllocationMipmapControl : int32_t {
    NONE = 0,
    FULL = 1,
    ON_SYNC_TO_TEXTURE = 2,
};

enum class AllocationCubemapFace : int32_t {
    POSITIVE_X = 0,
    NEGATIVE_X = 1,
    POSITIVE_Y = 2,
    NEGATIVE_Y = 3,
    POSITIVE_Z = 4,
    NEGATIVE_Z = 5,
};

enum class DataType : int32_t {
    NONE = 0,
    FLOAT_16 = 1 /* ::android::hardware::renderscript::V1_0::DataType.NONE implicitly + 1 */,
    FLOAT_32 = 2 /* ::android::hardware::renderscript::V1_0::DataType.FLOAT_16 implicitly + 1 */,
    FLOAT_64 = 3 /* ::android::hardware::renderscript::V1_0::DataType.FLOAT_32 implicitly + 1 */,
    SIGNED_8 = 4 /* ::android::hardware::renderscript::V1_0::DataType.FLOAT_64 implicitly + 1 */,
    SIGNED_16 = 5 /* ::android::hardware::renderscript::V1_0::DataType.SIGNED_8 implicitly + 1 */,
    SIGNED_32 = 6 /* ::android::hardware::renderscript::V1_0::DataType.SIGNED_16 implicitly + 1 */,
    SIGNED_64 = 7 /* ::android::hardware::renderscript::V1_0::DataType.SIGNED_32 implicitly + 1 */,
    UNSIGNED_8 = 8 /* ::android::hardware::renderscript::V1_0::DataType.SIGNED_64 implicitly + 1 */,
    UNSIGNED_16 = 9 /* ::android::hardware::renderscript::V1_0::DataType.UNSIGNED_8 implicitly + 1 */,
    UNSIGNED_32 = 10 /* ::android::hardware::renderscript::V1_0::DataType.UNSIGNED_16 implicitly + 1 */,
    UNSIGNED_64 = 11 /* ::android::hardware::renderscript::V1_0::DataType.UNSIGNED_32 implicitly + 1 */,
    BOOLEAN = 12 /* ::android::hardware::renderscript::V1_0::DataType.UNSIGNED_64 implicitly + 1 */,
    UNSIGNED_5_6_5 = 13 /* ::android::hardware::renderscript::V1_0::DataType.BOOLEAN implicitly + 1 */,
    UNSIGNED_5_5_5_1 = 14 /* ::android::hardware::renderscript::V1_0::DataType.UNSIGNED_5_6_5 implicitly + 1 */,
    UNSIGNED_4_4_4_4 = 15 /* ::android::hardware::renderscript::V1_0::DataType.UNSIGNED_5_5_5_1 implicitly + 1 */,
    MATRIX_4X4 = 16 /* ::android::hardware::renderscript::V1_0::DataType.UNSIGNED_4_4_4_4 implicitly + 1 */,
    MATRIX_3X3 = 17 /* ::android::hardware::renderscript::V1_0::DataType.MATRIX_4X4 implicitly + 1 */,
    MATRIX_2X2 = 18 /* ::android::hardware::renderscript::V1_0::DataType.MATRIX_3X3 implicitly + 1 */,
    ELEMENT = 1000,
    TYPE = 1001 /* ::android::hardware::renderscript::V1_0::DataType.ELEMENT implicitly + 1 */,
    ALLOCATION = 1002 /* ::android::hardware::renderscript::V1_0::DataType.TYPE implicitly + 1 */,
    SAMPLER = 1003 /* ::android::hardware::renderscript::V1_0::DataType.ALLOCATION implicitly + 1 */,
    SCRIPT = 1004 /* ::android::hardware::renderscript::V1_0::DataType.SAMPLER implicitly + 1 */,
    MESH = 1005 /* ::android::hardware::renderscript::V1_0::DataType.SCRIPT implicitly + 1 */,
    PROGRAM_FRAGMENT = 1006 /* ::android::hardware::renderscript::V1_0::DataType.MESH implicitly + 1 */,
    PROGRAM_VERTEX = 1007 /* ::android::hardware::renderscript::V1_0::DataType.PROGRAM_FRAGMENT implicitly + 1 */,
    PROGRAM_RASTER = 1008 /* ::android::hardware::renderscript::V1_0::DataType.PROGRAM_VERTEX implicitly + 1 */,
    PROGRAM_STORE = 1009 /* ::android::hardware::renderscript::V1_0::DataType.PROGRAM_RASTER implicitly + 1 */,
    FONT = 1010 /* ::android::hardware::renderscript::V1_0::DataType.PROGRAM_STORE implicitly + 1 */,
    INVALID = 10000,
};

enum class DataKind : int32_t {
    USER = 0,
    PIXEL_L = 7,
    PIXEL_A = 8 /* ::android::hardware::renderscript::V1_0::DataKind.PIXEL_L implicitly + 1 */,
    PIXEL_LA = 9 /* ::android::hardware::renderscript::V1_0::DataKind.PIXEL_A implicitly + 1 */,
    PIXEL_RGB = 10 /* ::android::hardware::renderscript::V1_0::DataKind.PIXEL_LA implicitly + 1 */,
    PIXEL_RGBA = 11 /* ::android::hardware::renderscript::V1_0::DataKind.PIXEL_RGB implicitly + 1 */,
    PIXEL_DEPTH = 12 /* ::android::hardware::renderscript::V1_0::DataKind.PIXEL_RGBA implicitly + 1 */,
    PIXEL_YUV = 13 /* ::android::hardware::renderscript::V1_0::DataKind.PIXEL_DEPTH implicitly + 1 */,
    INVALID = 100,
};

enum class YuvFormat : int32_t {
    YUV_NONE = 0,
    YUV_YV12 = 842094169 /* 0x32315659 */,
    YUV_NV21 = 17 /* 0x11 */,
    YUV_420_888 = 35 /* 0x23 */,
};

enum class SamplerValue : int32_t {
    NEAREST = 0,
    LINEAR = 1 /* ::android::hardware::renderscript::V1_0::SamplerValue.NEAREST implicitly + 1 */,
    LINEAR_MIP_LINEAR = 2 /* ::android::hardware::renderscript::V1_0::SamplerValue.LINEAR implicitly + 1 */,
    WRAP = 3 /* ::android::hardware::renderscript::V1_0::SamplerValue.LINEAR_MIP_LINEAR implicitly + 1 */,
    CLAMP = 4 /* ::android::hardware::renderscript::V1_0::SamplerValue.WRAP implicitly + 1 */,
    LINEAR_MIP_NEAREST = 5 /* ::android::hardware::renderscript::V1_0::SamplerValue.CLAMP implicitly + 1 */,
    MIRRORED_REPEAT = 6 /* ::android::hardware::renderscript::V1_0::SamplerValue.LINEAR_MIP_NEAREST implicitly + 1 */,
    INVALID = 100,
};

enum class ForEachStrategy : int32_t {
    SERIAL = 0,
    DONT_CARE = 1,
    DST_LINEAR = 2,
    TILE_SMALL = 3,
    TILE_MEDIUM = 4,
    TILE_LARGE = 5,
};

struct ScriptCall final {
    ::android::hardware::renderscript::V1_0::ForEachStrategy strategy __attribute__ ((aligned(4)));
    uint32_t xStart __attribute__ ((aligned(4)));
    uint32_t xEnd __attribute__ ((aligned(4)));
    uint32_t yStart __attribute__ ((aligned(4)));
    uint32_t yEnd __attribute__ ((aligned(4)));
    uint32_t zStart __attribute__ ((aligned(4)));
    uint32_t zEnd __attribute__ ((aligned(4)));
    uint32_t arrayStart __attribute__ ((aligned(4)));
    uint32_t arrayEnd __attribute__ ((aligned(4)));
    uint32_t array2Start __attribute__ ((aligned(4)));
    uint32_t array2End __attribute__ ((aligned(4)));
    uint32_t array3Start __attribute__ ((aligned(4)));
    uint32_t array3End __attribute__ ((aligned(4)));
    uint32_t array4Start __attribute__ ((aligned(4)));
    uint32_t array4End __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, strategy) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, xStart) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, xEnd) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, yStart) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, yEnd) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, zStart) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, zEnd) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, arrayStart) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, arrayEnd) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, array2Start) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, array2End) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, array3Start) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, array3End) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, array4Start) == 52, "wrong offset");
static_assert(offsetof(::android::hardware::renderscript::V1_0::ScriptCall, array4End) == 56, "wrong offset");
static_assert(sizeof(::android::hardware::renderscript::V1_0::ScriptCall) == 60, "wrong size");
static_assert(__alignof(::android::hardware::renderscript::V1_0::ScriptCall) == 4, "wrong alignment");

enum class ContextFlags : int32_t {
    SYNCHRONOUS = 1 /* 1 << 0 */,
    LOW_LATENCY = 2 /* 1 << 1 */,
    LOW_POWER = 4 /* 1 << 2 */,
    WAIT_FOR_ATTACH = 8 /* 1 << 3 */,
};

enum class MessageToClientType : int32_t {
    NONE = 0,
    EXCEPTION = 1,
    RESIZE = 2,
    ERROR = 3,
    USER = 4,
    NEW_BUFFER = 5,
};

enum class ScriptIntrinsicID : int32_t {
    ID_UNDEFINED = 0,
    ID_CONVOLVE_3X3 = 1,
    ID_COLOR_MATRIX = 2,
    ID_LUT = 3,
    ID_CONVOLVE_5X5 = 4,
    ID_BLUR = 5,
    ID_YUV_TO_RGB = 6,
    ID_BLEND = 7,
    ID_3DLUT = 8,
    ID_HISTOGRAM = 9,
    ID_RESIZE = 12,
    ID_BLAS = 13,
    ID_EXTBLAS = 14,
    ID_OEM_START = 268435456 /* 0x10000000 */,
};

enum class ThreadPriorities : int32_t {
    LOW = 15,
    NORMAL_GRAPHICS = -8 /* -8 */,
    NORMAL = -1 /* -1 */,
    LOW_LATENCY = -4 /* -4 */,
};

enum class MetadataSignatureBitval : int32_t {
    SIG_None = 0,
