{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA19_c",
   "name" : "char [19]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA19_c",
   "size" : 19,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 2,

   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 12,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__120__map_const_iteratorINS_21__tree_const_iteratorINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android12mediametrics4Item4PropEEEPNS_11__tree_nodeISD_PvEEiEEEE",
   "name" : "const std::__map_const_iterator<std::__tree_const_iterator<std::__value_type<std::basic_string<char, std::char_traits<char>, std::allocator<char>>, android::mediametrics::Item::Prop>, std::__tree_node<std::__value_type<std::basic_string<char, std::char_traits<char>, std::allocator<char>>, android::mediametrics::Item::Prop>, void *> *, int>>",
   "referenced_type" : "_ZTINSt3__120__map_const_iteratorINS_21__tree_const_iteratorINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android12mediametrics4Item4PropEEEPNS_11__tree_nodeISD_PvEEiEEEE",
   "self_type" : "_ZTIKNSt3__120__map_const_iteratorINS_21__tree_const_iteratorINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android12mediametrics4Item4PropEEEPNS_11__tree_nodeISD_PvEEiEEEE",
   "size" : 4,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIxxEE",
   "name" : "const std::pair<long long, long long>",
   "referenced_type" : "_ZTINSt3__14pairIxxEE",
   "self_type" : "_ZTIKNSt3__14pairIxxEE",
   "size" : 16,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__17variantIJNS_9monostateEixdNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_4pairIxxEEEEE",
   "name" : "const std::variant<monostate, int, long long, double, basic_string<char>, pair<long long, long long>>",
   "referenced_type" : "_ZTINSt3__17variantIJNS_9monostateEixdNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_4pairIxxEEEEE",
   "self_type" : "_ZTIKNSt3__17variantIJNS_9monostateEixdNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_4pairIxxEEEEE",
   "size" : 24,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18functionIFvvEEE",
   "name" : "const std::function<void ()>",
   "referenced_type" : "_ZTINSt3__18functionIFvvEEE",
   "self_type" : "_ZTIKNSt3__18functionIFvvEEE",
   "size" : 24,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__19monostateE",
   "name" : "const std::monostate",
   "referenced_type" : "_ZTINSt3__19monostateE",
   "self_type" : "_ZTIKNSt3__19monostateE",
   "size" : 1,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 4,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12mediametrics8BaseItemE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mBegin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "protected",
     "field_name" : "mEnd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "protected",
     "field_name" : "mBaseRealloc",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "access" : "protected",
     "field_name" : "mBptr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "protected",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "mPropCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mHeaderLen",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android12mediametrics12BufferedItemE",
   "name" : "android::mediametrics::BufferedItem",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12mediametrics12BufferedItemE",
   "self_type" : "_ZTIN7android12mediametrics12BufferedItemE",
   "size" : 32,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12mediametrics12BufferedItemE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12mediametrics12BufferedItemD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12mediametrics12BufferedItemD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "time",
     "referenced_type" : "_ZTIA19_c"
    }
   ],
   "linker_set_key" : "_ZTIN7android12mediametrics13time_string_tE",
   "name" : "android::mediametrics::time_string_t",
   "referenced_type" : "_ZTIN7android12mediametrics13time_string_tE",
   "self_type" : "_ZTIN7android12mediametrics13time_string_tE",
   "size" : 19,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mName",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mElem",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__17variantIJNS_9monostateEixdNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_4pairIxxEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12mediametrics4Item4PropE",
   "name" : "android::mediametrics::Item::Prop",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12mediametrics4Item4PropE",
   "self_type" : "_ZTIN7android12mediametrics4Item4PropE",
   "size" : 40,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "it",
     "referenced_type" : "_ZTINSt3__120__map_const_iteratorINS_21__tree_const_iteratorINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android12mediametrics4Item4PropEEEPNS_11__tree_nodeISD_PvEEiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12mediametrics4Item8iteratorE",
   "name" : "android::mediametrics::Item::iterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12mediametrics4Item8iteratorE",
   "self_type" : "_ZTIN7android12mediametrics4Item8iteratorE",
   "size" : 4,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12mediametrics8BaseItemE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPid",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mUid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mPkgName",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mPkgVersionCode",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "mKey",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mTimestamp",
     "field_offset" : 384,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "mProps",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__13mapINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android12mediametrics4Item4PropENS_4lessIS6_EENS4_INS_4pairIKS6_SA_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12mediametrics4ItemE",
   "name" : "android::mediametrics::Item",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12mediametrics4ItemE",
   "self_type" : "_ZTIN7android12mediametrics4ItemE",
   "size" : 72,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mThunk",
     "referenced_type" : "_ZTIKNSt3__18functionIFvvEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12mediametrics5DeferE",
   "name" : "android::mediametrics::Defer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12mediametrics5DeferE",
   "self_type" : "_ZTIN7android12mediametrics5DeferE",
   "size" : 24,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "name" : "android::mediametrics::BaseItem::get_type_of<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofINSt3__14pairIxxEEEE",
   "name" : "android::mediametrics::BaseItem::get_type_of<std::pair<long long, long long>>",
   "referenced_type" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofINSt3__14pairIxxEEEE",
   "self_type" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofINSt3__14pairIxxEEEE",
   "size" : 1,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h",
   "template_args" : [ "_ZTINSt3__14pairIxxEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofINSt3__19monostateEEE",
   "name" : "android::mediametrics::BaseItem::get_type_of<std::monostate>",
   "referenced_type" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofINSt3__19monostateEEE",
   "self_type" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofINSt3__19monostateEEE",
   "size" : 1,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h",
   "template_args" : [ "_ZTINSt3__19monostateE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofIdEE",
   "name" : "android::mediametrics::BaseItem::get_type_of<double>",
   "referenced_type" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofIdEE",
   "self_type" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofIdEE",
   "size" : 1,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofIiEE",
   "name" : "android::mediametrics::BaseItem::get_type_of<int>",
   "referenced_type" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofIiEE",
   "self_type" : "_ZTIN7android12mediametrics8BaseItem11get_type_ofIiEE",
   "size" : 1,
   "source_file" : "frameworks/av/media/libmediametrics/include/media/MediaMetricsItem.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
