{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" : [],
 "functions" :
 [
  {
   "function_name" : "android::hardware::neuralnetworks::V1_2::utils::deserialize",
   "linker_set_key" : "_ZN7android8hardware14neuralnetworks4V1_25utils11deserializeERKNSt3__16vectorINS2_14FmqResultDatumENS4_9allocatorIS6_EEEE",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIRKNSt3__16vectorIN7android8hardware14neuralnetworks4V1_214FmqResultDatumENS_9allocatorIS5_EEEE"
    }
   ],
   "return_type" : "_ZTIN7android4base8expectedINSt3__15tupleIJNS_8hardware14neuralnetworks4V1_011ErrorStatusENS2_6vectorINS5_4V1_211OutputShapeENS2_9allocatorISA_EEEENS9_6TimingEEEENS2_12basic_stringIcNS2_11char_traitsIcEENSB_IcEEEEEE",
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {

   "name" : "const android::hardware::neuralnetworks::utils::IProtectedCallback",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "self_type" : "_ZTIKN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16chrono8durationIxNS_5ratioILl1ELl1000000EEEEE",
   "name" : "const std::chrono::duration<long long, std::ratio<1, 1000000>>",
   "referenced_type" : "_ZTINSt3__16chrono8durationIxNS_5ratioILl1ELl1000000EEEEE",
   "self_type" : "_ZTIKNSt3__16chrono8durationIxNS_5ratioILl1ELl1000000EEEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks4V1_211OutputShapeENS_9allocatorIS5_EEEE",
   "name" : "const std::vector<android::hardware::neuralnetworks::V1_2::OutputShape, std::allocator<android::hardware::neuralnetworks::V1_2::OutputShape>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android8hardware14neuralnetworks4V1_211OutputShapeENS_9allocatorIS5_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks4V1_211OutputShapeENS_9allocatorIS5_EEEE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks4V1_214FmqResultDatumENS_9allocatorIS5_EEEE",
   "name" : "const std::vector<android::hardware::neuralnetworks::V1_2::FmqResultDatum, std::allocator<android::hardware::neuralnetworks::V1_2::FmqResultDatum>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android8hardware14neuralnetworks4V1_214FmqResultDatumENS_9allocatorIS5_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks4V1_214FmqResultDatumENS_9allocatorIS5_EEEE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks4V1_215FmqRequestDatumENS_9allocatorIS5_EEEE",
   "name" : "const std::vector<android::hardware::neuralnetworks::V1_2::FmqRequestDatum, std::allocator<android::hardware::neuralnetworks::V1_2::FmqRequestDatum>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android8hardware14neuralnetworks4V1_215FmqRequestDatumENS_9allocatorIS5_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks4V1_215FmqRequestDatumENS_9allocatorIS5_EEEE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIiNS_9allocatorIiEEEE",
   "name" : "const std::vector<int, std::allocator<int>>",
   "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE",
   "self_type" : "_ZTIKNSt3__16vectorIiNS_9allocatorIiEEEE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  }
 ],
 "record_types" :
 [
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSender21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::ResultChannelSender::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSender21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSender21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFmqResultChannel",
     "referenced_type" : "_ZTIN7android8hardware12MessageQueueINS0_14neuralnetworks4V1_214FmqResultDatumELNS0_8MQFlavorE1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSenderE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::ResultChannelSender",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSenderE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSenderE",
   "size" : 48,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSender21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::RequestChannelSender::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSender21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSender21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFmqRequestChannel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android8hardware12MessageQueueINS0_14neuralnetworks4V1_215FmqRequestDatumELNS0_8MQFlavorE1EEE"
    },
    {
     "access" : "private",
     "field_name" : "mValid",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__16atomicIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::RequestChannelSender",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderE",
   "size" : 64,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSender18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderD0Ev"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiver21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::ResultChannelReceiver::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiver21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiver21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFmqResultChannel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android8hardware12MessageQueueINS0_14neuralnetworks4V1_214FmqResultDatumELNS0_8MQFlavorE1EEE"
    },
    {
     "access" : "private",
     "field_name" : "mValid",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__16atomicIbEE"
    },
    {
     "access" : "private",
     "field_name" : "kPollingTimeWindow",
     "field_offset" : 512,
     "referenced_type" : "_ZTIKNSt3__16chrono8durationIxNS_5ratioILl1ELl1000000EEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::ResultChannelReceiver",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverE",
   "size" : 72,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiver18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverD0Ev"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiver21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::RequestChannelReceiver::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiver21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiver21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFmqRequestChannel",
     "referenced_type" : "_ZTIN7android8hardware12MessageQueueINS0_14neuralnetworks4V1_215FmqRequestDatumELNS0_8MQFlavorE1EEE"
    },
    {
     "access" : "private",
     "field_name" : "mTeardown",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16atomicIbEE"
    },
    {
     "access" : "private",
     "field_name" : "kPollingTimeWindow",
     "field_offset" : 448,
     "referenced_type" : "_ZTIKNSt3__16chrono8durationIxNS_5ratioILl1ELl1000000EEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiverE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::RequestChannelReceiver",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiverE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiverE",
   "size" : 64,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mObject",
     "referenced_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "access" : "private",
     "field_name" : "mDeathRecipient",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2spINS_8hardware14neuralnetworks5utils14DeathRecipientEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "android::hardware::neuralnetworks::utils::DeathHandler",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware20hidl_death_recipientE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mIsDeadObject",
     "field_offset" : 384,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__16vectorIPN7android8hardware14neuralnetworks5utils18IProtectedCallbackENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "name" : "android::hardware::neuralnetworks::utils::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "size" : 96,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h",
   "vtable_components" :
   [
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipient11serviceDiedEmRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -80,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -80,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware14neuralnetworks5utils14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware14neuralnetworks5utils14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "name" : "android::hardware::neuralnetworks::utils::IProtectedCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallback18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallbackD0Ev"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "android::hardware::neuralnetworks::utils::DeathHandler &&",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
