#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_V4_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_V4_0_TYPES_H

#include <android/hardware/audio/common/4.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace audio {
namespace V4_0 {

// Forward declaration for forward reference support:
enum class Result : int32_t;
enum class AudioDrain : int32_t;
struct TimeSpec;
struct ParameterValue;
struct DeviceAddress;
enum class MmapBufferFlag : uint32_t;
struct MmapBufferInfo;
struct MmapPosition;
enum class MessageQueueFlagBits : uint32_t;
struct PlaybackTrackMetadata;
struct SourceMetadata;
struct RecordTrackMetadata;
struct SinkMetadata;
struct AudioMicrophoneCoordinate;
enum class AudioMicrophoneChannelMapping : uint32_t;
enum class AudioMicrophoneLocation : uint32_t;
enum class AudioMicrophoneDirectionality : uint32_t;
struct AudioFrequencyResponsePoint;
struct MicrophoneInfo;

enum class Result : int32_t {
    OK = 0,
    NOT_INITIALIZED = 1 /* ::android::hardware::audio::V4_0::Result.OK implicitly + 1 */,
    INVALID_ARGUMENTS = 2 /* ::android::hardware::audio::V4_0::Result.NOT_INITIALIZED implicitly + 1 */,
    INVALID_STATE = 3 /* ::android::hardware::audio::V4_0::Result.INVALID_ARGUMENTS implicitly + 1 */,
    /**
     * Methods marked as "Optional method" must return this result value
     * if the operation is not supported by HAL.
     */
    NOT_SUPPORTED = 4 /* ::android::hardware::audio::V4_0::Result.INVALID_STATE implicitly + 1 */,
};

enum class AudioDrain : int32_t {
    /**
     * drain() returns when all data has been played.
     */
    ALL = 0,
    /**
     * drain() returns a short time before all data from the current track has
     * been played to give time for gapless track switch.
     */
    EARLY_NOTIFY = 1 /* ::android::hardware::audio::V4_0::AudioDrain.ALL implicitly + 1 */,
};

/**
 * A substitute for POSIX timespec.
 */
struct TimeSpec final {
    uint64_t tvSec __attribute__ ((aligned(8)));
    uint64_t tvNSec __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::TimeSpec, tvSec) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::TimeSpec, tvNSec) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::TimeSpec) == 16, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::TimeSpec) == 8, "wrong alignment");

/**
 * IEEE 802 MAC address.
 */
typedef ::android::hardware::hidl_array<uint8_t, 6> MacAddress;

struct ParameterValue final {
    ::android::hardware::hidl_string key __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string value __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::ParameterValue, key) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::ParameterValue, value) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::ParameterValue) == 32, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::ParameterValue) == 8, "wrong alignment");

/**
 * Specifies a device in case when several devices of the same type
 * can be connected (e.g. BT A2DP, USB).
 */
struct DeviceAddress final {
    // Forward declaration for forward reference support:
    union Address;

    union Address final {
        // Forward declaration for forward reference support:
        struct Alsa;

        struct Alsa final {
            int32_t card __attribute__ ((aligned(4)));
            int32_t device __attribute__ ((aligned(4)));
        };

        static_assert(offsetof(::android::hardware::audio::V4_0::DeviceAddress::Address::Alsa, card) == 0, "wrong offset");
        static_assert(offsetof(::android::hardware::audio::V4_0::DeviceAddress::Address::Alsa, device) == 4, "wrong offset");
        static_assert(sizeof(::android::hardware::audio::V4_0::DeviceAddress::Address::Alsa) == 8, "wrong size");
        static_assert(__alignof(::android::hardware::audio::V4_0::DeviceAddress::Address::Alsa) == 4, "wrong alignment");

        ::android::hardware::hidl_array<uint8_t, 6> mac __attribute__ ((aligned(1)));
        ::android::hardware::hidl_array<uint8_t, 4> ipv4 __attribute__ ((aligned(1)));
        ::android::hardware::audio::V4_0::DeviceAddress::Address::Alsa alsa __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::audio::V4_0::DeviceAddress::Address, mac) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::V4_0::DeviceAddress::Address, ipv4) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::V4_0::DeviceAddress::Address, alsa) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::audio::V4_0::DeviceAddress::Address) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::audio::V4_0::DeviceAddress::Address) == 4, "wrong alignment");

    ::android::hardware::audio::common::V4_0::AudioDevice device __attribute__ ((aligned(4)));
    ::android::hardware::audio::V4_0::DeviceAddress::Address address __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string busAddress __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string rSubmixAddress __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::DeviceAddress, device) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::DeviceAddress, address) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::DeviceAddress, busAddress) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::DeviceAddress, rSubmixAddress) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::DeviceAddress) == 48, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::DeviceAddress) == 8, "wrong alignment");

enum class MmapBufferFlag : uint32_t {
    NONE = 0u /* 0x0 */,
    /**
     * If the buffer can be securely shared to untrusted applications
     * through the AAudio exclusive mode.
     * Only set this flag if applications are restricted from accessing the
     * memory surrounding the audio data buffer by a kernel mechanism.
     * See Linux kernel's dma_buf.
     */
    APPLICATION_SHAREABLE = 1u /* 0x1 */,
};

/**
 * Mmap buffer descriptor returned by IStream.createMmapBuffer().
 * Used by streams opened in mmap mode.
 */
struct MmapBufferInfo final {
    /**
     * Mmap memory buffer
     */
    ::android::hardware::hidl_memory sharedMemory __attribute__ ((aligned(8)));
    /**
     * Total buffer size in frames
     */
    uint32_t bufferSizeFrames __attribute__ ((aligned(4)));
    /**
     * Transfer size granularity in frames
     */
    uint32_t burstSizeFrames __attribute__ ((aligned(4)));
    /**
     * Attributes describing the buffer.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::audio::V4_0::MmapBufferFlag> flags __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::MmapBufferInfo, sharedMemory) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MmapBufferInfo, bufferSizeFrames) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MmapBufferInfo, burstSizeFrames) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MmapBufferInfo, flags) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::MmapBufferInfo) == 56, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::MmapBufferInfo) == 8, "wrong alignment");

/**
 * Mmap buffer read/write position returned by IStream.getMmapPosition().
 * Used by streams opened in mmap mode.
 */
struct MmapPosition final {
    int64_t timeNanoseconds __attribute__ ((aligned(8)));
    int32_t positionFrames __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::MmapPosition, timeNanoseconds) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MmapPosition, positionFrames) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::MmapPosition) == 16, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::MmapPosition) == 8, "wrong alignment");

/**
 * The message queue flags used to synchronize reads and writes from
 * message queues used by StreamIn and StreamOut.
 */
enum class MessageQueueFlagBits : uint32_t {
    NOT_EMPTY = 1u /* 1 << 0 */,
    NOT_FULL = 2u /* 1 << 1 */,
};

/**
 * Metadata of a playback track for a StreamOut.
 */
struct PlaybackTrackMetadata final {
    ::android::hardware::audio::common::V4_0::AudioUsage usage __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V4_0::AudioContentType contentType __attribute__ ((aligned(4)));
    /**
     * Positive linear gain applied to the track samples. 0 being muted and 1 is no attenuation,
     * 2 means double amplification...
     * Must not be negative.
     */
    float gain __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::PlaybackTrackMetadata, usage) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::PlaybackTrackMetadata, contentType) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::PlaybackTrackMetadata, gain) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::PlaybackTrackMetadata) == 12, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::PlaybackTrackMetadata) == 4, "wrong alignment");

/**
 * Metadatas of the source of a StreamOut.
 */
struct SourceMetadata final {
    ::android::hardware::hidl_vec<::android::hardware::audio::V4_0::PlaybackTrackMetadata> tracks __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::SourceMetadata, tracks) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::SourceMetadata) == 16, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::SourceMetadata) == 8, "wrong alignment");

/**
 * Metadata of a record track for a StreamIn.
 */
struct RecordTrackMetadata final {
    ::android::hardware::audio::common::V4_0::AudioSource source __attribute__ ((aligned(4)));
    /**
     * Positive linear gain applied to the track samples. 0 being muted and 1 is no attenuation,
     * 2 means double amplification...
     * Must not be negative.
     */
    float gain __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::RecordTrackMetadata, source) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::RecordTrackMetadata, gain) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::RecordTrackMetadata) == 8, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::RecordTrackMetadata) == 4, "wrong alignment");

/**
 * Metadatas of the source of a StreamIn.
 */
struct SinkMetadata final {
    ::android::hardware::hidl_vec<::android::hardware::audio::V4_0::RecordTrackMetadata> tracks __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::SinkMetadata, tracks) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::SinkMetadata) == 16, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::SinkMetadata) == 8, "wrong alignment");

/*
 * Microphone information
 *
 *
 *
 * A 3D point used to represent position or orientation of a microphone.
 *
 * Position: Coordinates of the microphone's capsule, in meters, from the
 * bottom-left-back corner of the bounding box of android device in natural
 * orientation (PORTRAIT for phones, LANDSCAPE for tablets, tvs, etc).
 * The orientation musth match the reported by the api Display.getRotation().
 *
 * Orientation: Normalized vector to signal the main orientation of the
 * microphone's capsule. Magnitude = sqrt(x^2 + y^2 + z^2) = 1
 */
struct AudioMicrophoneCoordinate final {
    float x __attribute__ ((aligned(4)));
    float y __attribute__ ((aligned(4)));
    float z __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::AudioMicrophoneCoordinate, x) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::AudioMicrophoneCoordinate, y) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::AudioMicrophoneCoordinate, z) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::AudioMicrophoneCoordinate) == 12, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::AudioMicrophoneCoordinate) == 4, "wrong alignment");

/**
 * Enum to identify the type of channel mapping for active microphones.
 * Used channels further identify if the microphone has any significative
 * process (e.g. High Pass Filtering, dynamic compression)
 * Simple processing as constant gain adjustment must be DIRECT.
 */
enum class AudioMicrophoneChannelMapping : uint32_t {
    UNUSED = 0u,
    /*
     * Channel not used
     */
    DIRECT = 1u,
    /*
     * Channel used and signal not processed
     */
    PROCESSED = 2u,
};

/**
 * Enum to identify locations of microphones in regards to the body of the
 * android device.
 */
enum class AudioMicrophoneLocation : uint32_t {
    UNKNOWN = 0u,
    MAINBODY = 1u,
    MAINBODY_MOVABLE = 2u,
    PERIPHERAL = 3u,
};

/**
 * Identifier to help group related microphones together
 * e.g. microphone arrays should belong to the same group
 */
typedef int32_t AudioMicrophoneGroup;

/**
 * Enum with standard polar patterns of microphones
 */
enum class AudioMicrophoneDirectionality : uint32_t {
    UNKNOWN = 0u,
    OMNI = 1u,
    BI_DIRECTIONAL = 2u,
    CARDIOID = 3u,
    HYPER_CARDIOID = 4u,
    SUPER_CARDIOID = 5u,
};

/**
 * A (frequency, level) pair. Used to represent frequency response.
 */
struct AudioFrequencyResponsePoint final {
    /**
     * In Hz
     */
    float frequency __attribute__ ((aligned(4)));
    /**
     * In dB
     */
    float level __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::AudioFrequencyResponsePoint, frequency) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::AudioFrequencyResponsePoint, level) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::AudioFrequencyResponsePoint) == 8, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::AudioFrequencyResponsePoint) == 4, "wrong alignment");

/**
 * Structure used by the HAL to describe microphone's characteristics
 * Used by StreamIn and Device
 */
struct MicrophoneInfo final {
    /**
     * Unique alphanumeric id for microphone. Guaranteed to be the same
     * even after rebooting.
     */
    ::android::hardware::hidl_string deviceId __attribute__ ((aligned(8)));
    /**
     * Device specific information
     */
    ::android::hardware::audio::V4_0::DeviceAddress deviceAddress __attribute__ ((aligned(8)));
    /**
     * Each element of the vector must describe the channel with the same
     *  index.
     */
    ::android::hardware::hidl_vec<::android::hardware::audio::V4_0::AudioMicrophoneChannelMapping> channelMapping __attribute__ ((aligned(8)));
    /**
     * Location of the microphone in regard to the body of the device
     */
    ::android::hardware::audio::V4_0::AudioMicrophoneLocation location __attribute__ ((aligned(4)));
    /**
     * Identifier to help group related microphones together
     *  e.g. microphone arrays should belong to the same group
     */
    int32_t group __attribute__ ((aligned(4)));
    /**
     * Index of this microphone within the group.
     *  (group, index) must be unique within the same device.
     */
    uint32_t indexInTheGroup __attribute__ ((aligned(4)));
    /**
     * Level in dBFS produced by a 1000 Hz tone at 94 dB SPL
     */
    float sensitivity __attribute__ ((aligned(4)));
    /**
     * Level in dB of the max SPL supported at 1000 Hz
     */
    float maxSpl __attribute__ ((aligned(4)));
    /**
     * Level in dB of the min SPL supported at 1000 Hz
     */
    float minSpl __attribute__ ((aligned(4)));
    /**
     * Standard polar pattern of the microphone
     */
    ::android::hardware::audio::V4_0::AudioMicrophoneDirectionality directionality __attribute__ ((aligned(4)));
    /**
     * Vector with ordered frequency responses (from low to high frequencies)
     *  with the frequency response of the microphone.
     *  Levels are in dB, relative to level at 1000 Hz
     */
    ::android::hardware::hidl_vec<::android::hardware::audio::V4_0::AudioFrequencyResponsePoint> frequencyResponse __attribute__ ((aligned(8)));
    /**
     * Position of the microphone's capsule in meters, from the
     *  bottom-left-back corner of the bounding box of device.
     */
    ::android::hardware::audio::V4_0::AudioMicrophoneCoordinate position __attribute__ ((aligned(4)));
    /**
     * Normalized point to signal the main orientation of the microphone's
     *  capsule. sqrt(x^2 + y^2 + z^2) = 1
     */
    ::android::hardware::audio::V4_0::AudioMicrophoneCoordinate orientation __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, deviceId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, deviceAddress) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, channelMapping) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, location) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, group) == 84, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, indexInTheGroup) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, sensitivity) == 92, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, maxSpl) == 96, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, minSpl) == 100, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, directionality) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, frequencyResponse) == 112, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, position) == 128, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V4_0::MicrophoneInfo, orientation) == 140, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V4_0::MicrophoneInfo) == 152, "wrong size");
static_assert(__alignof(::android::hardware::audio::V4_0::MicrophoneInfo) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::audio::V4_0::Result o);
static inline void PrintTo(::android::hardware::audio::V4_0::Result o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::audio::V4_0::Result lhs, const ::android::hardware::audio::V4_0::Result rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::audio::V4_0::Result rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::audio::V4_0::Result lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
