{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFN7android4base8expectedINSt3__16vectorINS2_10shared_ptrIKNS_2nn6MemoryEEENS2_9allocatorIS8_EEEENS5_12GeneralErrorEEENS_8hardware14neuralnetworks4V1_011ErrorStatusERKNSE_8hidl_vecINSE_11hidl_memoryEEEE",
   "name" : "android::base::expected<std::__1::vector<std::__1::shared_ptr<const android::nn::Memory>, std::__1::allocator<std::__1::shared_ptr<const android::nn::Memory>>>, android::nn::GeneralError> (android::hardware::neuralnetworks::V1_0::ErrorStatus, const android::hardware::hidl_vec<android::hardware::hidl_memory> &)",
   "parameters" :
   [
    {

   "self_type" : "_ZTIKN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android8hardware6ReturnIvEE",
   "name" : "const android::hardware::Return<void>",
   "referenced_type" : "_ZTIN7android8hardware6ReturnIvEE",
   "self_type" : "_ZTIKN7android8hardware6ReturnIvEE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/HandleError.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android8hardware8hidl_vecINS0_11hidl_memoryEEE",
   "name" : "const android::hardware::hidl_vec<android::hardware::hidl_memory>",
   "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_11hidl_memoryEEE",
   "self_type" : "_ZTIKN7android8hardware8hidl_vecINS0_11hidl_memoryEEE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/TransferValue.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6IBurstEEE",
   "name" : "const std::shared_ptr<const android::nn::IBurst>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIKN7android2nn6IBurstEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6IBurstEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstServer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110unique_ptrIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSenderENS_14default_deleteIS6_EEEE",
   "name" : "const std::unique_ptr<android::hardware::neuralnetworks::V1_2::utils::ResultChannelSender, std::default_delete<android::hardware::neuralnetworks::V1_2::utils::ResultChannelSender>>",
   "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSenderENS_14default_deleteIS6_EEEE",
   "self_type" : "_ZTIKNSt3__110unique_ptrIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSenderENS_14default_deleteIS6_EEEE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstServer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110unique_ptrIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiverENS_14default_deleteIS6_EEEE",
   "name" : "const std::unique_ptr<android::hardware::neuralnetworks::V1_2::utils::RequestChannelReceiver, std::default_delete<android::hardware::neuralnetworks::V1_2::utils::RequestChannelReceiver>>",
   "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiverENS_14default_deleteIS6_EEEE",
   "self_type" : "_ZTIKNSt3__110unique_ptrIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiverENS_14default_deleteIS6_EEEE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstServer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16chrono8durationIxNS_5ratioILx1ELx1000000EEEEE",
   "name" : "const std::chrono::duration<long long, std::ratio<1, 1000000>>",
   "referenced_type" : "_ZTINSt3__16chrono8durationIxNS_5ratioILx1ELx1000000EEEEE",
   "self_type" : "_ZTIKNSt3__16chrono8durationIxNS_5ratioILx1ELx1000000EEEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIiNS_9allocatorIiEEEE",
   "name" : "const std::vector<int, std::allocator<int>>",
   "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE",
   "self_type" : "_ZTIKNSt3__16vectorIiNS_9allocatorIiEEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstServer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  }
 ],
 "record_types" :
 [
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSender21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::ResultChannelSender::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSender21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSender21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFmqResultChannel",
     "referenced_type" : "_ZTIN7android8hardware12MessageQueueINS0_14neuralnetworks4V1_214FmqResultDatumELNS0_8MQFlavorE1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSenderE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::ResultChannelSender",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSenderE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSenderE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mCache",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__13mapIiNS_4pairINS_10shared_ptrIKN7android2nn6MemoryEEENS2_IKNS3_4base10ScopeGuardINS_8functionIFvvEEEEEEEEENS_4lessIiEENS_9allocatorINS1_IKiSG_EEEEEE"
    },
    {
     "access" : "private",
     "field_name" : "kBurstExecutor",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__110shared_ptrIKN7android2nn6IBurstEEE"
    },
    {
     "access" : "private",
     "field_name" : "kBurstCallback",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKN7android2spINS_8hardware14neuralnetworks4V1_214IBurstCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServer11MemoryCacheE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::ExecutionBurstServer::MemoryCache",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServer11MemoryCacheE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServer11MemoryCacheE",
   "size" : 28,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstServer.h"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServer21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::ExecutionBurstServer::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServer21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServer21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstServer.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_213IBurstContextE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mWorker",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16threadE"
    },
    {
     "access" : "private",
     "field_name" : "mTeardown",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16atomicIbEE"
    },
    {
     "access" : "private",
     "field_name" : "mCallback",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKN7android2spINS_8hardware14neuralnetworks4V1_214IBurstCallbackEEE"
    },
    {
     "access" : "private",
     "field_name" : "mRequestChannelReceiver",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiverENS_14default_deleteIS6_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mResultChannelSender",
     "field_offset" : 160,
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN7android8hardware14neuralnetworks4V1_25utils19ResultChannelSenderENS_14default_deleteIS6_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mBurstExecutor",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6IBurstEEE"
    },
    {
     "access" : "private",
     "field_name" : "mMemoryCache",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServer11MemoryCacheE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServerE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::ExecutionBurstServer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServerE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServerE",
   "size" : 68,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstServer.h",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_213IBurstContext8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_213IBurstContext14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_213IBurstContext5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_213IBurstContext19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_213IBurstContext12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_213IBurstContext21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_213IBurstContext11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_213IBurstContext4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_213IBurstContext12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_213IBurstContext21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_213IBurstContext13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServer10freeMemoryEi"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14neuralnetworks4V1_25utils20ExecutionBurstServerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSender21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::RequestChannelSender::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSender21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSender21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFmqRequestChannel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android8hardware12MessageQueueINS0_14neuralnetworks4V1_215FmqRequestDatumELNS0_8MQFlavorE1EEE"
    },
    {
     "access" : "private",
     "field_name" : "mValid",
     "field_offset" : 224,
     "referenced_type" : "_ZTINSt3__16atomicIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::RequestChannelSender",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderE",
   "size" : 32,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSender18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils20RequestChannelSenderD0Ev"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiver21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::ResultChannelReceiver::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiver21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiver21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFmqResultChannel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android8hardware12MessageQueueINS0_14neuralnetworks4V1_214FmqResultDatumELNS0_8MQFlavorE1EEE"
    },
    {
     "access" : "private",
     "field_name" : "mValid",
     "field_offset" : 224,
     "referenced_type" : "_ZTINSt3__16atomicIbEE"
    },
    {
     "access" : "private",
     "field_name" : "kPollingTimeWindow",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKNSt3__16chrono8durationIxNS_5ratioILx1ELx1000000EEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::ResultChannelReceiver",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverE",
   "size" : 40,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiver18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_25utils21ResultChannelReceiverD0Ev"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiver21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::RequestChannelReceiver::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiver21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiver21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFmqRequestChannel",
     "referenced_type" : "_ZTIN7android8hardware12MessageQueueINS0_14neuralnetworks4V1_215FmqRequestDatumELNS0_8MQFlavorE1EEE"
    },
    {
     "access" : "private",
     "field_name" : "mTeardown",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16atomicIbEE"
    },
    {
     "access" : "private",
     "field_name" : "kPollingTimeWindow",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKNSt3__16chrono8durationIxNS_5ratioILx1ELx1000000EEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiverE",
   "name" : "android::hardware::neuralnetworks::V1_2::utils::RequestChannelReceiver",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiverE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_25utils22RequestChannelReceiverE",
   "size" : 40,
   "source_file" : "hardware/interfaces/neuralnetworks/1.2/utils/include/nnapi/hal/1.2/ExecutionBurstUtils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mObject",
     "referenced_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "access" : "private",
     "field_name" : "mDeathRecipient",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android2spINS_8hardware14neuralnetworks5utils14DeathRecipientEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "android::hardware::neuralnetworks::utils::DeathHandler",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mReturnValue",
     "referenced_type" : "_ZTINSt3__18optionalIN7android4base8expectedINS_6vectorINS_10shared_ptrIKNS1_2nn6MemoryEEENS_9allocatorIS9_EEEENS6_12GeneralErrorEEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mFunction",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFN7android4base8expectedINSt3__16vectorINS2_10shared_ptrIKNS_2nn6MemoryEEENS2_9allocatorIS8_EEEENS5_12GeneralErrorEEENS_8hardware14neuralnetworks4V1_011ErrorStatusERKNSE_8hidl_vecINSE_11hidl_memoryEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils13CallbackValueINS_4base8expectedINSt3__16vectorINS6_10shared_ptrIKNS_2nn6MemoryEEENS6_9allocatorISC_EEEENS9_12GeneralErrorEEEJNS1_4V1_011ErrorStatusERKNS0_8hidl_vecINS0_11hidl_memoryEEEEEE",
   "name" : "android::hardware::neuralnetworks::utils::CallbackValue<android::base::expected<std::vector<std::shared_ptr<const android::nn::Memory>, std::allocator<std::shared_ptr<const android::nn::Memory>>>, android::nn::GeneralError>, ErrorStatus, const hidl_vec<hidl_memory> &>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils13CallbackValueINS_4base8expectedINSt3__16vectorINS6_10shared_ptrIKNS_2nn6MemoryEEENS6_9allocatorISC_EEEENS9_12GeneralErrorEEEJNS1_4V1_011ErrorStatusERKNS0_8hidl_vecINS0_11hidl_memoryEEEEEE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils13CallbackValueINS_4base8expectedINSt3__16vectorINS6_10shared_ptrIKNS_2nn6MemoryEEENS6_9allocatorISC_EEEENS9_12GeneralErrorEEEJNS1_4V1_011ErrorStatusERKNS0_8hidl_vecINS0_11hidl_memoryEEEEEE",
   "size" : 28,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/TransferValue.h",
   "template_args" :
   [
    "_ZTIN7android4base8expectedINSt3__16vectorINS2_10shared_ptrIKNS_2nn6MemoryEEENS2_9allocatorIS8_EEEENS5_12GeneralErrorEEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware20hidl_death_recipientE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mIsDeadObject",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__16vectorIPN7android8hardware14neuralnetworks5utils18IProtectedCallbackENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "name" : "android::hardware::neuralnetworks::utils::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "size" : 32,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipient11serviceDiedEyRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14neuralnetworks5utils14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14neuralnetworks5utils14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input",
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS4_14RelocationInfoIPKvEEEENS_14default_deleteISA_EEEE"
    },
    {
     "field_name" : "output",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS4_14RelocationInfoIPvEEEENS_14default_deleteIS9_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "name" : "android::hardware::neuralnetworks::utils::RequestRelocation",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "name" : "android::hardware::neuralnetworks::utils::IProtectedCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallback18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallbackD0Ev"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "android::hardware::neuralnetworks::utils::DeathHandler &&",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTION7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "name" : "android::hardware::neuralnetworks::utils::IProtectedCallback &&",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "self_type" : "_ZTION7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  }
 ]
}
