#ifndef HIDL_GENERATED_ANDROID_HARDWARE_KEYMASTER_V3_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_KEYMASTER_V3_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace keymaster {
namespace V3_0 {

// Forward declaration for forward reference support:
enum class TagType : uint32_t;
enum class Tag : uint32_t;
enum class Algorithm : uint32_t;
enum class BlockMode : uint32_t;
enum class PaddingMode : uint32_t;
enum class Digest : uint32_t;
enum class EcCurve : uint32_t;
enum class KeyOrigin : uint32_t;
enum class KeyBlobUsageRequirements : uint32_t;
enum class KeyPurpose : uint32_t;
enum class ErrorCode : uint32_t;
enum class KeyDerivationFunction : uint32_t;
enum class HardwareAuthenticatorType : uint32_t;
struct KeyParameter;
struct KeyCharacteristics;
struct HardwareAuthToken;
enum class SecurityLevel : uint32_t;
enum class KeyFormat : uint32_t;

enum class TagType : uint32_t {
    INVALID = 0u /* 0 << 28 */,
    /*
     * Invalid type, used to designate a tag as uninitialized
     */
    ENUM = 268435456u /* 1 << 28 */,
    ENUM_REP = 536870912u /* 2 << 28 */,
    /*
     * Repeatable enumeration value.
     */
    UINT = 805306368u /* 3 << 28 */,
    UINT_REP = 1073741824u /* 4 << 28 */,
    /*
     * Repeatable integer value
     */
    ULONG = 1342177280u /* 5 << 28 */,
    DATE = 1610612736u /* 6 << 28 */,
    BOOL = 1879048192u /* 7 << 28 */,
    BIGNUM = 2147483648u /* 8 << 28 */,
    BYTES = 2415919104u /* 9 << 28 */,
    ULONG_REP = 2684354560u /* 10 << 28 */,
};

enum class Tag : uint32_t {
    INVALID = 0u /* TagType:INVALID | 0 */,
    /**
     * Tags that must be semantically enforced by hardware and software implementations.
     *
     *
     * Crypto parameters
     */
    PURPOSE = 536870913u /* TagType:ENUM_REP | 1 */,
    /**
     * KeyPurpose.
     */
    ALGORITHM = 268435458u /* TagType:ENUM | 2 */,
    /**
     * Algorithm.
     */
    KEY_SIZE = 805306371u /* TagType:UINT | 3 */,
    /**
     * Key size in bits.
     */
    BLOCK_MODE = 536870916u /* TagType:ENUM_REP | 4 */,
    /**
     * BlockMode.
     */
    DIGEST = 536870917u /* TagType:ENUM_REP | 5 */,
    /**
     * Digest.
     */
    PADDING = 536870918u /* TagType:ENUM_REP | 6 */,
    /**
     * PaddingMode.
     */
    CALLER_NONCE = 1879048199u /* TagType:BOOL | 7 */,
    /**
     * Allow caller to specify nonce or IV.
     */
    MIN_MAC_LENGTH = 805306376u /* TagType:UINT | 8 */,
    /*
     * Minimum length of MAC or AEAD authentication tag in
     * bits.
     */
    KDF = 536870921u /* TagType:ENUM_REP | 9 */,
    /**
     * KeyDerivationFunction.
     */
    EC_CURVE = 268435466u /* TagType:ENUM | 10 */,
    /**
     * EcCurve.
     *
     *
     * Algorithm-specific.
     */
    RSA_PUBLIC_EXPONENT = 1342177480u /* TagType:ULONG | 200 */,
    ECIES_SINGLE_HASH_MODE = 1879048393u /* TagType:BOOL | 201 */,
    /*
     * Whether the ephemeral public key is fed into the
     * KDF.
     */
    INCLUDE_UNIQUE_ID = 1879048394u /* TagType:BOOL | 202 */,
    /*
     * If true, attestation certificates for this key
     * will contain an application-scoped and
     * time-bounded device-unique ID.
     *
     *
     * Other hardware-enforced.
     */
    BLOB_USAGE_REQUIREMENTS = 268435757u /* TagType:ENUM | 301 */,
    /**
     * KeyBlobUsageRequirements.
     */
    BOOTLOADER_ONLY = 1879048494u /* TagType:BOOL | 302 */,
    /**
     * Usable only by bootloader.
     *
     *
     * Tags that should be semantically enforced by hardware if possible and will otherwise be
     * enforced by software (keystore).
     *
     *
     * Key validity period
     */
    ACTIVE_DATETIME = 1610613136u /* TagType:DATE | 400 */,
    /**
     * Start of validity.
     */
    ORIGINATION_EXPIRE_DATETIME = 1610613137u /* TagType:DATE | 401 */,
    /*
     * Date when new "messages" should no longer
     * be created.
     */
    USAGE_EXPIRE_DATETIME = 1610613138u /* TagType:DATE | 402 */,
    /*
     * Date when existing "messages" should no
     * longer be trusted.
     */
    MIN_SECONDS_BETWEEN_OPS = 805306771u /* TagType:UINT | 403 */,
    /*
     * Minimum elapsed time between
     * cryptographic operations with the key.
     */
    MAX_USES_PER_BOOT = 805306772u /* TagType:UINT | 404 */,
    /*
     * Number of times the key can be used per
     * boot.
     *
     *
     * User authentication
     */
    ALL_USERS = 1879048692u /* TagType:BOOL | 500 */,
    /**
     * Reserved for future use -- ignore.
     */
    USER_ID = 805306869u /* TagType:UINT | 501 */,
    /**
     * Reserved for future use -- ignore.
     */
    USER_SECURE_ID = 2684355062u /* TagType:ULONG_REP | 502 */,
    /*
     * Secure ID of authorized user or authenticator(s).
     * Disallowed if ALL_USERS or NO_AUTH_REQUIRED is
     * present.
     */
    NO_AUTH_REQUIRED = 1879048695u /* TagType:BOOL | 503 */,
    /**
     * If key is usable without authentication.
     */
    USER_AUTH_TYPE = 268435960u /* TagType:ENUM | 504 */,
    /*
     * Bitmask of authenticator types allowed when
     * USER_SECURE_ID contains a secure user ID, rather
     * than a secure authenticator ID.  Defined in
     * HardwareAuthenticatorType.
     */
    AUTH_TIMEOUT = 805306873u /* TagType:UINT | 505 */,
    /*
     * Required freshness of user authentication for
     * private/secret key operations, in seconds.  Public
     * key operations require no authentication.  If
     * absent, authentication is required for every use.
     * Authentication state is lost when the device is
     * powered off.
     */
    ALLOW_WHILE_ON_BODY = 1879048698u /* TagType:BOOL | 506 */,
    /*
     * Allow key to be used after authentication timeout
     * if device is still on-body (requires secure on-body
     * sensor.
     *
     *
     * Application access control
     */
    ALL_APPLICATIONS = 1879048792u /* TagType:BOOL | 600 */,
    /*
     * Specified to indicate key is usable by all
     * applications.
     */
    APPLICATION_ID = 2415919705u /* TagType:BYTES | 601 */,
    /**
     * Byte string identifying the authorized application.
     */
    EXPORTABLE = 1879048794u /* TagType:BOOL | 602 */,
    /*
     * If true, private/secret key can be exported, but only
     * if all access control requirements for use are
     * met. (keymaster2)
     *
     *
     * Semantically unenforceable tags, either because they have no specific meaning or because
     * they're informational only.
     */
    APPLICATION_DATA = 2415919804u /* TagType:BYTES | 700 */,
    /**
     * Data provided by authorized application.
     */
    CREATION_DATETIME = 1610613437u /* TagType:DATE | 701 */,
    /**
     * Key creation time
     */
    ORIGIN = 268436158u /* TagType:ENUM | 702 */,
    /**
     * keymaster_key_origin_t.
     */
    ROLLBACK_RESISTANT = 1879048895u /* TagType:BOOL | 703 */,
    /**
     * Whether key is rollback-resistant.
     */
    ROOT_OF_TRUST = 2415919808u /* TagType:BYTES | 704 */,
    /**
     * Root of trust ID.
     */
    OS_VERSION = 805307073u /* TagType:UINT | 705 */,
    /**
     * Version of system (keymaster2)
     */
    OS_PATCHLEVEL = 805307074u /* TagType:UINT | 706 */,
    /**
     * Patch level of system (keymaster2)
     */
    UNIQUE_ID = 2415919811u /* TagType:BYTES | 707 */,
    /**
     * Used to provide unique ID in attestation
     */
    ATTESTATION_CHALLENGE = 2415919812u /* TagType:BYTES | 708 */,
    /**
     * Used to provide challenge in attestation
     */
    ATTESTATION_APPLICATION_ID = 2415919813u /* TagType:BYTES | 709 */,
    /*
     * Used to identify the set of possible
     * applications of which one has initiated a
     * key attestation
     */
    ATTESTATION_ID_BRAND = 2415919814u /* TagType:BYTES | 710 */,
    /*
     * Used to provide the device's brand name to be
     * included in attestation
     */
    ATTESTATION_ID_DEVICE = 2415919815u /* TagType:BYTES | 711 */,
    /*
     * Used to provide the device's device name to be
     * included in attestation
     */
    ATTESTATION_ID_PRODUCT = 2415919816u /* TagType:BYTES | 712 */,
    /*
     * Used to provide the device's product name to be
     * included in attestation
     */
    ATTESTATION_ID_SERIAL = 2415919817u /* TagType:BYTES | 713 */,
    /*
     * Used to provide the device's serial number to be
     * included in attestation
     */
    ATTESTATION_ID_IMEI = 2415919818u /* TagType:BYTES | 714 */,
    /*
     * Used to provide the device's IMEI to be included
     * in attestation
     */
    ATTESTATION_ID_MEID = 2415919819u /* TagType:BYTES | 715 */,
    /*
     * Used to provide the device's MEID to be included
     * in attestation
     */
    ATTESTATION_ID_MANUFACTURER = 2415919820u /* TagType:BYTES | 716 */,
    /*
     * Used to provide the device's manufacturer
     * name to be included in attestation
     */
    ATTESTATION_ID_MODEL = 2415919821u /* TagType:BYTES | 717 */,
    /*
     * Used to provide the device's model name to be
     * included in attestation
     *
     *
     * Tags used only to provide data to or receive data from operations
     */
    ASSOCIATED_DATA = 2415920104u /* TagType:BYTES | 1000 */,
    /**
     * Used to provide associated data for AEAD modes.
     */
    NONCE = 2415920105u /* TagType:BYTES | 1001 */,
    /**
     * Nonce or Initialization Vector
     */
    AUTH_TOKEN = 2415920106u /* TagType:BYTES | 1002 */,
    /*
     * Authentication token that proves secure user
     * authentication has been performed.  Structure defined
     * in hw_auth_token_t in hw_auth_token.h.
     */
    MAC_LENGTH = 805307371u /* TagType:UINT | 1003 */,
    /**
     * MAC or AEAD authentication tag length in bits.
     */
    RESET_SINCE_ID_ROTATION = 1879049196u /* TagType:BOOL | 1004 */,
};

enum class Algorithm : uint32_t {
    /**
     * Asymmetric algorithms.
     */
    RSA = 1u,
    EC = 3u,
    /**
     * Block ciphers algorithms
     */
    AES = 32u,
    /**
     * MAC algorithms
     */
    HMAC = 128u,
};

/**
 * Symmetric block cipher modes provided by keymaster implementations.
 */
enum class BlockMode : uint32_t {
    /**
     * Unauthenticated modes, usable only for encryption/decryption and not generally recommended
     * except for compatibility with existing other protocols.
     */
    ECB = 1u,
    CBC = 2u,
    CTR = 3u,
    /**
     * Authenticated modes, usable for encryption/decryption and signing/verification.  Recommended
     * over unauthenticated modes for all purposes.
     */
    GCM = 32u,
};

/**
 * Padding modes that may be applied to plaintext for encryption operations.  This list includes
 * padding modes for both symmetric and asymmetric algorithms.  Note that implementations should not
 * provide all possible combinations of algorithm and padding, only the
 * cryptographically-appropriate pairs.
 */
enum class PaddingMode : uint32_t {
    NONE = 1u,
    /**
     * deprecated
     */
    RSA_OAEP = 2u,
    RSA_PSS = 3u,
    RSA_PKCS1_1_5_ENCRYPT = 4u,
    RSA_PKCS1_1_5_SIGN = 5u,
    PKCS7 = 64u,
};

/**
 * Digests provided by keymaster implementations.
 */
enum class Digest : uint32_t {
    NONE = 0u,
    MD5 = 1u,
    /*
     * Optional, may not be implemented in hardware, will be handled in software if
     * needed.
     */
    SHA1 = 2u,
    SHA_2_224 = 3u,
    SHA_2_256 = 4u,
    SHA_2_384 = 5u,
    SHA_2_512 = 6u,
};

/**
 * Supported EC curves, used in ECDSA
 */
enum class EcCurve : uint32_t {
    P_224 = 0u,
    P_256 = 1u,
    P_384 = 2u,
    P_521 = 3u,
};

/**
 * The origin of a key (or pair), i.e. where it was generated.  Note that ORIGIN can be found in
 * either the hardware-enforced or software-enforced list for a key, indicating whether the key is
 * hardware or software-based.  Specifically, a key with GENERATED in the hardware-enforced list is
 * guaranteed never to have existed outide the secure hardware.
 */
enum class KeyOrigin : uint32_t {
    GENERATED = 0u,
    /**
     * Generated in keymaster.  Should not exist outside the TEE.
     */
    DERIVED = 1u,
    /**
     * Derived inside keymaster.  Likely exists off-device.
     */
    IMPORTED = 2u,
    /**
     * Imported into keymaster.  Existed as cleartext in Android.
     */
    UNKNOWN = 3u,
};

/**
 * Usability requirements of key blobs.  This defines what system functionality must be available
 * for the key to function.  For example, key "blobs" which are actually handles referencing
 * encrypted key material stored in the file system cannot be used until the file system is
 * available, and should have BLOB_REQUIRES_FILE_SYSTEM.  Other requirements entries will be added
 * as needed for implementations.
 */
enum class KeyBlobUsageRequirements : uint32_t {
    STANDALONE = 0u,
    REQUIRES_FILE_SYSTEM = 1u,
};

/**
 * Possible purposes of a key (or pair).
 */
enum class KeyPurpose : uint32_t {
    ENCRYPT = 0u,
    /*
     * Usable with RSA, EC and AES keys.
     */
    DECRYPT = 1u,
    /*
     * Usable with RSA, EC and AES keys.
     */
    SIGN = 2u,
    /*
     * Usable with RSA, EC and HMAC keys.
     */
    VERIFY = 3u,
    /*
     * Usable with RSA, EC and HMAC keys.
     */
    DERIVE_KEY = 4u,
    /*
     * Usable with EC keys.
     */
    WRAP_KEY = 5u,
};

/**
 * Keymaster error codes.
 */
enum class ErrorCode : uint32_t {
    OK = 0u,
    ROOT_OF_TRUST_ALREADY_SET = 4294967295u /* -1 */,
    UNSUPPORTED_PURPOSE = 4294967294u /* -2 */,
    INCOMPATIBLE_PURPOSE = 4294967293u /* -3 */,
    UNSUPPORTED_ALGORITHM = 4294967292u /* -4 */,
    INCOMPATIBLE_ALGORITHM = 4294967291u /* -5 */,
    UNSUPPORTED_KEY_SIZE = 4294967290u /* -6 */,
    UNSUPPORTED_BLOCK_MODE = 4294967289u /* -7 */,
    INCOMPATIBLE_BLOCK_MODE = 4294967288u /* -8 */,
    UNSUPPORTED_MAC_LENGTH = 4294967287u /* -9 */,
    UNSUPPORTED_PADDING_MODE = 4294967286u /* -10 */,
    INCOMPATIBLE_PADDING_MODE = 4294967285u /* -11 */,
    UNSUPPORTED_DIGEST = 4294967284u /* -12 */,
    INCOMPATIBLE_DIGEST = 4294967283u /* -13 */,
    INVALID_EXPIRATION_TIME = 4294967282u /* -14 */,
    INVALID_USER_ID = 4294967281u /* -15 */,
    INVALID_AUTHORIZATION_TIMEOUT = 4294967280u /* -16 */,
    UNSUPPORTED_KEY_FORMAT = 4294967279u /* -17 */,
    INCOMPATIBLE_KEY_FORMAT = 4294967278u /* -18 */,
    UNSUPPORTED_KEY_ENCRYPTION_ALGORITHM = 4294967277u /* -19 */,
    /**
     * For PKCS8 & PKCS12
     */
    UNSUPPORTED_KEY_VERIFICATION_ALGORITHM = 4294967276u /* -20 */,
    /**
     * For PKCS8 & PKCS12
     */
    INVALID_INPUT_LENGTH = 4294967275u /* -21 */,
    KEY_EXPORT_OPTIONS_INVALID = 4294967274u /* -22 */,
    DELEGATION_NOT_ALLOWED = 4294967273u /* -23 */,
    KEY_NOT_YET_VALID = 4294967272u /* -24 */,
    KEY_EXPIRED = 4294967271u /* -25 */,
    KEY_USER_NOT_AUTHENTICATED = 4294967270u /* -26 */,
    OUTPUT_PARAMETER_NULL = 4294967269u /* -27 */,
    INVALID_OPERATION_HANDLE = 4294967268u /* -28 */,
    INSUFFICIENT_BUFFER_SPACE = 4294967267u /* -29 */,
    VERIFICATION_FAILED = 4294967266u /* -30 */,
    TOO_MANY_OPERATIONS = 4294967265u /* -31 */,
    UNEXPECTED_NULL_POINTER = 4294967264u /* -32 */,
    INVALID_KEY_BLOB = 4294967263u /* -33 */,
    IMPORTED_KEY_NOT_ENCRYPTED = 4294967262u /* -34 */,
    IMPORTED_KEY_DECRYPTION_FAILED = 4294967261u /* -35 */,
    IMPORTED_KEY_NOT_SIGNED = 4294967260u /* -36 */,
    IMPORTED_KEY_VERIFICATION_FAILED = 4294967259u /* -37 */,
    INVALID_ARGUMENT = 4294967258u /* -38 */,
    UNSUPPORTED_TAG = 4294967257u /* -39 */,
    INVALID_TAG = 4294967256u /* -40 */,
    MEMORY_ALLOCATION_FAILED = 4294967255u /* -41 */,
    IMPORT_PARAMETER_MISMATCH = 4294967252u /* -44 */,
    SECURE_HW_ACCESS_DENIED = 4294967251u /* -45 */,
    OPERATION_CANCELLED = 4294967250u /* -46 */,
    CONCURRENT_ACCESS_CONFLICT = 4294967249u /* -47 */,
    SECURE_HW_BUSY = 4294967248u /* -48 */,
    SECURE_HW_COMMUNICATION_FAILED = 4294967247u /* -49 */,
    UNSUPPORTED_EC_FIELD = 4294967246u /* -50 */,
    MISSING_NONCE = 4294967245u /* -51 */,
    INVALID_NONCE = 4294967244u /* -52 */,
    MISSING_MAC_LENGTH = 4294967243u /* -53 */,
    KEY_RATE_LIMIT_EXCEEDED = 4294967242u /* -54 */,
    CALLER_NONCE_PROHIBITED = 4294967241u /* -55 */,
    KEY_MAX_OPS_EXCEEDED = 4294967240u /* -56 */,
    INVALID_MAC_LENGTH = 4294967239u /* -57 */,
    MISSING_MIN_MAC_LENGTH = 4294967238u /* -58 */,
    UNSUPPORTED_MIN_MAC_LENGTH = 4294967237u /* -59 */,
    UNSUPPORTED_KDF = 4294967236u /* -60 */,
    UNSUPPORTED_EC_CURVE = 4294967235u /* -61 */,
    KEY_REQUIRES_UPGRADE = 4294967234u /* -62 */,
    ATTESTATION_CHALLENGE_MISSING = 4294967233u /* -63 */,
    KEYMASTER_NOT_CONFIGURED = 4294967232u /* -64 */,
    ATTESTATION_APPLICATION_ID_MISSING = 4294967231u /* -65 */,
    CANNOT_ATTEST_IDS = 4294967230u /* -66 */,
    UNIMPLEMENTED = 4294967196u /* -100 */,
    VERSION_MISMATCH = 4294967195u /* -101 */,
    UNKNOWN_ERROR = 4294966296u /* -1000 */,
};

/**
 * Key derivation functions, mostly used in ECIES.
 */
enum class KeyDerivationFunction : uint32_t {
    /**
     * Do not apply a key derivation function; use the raw agreed key
     */
    NONE = 0u,
    /**
     * HKDF defined in RFC 5869 with SHA256
     */
    RFC5869_SHA256 = 1u,
    /**
     * KDF1 defined in ISO 18033-2 with SHA1
     */
    ISO18033_2_KDF1_SHA1 = 2u,
    /**
     * KDF1 defined in ISO 18033-2 with SHA256
     */
    ISO18033_2_KDF1_SHA256 = 3u,
    /**
     * KDF2 defined in ISO 18033-2 with SHA1
     */
    ISO18033_2_KDF2_SHA1 = 4u,
    /**
     * KDF2 defined in ISO 18033-2 with SHA256
     */
    ISO18033_2_KDF2_SHA256 = 5u,
};

/**
 * Hardware authentication type, used by HardwareAuthTokens to specify the mechanism used to
 * authentiate the user, and in KeyCharacteristics to specify the allowable mechanisms for
 * authenticating to activate a key.
 */
enum class HardwareAuthenticatorType : uint32_t {
    NONE = 0u,
    PASSWORD = 1u /* 1 << 0 */,
    FINGERPRINT = 2u /* 1 << 1 */,
    ANY = 4294967295u /* 0xFFFFFFFF */,
};

struct KeyParameter final {
    // Forward declaration for forward reference support:
    union IntegerParams;

    union IntegerParams final {
        /**
         * Enum types
         */
        ::android::hardware::keymaster::V3_0::Algorithm algorithm __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::V3_0::BlockMode blockMode __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::V3_0::PaddingMode paddingMode __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::V3_0::Digest digest __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::V3_0::EcCurve ecCurve __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::V3_0::KeyOrigin origin __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::V3_0::KeyBlobUsageRequirements keyBlobUsageRequirements __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::V3_0::KeyPurpose purpose __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::V3_0::KeyDerivationFunction keyDerivationFunction __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::V3_0::HardwareAuthenticatorType hardwareAuthenticatorType __attribute__ ((aligned(4)));
        /**
         * Other types
         */
        bool boolValue __attribute__ ((aligned(1)));
        uint32_t integer __attribute__ ((aligned(4)));
        uint64_t longInteger __attribute__ ((aligned(8)));
        uint64_t dateTime __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, algorithm) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, blockMode) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, paddingMode) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, digest) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, ecCurve) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, origin) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, keyBlobUsageRequirements) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, purpose) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, keyDerivationFunction) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, hardwareAuthenticatorType) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, boolValue) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, integer) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, longInteger) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams, dateTime) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams) == 8, "wrong alignment");

    /**
     * Discriminates the uinon/blob field used.  The blob cannot be coincided with the union, but
     * only one of "f" and "blob" is ever used at a time.
     */
    ::android::hardware::keymaster::V3_0::Tag tag __attribute__ ((aligned(4)));
    ::android::hardware::keymaster::V3_0::KeyParameter::IntegerParams f __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<uint8_t> blob __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter, tag) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter, f) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyParameter, blob) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::keymaster::V3_0::KeyParameter) == 32, "wrong size");
static_assert(__alignof(::android::hardware::keymaster::V3_0::KeyParameter) == 8, "wrong alignment");

struct KeyCharacteristics final {
    ::android::hardware::hidl_vec<::android::hardware::keymaster::V3_0::KeyParameter> softwareEnforced __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::keymaster::V3_0::KeyParameter> teeEnforced __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyCharacteristics, softwareEnforced) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::V3_0::KeyCharacteristics, teeEnforced) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::keymaster::V3_0::KeyCharacteristics) == 32, "wrong size");
static_assert(__alignof(::android::hardware::keymaster::V3_0::KeyCharacteristics) == 8, "wrong alignment");

/**
 * Data used to prove successful authentication.
 */
struct HardwareAuthToken final {
    uint64_t challenge __attribute__ ((aligned(8)));
    uint64_t userId __attribute__ ((aligned(8)));
    uint64_t authenticatorId __attribute__ ((aligned(8)));
    uint32_t authenticatorType __attribute__ ((aligned(4)));
    uint64_t timestamp __attribute__ ((aligned(8)));
    ::android::hardware::hidl_array<uint8_t, 32> hmac __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::keymaster::V3_0::HardwareAuthToken, challenge) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::V3_0::HardwareAuthToken, userId) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::V3_0::HardwareAuthToken, authenticatorId) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::V3_0::HardwareAuthToken, authenticatorType) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::V3_0::HardwareAuthToken, timestamp) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::V3_0::HardwareAuthToken, hmac) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::keymaster::V3_0::HardwareAuthToken) == 72, "wrong size");
static_assert(__alignof(::android::hardware::keymaster::V3_0::HardwareAuthToken) == 8, "wrong alignment");

enum class SecurityLevel : uint32_t {
    SOFTWARE = 0u,
    TRUSTED_ENVIRONMENT = 1u,
};

/**
 * Formats for key import and export.
 */
enum class KeyFormat : uint32_t {
    X509 = 0u,
    /**
     * for public key export
     */
    PKCS8 = 1u,
    /**
     * for asymmetric key pair import
     */
    RAW = 3u,
};

typedef uint64_t OperationHandle;

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint32_t o);
static inline std::string toString(::android::hardware::keymaster::V3_0::TagType o);
static inline void PrintTo(::android::hardware::keymaster::V3_0::TagType o, ::std::ostream* os);
constexpr uint32_t operator|(const ::android::hardware::keymaster::V3_0::TagType lhs, const ::android::hardware::keymaster::V3_0::TagType rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | static_cast<uint32_t>(rhs));
}
