{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA2_PFiPK8encodingPKcS3_PS3_E",
   "name" : "int (*[2])(const encoding *, const char *, const char *, const char **)",
   "referenced_type" : "_ZTIPFiPK8encodingPKcS3_PS3_E",
   "self_type" : "_ZTIA2_PFiPK8encodingPKcS3_PS3_E",
   "size" : 16,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA4_PFiPK8encodingPKcS3_PS3_E",
   "name" : "int (*[4])(const encoding *, const char *, const char *, const char **)",
   "referenced_type" : "_ZTIPFiPK8encodingPKcS3_PS3_E",
   "self_type" : "_ZTIA4_PFiPK8encodingPKcS3_PS3_E",
   "size" : 32,
   "source_file" : "external/expat/lib/xmltok.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIt",
   "name" : "unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIt",
   "size" : 2
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" :
 [
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 0,
     "name" : "XML_CONVERT_COMPLETED"
    },
    {
     "enum_field_value" : 1,
     "name" : "XML_CONVERT_INPUT_INCOMPLETE"
    },
    {
     "enum_field_value" : 2,
     "name" : "XML_CONVERT_OUTPUT_EXHAUSTED"
    }
   ],
   "linker_set_key" : "_ZTI18XML_Convert_Result",
   "name" : "XML_Convert_Result",
   "referenced_type" : "_ZTI18XML_Convert_Result",
   "self_type" : "_ZTI18XML_Convert_Result",
   "size" : 4,
   "source_file" : "external/expat/lib/xmltok.h",
   "underlying_type" : "_ZTIj"
  },
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : -1,
     "name" : "XML_ROLE_ERROR"
    },
    {
     "enum_field_value" : 0,
     "name" : "XML_ROLE_NONE"
    },
    {
     "enum_field_value" : 1,
     "name" : "XML_ROLE_XML_DECL"
    },
    {
     "enum_field_value" : 2,
     "name" : "XML_ROLE_INSTANCE_START"
    },
    {
     "enum_field_value" : 3,
     "name" : "XML_ROLE_DOCTYPE_NONE"
    },
    {
     "enum_field_value" : 4,
     "name" : "XML_ROLE_DOCTYPE_NAME"
    },
    {
     "enum_field_value" : 5,
     "name" : "XML_ROLE_DOCTYPE_SYSTEM_ID"
    },
    {
     "enum_field_value" : 6,
     "name" : "XML_ROLE_DOCTYPE_PUBLIC_ID"
    },
    {
     "enum_field_value" : 7,
     "name" : "XML_ROLE_DOCTYPE_INTERNAL_SUBSET"
    },
    {
     "enum_field_value" : 8,
     "name" : "XML_ROLE_DOCTYPE_CLOSE"
    },
    {
     "enum_field_value" : 9,
     "name" : "XML_ROLE_GENERAL_ENTITY_NAME"
    },
    {
     "enum_field_value" : 10,
     "name" : "XML_ROLE_PARAM_ENTITY_NAME"
    },
    {
     "enum_field_value" : 11,
     "name" : "XML_ROLE_ENTITY_NONE"
    },
    {
     "enum_field_value" : 12,
     "name" : "XML_ROLE_ENTITY_VALUE"
    },
    {
     "enum_field_value" : 13,
     "name" : "XML_ROLE_ENTITY_SYSTEM_ID"
    },
    {
     "enum_field_value" : 14,
     "name" : "XML_ROLE_ENTITY_PUBLIC_ID"
    },
    {
     "enum_field_value" : 15,
     "name" : "XML_ROLE_ENTITY_COMPLETE"
    },
    {
     "enum_field_value" : 16,
     "name" : "XML_ROLE_ENTITY_NOTATION_NAME"
    },
    {
     "enum_field_value" : 17,
     "name" : "XML_ROLE_NOTATION_NONE"
    },
    {
     "enum_field_value" : 18,
     "name" : "XML_ROLE_NOTATION_NAME"
    },
    {
     "enum_field_value" : 19,
     "name" : "XML_ROLE_NOTATION_SYSTEM_ID"
    },
    {
     "enum_field_value" : 20,
     "name" : "XML_ROLE_NOTATION_NO_SYSTEM_ID"
    },
    {
     "enum_field_value" : 21,
     "name" : "XML_ROLE_NOTATION_PUBLIC_ID"
    },
    {
     "enum_field_value" : 22,
     "name" : "XML_ROLE_ATTRIBUTE_NAME"
    },
    {
     "enum_field_value" : 23,
     "name" : "XML_ROLE_ATTRIBUTE_TYPE_CDATA"
    },
    {
     "enum_field_value" : 24,
     "name" : "XML_ROLE_ATTRIBUTE_TYPE_ID"
    },
    {
     "enum_field_value" : 25,
     "name" : "XML_ROLE_ATTRIBUTE_TYPE_IDREF"
    },
    {
     "enum_field_value" : 26,
     "name" : "XML_ROLE_ATTRIBUTE_TYPE_IDREFS"
    },
    {
     "enum_field_value" : 27,
     "name" : "XML_ROLE_ATTRIBUTE_TYPE_ENTITY"
    },
    {
     "enum_field_value" : 28,
     "name" : "XML_ROLE_ATTRIBUTE_TYPE_ENTITIES"
    },
    {
     "enum_field_value" : 29,
     "name" : "XML_ROLE_ATTRIBUTE_TYPE_NMTOKEN"
    },
    {
     "enum_field_value" : 30,
     "name" : "XML_ROLE_ATTRIBUTE_TYPE_NMTOKENS"
    },
    {
     "enum_field_value" : 31,
     "name" : "XML_ROLE_ATTRIBUTE_ENUM_VALUE"
    },
    {
     "enum_field_value" : 32,
     "name" : "XML_ROLE_ATTRIBUTE_NOTATION_VALUE"
    },
    {
     "enum_field_value" : 33,
     "name" : "XML_ROLE_ATTLIST_NONE"
    },
    {
     "enum_field_value" : 34,
     "name" : "XML_ROLE_ATTLIST_ELEMENT_NAME"
    },
    {
     "enum_field_value" : 35,
     "name" : "XML_ROLE_IMPLIED_ATTRIBUTE_VALUE"
    },
    {
     "enum_field_value" : 36,
     "name" : "XML_ROLE_REQUIRED_ATTRIBUTE_VALUE"
    },
    {
     "enum_field_value" : 37,
     "name" : "XML_ROLE_DEFAULT_ATTRIBUTE_VALUE"
    },
    {
     "enum_field_value" : 38,
     "name" : "XML_ROLE_FIXED_ATTRIBUTE_VALUE"
    },
    {
     "enum_field_value" : 39,
     "name" : "XML_ROLE_ELEMENT_NONE"
    },
    {
     "enum_field_value" : 40,
     "name" : "XML_ROLE_ELEMENT_NAME"
    },
    {
     "enum_field_value" : 41,
     "name" : "XML_ROLE_CONTENT_ANY"
    },
    {
     "enum_field_value" : 42,
     "name" : "XML_ROLE_CONTENT_EMPTY"
    },
    {
     "enum_field_value" : 43,
     "name" : "XML_ROLE_CONTENT_PCDATA"
    },
    {
     "enum_field_value" : 44,
     "name" : "XML_ROLE_GROUP_OPEN"
    },
    {
     "enum_field_value" : 45,
     "name" : "XML_ROLE_GROUP_CLOSE"
    },
    {
     "enum_field_value" : 46,
     "name" : "XML_ROLE_GROUP_CLOSE_REP"
    },
    {
     "enum_field_value" : 47,
     "name" : "XML_ROLE_GROUP_CLOSE_OPT"
    },
    {
     "enum_field_value" : 48,
     "name" : "XML_ROLE_GROUP_CLOSE_PLUS"
    },
    {
     "enum_field_value" : 49,
     "name" : "XML_ROLE_GROUP_CHOICE"
    },
    {
     "enum_field_value" : 50,
     "name" : "XML_ROLE_GROUP_SEQUENCE"
    },
    {
     "enum_field_value" : 51,
     "name" : "XML_ROLE_CONTENT_ELEMENT"
    },
    {
     "enum_field_value" : 52,
     "name" : "XML_ROLE_CONTENT_ELEMENT_REP"
    },
    {
     "enum_field_value" : 53,
     "name" : "XML_ROLE_CONTENT_ELEMENT_OPT"
    },
    {
     "enum_field_value" : 54,
     "name" : "XML_ROLE_CONTENT_ELEMENT_PLUS"
    },
    {
     "enum_field_value" : 55,
     "name" : "XML_ROLE_PI"
    },
    {
     "enum_field_value" : 56,
     "name" : "XML_ROLE_COMMENT"
    },
    {
     "enum_field_value" : 57,
     "name" : "XML_ROLE_TEXT_DECL"
    },
    {
     "enum_field_value" : 58,
     "name" : "XML_ROLE_IGNORE_SECT"
    },
    {
     "enum_field_value" : 59,
     "name" : "XML_ROLE_INNER_PARAM_ENTITY_REF"
    },
    {
     "enum_field_value" : 60,
     "name" : "XML_ROLE_PARAM_ENTITY_REF"
    }
   ],
   "linker_set_key" : "_ZTI30$XML_ROLE_ATTLIST_ELEMENT_NAME",
   "name" : "(anonymous enum at external/expat/lib/xmlrole.h:48:1)",
   "referenced_type" : "_ZTI30$XML_ROLE_ATTLIST_ELEMENT_NAME",
   "self_type" : "_ZTI30$XML_ROLE_ATTLIST_ELEMENT_NAME",
   "size" : 4,
   "source_file" : "external/expat/lib/xmlrole.h",
   "underlying_type" : "_ZTIi"
  }
 ],
 "function_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "name" : "XML_Convert_Result (const encoding *, const char **, const char *, char **, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPPc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "return_type" : "_ZTI18XML_Convert_Result",
   "self_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "name" : "XML_Convert_Result (const encoding *, const char **, const char *, unsigned short **, const unsigned short *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPPt"
    },
    {
     "referenced_type" : "_ZTIPKt"
    }
   ],
   "referenced_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "return_type" : "_ZTI18XML_Convert_Result",
   "self_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFPKcPK8encodingS0_E",
   "name" : "const char *(const encoding *, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIFPKcPK8encodingS0_E",
   "return_type" : "_ZTIPKc",
   "self_type" : "_ZTIFPKcPK8encodingS0_E",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiP12prolog_stateiPKcS2_PK8encodingE",
   "name" : "int (prolog_state *, int, const char *, const char *, const encoding *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP12prolog_state"
    },
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPK8encoding"
    }
   ],
   "referenced_type" : "_ZTIFiP12prolog_stateiPKcS2_PK8encodingE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiP12prolog_stateiPKcS2_PK8encodingE",
   "source_file" : "external/expat/lib/xmlrole.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPK8encodingPKcE",
   "name" : "int (const encoding *, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIFiPK8encodingPKcE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPK8encodingPKcE",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPK8encodingPKcS3_E",
   "name" : "int (const encoding *, const char *, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_E",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPK8encodingPKcS3_E",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPK8encodingPKcS3_PS3_E",
   "name" : "int (const encoding *, const char *, const char *, const char **)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    }
   ],
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_PS3_E",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPK8encodingPKcS3_PS3_E",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPK8encodingPKcS3_S3_E",
   "name" : "int (const encoding *, const char *, const char *, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_S3_E",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPK8encodingPKcS3_S3_E",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPK8encodingPKciP9ATTRIBUTEE",
   "name" : "int (const encoding *, const char *, int, ATTRIBUTE *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTIP9ATTRIBUTE"
    }
   ],
   "referenced_type" : "_ZTIFiPK8encodingPKciP9ATTRIBUTEE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPK8encodingPKciP9ATTRIBUTEE",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFvPK8encodingPKcS3_P8positionE",
   "name" : "void (const encoding *, const char *, const char *, position *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIP8position"
    }
   ],
   "referenced_type" : "_ZTIFvPK8encodingPKcS3_P8positionE",
   "return_type" : "_ZTIv",
   "self_type" : "_ZTIFvPK8encodingPKcS3_P8positionE",
   "source_file" : "external/expat/lib/xmltok.h"
  }
 ],
 "functions" :
 [
  {
   "function_name" : "XmlPrologStateInit",
   "linker_set_key" : "XmlPrologStateInit",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP12prolog_state"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "external/expat/lib/xmlrole.h"
  },
  {
   "function_name" : "XmlPrologStateInitExternalEntity",
   "linker_set_key" : "XmlPrologStateInitExternalEntity",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP12prolog_state"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "external/expat/lib/xmlrole.h"
  }
 ],
 "global_vars" : [],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP12prolog_state",
   "name" : "prolog_state *",
   "referenced_type" : "_ZTI12prolog_state",
   "self_type" : "_ZTIP12prolog_state",
   "size" : 8,
   "source_file" : "external/expat/lib/xmlrole.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP8position",
   "name" : "position *",
   "referenced_type" : "_ZTI8position",
   "self_type" : "_ZTIP8position",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP9ATTRIBUTE",
   "name" : "ATTRIBUTE *",
   "referenced_type" : "_ZTI9ATTRIBUTE",
   "self_type" : "_ZTIP9ATTRIBUTE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "name" : "XML_Convert_Result (*)(const encoding *, const char **, const char *, char **, const char *)",
   "referenced_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "self_type" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "name" : "XML_Convert_Result (*)(const encoding *, const char **, const char *, unsigned short **, const unsigned short *)",
   "referenced_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "self_type" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFPKcPK8encodingS0_E",
   "name" : "const char *(*)(const encoding *, const char *)",
   "referenced_type" : "_ZTIFPKcPK8encodingS0_E",
   "self_type" : "_ZTIPFPKcPK8encodingS0_E",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiP12prolog_stateiPKcS2_PK8encodingE",
   "name" : "int (*)(prolog_state *, int, const char *, const char *, const encoding *)",
   "referenced_type" : "_ZTIFiP12prolog_stateiPKcS2_PK8encodingE",
   "self_type" : "_ZTIPFiP12prolog_stateiPKcS2_PK8encodingE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmlrole.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPK8encodingPKcE",
   "name" : "int (*)(const encoding *, const char *)",
   "referenced_type" : "_ZTIFiPK8encodingPKcE",
   "self_type" : "_ZTIPFiPK8encodingPKcE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPK8encodingPKcS3_E",
   "name" : "int (*)(const encoding *, const char *, const char *)",
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_E",
   "self_type" : "_ZTIPFiPK8encodingPKcS3_E",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPK8encodingPKcS3_PS3_E",
   "name" : "int (*)(const encoding *, const char *, const char *, const char **)",
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_PS3_E",
   "self_type" : "_ZTIPFiPK8encodingPKcS3_PS3_E",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPK8encodingPKcS3_S3_E",
   "name" : "int (*)(const encoding *, const char *, const char *, const char *)",
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_S3_E",
   "self_type" : "_ZTIPFiPK8encodingPKcS3_S3_E",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPK8encodingPKciP9ATTRIBUTEE",
   "name" : "int (*)(const encoding *, const char *, int, ATTRIBUTE *)",
   "referenced_type" : "_ZTIFiPK8encodingPKciP9ATTRIBUTEE",
   "self_type" : "_ZTIPFiPK8encodingPKciP9ATTRIBUTEE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFvPK8encodingPKcS3_P8positionE",
   "name" : "void (*)(const encoding *, const char *, const char *, position *)",
   "referenced_type" : "_ZTIFvPK8encodingPKcS3_P8positionE",
   "self_type" : "_ZTIPFvPK8encodingPKcS3_P8positionE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK8encoding",
   "name" : "const encoding *",
   "referenced_type" : "_ZTIK8encoding",
   "self_type" : "_ZTIPK8encoding",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKt",
   "name" : "const unsigned short *",
   "referenced_type" : "_ZTIKt",
   "self_type" : "_ZTIPKt",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPK8encoding",
   "name" : "const encoding **",
   "referenced_type" : "_ZTIPK8encoding",
   "self_type" : "_ZTIPPK8encoding",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKc",
   "name" : "const char **",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIPPKc",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPc",
   "name" : "char **",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIPPc",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPt",
   "name" : "unsigned short **",
   "referenced_type" : "_ZTIPt",
   "self_type" : "_ZTIPPt",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPt",
   "name" : "unsigned short *",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIPt",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8encoding",
   "name" : "const encoding",
   "referenced_type" : "_ZTI8encoding",
   "self_type" : "_ZTIK8encoding",
   "size" : 136,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "external/expat/lib/xmltok.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIPFiP12prolog_stateiPKcS2_PK8encodingE"
    },
    {
     "field_name" : "level",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "role_none",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "includeLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "documentEntity",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "inEntityValue",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI12prolog_state",
   "name" : "prolog_state",
   "referenced_type" : "_ZTI12prolog_state",
   "self_type" : "_ZTI12prolog_state",
   "size" : 32,
   "source_file" : "external/expat/lib/xmlrole.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "initEnc",
     "referenced_type" : "_ZTI8encoding"
    },
    {
     "field_name" : "encPtr",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPPK8encoding"
    }
   ],
   "linker_set_key" : "_ZTI13INIT_ENCODING",
   "name" : "INIT_ENCODING",
   "referenced_type" : "_ZTI13INIT_ENCODING",
   "self_type" : "_ZTI13INIT_ENCODING",
   "size" : 144,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "scanners",
     "referenced_type" : "_ZTIA4_PFiPK8encodingPKcS3_PS3_E"
    },
    {
     "field_name" : "literalScanners",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA2_PFiPK8encodingPKcS3_PS3_E"
    },
    {
     "field_name" : "nameMatchesAscii",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFiPK8encodingPKcS3_S3_E"
    },
    {
     "field_name" : "nameLength",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiPK8encodingPKcE"
    },
    {
     "field_name" : "skipS",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFPKcPK8encodingS0_E"
    },
    {
     "field_name" : "getAtts",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFiPK8encodingPKciP9ATTRIBUTEE"
    },
    {
     "field_name" : "charRefNumber",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFiPK8encodingPKcE"
    },
    {
     "field_name" : "predefinedEntityName",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFiPK8encodingPKcS3_E"
    },
    {
     "field_name" : "updatePosition",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvPK8encodingPKcS3_P8positionE"
    },
    {
     "field_name" : "isPublicId",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiPK8encodingPKcS3_PS3_E"
    },
    {
     "field_name" : "utf8Convert",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E"
    },
    {
     "field_name" : "utf16Convert",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE"
    },
    {
     "field_name" : "minBytesPerChar",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "isUtf8",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "isUtf16",
     "field_offset" : 1064,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI8encoding",
   "name" : "encoding",
   "referenced_type" : "_ZTI8encoding",
   "self_type" : "_ZTI8encoding",
   "size" : 136,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lineNumber",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "columnNumber",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8position",
   "name" : "position",
   "referenced_type" : "_ZTI8position",
   "self_type" : "_ZTI8position",
   "size" : 16,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "valuePtr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "valueEnd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "normalized",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI9ATTRIBUTE",
   "name" : "ATTRIBUTE",
   "referenced_type" : "_ZTI9ATTRIBUTE",
   "self_type" : "_ZTI9ATTRIBUTE",
   "size" : 32,
   "source_file" : "external/expat/lib/xmltok.h"
  }
 ],
 "rvalue_reference_types" : []
}
