{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA256_h",
   "name" : "unsigned char [256]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA256_h",
   "size" : 256,
   "source_file" : "external/expat/lib/nametab.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA2_PFiPK8encodingPKcS3_PS3_E",
   "name" : "int (*[2])(const encoding *, const char *, const char *, const char **)",
   "referenced_type" : "_ZTIPFiPK8encodingPKcS3_PS3_E",
   "self_type" : "_ZTIA2_PFiPK8encodingPKcS3_PS3_E",
   "size" : 16,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA320_j",
   "name" : "unsigned int [320]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA320_j",
   "size" : 1280,
   "source_file" : "external/expat/lib/nametab.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA4_PFiPK8encodingPKcS3_PS3_E",
   "name" : "int (*[4])(const encoding *, const char *, const char *, const char **)",
   "referenced_type" : "_ZTIPFiPK8encodingPKcS3_PS3_E",
   "self_type" : "_ZTIA4_PFiPK8encodingPKcS3_PS3_E",
   "size" : 32,
   "source_file" : "external/expat/lib/xmltok.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIt",
   "name" : "unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIt",
   "size" : 2
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" :
 [
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 0,
     "name" : "XML_CONVERT_COMPLETED"
    },
    {
     "enum_field_value" : 1,
     "name" : "XML_CONVERT_INPUT_INCOMPLETE"
    },
    {
     "enum_field_value" : 2,
     "name" : "XML_CONVERT_OUTPUT_EXHAUSTED"
    }
   ],
   "linker_set_key" : "_ZTI18XML_Convert_Result",
   "name" : "XML_Convert_Result",
   "referenced_type" : "_ZTI18XML_Convert_Result",
   "self_type" : "_ZTI18XML_Convert_Result",
   "size" : 4,
   "source_file" : "external/expat/lib/xmltok.h",
   "underlying_type" : "_ZTIj"
  },
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 0,
     "name" : "BT_NONXML"
    },
    {
     "enum_field_value" : 1,
     "name" : "BT_MALFORM"
    },
    {
     "enum_field_value" : 2,
     "name" : "BT_LT"
    },
    {
     "enum_field_value" : 3,
     "name" : "BT_AMP"
    },
    {
     "enum_field_value" : 4,
     "name" : "BT_RSQB"
    },
    {
     "enum_field_value" : 5,
     "name" : "BT_LEAD2"
    },
    {
     "enum_field_value" : 6,
     "name" : "BT_LEAD3"
    },
    {
     "enum_field_value" : 7,
     "name" : "BT_LEAD4"
    },
    {
     "enum_field_value" : 8,
     "name" : "BT_TRAIL"
    },
    {
     "enum_field_value" : 9,
     "name" : "BT_CR"
    },
    {
     "enum_field_value" : 10,
     "name" : "BT_LF"
    },
    {
     "enum_field_value" : 11,
     "name" : "BT_GT"
    },
    {
     "enum_field_value" : 12,
     "name" : "BT_QUOT"
    },
    {
     "enum_field_value" : 13,
     "name" : "BT_APOS"
    },
    {
     "enum_field_value" : 14,
     "name" : "BT_EQUALS"
    },
    {
     "enum_field_value" : 15,
     "name" : "BT_QUEST"
    },
    {
     "enum_field_value" : 16,
     "name" : "BT_EXCL"
    },
    {
     "enum_field_value" : 17,
     "name" : "BT_SOL"
    },
    {
     "enum_field_value" : 18,
     "name" : "BT_SEMI"
    },
    {
     "enum_field_value" : 19,
     "name" : "BT_NUM"
    },
    {
     "enum_field_value" : 20,
     "name" : "BT_LSQB"
    },
    {
     "enum_field_value" : 21,
     "name" : "BT_S"
    },
    {
     "enum_field_value" : 22,
     "name" : "BT_NMSTRT"
    },
    {
     "enum_field_value" : 23,
     "name" : "BT_COLON"
    },
    {
     "enum_field_value" : 24,
     "name" : "BT_HEX"
    },
    {
     "enum_field_value" : 25,
     "name" : "BT_DIGIT"
    },
    {
     "enum_field_value" : 26,
     "name" : "BT_NAME"
    },
    {
     "enum_field_value" : 27,
     "name" : "BT_MINUS"
    },
    {
     "enum_field_value" : 28,
     "name" : "BT_OTHER"
    },
    {
     "enum_field_value" : 29,
     "name" : "BT_NONASCII"
    },
    {
     "enum_field_value" : 30,
     "name" : "BT_PERCNT"
    },
    {
     "enum_field_value" : 31,
     "name" : "BT_LPAR"
    },
    {
     "enum_field_value" : 32,
     "name" : "BT_RPAR"
    },
    {
     "enum_field_value" : 33,
     "name" : "BT_AST"
    },
    {
     "enum_field_value" : 34,
     "name" : "BT_PLUS"
    },
    {
     "enum_field_value" : 35,
     "name" : "BT_COMMA"
    },
    {
     "enum_field_value" : 36,
     "name" : "BT_VERBAR"
    }
   ],
   "linker_set_key" : "_ZTI7$BT_AMP",
   "name" : "(anonymous enum at external/expat/lib/xmltok_impl.h:33:1)",
   "referenced_type" : "_ZTI7$BT_AMP",
   "self_type" : "_ZTI7$BT_AMP",
   "size" : 4,
   "source_file" : "external/expat/lib/xmltok_impl.h",
   "underlying_type" : "_ZTIj"
  }
 ],
 "function_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "name" : "XML_Convert_Result (const encoding *, const char **, const char *, char **, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPPc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "return_type" : "_ZTI18XML_Convert_Result",
   "self_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "name" : "XML_Convert_Result (const encoding *, const char **, const char *, unsigned short **, const unsigned short *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPPt"
    },
    {
     "referenced_type" : "_ZTIPKt"
    }
   ],
   "referenced_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "return_type" : "_ZTI18XML_Convert_Result",
   "self_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFPKcPK8encodingS0_E",
   "name" : "const char *(const encoding *, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIFPKcPK8encodingS0_E",
   "return_type" : "_ZTIPKc",
   "self_type" : "_ZTIFPKcPK8encodingS0_E",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPK8encodingPKcE",
   "name" : "int (const encoding *, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIFiPK8encodingPKcE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPK8encodingPKcE",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPK8encodingPKcS3_E",
   "name" : "int (const encoding *, const char *, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_E",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPK8encodingPKcS3_E",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPK8encodingPKcS3_PS3_E",
   "name" : "int (const encoding *, const char *, const char *, const char **)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    }
   ],
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_PS3_E",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPK8encodingPKcS3_PS3_E",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPK8encodingPKcS3_S3_E",
   "name" : "int (const encoding *, const char *, const char *, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_S3_E",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPK8encodingPKcS3_S3_E",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPK8encodingPKciP9ATTRIBUTEE",
   "name" : "int (const encoding *, const char *, int, ATTRIBUTE *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTIP9ATTRIBUTE"
    }
   ],
   "referenced_type" : "_ZTIFiPK8encodingPKciP9ATTRIBUTEE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPK8encodingPKciP9ATTRIBUTEE",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPvPKcE",
   "name" : "int (void *, const char *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPv"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "referenced_type" : "_ZTIFiPvPKcE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPvPKcE",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFvPK8encodingPKcS3_P8positionE",
   "name" : "void (const encoding *, const char *, const char *, position *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIP8position"
    }
   ],
   "referenced_type" : "_ZTIFvPK8encodingPKcS3_P8positionE",
   "return_type" : "_ZTIv",
   "self_type" : "_ZTIFvPK8encodingPKcS3_P8positionE",
   "source_file" : "external/expat/lib/xmltok.h"
  }
 ],
 "functions" :
 [
  {
   "function_name" : "XmlGetUtf16InternalEncoding",
   "linker_set_key" : "XmlGetUtf16InternalEncoding",
   "return_type" : "_ZTIPK8encoding",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlGetUtf16InternalEncodingNS",
   "linker_set_key" : "XmlGetUtf16InternalEncodingNS",
   "return_type" : "_ZTIPK8encoding",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlGetUtf8InternalEncoding",
   "linker_set_key" : "XmlGetUtf8InternalEncoding",
   "return_type" : "_ZTIPK8encoding",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlGetUtf8InternalEncodingNS",
   "linker_set_key" : "XmlGetUtf8InternalEncodingNS",
   "return_type" : "_ZTIPK8encoding",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlInitEncoding",
   "linker_set_key" : "XmlInitEncoding",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP13INIT_ENCODING"
    },
    {
     "referenced_type" : "_ZTIPPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlInitEncodingNS",
   "linker_set_key" : "XmlInitEncodingNS",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP13INIT_ENCODING"
    },
    {
     "referenced_type" : "_ZTIPPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlInitUnknownEncoding",
   "linker_set_key" : "XmlInitUnknownEncoding",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPv"
    },
    {
     "referenced_type" : "_ZTIPi"
    },
    {
     "referenced_type" : "_ZTIPFiPvPKcE"
    },
    {
     "referenced_type" : "_ZTIPv"
    }
   ],
   "return_type" : "_ZTIP8encoding",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlInitUnknownEncodingNS",
   "linker_set_key" : "XmlInitUnknownEncodingNS",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPv"
    },
    {
     "referenced_type" : "_ZTIPi"
    },
    {
     "referenced_type" : "_ZTIPFiPvPKcE"
    },
    {
     "referenced_type" : "_ZTIPv"
    }
   ],
   "return_type" : "_ZTIP8encoding",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlParseXmlDecl",
   "linker_set_key" : "XmlParseXmlDecl",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlParseXmlDeclNS",
   "linker_set_key" : "XmlParseXmlDeclNS",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTIPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "referenced_type" : "_ZTIPPK8encoding"
    },
    {
     "referenced_type" : "_ZTIPi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlSizeOfUnknownEncoding",
   "linker_set_key" : "XmlSizeOfUnknownEncoding",
   "return_type" : "_ZTIi",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlUtf16Encode",
   "linker_set_key" : "XmlUtf16Encode",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTIPt"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "XmlUtf8Encode",
   "linker_set_key" : "XmlUtf8Encode",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTIPc"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "function_name" : "_INTERNAL_trim_to_complete_utf8_characters",
   "linker_set_key" : "_INTERNAL_trim_to_complete_utf8_characters",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIPPKc"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "external/expat/lib/internal.h"
  }
 ],
 "global_vars" :
 [
  {
   "linker_set_key" : "namePages",
   "name" : "namePages",
   "referenced_type" : "_ZTIA256_Kh",
   "source_file" : "external/expat/lib/nametab.h"
  },
  {
   "linker_set_key" : "namingBitmap",
   "name" : "namingBitmap",
   "referenced_type" : "_ZTIA320_Kj",
   "source_file" : "external/expat/lib/nametab.h"
  },
  {
   "linker_set_key" : "nmstrtPages",
   "name" : "nmstrtPages",
   "referenced_type" : "_ZTIA256_Kh",
   "source_file" : "external/expat/lib/nametab.h"
  }
 ],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP13INIT_ENCODING",
   "name" : "INIT_ENCODING *",
   "referenced_type" : "_ZTI13INIT_ENCODING",
   "self_type" : "_ZTIP13INIT_ENCODING",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP8encoding",
   "name" : "encoding *",
   "referenced_type" : "_ZTI8encoding",
   "self_type" : "_ZTIP8encoding",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP8position",
   "name" : "position *",
   "referenced_type" : "_ZTI8position",
   "self_type" : "_ZTIP8position",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP9ATTRIBUTE",
   "name" : "ATTRIBUTE *",
   "referenced_type" : "_ZTI9ATTRIBUTE",
   "self_type" : "_ZTIP9ATTRIBUTE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "name" : "XML_Convert_Result (*)(const encoding *, const char **, const char *, char **, const char *)",
   "referenced_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "self_type" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "name" : "XML_Convert_Result (*)(const encoding *, const char **, const char *, unsigned short **, const unsigned short *)",
   "referenced_type" : "_ZTIF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "self_type" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFPKcPK8encodingS0_E",
   "name" : "const char *(*)(const encoding *, const char *)",
   "referenced_type" : "_ZTIFPKcPK8encodingS0_E",
   "self_type" : "_ZTIPFPKcPK8encodingS0_E",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPK8encodingPKcE",
   "name" : "int (*)(const encoding *, const char *)",
   "referenced_type" : "_ZTIFiPK8encodingPKcE",
   "self_type" : "_ZTIPFiPK8encodingPKcE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPK8encodingPKcS3_E",
   "name" : "int (*)(const encoding *, const char *, const char *)",
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_E",
   "self_type" : "_ZTIPFiPK8encodingPKcS3_E",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPK8encodingPKcS3_PS3_E",
   "name" : "int (*)(const encoding *, const char *, const char *, const char **)",
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_PS3_E",
   "self_type" : "_ZTIPFiPK8encodingPKcS3_PS3_E",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPK8encodingPKcS3_S3_E",
   "name" : "int (*)(const encoding *, const char *, const char *, const char *)",
   "referenced_type" : "_ZTIFiPK8encodingPKcS3_S3_E",
   "self_type" : "_ZTIPFiPK8encodingPKcS3_S3_E",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPK8encodingPKciP9ATTRIBUTEE",
   "name" : "int (*)(const encoding *, const char *, int, ATTRIBUTE *)",
   "referenced_type" : "_ZTIFiPK8encodingPKciP9ATTRIBUTEE",
   "self_type" : "_ZTIPFiPK8encodingPKciP9ATTRIBUTEE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPvPKcE",
   "name" : "int (*)(void *, const char *)",
   "referenced_type" : "_ZTIFiPvPKcE",
   "self_type" : "_ZTIPFiPvPKcE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFvPK8encodingPKcS3_P8positionE",
   "name" : "void (*)(const encoding *, const char *, const char *, position *)",
   "referenced_type" : "_ZTIFvPK8encodingPKcS3_P8positionE",
   "self_type" : "_ZTIPFvPK8encodingPKcS3_P8positionE",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK8encoding",
   "name" : "const encoding *",
   "referenced_type" : "_ZTIK8encoding",
   "self_type" : "_ZTIPK8encoding",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 8,
   "source_file" : "external/expat/lib/internal.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKt",
   "name" : "const unsigned short *",
   "referenced_type" : "_ZTIKt",
   "self_type" : "_ZTIPKt",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPK8encoding",
   "name" : "const encoding **",
   "referenced_type" : "_ZTIPK8encoding",
   "self_type" : "_ZTIPPK8encoding",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKc",
   "name" : "const char **",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIPPKc",
   "size" : 8,
   "source_file" : "external/expat/lib/internal.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPc",
   "name" : "char **",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIPPc",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPt",
   "name" : "unsigned short **",
   "referenced_type" : "_ZTIPt",
   "self_type" : "_ZTIPPt",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPt",
   "name" : "unsigned short *",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIPt",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/expat/lib/xmltok.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIA256_Kh",
   "name" : "unsigned char const[256]",
   "referenced_type" : "_ZTIA256_h",
   "self_type" : "_ZTIA256_Kh",
   "size" : 256,
   "source_file" : "external/expat/lib/nametab.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIA320_Kj",
   "name" : "unsigned int const[320]",
   "referenced_type" : "_ZTIA320_j",
   "self_type" : "_ZTIA320_Kj",
   "size" : 1280,
   "source_file" : "external/expat/lib/nametab.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8encoding",
   "name" : "const encoding",
   "referenced_type" : "_ZTI8encoding",
   "self_type" : "_ZTIK8encoding",
   "size" : 136,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/expat/lib/internal.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "external/expat/lib/xmltok.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "initEnc",
     "referenced_type" : "_ZTI8encoding"
    },
    {
     "field_name" : "encPtr",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPPK8encoding"
    }
   ],
   "linker_set_key" : "_ZTI13INIT_ENCODING",
   "name" : "INIT_ENCODING",
   "referenced_type" : "_ZTI13INIT_ENCODING",
   "self_type" : "_ZTI13INIT_ENCODING",
   "size" : 144,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "scanners",
     "referenced_type" : "_ZTIA4_PFiPK8encodingPKcS3_PS3_E"
    },
    {
     "field_name" : "literalScanners",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA2_PFiPK8encodingPKcS3_PS3_E"
    },
    {
     "field_name" : "nameMatchesAscii",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFiPK8encodingPKcS3_S3_E"
    },
    {
     "field_name" : "nameLength",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiPK8encodingPKcE"
    },
    {
     "field_name" : "skipS",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFPKcPK8encodingS0_E"
    },
    {
     "field_name" : "getAtts",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFiPK8encodingPKciP9ATTRIBUTEE"
    },
    {
     "field_name" : "charRefNumber",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFiPK8encodingPKcE"
    },
    {
     "field_name" : "predefinedEntityName",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFiPK8encodingPKcS3_E"
    },
    {
     "field_name" : "updatePosition",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvPK8encodingPKcS3_P8positionE"
    },
    {
     "field_name" : "isPublicId",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiPK8encodingPKcS3_PS3_E"
    },
    {
     "field_name" : "utf8Convert",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPcS4_E"
    },
    {
     "field_name" : "utf16Convert",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPF18XML_Convert_ResultPK8encodingPPKcS4_PPtPKtE"
    },
    {
     "field_name" : "minBytesPerChar",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "isUtf8",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "isUtf16",
     "field_offset" : 1064,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI8encoding",
   "name" : "encoding",
   "referenced_type" : "_ZTI8encoding",
   "self_type" : "_ZTI8encoding",
   "size" : 136,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lineNumber",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "columnNumber",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8position",
   "name" : "position",
   "referenced_type" : "_ZTI8position",
   "self_type" : "_ZTI8position",
   "size" : 16,
   "source_file" : "external/expat/lib/xmltok.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "valuePtr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "valueEnd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "normalized",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI9ATTRIBUTE",
   "name" : "ATTRIBUTE",
   "referenced_type" : "_ZTI9ATTRIBUTE",
   "self_type" : "_ZTI9ATTRIBUTE",
   "size" : 32,
   "source_file" : "external/expat/lib/xmltok.h"
  }
 ],
 "rvalue_reference_types" : []
}
