{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" : [],
 "functions" :
 [
  {
   "function_name" : "android::hardware::neuralnetworks::V1_0::utils::PreparedModel::create",
   "linker_set_key" : "_ZN7android8hardware14neuralnetworks4V1_05utils13PreparedModel6createENS_2spINS2_14IPreparedModelEEE",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIN7android2spINS_8hardware14neuralnetworks4V1_014IPreparedModelEEE"
    }
   ],
   "return_type" : "_ZTIN7android4base8expectedINSt3__110shared_ptrIKNS_8hardware14neuralnetworks4V1_05utils13PreparedModelEEENS_2nn12GeneralErrorEEE",
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/PreparedModel.h"
  },
  {
   "function_name" : "android::hardware::neuralnetworks::V1_0::utils::PreparedModel::PreparedModel",

   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIKN7android2nn14IPreparedModelEEE",
   "name" : "const std::shared_ptr<const android::nn::IPreparedModel>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIKN7android2nn14IPreparedModelEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIKN7android2nn14IPreparedModelEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/Burst.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6MemoryEEE",
   "name" : "const std::shared_ptr<const android::nn::Memory>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIKN7android2nn6MemoryEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6MemoryEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIKN7android8hardware14neuralnetworks4V1_05utils13PreparedModelEEE",
   "name" : "const std::shared_ptr<const android::hardware::neuralnetworks::V1_0::utils::PreparedModel>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIKN7android8hardware14neuralnetworks4V1_05utils13PreparedModelEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIKN7android8hardware14neuralnetworks4V1_05utils13PreparedModelEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/Execution.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android2nn9SyncFenceENS_9allocatorIS3_EEEE",
   "name" : "const std::vector<android::nn::SyncFence, std::allocator<android::nn::SyncFence>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android2nn9SyncFenceENS_9allocatorIS3_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android2nn9SyncFenceENS_9allocatorIS3_EEEE",
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/PreparedModel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEENS_9allocatorIS8_EEEE",
   "name" : "const std::vector<android::hardware::neuralnetworks::utils::RelocationInfo<const void *>, std::allocator<android::hardware::neuralnetworks::utils::RelocationInfo<const void *>>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEENS_9allocatorIS8_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEENS_9allocatorIS8_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEENS_9allocatorIS7_EEEE",
   "name" : "const std::vector<android::hardware::neuralnetworks::utils::RelocationInfo<void *>, std::allocator<android::hardware::neuralnetworks::utils::RelocationInfo<void *>>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEENS_9allocatorIS7_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEENS_9allocatorIS7_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6chrono10time_pointIN7android4base10boot_clockENS1_8durationIxNS_5ratioILx1ELx1000000000EEEEEEEEE",
   "name" : "const std::optional<std::chrono::time_point<android::base::boot_clock, std::chrono::duration<long long, std::ratio<1, 1000000000>>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6chrono10time_pointIN7android4base10boot_clockENS1_8durationIxNS_5ratioILx1ELx1000000000EEEEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6chrono10time_pointIN7android4base10boot_clockENS1_8durationIxNS_5ratioILx1ELx1000000000EEEEEEEEE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/PreparedModel.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEE",
   "name" : "const std::optional<std::chrono::duration<long long, std::ratio<1, 1000000000>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/PreparedModel.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  }
 ],
 "record_types" :
 [
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils13PreparedModel21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_0::utils::PreparedModel::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils13PreparedModel21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils13PreparedModel21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/PreparedModel.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn14IPreparedModelE"
    },
    {
     "referenced_type" : "_ZTINSt3__123enable_shared_from_thisIN7android8hardware14neuralnetworks4V1_05utils13PreparedModelEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kPreparedModel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKN7android2spINS_8hardware14neuralnetworks4V1_014IPreparedModelEEE"
    },
    {
     "access" : "private",
     "field_name" : "kDeathHandler",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKN7android8hardware14neuralnetworks5utils12DeathHandlerE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils13PreparedModelE",
   "name" : "android::hardware::neuralnetworks::V1_0::utils::PreparedModel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils13PreparedModelE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils13PreparedModelE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/PreparedModel.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils13PreparedModelE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_05utils13PreparedModel7executeERKNS_2nn7RequestENS5_13MeasureTimingERKNSt3__18optionalINSA_6chrono10time_pointINS_4base10boot_clockENSC_8durationIxNSA_5ratioILx1ELx1000000000EEEEEEEEERKNSB_ISJ_EE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_05utils13PreparedModel13executeFencedERKNS_2nn7RequestERKNSt3__16vectorINS5_9SyncFenceENS9_9allocatorISB_EEEENS5_13MeasureTimingERKNS9_8optionalINS9_6chrono10time_pointINS_4base10boot_clockENSJ_8durationIxNS9_5ratioILx1ELx1000000000EEEEEEEEERKNSI_ISQ_EESX_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_05utils13PreparedModel23createReusableExecutionERKNS_2nn7RequestENS5_13MeasureTimingERKNSt3__18optionalINSA_6chrono8durationIxNSA_5ratioILx1ELx1000000000EEEEEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_05utils13PreparedModel23configureExecutionBurstEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_05utils13PreparedModel21getUnderlyingResourceEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils13PreparedModelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils13PreparedModelD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_018IExecutionCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils13TransferValueINS_4base8expectedINSt3__14pairINS6_6vectorINS_2nn11OutputShapeENS6_9allocatorISA_EEEENS9_6TimingEEENS9_14ExecutionErrorEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackE",
   "name" : "android::hardware::neuralnetworks::V1_0::utils::ExecutionCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackE",
   "size" : 88,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/Callbacks.h",
   "vtable_components" :
   [
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_018IExecutionCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_018IExecutionCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_018IExecutionCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_018IExecutionCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_018IExecutionCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_018IExecutionCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_018IExecutionCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_018IExecutionCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_018IExecutionCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_018IExecutionCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_018IExecutionCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils17ExecutionCallback6notifyENS2_11ErrorStatusE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils17ExecutionCallback18notifyAsDeadObjectEv"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware14neuralnetworks4V1_05utils17ExecutionCallback18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -80,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -80,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14neuralnetworks4V1_05utils17ExecutionCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_022IPreparedModelCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils13TransferValueINS_4base8expectedINSt3__110shared_ptrIKNS_2nn14IPreparedModelEEENS8_12GeneralErrorEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackE",
   "name" : "android::hardware::neuralnetworks::V1_0::utils::PreparedModelCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackE",
   "size" : 48,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/Callbacks.h",
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_022IPreparedModelCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_022IPreparedModelCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_022IPreparedModelCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_022IPreparedModelCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_022IPreparedModelCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_022IPreparedModelCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_022IPreparedModelCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_022IPreparedModelCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_022IPreparedModelCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_022IPreparedModelCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_022IPreparedModelCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallback6notifyENS2_11ErrorStatusERKNS_2spINS2_14IPreparedModelEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallback18notifyAsDeadObjectEv"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallback18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14neuralnetworks4V1_05utils21PreparedModelCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils5Burst21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_0::utils::Burst::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils5Burst21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils5Burst21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/Burst.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn6IBurstE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kPreparedModel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIKN7android2nn14IPreparedModelEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils5BurstE",
   "name" : "android::hardware::neuralnetworks::V1_0::utils::Burst",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils5BurstE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils5BurstE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/Burst.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils5BurstE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_05utils5Burst11cacheMemoryERKNSt3__110shared_ptrIKNS_2nn6MemoryEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_05utils5Burst7executeERKNS_2nn7RequestENS5_13MeasureTimingERKNSt3__18optionalINSA_6chrono10time_pointINS_4base10boot_clockENSC_8durationIxNSA_5ratioILx1ELx1000000000EEEEEEEEERKNSB_ISJ_EE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_05utils5Burst23createReusableExecutionERKNS_2nn7RequestENS5_13MeasureTimingERKNSt3__18optionalINSA_6chrono8durationIxNSA_5ratioILx1ELx1000000000EEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils5BurstD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils5BurstD0Ev"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils9Execution21PrivateConstructorTagE",
   "name" : "android::hardware::neuralnetworks::V1_0::utils::Execution::PrivateConstructorTag",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils9Execution21PrivateConstructorTagE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils9Execution21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/Execution.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn10IExecutionE"
    },
    {
     "referenced_type" : "_ZTINSt3__123enable_shared_from_thisIN7android8hardware14neuralnetworks4V1_05utils9ExecutionEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kPreparedModel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIKN7android8hardware14neuralnetworks4V1_05utils13PreparedModelEEE"
    },
    {
     "access" : "private",
     "field_name" : "kRequest",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKN7android8hardware14neuralnetworks4V1_07RequestE"
    },
    {
     "access" : "private",
     "field_name" : "kRelocation",
     "field_offset" : 576,
     "referenced_type" : "_ZTIKN7android8hardware14neuralnetworks5utils17RequestRelocationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils9ExecutionE",
   "name" : "android::hardware::neuralnetworks::V1_0::utils::Execution",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils9ExecutionE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils9ExecutionE",
   "size" : 80,
   "source_file" : "hardware/interfaces/neuralnetworks/1.0/utils/include/nnapi/hal/1.0/Execution.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks4V1_05utils9ExecutionE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_05utils9Execution7computeERKNSt3__18optionalINS5_6chrono10time_pointINS_4base10boot_clockENS7_8durationIxNS5_5ratioILx1ELx1000000000EEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14neuralnetworks4V1_05utils9Execution13computeFencedERKNSt3__16vectorINS_2nn9SyncFenceENS5_9allocatorIS8_EEEERKNS5_8optionalINS5_6chrono10time_pointINS_4base10boot_clockENSF_8durationIxNS5_5ratioILx1ELx1000000000EEEEEEEEERKNSE_ISM_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils9ExecutionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks4V1_05utils9ExecutionD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mObject",
     "referenced_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "access" : "private",
     "field_name" : "mDeathRecipient",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android2spINS_8hardware14neuralnetworks5utils14DeathRecipientEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "android::hardware::neuralnetworks::utils::DeathHandler",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mCondition",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__118condition_variableE"
    },
    {
     "access" : "private",
     "field_name" : "mObject",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18optionalIN7android4base8expectedINS_10shared_ptrIKNS1_2nn14IPreparedModelEEENS5_12GeneralErrorEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils13TransferValueINS_4base8expectedINSt3__110shared_ptrIKNS_2nn14IPreparedModelEEENS8_12GeneralErrorEEEEE",
   "name" : "android::hardware::neuralnetworks::utils::TransferValue<android::base::expected<std::shared_ptr<const android::nn::IPreparedModel>, android::nn::GeneralError>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils13TransferValueINS_4base8expectedINSt3__110shared_ptrIKNS_2nn14IPreparedModelEEENS8_12GeneralErrorEEEEE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils13TransferValueINS_4base8expectedINSt3__110shared_ptrIKNS_2nn14IPreparedModelEEENS8_12GeneralErrorEEEEE",
   "size" : 32,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/TransferValue.h",
   "template_args" :
   [
    "_ZTIN7android4base8expectedINSt3__110shared_ptrIKNS_2nn14IPreparedModelEEENS4_12GeneralErrorEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mCondition",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__118condition_variableE"
    },
    {
     "access" : "private",
     "field_name" : "mObject",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18optionalIN7android4base8expectedINS_4pairINS_6vectorINS1_2nn11OutputShapeENS_9allocatorIS7_EEEENS6_6TimingEEENS6_14ExecutionErrorEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils13TransferValueINS_4base8expectedINSt3__14pairINS6_6vectorINS_2nn11OutputShapeENS6_9allocatorISA_EEEENS9_6TimingEEENS9_14ExecutionErrorEEEEE",
   "name" : "android::hardware::neuralnetworks::utils::TransferValue<android::base::expected<std::pair<std::vector<android::nn::OutputShape, std::allocator<android::nn::OutputShape>>, android::nn::Timing>, android::nn::ExecutionError>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils13TransferValueINS_4base8expectedINSt3__14pairINS6_6vectorINS_2nn11OutputShapeENS6_9allocatorISA_EEEENS9_6TimingEEENS9_14ExecutionErrorEEEEE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils13TransferValueINS_4base8expectedINSt3__14pairINS6_6vectorINS_2nn11OutputShapeENS6_9allocatorISA_EEEENS9_6TimingEEENS9_14ExecutionErrorEEEEE",
   "size" : 72,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/TransferValue.h",
   "template_args" :
   [
    "_ZTIN7android4base8expectedINSt3__14pairINS2_6vectorINS_2nn11OutputShapeENS2_9allocatorIS6_EEEENS5_6TimingEEENS5_14ExecutionErrorEEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware20hidl_death_recipientE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mIsDeadObject",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__16vectorIPN7android8hardware14neuralnetworks5utils18IProtectedCallbackENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "name" : "android::hardware::neuralnetworks::utils::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE",
   "size" : 32,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipient11serviceDiedEyRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14neuralnetworks5utils14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14neuralnetworks5utils14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "length",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEE",
   "name" : "android::hardware::neuralnetworks::utils::RelocationInfo<const void *>",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "length",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEE",
   "name" : "android::hardware::neuralnetworks::utils::RelocationInfo<void *>",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kRelocationInfos",
     "referenced_type" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEENS_9allocatorIS8_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "kMemory",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6MemoryEEE"
    },
    {
     "access" : "private",
     "field_name" : "kMapping",
     "field_offset" : 160,
     "referenced_type" : "_ZTIKN7android2nn7MappingE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPKvEEEE",
   "name" : "android::hardware::neuralnetworks::utils::RelocationTracker<android::hardware::neuralnetworks::utils::RelocationInfo<const void *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPKvEEEE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPKvEEEE",
   "size" : 48,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h",
   "template_args" : [ "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kRelocationInfos",
     "referenced_type" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEENS_9allocatorIS7_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "kMemory",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6MemoryEEE"
    },
    {
     "access" : "private",
     "field_name" : "kMapping",
     "field_offset" : 160,
     "referenced_type" : "_ZTIKN7android2nn7MappingE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPvEEEE",
   "name" : "android::hardware::neuralnetworks::utils::RelocationTracker<android::hardware::neuralnetworks::utils::RelocationInfo<void *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPvEEEE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPvEEEE",
   "size" : 48,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h",
   "template_args" : [ "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input",
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS4_14RelocationInfoIPKvEEEENS_14default_deleteISA_EEEE"
    },
    {
     "field_name" : "output",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS4_14RelocationInfoIPvEEEENS_14default_deleteIS9_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "name" : "android::hardware::neuralnetworks::utils::RequestRelocation",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "name" : "android::hardware::neuralnetworks::utils::IProtectedCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallback18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14neuralnetworks5utils18IProtectedCallbackD0Ev"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "android::hardware::neuralnetworks::utils::DeathHandler &&",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTION7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "name" : "android::hardware::neuralnetworks::utils::IProtectedCallback &&",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "self_type" : "_ZTION7android8hardware14neuralnetworks5utils18IProtectedCallbackE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/ProtectCallback.h"
  }
 ]
}
