{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "linker_set_key" : "_ZTIs",
   "name" : "short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIs",
   "size" : 2
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",

   "self_type" : "_ZTIPK21evbuffer_file_segment",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK7timeval",
   "name" : "const timeval *",
   "referenced_type" : "_ZTIK7timeval",
   "self_type" : "_ZTIPK7timeval",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/thread.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK8evbuffer",
   "name" : "const evbuffer *",
   "referenced_type" : "_ZTIK8evbuffer",
   "self_type" : "_ZTIPK8evbuffer",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/buffer_compat.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP14event_callback",
   "name" : "event_callback **",
   "referenced_type" : "_ZTIP14event_callback",
   "self_type" : "_ZTIPP14event_callback",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP5event",
   "name" : "event **",
   "referenced_type" : "_ZTIP5event",
   "self_type" : "_ZTIPP5event",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP8evkeyval",
   "name" : "evkeyval **",
   "referenced_type" : "_ZTIP8evkeyval",
   "self_type" : "_ZTIPP8evkeyval",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/keyvalq_struct.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPs",
   "name" : "short *",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIPs",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/buffer.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12evbuffer_ptr",
   "name" : "const evbuffer_ptr",
   "referenced_type" : "_ZTI12evbuffer_ptr",
   "self_type" : "_ZTIK12evbuffer_ptr",
   "size" : 24,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK15bufferevent_ops",
   "name" : "const bufferevent_ops",
   "referenced_type" : "_ZTI15bufferevent_ops",
   "self_type" : "_ZTIK15bufferevent_ops",
   "size" : 72,
   "source_file" : "external/libevent/include/event2/bufferevent_struct.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK16evbuffer_cb_info",
   "name" : "const evbuffer_cb_info",
   "referenced_type" : "_ZTI16evbuffer_cb_info",
   "self_type" : "_ZTIK16evbuffer_cb_info",
   "size" : 24,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK21evbuffer_file_segment",
   "name" : "const evbuffer_file_segment",
   "referenced_type" : "_ZTI21evbuffer_file_segment",
   "self_type" : "_ZTIK21evbuffer_file_segment",
   "size" : 80,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7timeval",
   "name" : "const timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTIK7timeval",
   "size" : 16,
   "source_file" : "external/libevent/include/event2/thread.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8evbuffer",
   "name" : "const evbuffer",
   "referenced_type" : "_ZTI8evbuffer",
   "self_type" : "_ZTIK8evbuffer",
   "size" : 136,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/libevent/include/event2/buffer_compat.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/libevent/include/event2/buffer.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tqh_first",
     "referenced_type" : "_ZTIP5event"
    },
    {
     "field_name" : "tqh_last",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPP5event"
    }
   ],
   "linker_set_key" : "_ZTI10event_list",
   "name" : "event_list",
   "referenced_type" : "_ZTI10event_list",
   "self_type" : "_ZTI10event_list",
   "size" : 16,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ev_base",
     "referenced_type" : "_ZTIP10event_base"
    },
    {
     "field_name" : "be_ops",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK15bufferevent_ops"
    },
    {
     "field_name" : "ev_read",
     "field_offset" : 128,
     "referenced_type" : "_ZTI5event"
    },
    {
     "field_name" : "ev_write",
     "field_offset" : 1152,
     "referenced_type" : "_ZTI5event"
    },
    {
     "field_name" : "input",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIP8evbuffer"
    },
    {
     "field_name" : "output",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIP8evbuffer"
    },
    {
     "field_name" : "wm_read",
     "field_offset" : 2304,
     "referenced_type" : "_ZTI15event_watermark"
    },
    {
     "field_name" : "wm_write",
     "field_offset" : 2432,
     "referenced_type" : "_ZTI15event_watermark"
    },
    {
     "field_name" : "readcb",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIPFvP11buffereventPvE"
    },
    {
     "field_name" : "writecb",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIPFvP11buffereventPvE"
    },
    {
     "field_name" : "errorcb",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIPFvP11buffereventsPvE"
    },
    {
     "field_name" : "cbarg",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "timeout_read",
     "field_offset" : 2816,
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "timeout_write",
     "field_offset" : 2944,
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "enabled",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI11bufferevent",
   "name" : "bufferevent",
   "referenced_type" : "_ZTI11bufferevent",
   "self_type" : "_ZTI11bufferevent",
   "size" : 392,
   "source_file" : "external/libevent/include/event2/bufferevent_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lh_first",
     "referenced_type" : "_ZTIP5event"
    }
   ],
   "linker_set_key" : "_ZTI11event_dlist",
   "name" : "event_dlist",
   "referenced_type" : "_ZTI11event_dlist",
   "self_type" : "_ZTI11event_dlist",
   "size" : 8,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pos",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "internal_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN12evbuffer_ptrUt_E"
    }
   ],
   "linker_set_key" : "_ZTI12evbuffer_ptr",
   "name" : "evbuffer_ptr",
   "referenced_type" : "_ZTI12evbuffer_ptr",
   "self_type" : "_ZTI12evbuffer_ptr",
   "size" : 24,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "evcb_active_next",
     "referenced_type" : "_ZTIN14event_callbackUt_E"
    },
    {
     "field_name" : "evcb_flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "evcb_pri",
     "field_offset" : 144,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "evcb_closure",
     "field_offset" : 152,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "evcb_cb_union",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN14event_callbackUt_E"
    },
    {
     "field_name" : "evcb_arg",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI14event_callback",
   "name" : "event_callback",
   "referenced_type" : "_ZTI14event_callback",
   "self_type" : "_ZTI14event_callback",
   "size" : 40,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "low",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "high",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI15event_watermark",
   "name" : "event_watermark",
   "referenced_type" : "_ZTI15event_watermark",
   "self_type" : "_ZTI15event_watermark",
   "size" : 16,
   "source_file" : "external/libevent/include/event2/bufferevent_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "orig_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "n_added",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "n_deleted",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI16evbuffer_cb_info",
   "name" : "evbuffer_cb_info",
   "referenced_type" : "_ZTI16evbuffer_cb_info",
   "self_type" : "_ZTI16evbuffer_cb_info",
   "size" : 24,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lock_api_version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "supported_locktypes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alloc",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFPvjE"
    },
    {
     "field_name" : "free",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvPvjE"
    },
    {
     "field_name" : "lock",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFijPvE"
    },
    {
     "field_name" : "unlock",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFijPvE"
    }
   ],
   "linker_set_key" : "_ZTI23evthread_lock_callbacks",
   "name" : "evthread_lock_callbacks",
   "referenced_type" : "_ZTI23evthread_lock_callbacks",
   "self_type" : "_ZTI23evthread_lock_callbacks",
   "size" : 40,
   "source_file" : "external/libevent/include/event2/thread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "condition_api_version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "alloc_condition",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFPvjE"
    },
    {
     "field_name" : "free_condition",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "signal_condition",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPviE"
    },
    {
     "field_name" : "wait_condition",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiPvS_PK7timevalE"
    }
   ],
   "linker_set_key" : "_ZTI28evthread_condition_callbacks",
   "name" : "evthread_condition_callbacks",
   "referenced_type" : "_ZTI28evthread_condition_callbacks",
   "self_type" : "_ZTI28evthread_condition_callbacks",
   "size" : 40,
   "source_file" : "external/libevent/include/event2/thread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ev_evcallback",
     "referenced_type" : "_ZTI14event_callback"
    },
    {
     "field_name" : "ev_timeout_pos",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN5eventUt_E"
    },
    {
     "field_name" : "ev_fd",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ev_base",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP10event_base"
    },
    {
     "field_name" : "ev_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN5eventUt_E"
    },
    {
     "field_name" : "ev_events",
     "field_offset" : 832,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "ev_res",
     "field_offset" : 848,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "ev_timeout",
     "field_offset" : 896,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI5event",
   "name" : "event",
   "referenced_type" : "_ZTI5event",
   "self_type" : "_ZTI5event",
   "size" : 128,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIN8evkeyvalUt_E"
    },
    {
     "field_name" : "key",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "value",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI8evkeyval",
   "name" : "evkeyval",
   "referenced_type" : "_ZTI8evkeyval",
   "self_type" : "_ZTI8evkeyval",
   "size" : 32,
   "source_file" : "external/libevent/include/event2/keyvalq_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tqh_first",
     "referenced_type" : "_ZTIP8evkeyval"
    },
    {
     "field_name" : "tqh_last",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPP8evkeyval"
    }
   ],
   "linker_set_key" : "_ZTI9evkeyvalq",
   "name" : "evkeyvalq",
   "referenced_type" : "_ZTI9evkeyvalq",
   "self_type" : "_ZTI9evkeyvalq",
   "size" : 16,
   "source_file" : "external/libevent/include/event2/keyvalq_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "chain",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pos_in_chain",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12evbuffer_ptrUt_E",
   "name" : "evbuffer_ptr::(anonymous struct at external/libevent/include/event2/buffer.h:121:2)",
   "referenced_type" : "_ZTIN12evbuffer_ptrUt_E",
   "self_type" : "_ZTIN12evbuffer_ptrUt_E",
   "size" : 16,
   "source_file" : "external/libevent/include/event2/buffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tqe_next",
     "referenced_type" : "_ZTIP14event_callback"
    },
    {
     "field_name" : "tqe_prev",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPP14event_callback"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN14event_callbackUt_E",
   "name" : "event_callback::(anonymous struct at external/libevent/include/event2/event_struct.h:108:2)",
   "referenced_type" : "_ZTIN14event_callbackUt_E",
   "self_type" : "_ZTIN14event_callbackUt_E",
   "size" : 16,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ev_next_with_common_timeout",
     "referenced_type" : "_ZTIN5eventUt_Ut_E"
    },
    {
     "field_name" : "min_heap_idx",
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN5eventUt_E",
   "name" : "event::(anonymous union at external/libevent/include/event2/event_struct.h:127:2)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN5eventUt_E",
   "self_type" : "_ZTIN5eventUt_E",
   "size" : 16,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tqe_next",
     "referenced_type" : "_ZTIP5event"
    },
    {
     "field_name" : "tqe_prev",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPP5event"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN5eventUt_Ut_E",
   "name" : "event::(anonymous union at external/libevent/include/event2/event_struct.h:127:2)::(anonymous struct at external/libevent/include/event2/event_struct.h:128:3)",
   "referenced_type" : "_ZTIN5eventUt_Ut_E",
   "self_type" : "_ZTIN5eventUt_Ut_E",
   "size" : 16,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "le_next",
     "referenced_type" : "_ZTIP5event"
    },
    {
     "field_name" : "le_prev",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPP5event"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN5eventUt_Ut_Ut_E",
   "name" : "event::(anonymous union at external/libevent/include/event2/event_struct.h:135:2)::(anonymous struct at external/libevent/include/event2/event_struct.h:137:3)::(anonymous struct at external/libevent/include/event2/event_struct.h:138:4)",
   "referenced_type" : "_ZTIN5eventUt_Ut_Ut_E",
   "self_type" : "_ZTIN5eventUt_Ut_Ut_E",
   "size" : 16,
   "source_file" : "external/libevent/include/event2/event_struct.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tqe_next",
     "referenced_type" : "_ZTIP8evkeyval"
    },
    {
     "field_name" : "tqe_prev",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPP8evkeyval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8evkeyvalUt_E",
   "name" : "evkeyval::(anonymous struct at external/libevent/include/event2/keyvalq_struct.h:59:2)",
   "referenced_type" : "_ZTIN8evkeyvalUt_E",
   "self_type" : "_ZTIN8evkeyvalUt_E",
   "size" : 16,
   "source_file" : "external/libevent/include/event2/keyvalq_struct.h"
  }
 ],
 "rvalue_reference_types" : []
}
