#ifndef HIDL_GENERATED_ANDROID_HARDWARE_WIFI_HOSTAPD_V1_2_IHOSTAPD_H
#define HIDL_GENERATED_ANDROID_HARDWARE_WIFI_HOSTAPD_V1_2_IHOSTAPD_H

#include <android/hardware/wifi/hostapd/1.0/IHostapd.h>
#include <android/hardware/wifi/hostapd/1.1/IHostapd.h>
#include <android/hardware/wifi/hostapd/1.2/types.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace wifi {
namespace hostapd {
namespace V1_2 {

/**
 * Top-level object for managing SoftAPs.
 */
struct IHostapd : public ::android::hardware::wifi::hostapd::V1_1::IHostapd {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.wifi.hostapd@1.2::IHostapd"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class EncryptionType : uint32_t;
    enum class BandMask : uint32_t;
    struct HwModeParams;
    struct AcsFrequencyRange;
    struct ChannelParams;
    struct IfaceParams;
    struct NetworkParams;

    /**
     * Possible Security types.
     */
    enum class EncryptionType : uint32_t {
        NONE = 0u,
        WPA = 1u /* ::android::hardware::wifi::hostapd::V1_0::IHostapd::EncryptionType.NONE implicitly + 1 */,
        WPA2 = 2u /* ::android::hardware::wifi::hostapd::V1_0::IHostapd::EncryptionType.WPA implicitly + 1 */,
        WPA3_SAE_TRANSITION = 3u /* ::android::hardware::wifi::hostapd::V1_0::IHostapd::EncryptionType.WPA2 implicitly + 1 */,
        WPA3_SAE = 4u /* ::android::hardware::wifi::hostapd::V1_2::IHostapd::EncryptionType.WPA3_SAE_TRANSITION implicitly + 1 */,
    };

    /**
     * Band bitmMask to use for the SoftAp operations.
     * A combinatoin of these bits are used to identify the allowed bands
     * to start the softAp
     */
    enum class BandMask : uint32_t {
        /**
         * 2.4 GHz band.
         */
        BAND_2_GHZ = 1u /* 1 << 0 */,
        /**
         * 5 GHz band.
         */
        BAND_5_GHZ = 2u /* 1 << 1 */,
        /**
         * 6 GHz band.
         */
        BAND_6_GHZ = 4u /* 1 << 2 */,
    };

    /**
     * Parameters to control the HW mode for the interface.
     */
    struct HwModeParams final {
        /**
         * Whether IEEE 802.11ax (HE) is enabled or not.
         * Note: hw_mode=a is used to specify that 5 GHz band or 6 GHz band is
         * used with HE.
         */
        bool enable80211AX __attribute__ ((aligned(1)));
        /**
         * Whether 6GHz band enabled or not on softAp.
         * Note: hw_mode=a is used to specify that 5 GHz band or 6 GHz band is
         * used.
         */
        bool enable6GhzBand __attribute__ ((aligned(1)));
        /**
         * Whether HE single user beamformer in enabled or not on softAp.
         * Note: this is only applicable if 802.11ax is supported for softAp
         */
        bool enableHeSingleUserBeamformer __attribute__ ((aligned(1)));
        /**
         * Whether HE single user beamformee is enabled or not on softAp.
         * Note: this is only applicable if 802.11ax is supported for softAp
         */
        bool enableHeSingleUserBeamformee __attribute__ ((aligned(1)));
        /**
         * Whether HE multiple user beamformer is enabled or not on softAp.
         * Note: this is only applicable if 802.11ax is supported for softAp
         */
        bool enableHeMultiUserBeamformer __attribute__ ((aligned(1)));
        /**
         * Whether HE Target Wait Time (TWT) is enabled or not on softAp.
         * Note: this is only applicable if 802.11ax is supported for softAp
         */
        bool enableHeTargetWakeTime __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::HwModeParams, enable80211AX) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::HwModeParams, enable6GhzBand) == 1, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::HwModeParams, enableHeSingleUserBeamformer) == 2, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::HwModeParams, enableHeSingleUserBeamformee) == 3, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::HwModeParams, enableHeMultiUserBeamformer) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::HwModeParams, enableHeTargetWakeTime) == 5, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::hostapd::V1_2::IHostapd::HwModeParams) == 6, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::hostapd::V1_2::IHostapd::HwModeParams) == 1, "wrong alignment");

    /**
     * Parameters to specify the channel frequency range for ACS.
     */
    struct AcsFrequencyRange final {
        /**
         * Channel Frequency (in MHz) at the start of the range.
         */
        uint32_t start __attribute__ ((aligned(4)));
        /**
         * Channel Frequency (in MHz) at the end of the range.
         */
        uint32_t end __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::AcsFrequencyRange, start) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::AcsFrequencyRange, end) == 4, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::hostapd::V1_2::IHostapd::AcsFrequencyRange) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::hostapd::V1_2::IHostapd::AcsFrequencyRange) == 4, "wrong alignment");

    /**
     * Parameters to control the channel selection for the interface.
     */
    struct ChannelParams final {
        /**
         * Band to use for the SoftAp operations.
         */
        ::android::hardware::hidl_bitfield<::android::hardware::wifi::hostapd::V1_2::IHostapd::BandMask> bandMask __attribute__ ((aligned(4)));
        /**
         * This option can be used to specify the channel frequencies (in MHz) selected by ACS.
         * If this is an empty list, all channels allowed in selected HW mode
         * are specified implicitly.
         * Note: channels may be overridden by firmware.
         * Note: this option is ignored if ACS is disabled.
         */
        ::android::hardware::hidl_vec<::android::hardware::wifi::hostapd::V1_2::IHostapd::AcsFrequencyRange> acsChannelFreqRangesMhz __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::ChannelParams, bandMask) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::ChannelParams, acsChannelFreqRangesMhz) == 8, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::hostapd::V1_2::IHostapd::ChannelParams) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::hostapd::V1_2::IHostapd::ChannelParams) == 8, "wrong alignment");

    /**
     * Parameters to use for setting up the access point interface.
     */
    struct IfaceParams final {
        /**
         * Baseline information as defined in HAL 1.1.
         */
        ::android::hardware::wifi::hostapd::V1_1::IHostapd::IfaceParams V1_1 __attribute__ ((aligned(8)));
        /**
         * Additional Hw mode params for the interface
         */
        ::android::hardware::wifi::hostapd::V1_2::IHostapd::HwModeParams hwModeParams __attribute__ ((aligned(1)));
        /**
         * Additional Channel params for the interface
         */
        ::android::hardware::wifi::hostapd::V1_2::IHostapd::ChannelParams channelParams __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::IfaceParams, V1_1) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::IfaceParams, hwModeParams) == 48, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::IfaceParams, channelParams) == 56, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::hostapd::V1_2::IHostapd::IfaceParams) == 80, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::hostapd::V1_2::IHostapd::IfaceParams) == 8, "wrong alignment");

    /**
     * Parameters to use for setting up the access point network.
     */
    struct NetworkParams final {
        /**
         * Baseline information as defined in HAL 1.0.
         */
        ::android::hardware::wifi::hostapd::V1_0::IHostapd::NetworkParams V1_0 __attribute__ ((aligned(8)));
        /**
         * Key management mask for the replace V1_0.encryptionType.
         */
        ::android::hardware::wifi::hostapd::V1_2::IHostapd::EncryptionType encryptionType __attribute__ ((aligned(4)));
        /**
         * Passphrase for WPA3_SAE network, WPA3_SAE_TRANSITION and
         * WPA2_PSK. Replaces @1.0::IHostapd.NetworkParams.pskPassphrase.
         */
        ::android::hardware::hidl_string passphrase __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::NetworkParams, V1_0) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::NetworkParams, encryptionType) == 40, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::hostapd::V1_2::IHostapd::NetworkParams, passphrase) == 48, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::hostapd::V1_2::IHostapd::NetworkParams) == 64, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::hostapd::V1_2::IHostapd::NetworkParams) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Return callback for addAccessPoint
     */
    using addAccessPoint_cb = std::function<void(const ::android::hardware::wifi::hostapd::V1_0::HostapdStatus& status)>;
    /**
     * Adds a new access point for hostapd to control.
     *
     * This should trigger the setup of an access point with the specified
     * interface and network params.
     *
     * @param ifaceParams AccessPoint Params for the access point.
     * @param nwParams Network Params for the access point.
     * @return status Status of the operation.
     *         Possible status codes:
     *         |HostapdStatusCode.SUCCESS|,
     *         |HostapdStatusCode.FAILURE_ARGS_INVALID|,
