{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA12_c",
   "name" : "char [12]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA12_c",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/message_lite.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_N6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "name" : "google::protobuf::internal::ArenaImpl::CleanupNode [1]",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "self_type" : "_ZTIA1_N6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_Pv",
   "name" : "void *[1]",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIA1_Pv",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1_b",
   "name" : "bool [1]",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIA1_b",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_d",
   "name" : "double [1]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA1_d",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_f",
   "name" : "float [1]",

   "referenced_type" : "_ZTISt9type_info",
   "self_type" : "_ZTIKSt9type_info",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/implicit_weak_message.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/io/coded_stream.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf11LogSilencerE",
   "name" : "google::protobuf::LogSilencer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf11LogSilencerE",
   "self_type" : "_ZTIN6google8protobuf11LogSilencerE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN6google8protobuf11MessageLiteE",
   "name" : "google::protobuf::MessageLite",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf11MessageLiteE",
   "self_type" : "_ZTIN6google8protobuf11MessageLiteE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/message_lite.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf11MessageLiteE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf11MessageLiteD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf11MessageLiteD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite11GetTypeNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite3NewEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite3NewEPNS0_5ArenaE"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite8GetArenaEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite20GetMaybeArenaPointerEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf11MessageLite5ClearEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite13IsInitializedEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite25InitializationErrorStringEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf11MessageLite21CheckTypeAndMergeFromERKS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf11MessageLite27MergePartialFromCodedStreamEPNS0_2io16CodedInputStreamE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite12ByteSizeLongEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite24SerializeWithCachedSizesEPNS0_2io17CodedOutputStreamE"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite31SerializeWithCachedSizesToArrayEPh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite13GetCachedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite16InternalGetTableEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite39InternalSerializeWithCachedSizesToArrayEPh"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "length_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf11StringPieceE",
   "name" : "google::protobuf::StringPiece",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf11StringPieceE",
   "self_type" : "_ZTIN6google8protobuf11StringPieceE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/stringpiece.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_block_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "max_block_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "initial_block",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "initial_block_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "block_alloc",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFPvjE"
    },
    {
     "field_name" : "block_dealloc",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFvPvjE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_init",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFPvPN6google8protobuf5ArenaEE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_reset",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvyE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_destruction",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvyE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_allocation",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFvPKSt9type_infoyPvE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf12ArenaOptionsE",
   "name" : "google::protobuf::ArenaOptions",
   "referenced_type" : "_ZTIN6google8protobuf12ArenaOptionsE",
   "self_type" : "_ZTIN6google8protobuf12ArenaOptionsE",
   "size" : 40,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIPN6google8protobuf5ArenaE"
    },
    {
     "field_name" : "elements",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_b"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIbE3RepE",
   "name" : "google::protobuf::RepeatedField<bool>::Rep",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIbE3RepE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIbE3RepE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "arena_or_elements_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIbEE",
   "name" : "google::protobuf::RepeatedField<bool>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIbEE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIbEE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIPN6google8protobuf5ArenaE"
    },
    {
     "field_name" : "elements",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA1_d"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIdE3RepE",
   "name" : "google::protobuf::RepeatedField<double>::Rep",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIdE3RepE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIdE3RepE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "arena_or_elements_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIdEE",
   "name" : "google::protobuf::RepeatedField<double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIdEE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIdEE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIPN6google8protobuf5ArenaE"
    },
    {
     "field_name" : "elements",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_f"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIfE3RepE",
   "name" : "google::protobuf::RepeatedField<float>::Rep",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIfE3RepE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIfE3RepE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "arena_or_elements_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIfEE",
   "name" : "google::protobuf::RepeatedField<float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIfEE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIfEE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIPN6google8protobuf5ArenaE"
    },
    {
     "field_name" : "elements",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIiE3RepE",
   "name" : "google::protobuf::RepeatedField<int32>::Rep",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIiE3RepE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIiE3RepE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "arena_or_elements_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIiEE",
   "name" : "google::protobuf::RepeatedField<int32>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIiEE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIiEE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIPN6google8protobuf5ArenaE"
    },
    {
     "field_name" : "elements",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_j"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIjE3RepE",
   "name" : "google::protobuf::RepeatedField<uint32>::Rep",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIjE3RepE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIjE3RepE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "arena_or_elements_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIjEE",
   "name" : "google::protobuf::RepeatedField<uint32>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIjEE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIjEE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIPN6google8protobuf5ArenaE"
    },
    {
     "field_name" : "elements",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA1_x"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIxE3RepE",
   "name" : "google::protobuf::RepeatedField<int64>::Rep",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIxE3RepE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIxE3RepE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "arena_or_elements_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIxEE",
   "name" : "google::protobuf::RepeatedField<int64>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIxEE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIxEE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIPN6google8protobuf5ArenaE"
    },
    {
     "field_name" : "elements",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA1_y"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIyE3RepE",
   "name" : "google::protobuf::RepeatedField<uint64>::Rep",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIyE3RepE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIyE3RepE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "arena_or_elements_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf13RepeatedFieldIyEE",
   "name" : "google::protobuf::RepeatedField<uint64>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIyEE",
   "self_type" : "_ZTIN6google8protobuf13RepeatedFieldIyEE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6google8protobuf8internal17StringTypeHandlerE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf16RepeatedPtrFieldINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEE11TypeHandlerE",
   "name" : "google::protobuf::RepeatedPtrField<std::string>::TypeHandler",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf16RepeatedPtrFieldINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEE11TypeHandlerE",
   "self_type" : "_ZTIN6google8protobuf16RepeatedPtrFieldINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEE11TypeHandlerE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN6google8protobuf8internal20RepeatedPtrFieldBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf16RepeatedPtrFieldINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf16RepeatedPtrFieldINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN6google8protobuf16RepeatedPtrFieldINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "buffer_end_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "input_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN6google8protobuf2io19ZeroCopyInputStreamE"
    },
    {
     "access" : "private",
     "field_name" : "total_bytes_read_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "overflow_bytes_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "last_tag_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "legitimate_message_end_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "aliasing_enabled_",
     "field_offset" : 200,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "current_limit_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_after_limit_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_bytes_limit_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "recursion_budget_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "recursion_limit_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "extension_pool_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKN6google8protobuf14DescriptorPoolE"
    },
    {
     "access" : "private",
     "field_name" : "extension_factory_",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPN6google8protobuf14MessageFactoryE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf2io16CodedInputStreamE",
   "name" : "google::protobuf::io::CodedInputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io16CodedInputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io16CodedInputStreamE",
   "size" : 56,
   "source_file" : "external/protobuf/src/google/protobuf/io/coded_stream.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "output_",
     "referenced_type" : "_ZTIPN6google8protobuf2io20ZeroCopyOutputStreamE"
    },
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_bytes_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "had_error_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "aliasing_enabled_",
     "field_offset" : 136,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "is_serialization_deterministic_",
     "field_offset" : 144,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf2io17CodedOutputStreamE",
   "name" : "google::protobuf::io::CodedOutputStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf2io17CodedOutputStreamE",
   "self_type" : "_ZTIN6google8protobuf2io17CodedOutputStreamE",
   "size" : 20,
   "source_file" : "external/protobuf/src/google/protobuf/io/coded_stream.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4BitsE",
   "name" : "google::protobuf::Bits",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf4BitsE",
   "self_type" : "_ZTIN6google8protobuf4BitsE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4hashINS0_11StringPieceEEE",
   "name" : "google::protobuf::hash<google::protobuf::StringPiece>",
   "referenced_type" : "_ZTIN6google8protobuf4hashINS0_11StringPieceEEE",
   "self_type" : "_ZTIN6google8protobuf4hashINS0_11StringPieceEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/stringpiece.h",
   "template_args" : [ "_ZTIN6google8protobuf11StringPieceE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4hashINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "google::protobuf::hash<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN6google8protobuf4hashINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN6google8protobuf4hashINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4hashIPKcEE",
   "name" : "google::protobuf::hash<const char *>",
   "referenced_type" : "_ZTIN6google8protobuf4hashIPKcEE",
   "self_type" : "_ZTIN6google8protobuf4hashIPKcEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4hashIbEE",
   "name" : "google::protobuf::hash<bool>",
   "referenced_type" : "_ZTIN6google8protobuf4hashIbEE",
   "self_type" : "_ZTIN6google8protobuf4hashIbEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf5Arena14InternalHelperINS0_8internal19ImplicitWeakMessageEEE",
   "name" : "google::protobuf::Arena::InternalHelper<google::protobuf::internal::ImplicitWeakMessage>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf5Arena14InternalHelperINS0_8internal19ImplicitWeakMessageEEE",
   "self_type" : "_ZTIN6google8protobuf5Arena14InternalHelperINS0_8internal19ImplicitWeakMessageEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h",
   "template_args" : [ "_ZTIN6google8protobuf8internal19ImplicitWeakMessageE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf5Arena14InternalHelperINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "name" : "google::protobuf::Arena::InternalHelper<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf5Arena14InternalHelperINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN6google8protobuf5Arena14InternalHelperINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf5Arena22is_arena_constructableINS0_8internal19ImplicitWeakMessageEEE",
   "name" : "google::protobuf::Arena::is_arena_constructable<google::protobuf::internal::ImplicitWeakMessage>",
   "referenced_type" : "_ZTIN6google8protobuf5Arena22is_arena_constructableINS0_8internal19ImplicitWeakMessageEEE",
   "self_type" : "_ZTIN6google8protobuf5Arena22is_arena_constructableINS0_8internal19ImplicitWeakMessageEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h",
   "template_args" : [ "_ZTIN6google8protobuf8internal19ImplicitWeakMessageE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf5Arena22is_arena_constructableINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "name" : "google::protobuf::Arena::is_arena_constructable<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN6google8protobuf5Arena22is_arena_constructableINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN6google8protobuf5Arena22is_arena_constructableINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "impl_",
     "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImplE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_allocation_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFvPKSt9type_infoyPvE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_reset_",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvyE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_destruction_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvyE"
    },
    {
     "access" : "private",
     "field_name" : "hooks_cookie_",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf5ArenaE",
   "name" : "google::protobuf::Arena",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf5ArenaE",
   "self_type" : "_ZTIN6google8protobuf5ArenaE",
   "size" : 64,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf5streqE",
   "name" : "google::protobuf::streq",
   "referenced_type" : "_ZTIN6google8protobuf5streqE",
   "self_type" : "_ZTIN6google8protobuf5streqE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "spec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN6google8protobuf7strings7PadSpecE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf7strings3HexE",
   "name" : "google::protobuf::strings::Hex",
   "referenced_type" : "_ZTIN6google8protobuf7strings3HexE",
   "self_type" : "_ZTIN6google8protobuf7strings3HexE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/strutil.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "piece_data_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "piece_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "digits",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA32_c"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf7strings8AlphaNumE",
   "name" : "google::protobuf::strings::AlphaNum",
   "referenced_type" : "_ZTIN6google8protobuf7strings8AlphaNumE",
   "self_type" : "_ZTIN6google8protobuf7strings8AlphaNumE",
   "size" : 40,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/strutil.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "level_",
     "referenced_type" : "_ZTIN6google8protobuf8LogLevelE"
    },
    {
     "access" : "private",
     "field_name" : "filename_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "line_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "message_",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "name" : "google::protobuf::internal::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "self_type" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "size" : 24,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "zcis",
     "referenced_type" : "_ZTIPN6google8protobuf2io19ZeroCopyInputStreamE"
    },
    {
     "field_name" : "limit",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal11BoundedZCISE",
   "name" : "google::protobuf::internal::BoundedZCIS",
   "referenced_type" : "_ZTIN6google8protobuf8internal11BoundedZCISE",
   "self_type" : "_ZTIN6google8protobuf8internal11BoundedZCISE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/message_lite.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "name" : "google::protobuf::internal::LogFinisher",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "self_type" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal13ElementCopierIbLb1EEE",
   "name" : "google::protobuf::internal::ElementCopier<bool, true>",
   "referenced_type" : "_ZTIN6google8protobuf8internal13ElementCopierIbLb1EEE",
   "self_type" : "_ZTIN6google8protobuf8internal13ElementCopierIbLb1EEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal13ElementCopierIdLb1EEE",
   "name" : "google::protobuf::internal::ElementCopier<double, true>",
   "referenced_type" : "_ZTIN6google8protobuf8internal13ElementCopierIdLb1EEE",
   "self_type" : "_ZTIN6google8protobuf8internal13ElementCopierIdLb1EEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal13ElementCopierIfLb1EEE",
   "name" : "google::protobuf::internal::ElementCopier<float, true>",
   "referenced_type" : "_ZTIN6google8protobuf8internal13ElementCopierIfLb1EEE",
   "self_type" : "_ZTIN6google8protobuf8internal13ElementCopierIfLb1EEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal13ElementCopierIiLb1EEE",
   "name" : "google::protobuf::internal::ElementCopier<int, true>",
   "referenced_type" : "_ZTIN6google8protobuf8internal13ElementCopierIiLb1EEE",
   "self_type" : "_ZTIN6google8protobuf8internal13ElementCopierIiLb1EEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal13ElementCopierIjLb1EEE",
   "name" : "google::protobuf::internal::ElementCopier<unsigned int, true>",
   "referenced_type" : "_ZTIN6google8protobuf8internal13ElementCopierIjLb1EEE",
   "self_type" : "_ZTIN6google8protobuf8internal13ElementCopierIjLb1EEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal13ElementCopierIxLb1EEE",
   "name" : "google::protobuf::internal::ElementCopier<long long, true>",
   "referenced_type" : "_ZTIN6google8protobuf8internal13ElementCopierIxLb1EEE",
   "self_type" : "_ZTIN6google8protobuf8internal13ElementCopierIxLb1EEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal13ElementCopierIyLb1EEE",
   "name" : "google::protobuf::internal::ElementCopier<unsigned long long, true>",
   "referenced_type" : "_ZTIN6google8protobuf8internal13ElementCopierIyLb1EEE",
   "self_type" : "_ZTIN6google8protobuf8internal13ElementCopierIyLb1EEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal14StringPiecePodE",
   "name" : "google::protobuf::internal::StringPiecePod",
   "referenced_type" : "_ZTIN6google8protobuf8internal14StringPiecePodE",
   "self_type" : "_ZTIN6google8protobuf8internal14StringPiecePodE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/stringpiece.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal17StringTypeHandlerE",
   "name" : "google::protobuf::internal::StringTypeHandler",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal17StringTypeHandlerE",
   "self_type" : "_ZTIN6google8protobuf8internal17StringTypeHandlerE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal18GenericTypeHandlerINS0_11MessageLiteEEE",
   "name" : "google::protobuf::internal::GenericTypeHandler<google::protobuf::MessageLite>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal18GenericTypeHandlerINS0_11MessageLiteEEE",
   "self_type" : "_ZTIN6google8protobuf8internal18GenericTypeHandlerINS0_11MessageLiteEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIN6google8protobuf11MessageLiteE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal18GenericTypeHandlerINS0_7MessageEEE",
   "name" : "google::protobuf::internal::GenericTypeHandler<google::protobuf::Message>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal18GenericTypeHandlerINS0_7MessageEEE",
   "self_type" : "_ZTIN6google8protobuf8internal18GenericTypeHandlerINS0_7MessageEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIN6google8protobuf7MessageE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal18GenericTypeHandlerINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "name" : "google::protobuf::internal::GenericTypeHandler<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal18GenericTypeHandlerINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN6google8protobuf8internal18GenericTypeHandlerINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6google8protobuf11MessageLiteE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "arena_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPN6google8protobuf5ArenaE"
    },
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal19ImplicitWeakMessageE",
   "name" : "google::protobuf::internal::ImplicitWeakMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal19ImplicitWeakMessageE",
   "self_type" : "_ZTIN6google8protobuf8internal19ImplicitWeakMessageE",
   "size" : 20,
   "source_file" : "external/protobuf/src/google/protobuf/implicit_weak_message.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf8internal19ImplicitWeakMessageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal19ImplicitWeakMessageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal19ImplicitWeakMessageD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf8internal19ImplicitWeakMessage11GetTypeNameEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf8internal19ImplicitWeakMessage3NewEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf8internal19ImplicitWeakMessage3NewEPNS0_5ArenaE"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf8internal19ImplicitWeakMessage8GetArenaEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite20GetMaybeArenaPointerEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal19ImplicitWeakMessage5ClearEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf8internal19ImplicitWeakMessage13IsInitializedEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite25InitializationErrorStringEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal19ImplicitWeakMessage21CheckTypeAndMergeFromERKNS0_11MessageLiteE"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal19ImplicitWeakMessage27MergePartialFromCodedStreamEPNS0_2io16CodedInputStreamE"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf8internal19ImplicitWeakMessage12ByteSizeLongEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf8internal19ImplicitWeakMessage24SerializeWithCachedSizesEPNS0_2io17CodedOutputStreamE"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite31SerializeWithCachedSizesToArrayEPh"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf8internal19ImplicitWeakMessage13GetCachedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite16InternalGetTableEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite39InternalSerializeWithCachedSizesToArrayEPh"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "it_",
     "referenced_type" : "_ZTIPKPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal19RepeatedPtrIteratorIKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "name" : "google::protobuf::internal::RepeatedPtrIterator<const std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal19RepeatedPtrIteratorIKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN6google8protobuf8internal19RepeatedPtrIteratorIKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "it_",
     "referenced_type" : "_ZTIPKPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal19RepeatedPtrIteratorINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "name" : "google::protobuf::internal::RepeatedPtrIterator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal19RepeatedPtrIteratorINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN6google8protobuf8internal19RepeatedPtrIteratorINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "allocated_size",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "elements",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_Pv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal20RepeatedPtrFieldBase3RepE",
   "name" : "google::protobuf::internal::RepeatedPtrFieldBase::Rep",
   "referenced_type" : "_ZTIN6google8protobuf8internal20RepeatedPtrFieldBase3RepE",
   "self_type" : "_ZTIN6google8protobuf8internal20RepeatedPtrFieldBase3RepE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "arena_",
     "referenced_type" : "_ZTIPN6google8protobuf5ArenaE"
    },
    {
     "access" : "private",
     "field_name" : "current_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "rep_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPN6google8protobuf8internal20RepeatedPtrFieldBase3RepE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal20RepeatedPtrFieldBaseE",
   "name" : "google::protobuf::internal::RepeatedPtrFieldBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal20RepeatedPtrFieldBaseE",
   "self_type" : "_ZTIN6google8protobuf8internal20RepeatedPtrFieldBaseE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "space",
     "referenced_type" : "_ZTIA12_c"
    },
    {
     "field_name" : "align_to_int64",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "align_to_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal21ExplicitlyConstructedINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEE12AlignedUnionE",
   "name" : "google::protobuf::internal::ExplicitlyConstructed<basic_string<char>>::AlignedUnion",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN6google8protobuf8internal21ExplicitlyConstructedINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEE12AlignedUnionE",
   "self_type" : "_ZTIN6google8protobuf8internal21ExplicitlyConstructedINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEE12AlignedUnionE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/message_lite.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "union_",
     "referenced_type" : "_ZTIN6google8protobuf8internal21ExplicitlyConstructedINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEE12AlignedUnionE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal21ExplicitlyConstructedINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "name" : "google::protobuf::internal::ExplicitlyConstructed<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal21ExplicitlyConstructedINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN6google8protobuf8internal21ExplicitlyConstructedINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/message_lite.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "it_",
     "referenced_type" : "_ZTIPKPKv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal27RepeatedPtrOverPtrsIteratorIKPKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEKPKvEE",
   "name" : "google::protobuf::internal::RepeatedPtrOverPtrsIterator<const std::basic_string<char, std::char_traits<char>, std::allocator<char>> *const, const void *const>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal27RepeatedPtrOverPtrsIteratorIKPKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEKPKvEE",
   "self_type" : "_ZTIN6google8protobuf8internal27RepeatedPtrOverPtrsIteratorIKPKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEKPKvEE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" :
   [
    "_ZTIKPKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
    "_ZTIKPKv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "it_",
     "referenced_type" : "_ZTIPPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal27RepeatedPtrOverPtrsIteratorIPNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEPvEE",
   "name" : "google::protobuf::internal::RepeatedPtrOverPtrsIterator<std::basic_string<char, std::char_traits<char>, std::allocator<char>> *, void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal27RepeatedPtrOverPtrsIteratorIPNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEPvEE",
   "self_type" : "_ZTIN6google8protobuf8internal27RepeatedPtrOverPtrsIteratorIPNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEPvEE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" :
   [
    "_ZTIPNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
    "_ZTIPv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal27TypeImplementsMergeBehaviorINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEvEE",
   "name" : "google::protobuf::internal::TypeImplementsMergeBehavior<std::basic_string<char, std::char_traits<char>, std::allocator<char>>, void>",
   "referenced_type" : "_ZTIN6google8protobuf8internal27TypeImplementsMergeBehaviorINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEvEE",
   "self_type" : "_ZTIN6google8protobuf8internal27TypeImplementsMergeBehaviorINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEvEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
    "_ZTIv"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "elem",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "name" : "google::protobuf::internal::ArenaImpl::CleanupNode",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "arena_",
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImplE"
    },
    {
     "access" : "private",
     "field_name" : "owner_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "head_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "cleanup_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl12CleanupChunkE"
    },
    {
     "access" : "private",
     "field_name" : "next_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11SerialArenaE"
    },
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "limit_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "cleanup_ptr_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11CleanupNodeE"
    },
    {
     "access" : "private",
     "field_name" : "cleanup_limit_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11CleanupNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "name" : "google::protobuf::internal::ArenaImpl::SerialArena",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "size" : 36,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "last_lifecycle_id_seen",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "last_serial_arena",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11SerialArenaE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl11ThreadCacheE",
   "name" : "google::protobuf::internal::ArenaImpl::ThreadCache",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11ThreadCacheE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11ThreadCacheE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "next",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl12CleanupChunkE"
    },
    {
     "field_name" : "nodes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA1_N6google8protobuf8internal9ArenaImpl11CleanupNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl12CleanupChunkE",
   "name" : "google::protobuf::internal::ArenaImpl::CleanupChunk",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl12CleanupChunkE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl12CleanupChunkE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "next_",
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "pos_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl5BlockE",
   "name" : "google::protobuf::internal::ArenaImpl::Block",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl5BlockE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl5BlockE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_block_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "max_block_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "initial_block",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "initial_block_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "block_alloc",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFPvjE"
    },
    {
     "field_name" : "block_dealloc",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFvPvjE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE",
   "name" : "google::protobuf::internal::ArenaImpl::Options",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE",
   "size" : 24,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "threads_",
     "referenced_type" : "_ZTINSt3__16atomicIPN6google8protobuf8internal9ArenaImpl11SerialArenaEEE"
    },
    {
     "access" : "private",
     "field_name" : "hint_",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16atomicIPN6google8protobuf8internal9ArenaImpl11SerialArenaEEE"
    },
    {
     "access" : "private",
     "field_name" : "space_allocated_",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16atomicIjEE"
    },
    {
     "access" : "private",
     "field_name" : "initial_block_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "lifecycle_id_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "options_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImplE",
   "name" : "google::protobuf::internal::ArenaImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImplE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImplE",
   "size" : 48,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9IsMovableINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "name" : "google::protobuf::internal::IsMovable<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN6google8protobuf8internal9IsMovableINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN6google8protobuf8internal9IsMovableINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf9BigEndianE",
   "name" : "google::protobuf::BigEndian",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf9BigEndianE",
   "self_type" : "_ZTIN6google8protobuf9BigEndianE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION6google8protobuf13RepeatedFieldIbEE",
   "name" : "google::protobuf::RepeatedField<bool> &&",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIbEE",
   "self_type" : "_ZTION6google8protobuf13RepeatedFieldIbEE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION6google8protobuf13RepeatedFieldIdEE",
   "name" : "google::protobuf::RepeatedField<double> &&",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIdEE",
   "self_type" : "_ZTION6google8protobuf13RepeatedFieldIdEE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION6google8protobuf13RepeatedFieldIfEE",
   "name" : "google::protobuf::RepeatedField<float> &&",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIfEE",
   "self_type" : "_ZTION6google8protobuf13RepeatedFieldIfEE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION6google8protobuf13RepeatedFieldIiEE",
   "name" : "google::protobuf::RepeatedField<int32> &&",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIiEE",
   "self_type" : "_ZTION6google8protobuf13RepeatedFieldIiEE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION6google8protobuf13RepeatedFieldIjEE",
   "name" : "google::protobuf::RepeatedField<uint32> &&",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIjEE",
   "self_type" : "_ZTION6google8protobuf13RepeatedFieldIjEE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION6google8protobuf13RepeatedFieldIxEE",
   "name" : "google::protobuf::RepeatedField<int64> &&",
   "referenced_type" : "_ZTIN6google8protobuf13RepeatedFieldIxEE",
   "self_type" : "_ZTION6google8protobuf13RepeatedFieldIxEE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
