#ifndef HIDL_GENERATED_ANDROID_HARDWARE_WIFI_V1_0_IWIFICHIP_H
#define HIDL_GENERATED_ANDROID_HARDWARE_WIFI_V1_0_IWIFICHIP_H

#include <android/hardware/wifi/1.0/IWifiApIface.h>
#include <android/hardware/wifi/1.0/IWifiChipEventCallback.h>
#include <android/hardware/wifi/1.0/IWifiIface.h>
#include <android/hardware/wifi/1.0/IWifiNanIface.h>
#include <android/hardware/wifi/1.0/IWifiP2pIface.h>
#include <android/hardware/wifi/1.0/IWifiRttController.h>
#include <android/hardware/wifi/1.0/IWifiStaIface.h>
#include <android/hardware/wifi/1.0/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace wifi {
namespace V1_0 {

/**
 * Interface that represents a chip that must be configured as a single unit.
 * The HAL/driver/firmware will be responsible for determining which phy is used
 * to perform operations like NAN, RTT, etc.
 */
struct IWifiChip : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.wifi@1.0::IWifiChip"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    struct ChipIfaceCombinationLimit;
    struct ChipIfaceCombination;
    struct ChipMode;
    struct ChipDebugInfo;
    enum class ChipCapabilityMask : uint32_t;

    /**
     * Set of interface types with the maximum number of interfaces that can have
     * one of the specified type for a given ChipIfaceCombination. See
     * ChipIfaceCombination for examples.
     */
    struct ChipIfaceCombinationLimit final {
        ::android::hardware::hidl_vec<::android::hardware::wifi::V1_0::IfaceType> types __attribute__ ((aligned(8)));
        uint32_t maxIfaces __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::wifi::V1_0::IWifiChip::ChipIfaceCombinationLimit, types) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::V1_0::IWifiChip::ChipIfaceCombinationLimit, maxIfaces) == 16, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::V1_0::IWifiChip::ChipIfaceCombinationLimit) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::V1_0::IWifiChip::ChipIfaceCombinationLimit) == 8, "wrong alignment");

    /**
     * Set of interfaces that can operate concurrently when in a given mode. See
     * ChipMode below.
     *
     * For example:
     *   [{STA} <= 2]
     *       At most two STA interfaces are supported
     *       [], [STA], [STA+STA]
     *
     *   [{STA} <= 1, {NAN} <= 1, {AP} <= 1]
     *       Any combination of STA, NAN, AP
     *       [], [STA], [NAN], [AP], [STA+NAN], [STA+AP], [NAN+AP], [STA+NAN+AP]
     *
     *   [{STA} <= 1, {NAN,P2P} <= 1]
     *       Optionally a STA and either NAN or P2P
     *       [], [STA], [STA+NAN], [STA+P2P], [NAN], [P2P]
     *       Not included [NAN+P2P], [STA+NAN+P2P]
     *
     *   [{STA} <= 1, {STA,NAN} <= 1]
     *       Optionally a STA and either a second STA or a NAN
     *       [], [STA], [STA+NAN], [STA+STA], [NAN]
     *       Not included [STA+STA+NAN]
     */
    struct ChipIfaceCombination final {
        ::android::hardware::hidl_vec<::android::hardware::wifi::V1_0::IWifiChip::ChipIfaceCombinationLimit> limits __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::wifi::V1_0::IWifiChip::ChipIfaceCombination, limits) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::V1_0::IWifiChip::ChipIfaceCombination) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::V1_0::IWifiChip::ChipIfaceCombination) == 8, "wrong alignment");

    /**
     * A mode that the chip can be put in. A mode defines a set of constraints on
     * the interfaces that can exist while in that mode. Modes define a unit of
     * configuration where all interfaces must be torn down to switch to a
     * different mode. Some HALs may only have a single mode, but an example where
     * multiple modes would be required is if a chip has different firmwares with
     * different capabilities.
     *
     * When in a mode, it must be possible to perform any combination of creating
     * and removing interfaces as long as at least one of the
     * ChipIfaceCombinations is satisfied. This means that if a chip has two
     * available combinations, [{STA} <= 1] and [{AP} <= 1] then it is expected
     * that exactly one STA interface or one AP interface can be created, but it
     * is not expected that both a STA and AP interface could be created. If it
     * was then there would be a single available combination
     * [{STA} <=1, {AP} <= 1].
     *
     * When switching between two available combinations it is expected that
     * interfaces only supported by the initial combination must be removed until
     * the target combination is also satisfied. At that point new interfaces
     * satisfying only the target combination can be added (meaning the initial
     * combination limits will no longer satisfied). The addition of these new
     * interfaces must not impact the existence of interfaces that satisfy both
     * combinations.
     *
     * For example, a chip with available combinations:
     *     [{STA} <= 2, {NAN} <=1] and [{STA} <=1, {NAN} <= 1, {AP} <= 1}]
     * If the chip currently has 3 interfaces STA, STA and NAN and wants to add an
     * AP interface in place of one of the STAs then first one of the STA
     * interfaces must be removed and then the AP interface can be created after
     * the STA had been torn down. During this process the remaining STA and NAN
     * interfaces must not be removed/recreated.
     *
     * If a chip does not support this kind of reconfiguration in this mode then
     * the combinations must be separated into two separate modes. Before
     * switching modes all interfaces must be torn down, the mode switch must be
     * enacted and when it completes the new interfaces must be brought up.
     */
    struct ChipMode final {
        /**
         * Id that can be used to put the chip in this mode.
         */
        uint32_t id __attribute__ ((aligned(4)));
        /**
         * A list of the possible interface combinations that the chip can have
         * while in this mode.
         */
        ::android::hardware::hidl_vec<::android::hardware::wifi::V1_0::IWifiChip::ChipIfaceCombination> availableCombinations __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::wifi::V1_0::IWifiChip::ChipMode, id) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::V1_0::IWifiChip::ChipMode, availableCombinations) == 8, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::V1_0::IWifiChip::ChipMode) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::V1_0::IWifiChip::ChipMode) == 8, "wrong alignment");

    /**
     * Information about the version of the driver and firmware running this chip.
     *
     * The information in these ASCII strings are vendor specific and does not
     * need to follow any particular format. It may be dumped as part of the bug
     * report.
     */
    struct ChipDebugInfo final {
        ::android::hardware::hidl_string driverDescription __attribute__ ((aligned(8)));
        ::android::hardware::hidl_string firmwareDescription __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::wifi::V1_0::IWifiChip::ChipDebugInfo, driverDescription) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::V1_0::IWifiChip::ChipDebugInfo, firmwareDescription) == 16, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::V1_0::IWifiChip::ChipDebugInfo) == 32, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::V1_0::IWifiChip::ChipDebugInfo) == 8, "wrong alignment");

    /**
     * Capabilities exposed by this chip.
     */
    enum class ChipCapabilityMask : uint32_t {
        /**
         * Memory dump of Firmware.
         */
        DEBUG_MEMORY_FIRMWARE_DUMP = 1u /* 1 << 0 */,
        /**
         * Memory dump of Driver.
         */
        DEBUG_MEMORY_DRIVER_DUMP = 2u /* 1 << 1 */,
        /**
         * Connectivity events reported via debug ring buffer.
         */
        DEBUG_RING_BUFFER_CONNECT_EVENT = 4u /* 1 << 2 */,
        /**
         * Power events reported via debug ring buffer.
         */
        DEBUG_RING_BUFFER_POWER_EVENT = 8u /* 1 << 3 */,
        /**
         * Wakelock events reported via debug ring buffer.
         */
        DEBUG_RING_BUFFER_WAKELOCK_EVENT = 16u /* 1 << 4 */,
        /**
         * Vendor data reported via debug ring buffer.
         * This mostly contains firmware event logs.
         */
