{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA5_P12_ExifContent",
   "name" : "_ExifContent *[5]",
   "referenced_type" : "_ZTIP12_ExifContent",
   "self_type" : "_ZTIA5_P12_ExifContent",
   "size" : 20,
   "source_file" : "external/libexif/libexif/exif-data.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 4
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "linker_set_key" : "_ZTIs",
   "name" : "short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIs",

   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-content.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP12_ExifContentPvE",
   "name" : "void (*)(_ExifContent *, void *)",
   "referenced_type" : "_ZTIFvP12_ExifContentPvE",
   "self_type" : "_ZTIPFvP12_ExifContentPvE",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-data.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14_ExifMnoteData13ExifByteOrderE",
   "name" : "void (*)(_ExifMnoteData *, ExifByteOrder)",
   "referenced_type" : "_ZTIFvP14_ExifMnoteData13ExifByteOrderE",
   "self_type" : "_ZTIPFvP14_ExifMnoteData13ExifByteOrderE",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-mnote-data-priv.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14_ExifMnoteDataE",
   "name" : "void (*)(_ExifMnoteData *)",
   "referenced_type" : "_ZTIFvP14_ExifMnoteDataE",
   "self_type" : "_ZTIPFvP14_ExifMnoteDataE",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-mnote-data-priv.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14_ExifMnoteDataPKhjE",
   "name" : "void (*)(_ExifMnoteData *, const unsigned char *, unsigned int)",
   "referenced_type" : "_ZTIFvP14_ExifMnoteDataPKhjE",
   "self_type" : "_ZTIPFvP14_ExifMnoteDataPKhjE",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-mnote-data-priv.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14_ExifMnoteDataPPhPjE",
   "name" : "void (*)(_ExifMnoteData *, unsigned char **, unsigned int *)",
   "referenced_type" : "_ZTIFvP14_ExifMnoteDataPPhPjE",
   "self_type" : "_ZTIPFvP14_ExifMnoteDataPPhPjE",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-mnote-data-priv.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14_ExifMnoteDatajE",
   "name" : "void (*)(_ExifMnoteData *, unsigned int)",
   "referenced_type" : "_ZTIFvP14_ExifMnoteDatajE",
   "self_type" : "_ZTIPFvP14_ExifMnoteDatajE",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-mnote-data-priv.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP8_ExifLog11ExifLogCodePKcS3_9__va_listPvE",
   "name" : "void (*)(_ExifLog *, ExifLogCode, const char *, const char *, __va_list, void *)",
   "referenced_type" : "_ZTIFvP8_ExifLog11ExifLogCodePKcS3_9__va_listPvE",
   "self_type" : "_ZTIPFvP8_ExifLog11ExifLogCodePKcS3_9__va_listPvE",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-log.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvPvE",
   "name" : "void (*)(void *)",
   "referenced_type" : "_ZTIFvPvE",
   "self_type" : "_ZTIPFvPvE",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-mem.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-byte-order.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-data.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKt",
   "name" : "const unsigned short *",
   "referenced_type" : "_ZTIKt",
   "self_type" : "_ZTIPKt",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-utils.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP10_ExifEntry",
   "name" : "_ExifEntry **",
   "referenced_type" : "_ZTIP10_ExifEntry",
   "self_type" : "_ZTIPP10_ExifEntry",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-content.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPKh",
   "name" : "const unsigned char **",
   "referenced_type" : "_ZTIPKh",
   "self_type" : "_ZTIPPKh",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-loader.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPh",
   "name" : "unsigned char **",
   "referenced_type" : "_ZTIPh",
   "self_type" : "_ZTIPPh",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-data.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-mnote-data-priv.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-entry.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-data.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/libexif/libexif/exif-content.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libexif/libexif/exif-byte-order.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/libexif/libexif/exif-data.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "external/libexif/libexif/exif-utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "_ZTI7ExifTag"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "_ZTI10ExifFormat"
    },
    {
     "field_name" : "components",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "parent",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP12_ExifContent"
    },
    {
     "field_name" : "priv",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP17_ExifEntryPrivate"
    }
   ],
   "linker_set_key" : "_ZTI10_ExifEntry",
   "name" : "_ExifEntry",
   "referenced_type" : "_ZTI10_ExifEntry",
   "self_type" : "_ZTI10_ExifEntry",
   "size" : 28,
   "source_file" : "external/libexif/libexif/exif-entry.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "numerator",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "denominator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12ExifRational",
   "name" : "ExifRational",
   "referenced_type" : "_ZTI12ExifRational",
   "self_type" : "_ZTI12ExifRational",
   "size" : 8,
   "source_file" : "external/libexif/libexif/exif-utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "entries",
     "referenced_type" : "_ZTIPP10_ExifEntry"
    },
    {
     "field_name" : "count",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "parent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9_ExifData"
    },
    {
     "field_name" : "priv",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP19_ExifContentPrivate"
    }
   ],
   "linker_set_key" : "_ZTI12_ExifContent",
   "name" : "_ExifContent",
   "referenced_type" : "_ZTI12_ExifContent",
   "self_type" : "_ZTI12_ExifContent",
   "size" : 16,
   "source_file" : "external/libexif/libexif/exif-content.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "numerator",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "denominator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI13ExifSRational",
   "name" : "ExifSRational",
   "referenced_type" : "_ZTI13ExifSRational",
   "self_type" : "_ZTI13ExifSRational",
   "size" : 8,
   "source_file" : "external/libexif/libexif/exif-utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "priv",
     "referenced_type" : "_ZTIP18_ExifMnoteDataPriv"
    },
    {
     "field_name" : "methods",
     "field_offset" : 32,
     "referenced_type" : "_ZTI21_ExifMnoteDataMethods"
    },
    {
     "field_name" : "log",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP8_ExifLog"
    },
    {
     "field_name" : "mem",
     "field_offset" : 416,
     "referenced_type" : "_ZTIP8_ExifMem"
    }
   ],
   "linker_set_key" : "_ZTI14_ExifMnoteData",
   "name" : "_ExifMnoteData",
   "referenced_type" : "_ZTI14_ExifMnoteData",
   "self_type" : "_ZTI14_ExifMnoteData",
   "size" : 56,
   "source_file" : "external/libexif/libexif/exif-mnote-data-priv.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "free",
     "referenced_type" : "_ZTIPFvP14_ExifMnoteDataE"
    },
    {
     "field_name" : "save",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvP14_ExifMnoteDataPPhPjE"
    },
    {
     "field_name" : "load",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvP14_ExifMnoteDataPKhjE"
    },
    {
     "field_name" : "set_offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvP14_ExifMnoteDatajE"
    },
    {
     "field_name" : "set_byte_order",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvP14_ExifMnoteData13ExifByteOrderE"
    },
    {
     "field_name" : "count",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjP14_ExifMnoteDataE"
    },
    {
     "field_name" : "get_id",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjP14_ExifMnoteDatajE"
    },
    {
     "field_name" : "get_name",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFPKcP14_ExifMnoteDatajE"
    },
    {
     "field_name" : "get_title",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFPKcP14_ExifMnoteDatajE"
    },
    {
     "field_name" : "get_description",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFPKcP14_ExifMnoteDatajE"
    },
    {
     "field_name" : "get_value",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFPcP14_ExifMnoteDatajS_jE"
    }
   ],
   "linker_set_key" : "_ZTI21_ExifMnoteDataMethods",
   "name" : "_ExifMnoteDataMethods",
   "referenced_type" : "_ZTI21_ExifMnoteDataMethods",
   "self_type" : "_ZTI21_ExifMnoteDataMethods",
   "size" : 44,
   "source_file" : "external/libexif/libexif/exif-mnote-data-priv.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifd",
     "referenced_type" : "_ZTIA5_P12_ExifContent"
    },
    {
     "field_name" : "data",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "priv",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP16_ExifDataPrivate"
    }
   ],
   "linker_set_key" : "_ZTI9_ExifData",
   "name" : "_ExifData",
   "referenced_type" : "_ZTI9_ExifData",
   "self_type" : "_ZTI9_ExifData",
   "size" : 32,
   "source_file" : "external/libexif/libexif/exif-data.h"
  }
 ],
 "rvalue_reference_types" : []
}
