{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA2052_y",
   "name" : "unsigned long long [2052]",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIA2052_y",
   "size" : 16416,
   "source_file" : "external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA2_j",
   "name" : "unsigned int [2]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA2_j",
   "size" : 8,
   "source_file" : "external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA32768_j",
   "name" : "unsigned int [32768]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA32768_j",
   "size" : 131072,
   "source_file" : "external/lz4/lib/lz4hc.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA32775_m",
   "name" : "unsigned long [32775]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA32775_m",
   "size" : 262200,
   "source_file" : "external/lz4/lib/lz4hc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA3_j",
   "name" : "unsigned int [3]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA3_j",
   "size" : 12,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4096_j",
   "name" : "unsigned int [4096]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA4096_j",
   "size" : 16384,
   "source_file" : "external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA4_h",
   "name" : "unsigned char [4]",

  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK19LZ4HC_CCtx_internal",
   "name" : "const LZ4HC_CCtx_internal *",
   "referenced_type" : "_ZTIK19LZ4HC_CCtx_internal",
   "self_type" : "_ZTIPK19LZ4HC_CCtx_internal",
   "size" : 8,
   "source_file" : "external/lz4/lib/lz4hc.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK21LZ4_stream_t_internal",
   "name" : "const LZ4_stream_t_internal *",
   "referenced_type" : "_ZTIK21LZ4_stream_t_internal",
   "self_type" : "_ZTIPK21LZ4_stream_t_internal",
   "size" : 8,
   "source_file" : "external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK22LZ4F_compressOptions_t",
   "name" : "const LZ4F_compressOptions_t *",
   "referenced_type" : "_ZTIK22LZ4F_compressOptions_t",
   "self_type" : "_ZTIPK22LZ4F_compressOptions_t",
   "size" : 8,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK24LZ4F_decompressOptions_t",
   "name" : "const LZ4F_decompressOptions_t *",
   "referenced_type" : "_ZTIK24LZ4F_decompressOptions_t",
   "self_type" : "_ZTIPK24LZ4F_decompressOptions_t",
   "size" : 8,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 8,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 8,
   "source_file" : "external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 8,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP11LZ4F_cctx_s",
   "name" : "LZ4F_cctx_s **",
   "referenced_type" : "_ZTIP11LZ4F_cctx_s",
   "self_type" : "_ZTIPP11LZ4F_cctx_s",
   "size" : 8,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP11LZ4F_dctx_s",
   "name" : "LZ4F_dctx_s **",
   "referenced_type" : "_ZTIP11LZ4F_dctx_s",
   "self_type" : "_ZTIPP11LZ4F_dctx_s",
   "size" : 8,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 8,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/lz4/lib/lz4frame.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12LZ4F_CDict_s",
   "name" : "const LZ4F_CDict_s",
   "referenced_type" : "_ZTI12LZ4F_CDict_s",
   "self_type" : "_ZTIK12LZ4F_CDict_s",
   "size" : 24,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK18LZ4F_preferences_t",
   "name" : "const LZ4F_preferences_t",
   "referenced_type" : "_ZTI18LZ4F_preferences_t",
   "self_type" : "_ZTIK18LZ4F_preferences_t",
   "size" : 56,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK19LZ4HC_CCtx_internal",
   "name" : "const LZ4HC_CCtx_internal",
   "referenced_type" : "_ZTI19LZ4HC_CCtx_internal",
   "self_type" : "_ZTIK19LZ4HC_CCtx_internal",
   "size" : 262192,
   "source_file" : "external/lz4/lib/lz4hc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK21LZ4_stream_t_internal",
   "name" : "const LZ4_stream_t_internal",
   "referenced_type" : "_ZTI21LZ4_stream_t_internal",
   "self_type" : "_ZTIK21LZ4_stream_t_internal",
   "size" : 16416,
   "source_file" : "external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK22LZ4F_compressOptions_t",
   "name" : "const LZ4F_compressOptions_t",
   "referenced_type" : "_ZTI22LZ4F_compressOptions_t",
   "self_type" : "_ZTIK22LZ4F_compressOptions_t",
   "size" : 16,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK24LZ4F_decompressOptions_t",
   "name" : "const LZ4F_decompressOptions_t",
   "referenced_type" : "_ZTI24LZ4F_decompressOptions_t",
   "self_type" : "_ZTIK24LZ4F_decompressOptions_t",
   "size" : 16,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/lz4/lib/lz4.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/lz4/lib/lz4frame.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "table",
     "referenced_type" : "_ZTIA2052_y"
    },
    {
     "field_name" : "internal_donotuse",
     "referenced_type" : "_ZTI21LZ4_stream_t_internal"
    }
   ],
   "linker_set_key" : "_ZTI12LZ4_stream_u",
   "name" : "LZ4_stream_u",
   "record_kind" : "union",
   "referenced_type" : "_ZTI12LZ4_stream_u",
   "self_type" : "_ZTI12LZ4_stream_u",
   "size" : 16416,
   "source_file" : "external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "total_len_32",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "large_len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "v1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "v2",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "v3",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "v4",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mem32",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA4_j"
    },
    {
     "field_name" : "memsize",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13XXH32_state_s",
   "name" : "XXH32_state_s",
   "referenced_type" : "_ZTI13XXH32_state_s",
   "self_type" : "_ZTI13XXH32_state_s",
   "size" : 48,
   "source_file" : "external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "total_len",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "v1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "v2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "v3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "v4",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "mem64",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA4_m"
    },
    {
     "field_name" : "memsize",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 608,
     "referenced_type" : "_ZTIA2_j"
    }
   ],
   "linker_set_key" : "_ZTI13XXH64_state_s",
   "name" : "XXH64_state_s",
   "referenced_type" : "_ZTI13XXH64_state_s",
   "self_type" : "_ZTI13XXH64_state_s",
   "size" : 88,
   "source_file" : "external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "table",
     "referenced_type" : "_ZTIA32775_m"
    },
    {
     "field_name" : "internal_donotuse",
     "referenced_type" : "_ZTI19LZ4HC_CCtx_internal"
    }
   ],
   "linker_set_key" : "_ZTI14LZ4_streamHC_u",
   "name" : "LZ4_streamHC_u",
   "record_kind" : "union",
   "referenced_type" : "_ZTI14LZ4_streamHC_u",
   "self_type" : "_ZTI14LZ4_streamHC_u",
   "size" : 262200,
   "source_file" : "external/lz4/lib/lz4hc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "blockSizeID",
     "referenced_type" : "_ZTI18LZ4F_blockSizeID_t"
    },
    {
     "field_name" : "blockMode",
     "field_offset" : 32,
     "referenced_type" : "_ZTI16LZ4F_blockMode_t"
    },
    {
     "field_name" : "contentChecksumFlag",
     "field_offset" : 64,
     "referenced_type" : "_ZTI22LZ4F_contentChecksum_t"
    },
    {
     "field_name" : "frameType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI16LZ4F_frameType_t"
    },
    {
     "field_name" : "contentSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dictID",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "blockChecksumFlag",
     "field_offset" : 224,
     "referenced_type" : "_ZTI20LZ4F_blockChecksum_t"
    }
   ],
   "linker_set_key" : "_ZTI16LZ4F_frameInfo_t",
   "name" : "LZ4F_frameInfo_t",
   "referenced_type" : "_ZTI16LZ4F_frameInfo_t",
   "self_type" : "_ZTI16LZ4F_frameInfo_t",
   "size" : 32,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "digest",
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI17XXH32_canonical_t",
   "name" : "XXH32_canonical_t",
   "referenced_type" : "_ZTI17XXH32_canonical_t",
   "self_type" : "_ZTI17XXH32_canonical_t",
   "size" : 4,
   "source_file" : "external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "digest",
     "referenced_type" : "_ZTIA8_h"
    }
   ],
   "linker_set_key" : "_ZTI17XXH64_canonical_t",
   "name" : "XXH64_canonical_t",
   "referenced_type" : "_ZTI17XXH64_canonical_t",
   "self_type" : "_ZTI17XXH64_canonical_t",
   "size" : 8,
   "source_file" : "external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frameInfo",
     "referenced_type" : "_ZTI16LZ4F_frameInfo_t"
    },
    {
     "field_name" : "compressionLevel",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "autoFlush",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "favorDecSpeed",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 352,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI18LZ4F_preferences_t",
   "name" : "LZ4F_preferences_t",
   "referenced_type" : "_ZTI18LZ4F_preferences_t",
   "self_type" : "_ZTI18LZ4F_preferences_t",
   "size" : 56,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "table",
     "referenced_type" : "_ZTIA4_y"
    },
    {
     "field_name" : "internal_donotuse",
     "referenced_type" : "_ZTI27LZ4_streamDecode_t_internal"
    }
   ],
   "linker_set_key" : "_ZTI18LZ4_streamDecode_u",
   "name" : "LZ4_streamDecode_u",
   "record_kind" : "union",
   "referenced_type" : "_ZTI18LZ4_streamDecode_u",
   "self_type" : "_ZTI18LZ4_streamDecode_u",
   "size" : 32,
   "source_file" : "external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hashTable",
     "referenced_type" : "_ZTIA32768_j"
    },
    {
     "field_name" : "chainTable",
     "field_offset" : 1048576,
     "referenced_type" : "_ZTIA65536_t"
    },
    {
     "field_name" : "end",
     "field_offset" : 2097152,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "base",
     "field_offset" : 2097216,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "dictBase",
     "field_offset" : 2097280,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "dictLimit",
     "field_offset" : 2097344,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lowLimit",
     "field_offset" : 2097376,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nextToUpdate",
     "field_offset" : 2097408,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "compressionLevel",
     "field_offset" : 2097440,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "favorDecSpeed",
     "field_offset" : 2097456,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "dirty",
     "field_offset" : 2097464,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "dictCtx",
     "field_offset" : 2097472,
     "referenced_type" : "_ZTIPK19LZ4HC_CCtx_internal"
    }
   ],
   "linker_set_key" : "_ZTI19LZ4HC_CCtx_internal",
   "name" : "LZ4HC_CCtx_internal",
   "referenced_type" : "_ZTI19LZ4HC_CCtx_internal",
   "self_type" : "_ZTI19LZ4HC_CCtx_internal",
   "size" : 262192,
   "source_file" : "external/lz4/lib/lz4hc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hashTable",
     "referenced_type" : "_ZTIA4096_j"
    },
    {
     "field_name" : "currentOffset",
     "field_offset" : 131072,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dirty",
     "field_offset" : 131104,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tableType",
     "field_offset" : 131120,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "dictionary",
     "field_offset" : 131136,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "dictCtx",
     "field_offset" : 131200,
     "referenced_type" : "_ZTIPK21LZ4_stream_t_internal"
    },
    {
     "field_name" : "dictSize",
     "field_offset" : 131264,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21LZ4_stream_t_internal",
   "name" : "LZ4_stream_t_internal",
   "referenced_type" : "_ZTI21LZ4_stream_t_internal",
   "self_type" : "_ZTI21LZ4_stream_t_internal",
   "size" : 16416,
   "source_file" : "external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stableSrc",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI22LZ4F_compressOptions_t",
   "name" : "LZ4F_compressOptions_t",
   "referenced_type" : "_ZTI22LZ4F_compressOptions_t",
   "self_type" : "_ZTI22LZ4F_compressOptions_t",
   "size" : 16,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stableDst",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI24LZ4F_decompressOptions_t",
   "name" : "LZ4F_decompressOptions_t",
   "referenced_type" : "_ZTI24LZ4F_decompressOptions_t",
   "self_type" : "_ZTI24LZ4F_decompressOptions_t",
   "size" : 16,
   "source_file" : "external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "externalDict",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "extDictSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "prefixEnd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "prefixSize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI27LZ4_streamDecode_t_internal",
   "name" : "LZ4_streamDecode_t_internal",
   "referenced_type" : "_ZTI27LZ4_streamDecode_t_internal",
   "self_type" : "_ZTI27LZ4_streamDecode_t_internal",
   "size" : 32,
   "source_file" : "external/lz4/lib/lz4.h"
  }
 ],
 "rvalue_reference_types" : []
}
