#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GNSS_V2_1_IGNSSMEASUREMENTCALLBACK_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GNSS_V2_1_IGNSSMEASUREMENTCALLBACK_H

#include <android/hardware/gnss/1.0/IGnssMeasurementCallback.h>
#include <android/hardware/gnss/2.0/IGnssMeasurementCallback.h>
#include <android/hardware/gnss/2.0/types.h>
#include <android/hardware/gnss/2.1/types.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace gnss {
namespace V2_1 {

/**
 * The callback interface to report measurements from the HAL.
 */
struct IGnssMeasurementCallback : public ::android::hardware::gnss::V2_0::IGnssMeasurementCallback {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.gnss@2.1::IGnssMeasurementCallback"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class GnssMeasurementFlags : uint32_t;
    struct GnssMeasurement;
    struct GnssClock;
    struct GnssData;

    /**
     * Flags to indicate what fields in GnssMeasurement are valid.
     */
    enum class GnssMeasurementFlags : uint32_t {
        /**
         * A valid 'snr' is stored in the data structure.
         */
        HAS_SNR = 1u /* 1 << 0 */,
        /**
         * A valid 'carrier frequency' is stored in the data structure.
         */
        HAS_CARRIER_FREQUENCY = 512u /* 1 << 9 */,
        /**
         * A valid 'carrier cycles' is stored in the data structure.
         */
        HAS_CARRIER_CYCLES = 1024u /* 1 << 10 */,
        /**
         * A valid 'carrier phase' is stored in the data structure.
         */
        HAS_CARRIER_PHASE = 2048u /* 1 << 11 */,
        /**
         * A valid 'carrier phase uncertainty' is stored in the data structure.
         */
        HAS_CARRIER_PHASE_UNCERTAINTY = 4096u /* 1 << 12 */,
        /**
         * A valid automatic gain control is stored in the data structure.
         */
        HAS_AUTOMATIC_GAIN_CONTROL = 8192u /* 1 << 13 */,
        /**
         * A valid full inter-signal bias is stored in the data structure.
         */
        HAS_FULL_ISB = 65536u /* 1 << 16 */,
        /**
         * A valid full inter-signal bias uncertainty is stored in the data structure.
         */
        HAS_FULL_ISB_UNCERTAINTY = 131072u /* 1 << 17 */,
        /**
         * A valid satellite inter-signal bias is stored in the data structure.
         */
        HAS_SATELLITE_ISB = 262144u /* 1 << 18 */,
        /**
         * A valid satellite inter-signal bias uncertainty is stored in the data structure.
         */
        HAS_SATELLITE_ISB_UNCERTAINTY = 524288u /* 1 << 19 */,
    };

    /**
     * Extends a GNSS Measurement, adding basebandCN0DbHz, GnssMeasurementFlags,
     * receiverInterSignalBiasNs, receiverInterSignalBiasUncertaintyNs, satelliteInterSignalBiasNs
     * and satelliteInterSignalBiasUncertaintyNs.
     */
    struct GnssMeasurement final {
        /**
         * GNSS measurement information for a single satellite and frequency, as in the 2.0 version
         * of the HAL.
         *
         * In this version of the HAL, the field 'flags' in the v2_0.v1_1.v1_0 struct is deprecated,
         * and is no longer used by the framework. The GNSS measurement flags are instead reported
         * in @2.1::IGnssMeasurementCallback.GnssMeasurement.flags.
         *
         */
        ::android::hardware::gnss::V2_0::IGnssMeasurementCallback::GnssMeasurement v2_0 __attribute__ ((aligned(8)));
        /**
         * A set of flags indicating the validity of the fields in this data
         * structure.
         *
         * Fields for which there is no corresponding flag must be filled in
         * with a valid value.  For convenience, these are marked as mandatory.
         *
         * Others fields may have invalid information in them, if not marked as
         * valid by the corresponding bit in flags.
         */
        ::android::hardware::hidl_bitfield<::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssMeasurementFlags> flags __attribute__ ((aligned(4)));
        /**
         * The full inter-signal bias (ISB) in nanoseconds.
         *
         * This value is the sum of the estimated receiver-side and the space-segment-side
         * inter-system bias, inter-frequency bias and inter-code bias, including
         *
         * - Receiver inter-constellation bias (with respect to the constellation in
         *   GnssClock.referenceSignalTypeForIsb)
         * - Receiver inter-frequency bias (with respect to the carrier frequency in
         *   GnssClock.referenceSignalTypeForIsb)
         * - Receiver inter-code bias (with respect to the code type in
         *   GnssClock.referenceSignalTypeForIsb)
         * - Master clock bias (e.g., GPS-GAL Time Offset (GGTO), GPS-UTC Time Offset
         *   (TauGps), BDS-GLO Time Offset (BGTO)) (with respect to the constellation in
         *   GnssClock.referenceSignalTypeForIsb)
         * - Group delay (e.g., Total Group Delay (TGD))
         * - Satellite inter-frequency bias (GLO only) (with respect to the carrier frequency in
         *   GnssClock.referenceSignalTypeForIsb)
         * - Satellite inter-code bias (e.g., Differential Code Bias (DCB)) (with respect to the
         *   code type in GnssClock.referenceSignalTypeForIsb)
         *
         * If a component of the above is already compensated in the provided
         * GnssMeasurement.receivedSvTimeInNs, then it must not be included in the reported full
         * ISB.
         *
         * The value does not include the inter-frequency Ionospheric bias.
         *
         * The full ISB of GnssClock.referenceSignalTypeForIsb is defined to be 0.0 nanoseconds.
         */
        double fullInterSignalBiasNs __attribute__ ((aligned(8)));
        /**
         * 1-sigma uncertainty associated with the full inter-signal bias in nanoseconds.
         */
        double fullInterSignalBiasUncertaintyNs __attribute__ ((aligned(8)));
        /**
         * The satellite inter-signal bias in nanoseconds.
         *
         * This value is the sum of the space-segment-side inter-system bias, inter-frequency bias
         * and inter-code bias, including
         *
         * - Master clock bias (e.g., GPS-GAL Time Offset (GGTO), GPS-UTC Time Offset
         *   (TauGps), BDS-GLO Time Offset (BGTO)) (with respect to the constellation in
         *   GnssClock.referenceSignalTypeForIsb)
         * - Group delay (e.g., Total Group Delay (TGD))
         * - Satellite inter-frequency bias (GLO only) (with respect to the carrier frequency in
         *   GnssClock.referenceSignalTypeForIsb)
         * - Satellite inter-code bias (e.g., Differential Code Bias (DCB)) (with respect to the
         *   code type in GnssClock.referenceSignalTypeForIsb)
         *
         * The satellite ISB of GnssClock.referenceSignalTypeForIsb is defined to be 0.0
         * nanoseconds.
         */
        double satelliteInterSignalBiasNs __attribute__ ((aligned(8)));
        /**
         * 1-sigma uncertainty associated with the satellite inter-signal bias in nanoseconds.
         */
        double satelliteInterSignalBiasUncertaintyNs __attribute__ ((aligned(8)));
        /**
         * Baseband Carrier-to-noise density in dB-Hz, typically in the range [0, 63]. It contains
         * the measured C/N0 value for the signal measured at the baseband.
         *
         * This is typically a few dB weaker than the value estimated for C/N0 at the antenna port,
         * which is reported in cN0DbHz.
         *
         * If a signal has separate components (e.g. Pilot and Data channels) and the receiver only
         * processes one of the components, then the reported basebandCN0DbHz reflects only the
         * component that is processed.
         *
         * This value is mandatory.
         */
        double basebandCN0DbHz __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssMeasurement, v2_0) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssMeasurement, flags) == 176, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssMeasurement, fullInterSignalBiasNs) == 184, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssMeasurement, fullInterSignalBiasUncertaintyNs) == 192, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssMeasurement, satelliteInterSignalBiasNs) == 200, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssMeasurement, satelliteInterSignalBiasUncertaintyNs) == 208, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssMeasurement, basebandCN0DbHz) == 216, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssMeasurement) == 224, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssMeasurement) == 8, "wrong alignment");

    /**
     * Extends a GNSS clock time, adding a referenceSignalTypeForIsb.
     */
    struct GnssClock final {
        /**
         * GNSS clock time information, as in the 1.0 version of the HAL.
         */
        ::android::hardware::gnss::V1_0::IGnssMeasurementCallback::GnssClock v1_0 __attribute__ ((aligned(8)));
        /**
         * Reference GNSS signal type for inter-signal bias.
         */
        ::android::hardware::gnss::V2_1::GnssSignalType referenceSignalTypeForIsb __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssClock, v1_0) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssClock, referenceSignalTypeForIsb) == 72, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssClock) == 104, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssClock) == 8, "wrong alignment");

    /**
     * Complete set of GNSS Measurement data, same as 2.0 with additional fields in measurements.
     */
    struct GnssData final {
        /**
         * The full set of satellite measurement observations.
         */
        ::android::hardware::hidl_vec<::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssMeasurement> measurements __attribute__ ((aligned(8)));
        /**
         * The GNSS clock time reading.
         */
        ::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssClock clock __attribute__ ((aligned(8)));
        /**
         * Timing information of the GNSS data synchronized with SystemClock.elapsedRealtimeNanos()
         * clock.
         */
        ::android::hardware::gnss::V2_0::ElapsedRealtime elapsedRealtime __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssData, measurements) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssData, clock) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssData, elapsedRealtime) == 120, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssData) == 144, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V2_1::IGnssMeasurementCallback::GnssData) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Callback for the hal to pass a GnssData structure back to the client.
     *
     * @param data Contains a reading of GNSS measurements.
     */
    virtual ::android::hardware::Return<void> GnssMeasurementCb(const ::android::hardware::gnss::V1_0::IGnssMeasurementCallback::GnssData& data) = 0;

    /**
     * Callback for the hal to pass a GnssData structure back to the client.
     *
     * @param data Contains a reading of GNSS measurements.
     */
    virtual ::android::hardware::Return<void> gnssMeasurementCb(const ::android::hardware::gnss::V1_1::IGnssMeasurementCallback::GnssData& data) = 0;

    /**
     * Callback for the hal to pass a GnssData structure back to the client.
     *
