{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA44_h",
   "name" : "unsigned char [44]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA44_h",
   "size" : 44,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA60_h",
   "name" : "unsigned char [60]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA60_h",
   "size" : 60,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA8_j",
   "name" : "unsigned int [8]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA8_j",
   "size" : 32,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" :
 [
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : -1,
     "name" : "PCM_FORMAT_INVALID"
    },
    {
     "enum_field_value" : 0,
     "name" : "PCM_FORMAT_S16_LE"
    },
    {
     "enum_field_value" : 1,
     "name" : "PCM_FORMAT_S32_LE"
    },
    {
     "enum_field_value" : 2,
     "name" : "PCM_FORMAT_S8"
    },
    {
     "enum_field_value" : 3,
     "name" : "PCM_FORMAT_S24_LE"
    },
    {
     "enum_field_value" : 4,
     "name" : "PCM_FORMAT_S24_3LE"
    },
    {
     "enum_field_value" : 5,
     "name" : "PCM_FORMAT_MAX"
    }
   ],
   "linker_set_key" : "_ZTI10pcm_format",
   "name" : "pcm_format",
   "referenced_type" : "_ZTI10pcm_format",
   "self_type" : "_ZTI10pcm_format",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h",
   "underlying_type" : "_ZTIi"
  },
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 0,
     "name" : "MIXER_CTL_TYPE_BOOL"
    },
    {
     "enum_field_value" : 1,
     "name" : "MIXER_CTL_TYPE_INT"
    },
    {
     "enum_field_value" : 2,
     "name" : "MIXER_CTL_TYPE_ENUM"
    },
    {
     "enum_field_value" : 3,
     "name" : "MIXER_CTL_TYPE_BYTE"
    },
    {
     "enum_field_value" : 4,
     "name" : "MIXER_CTL_TYPE_IEC958"
    },
    {
     "enum_field_value" : 5,
     "name" : "MIXER_CTL_TYPE_INT64"
    },
    {
     "enum_field_value" : 6,
     "name" : "MIXER_CTL_TYPE_UNKNOWN"
    },
    {
     "enum_field_value" : 7,
     "name" : "MIXER_CTL_TYPE_MAX"
    }
   ],
   "linker_set_key" : "_ZTI14mixer_ctl_type",
   "name" : "mixer_ctl_type",
   "referenced_type" : "_ZTI14mixer_ctl_type",
   "self_type" : "_ZTI14mixer_ctl_type",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h",
   "underlying_type" : "_ZTIj"
  },
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 0,
     "name" : "PCM_PARAM_ACCESS"
    },
    {
     "enum_field_value" : 1,
     "name" : "PCM_PARAM_FORMAT"
    },
    {
     "enum_field_value" : 2,
     "name" : "PCM_PARAM_SUBFORMAT"
    },
    {
     "enum_field_value" : 3,
     "name" : "PCM_PARAM_SAMPLE_BITS"
    },
    {
     "enum_field_value" : 4,
     "name" : "PCM_PARAM_FRAME_BITS"
    },
    {
     "enum_field_value" : 5,
     "name" : "PCM_PARAM_CHANNELS"
    },
    {
     "enum_field_value" : 6,
     "name" : "PCM_PARAM_RATE"
    },
    {
     "enum_field_value" : 7,
     "name" : "PCM_PARAM_PERIOD_TIME"
    },
    {
     "enum_field_value" : 8,
     "name" : "PCM_PARAM_PERIOD_SIZE"
    },
    {
     "enum_field_value" : 9,
     "name" : "PCM_PARAM_PERIOD_BYTES"
    },
    {
     "enum_field_value" : 10,
     "name" : "PCM_PARAM_PERIODS"
    },
    {
     "enum_field_value" : 11,
     "name" : "PCM_PARAM_BUFFER_TIME"
    },
    {
     "enum_field_value" : 12,
     "name" : "PCM_PARAM_BUFFER_SIZE"
    },
    {
     "enum_field_value" : 13,
     "name" : "PCM_PARAM_BUFFER_BYTES"
    },
    {
     "enum_field_value" : 14,
     "name" : "PCM_PARAM_TICK_TIME"
    }
   ],
   "linker_set_key" : "_ZTI9pcm_param",
   "name" : "pcm_param",
   "referenced_type" : "_ZTI9pcm_param",
   "self_type" : "_ZTI9pcm_param",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h",
   "underlying_type" : "_ZTIj"
  }
 ],
 "function_types" : [],
 "functions" :
 [
  {
   "function_name" : "pcm_bytes_to_frames",
   "linker_set_key" : "pcm_bytes_to_frames",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIj",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_close",
   "linker_set_key" : "pcm_close",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_format_to_bits",
   "linker_set_key" : "pcm_format_to_bits",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTI10pcm_format"
    }
   ],
   "return_type" : "_ZTIj",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_frames_to_bytes",
   "linker_set_key" : "pcm_frames_to_bytes",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIj",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_get_buffer_size",
   "linker_set_key" : "pcm_get_buffer_size",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIj",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_get_error",
   "linker_set_key" : "pcm_get_error",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIPKc",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_get_htimestamp",
   "linker_set_key" : "pcm_get_htimestamp",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIPj"
    },
    {
     "referenced_type" : "_ZTIP8timespec"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_get_poll_fd",
   "linker_set_key" : "pcm_get_poll_fd",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_get_subdevice",
   "linker_set_key" : "pcm_get_subdevice",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIj",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_ioctl",
   "linker_set_key" : "pcm_ioctl",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_is_ready",
   "linker_set_key" : "pcm_is_ready",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_mmap_avail",
   "linker_set_key" : "pcm_mmap_avail",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_mmap_begin",
   "linker_set_key" : "pcm_mmap_begin",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIPPv"
    },
    {
     "referenced_type" : "_ZTIPj"
    },
    {
     "referenced_type" : "_ZTIPj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_mmap_commit",
   "linker_set_key" : "pcm_mmap_commit",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_mmap_get_hw_ptr",
   "linker_set_key" : "pcm_mmap_get_hw_ptr",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIPj"
    },
    {
     "referenced_type" : "_ZTIP8timespec"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_mmap_read",
   "linker_set_key" : "pcm_mmap_read",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIPv"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_mmap_write",
   "linker_set_key" : "pcm_mmap_write",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIPKv"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_open",
   "linker_set_key" : "pcm_open",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIP10pcm_config"
    }
   ],
   "return_type" : "_ZTIP3pcm",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_params_format_test",
   "linker_set_key" : "pcm_params_format_test",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP10pcm_params"
    },
    {
     "referenced_type" : "_ZTI10pcm_format"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_params_free",
   "linker_set_key" : "pcm_params_free",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP10pcm_params"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_params_get",
   "linker_set_key" : "pcm_params_get",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIP10pcm_params",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_params_get_mask",
   "linker_set_key" : "pcm_params_get_mask",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK10pcm_params"
    },
    {
     "referenced_type" : "_ZTI9pcm_param"
    }
   ],
   "return_type" : "_ZTIP8pcm_mask",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_params_get_max",
   "linker_set_key" : "pcm_params_get_max",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK10pcm_params"
    },
    {
     "referenced_type" : "_ZTI9pcm_param"
    }
   ],
   "return_type" : "_ZTIj",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_params_get_min",
   "linker_set_key" : "pcm_params_get_min",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK10pcm_params"
    },
    {
     "referenced_type" : "_ZTI9pcm_param"
    }
   ],
   "return_type" : "_ZTIj",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_params_set_max",
   "linker_set_key" : "pcm_params_set_max",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP10pcm_params"
    },
    {
     "referenced_type" : "_ZTI9pcm_param"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_params_set_min",
   "linker_set_key" : "pcm_params_set_min",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP10pcm_params"
    },
    {
     "referenced_type" : "_ZTI9pcm_param"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_params_to_string",
   "linker_set_key" : "pcm_params_to_string",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP10pcm_params"
    },
    {
     "referenced_type" : "_ZTIPc"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_prepare",
   "linker_set_key" : "pcm_prepare",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_read",
   "linker_set_key" : "pcm_read",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIPv"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_set_avail_min",
   "linker_set_key" : "pcm_set_avail_min",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_start",
   "linker_set_key" : "pcm_start",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_stop",
   "linker_set_key" : "pcm_stop",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_wait",
   "linker_set_key" : "pcm_wait",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_write",
   "linker_set_key" : "pcm_write",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIPKv"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "global_vars" : [],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP10pcm_config",
   "name" : "pcm_config *",
   "referenced_type" : "_ZTI10pcm_config",
   "self_type" : "_ZTIP10pcm_config",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP10pcm_params",
   "name" : "pcm_params *",
   "referenced_type" : "_ZTI10pcm_params",
   "self_type" : "_ZTIP10pcm_params",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP3pcm",
   "name" : "pcm *",
   "referenced_type" : "_ZTI3pcm",
   "self_type" : "_ZTIP3pcm",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP8pcm_mask",
   "name" : "pcm_mask *",
   "referenced_type" : "_ZTI8pcm_mask",
   "self_type" : "_ZTIP8pcm_mask",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP8timespec",
   "name" : "timespec *",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTIP8timespec",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK10pcm_params",
   "name" : "const pcm_params *",
   "referenced_type" : "_ZTIK10pcm_params",
   "self_type" : "_ZTIPK10pcm_params",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK10pcm_params",
   "name" : "const pcm_params",
   "referenced_type" : "_ZTI10pcm_params",
   "self_type" : "_ZTIK10pcm_params",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "channels",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "period_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "period_count",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10pcm_format"
    },
    {
     "field_name" : "start_threshold",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stop_threshold",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "silence_threshold",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "silence_size",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "avail_min",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10pcm_config",
   "name" : "pcm_config",
   "referenced_type" : "_ZTI10pcm_config",
   "self_type" : "_ZTI10pcm_config",
   "size" : 40,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "numid",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "iface",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "device",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "subdevice",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA44_h"
    },
    {
     "field_name" : "index",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11ctl_elem_id",
   "name" : "ctl_elem_id",
   "referenced_type" : "_ZTI11ctl_elem_id",
   "self_type" : "_ZTI11ctl_elem_id",
   "size" : 64,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bits",
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI8pcm_mask",
   "name" : "pcm_mask",
   "referenced_type" : "_ZTI8pcm_mask",
   "self_type" : "_ZTI8pcm_mask",
   "size" : 32,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN9ctl_eventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI9ctl_event",
   "name" : "ctl_event",
   "referenced_type" : "_ZTI9ctl_event",
   "self_type" : "_ZTI9ctl_event",
   "size" : 72,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "elem",
     "referenced_type" : "_ZTIN9ctl_eventUt_Ut_E"
    },
    {
     "field_name" : "data8",
     "referenced_type" : "_ZTIA60_h"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9ctl_eventUt_E",
   "name" : "ctl_event::(anonymous union at external/tinyalsa/include/tinyalsa/asoundlib.h:172:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9ctl_eventUt_E",
   "self_type" : "_ZTIN9ctl_eventUt_E",
   "size" : 68,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mask",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "id",
     "field_offset" : 32,
     "referenced_type" : "_ZTI11ctl_elem_id"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9ctl_eventUt_Ut_E",
   "name" : "ctl_event::(anonymous union at external/tinyalsa/include/tinyalsa/asoundlib.h:172:3)::(anonymous struct at external/tinyalsa/include/tinyalsa/asoundlib.h:173:5)",
   "referenced_type" : "_ZTIN9ctl_eventUt_Ut_E",
   "self_type" : "_ZTIN9ctl_eventUt_Ut_E",
   "size" : 68,
   "source_file" : "external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "rvalue_reference_types" : []
}
