{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" : [],
 "functions" :
 [
  {
   "function_name" : "android::hardware::neuralnetworks::utils::hasNoPointerData",
   "linker_set_key" : "_ZN7android8hardware14neuralnetworks5utils16hasNoPointerDataERKNS_2nn5ModelE",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIRKN7android2nn5ModelE"
    }
   ],
   "return_type" : "_ZTIb",
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "function_name" : "android::hardware::neuralnetworks::utils::hasNoPointerData",
   "linker_set_key" : "_ZN7android8hardware14neuralnetworks5utils16hasNoPointerDataERKNS_2nn7RequestE",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIRKN7android2nn7RequestE"
    }
   ],
   "return_type" : "_ZTIb",

   "is_const" : true,
   "linker_set_key" : "_ZTIK13native_handle",
   "name" : "const native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTIK13native_handle",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2nn12Capabilities15PerformanceInfoE",
   "name" : "const android::nn::Capabilities::PerformanceInfo",
   "referenced_type" : "_ZTIN7android2nn12Capabilities15PerformanceInfoE",
   "self_type" : "_ZTIKN7android2nn12Capabilities15PerformanceInfoE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2nn5ModelE",
   "name" : "const android::nn::Model",
   "referenced_type" : "_ZTIN7android2nn5ModelE",
   "self_type" : "_ZTIKN7android2nn5ModelE",
   "size" : 100,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2nn6HandleE",
   "name" : "const android::nn::Handle",
   "referenced_type" : "_ZTIN7android2nn6HandleE",
   "self_type" : "_ZTIKN7android2nn6HandleE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2nn7MappingE",
   "name" : "const android::nn::Mapping",
   "referenced_type" : "_ZTIN7android2nn7MappingE",
   "self_type" : "_ZTIKN7android2nn7MappingE",
   "size" : 28,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2nn7RequestE",
   "name" : "const android::nn::Request",
   "referenced_type" : "_ZTIN7android2nn7RequestE",
   "self_type" : "_ZTIKN7android2nn7RequestE",
   "size" : 36,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android8hardware11hidl_memoryE",
   "name" : "const android::hardware::hidl_memory",
   "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE",
   "self_type" : "_ZTIKN7android8hardware11hidl_memoryE",
   "size" : 40,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6MemoryEEE",
   "name" : "const std::shared_ptr<const android::nn::Memory>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIKN7android2nn6MemoryEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6MemoryEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android2nn9OperationENS_9allocatorIS3_EEEE",
   "name" : "const std::vector<android::nn::Operation, std::allocator<android::nn::Operation>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android2nn9OperationENS_9allocatorIS3_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android2nn9OperationENS_9allocatorIS3_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android2nn9SyncFenceENS_9allocatorIS3_EEEE",
   "name" : "const std::vector<android::nn::SyncFence, std::allocator<android::nn::SyncFence>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android2nn9SyncFenceENS_9allocatorIS3_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android2nn9SyncFenceENS_9allocatorIS3_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEENS_9allocatorIS8_EEEE",
   "name" : "const std::vector<android::hardware::neuralnetworks::utils::RelocationInfo<const void *>, std::allocator<android::hardware::neuralnetworks::utils::RelocationInfo<const void *>>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEENS_9allocatorIS8_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEENS_9allocatorIS8_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEENS_9allocatorIS7_EEEE",
   "name" : "const std::vector<android::hardware::neuralnetworks::utils::RelocationInfo<void *>, std::allocator<android::hardware::neuralnetworks::utils::RelocationInfo<void *>>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEENS_9allocatorIS7_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEENS_9allocatorIS7_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "length",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEE",
   "name" : "android::hardware::neuralnetworks::utils::RelocationInfo<const void *>",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "length",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEE",
   "name" : "android::hardware::neuralnetworks::utils::RelocationInfo<void *>",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kRelocationInfos",
     "referenced_type" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEENS_9allocatorIS8_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "kMemory",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6MemoryEEE"
    },
    {
     "access" : "private",
     "field_name" : "kMapping",
     "field_offset" : 160,
     "referenced_type" : "_ZTIKN7android2nn7MappingE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPKvEEEE",
   "name" : "android::hardware::neuralnetworks::utils::RelocationTracker<android::hardware::neuralnetworks::utils::RelocationInfo<const void *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPKvEEEE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPKvEEEE",
   "size" : 48,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h",
   "template_args" : [ "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPKvEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kRelocationInfos",
     "referenced_type" : "_ZTIKNSt3__16vectorIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEENS_9allocatorIS7_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "kMemory",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIKN7android2nn6MemoryEEE"
    },
    {
     "access" : "private",
     "field_name" : "kMapping",
     "field_offset" : 160,
     "referenced_type" : "_ZTIKN7android2nn7MappingE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPvEEEE",
   "name" : "android::hardware::neuralnetworks::utils::RelocationTracker<android::hardware::neuralnetworks::utils::RelocationInfo<void *>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPvEEEE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS2_14RelocationInfoIPvEEEE",
   "size" : 48,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h",
   "template_args" : [ "_ZTIN7android8hardware14neuralnetworks5utils14RelocationInfoIPvEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input",
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS4_14RelocationInfoIPKvEEEENS_14default_deleteISA_EEEE"
    },
    {
     "field_name" : "output",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware14neuralnetworks5utils17RelocationTrackerINS4_14RelocationInfoIPvEEEENS_14default_deleteIS9_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "name" : "android::hardware::neuralnetworks::utils::RequestRelocation",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "self_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/utils/common/include/nnapi/hal/CommonUtils.h"
  }
 ],
 "rvalue_reference_types" : []
}
