#ifndef HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_4_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_4_TYPES_H

#include <android/hardware/radio/1.0/types.h>
#include <android/hardware/radio/1.1/types.h>
#include <android/hardware/radio/1.2/types.h>
#include <android/hidl/safe_union/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace radio {
namespace V1_4 {

// Forward declaration for forward reference support:
enum class AccessNetwork : int32_t;
enum class ApnTypes : int32_t;
enum class EmergencyServiceCategory : int32_t;
enum class EmergencyNumberSource : int32_t;
struct EmergencyNumber;
enum class EmergencyCallRouting : int32_t;
enum class RadioTechnology : int32_t;
enum class RadioAccessFamily : int32_t;
enum class FrequencyRange : int32_t;
enum class DataCallFailCause : int32_t;
enum class DataConnActiveStatus : int32_t;
enum class PdpProtocolType : int32_t;
struct RadioFrequencyInfo;
struct PhysicalChannelConfig;
struct LteVopsInfo;
struct NrIndicators;
struct DataRegStateResult;
struct CellConfigLte;
struct CellInfoLte;
struct NrSignalStrength;
struct CellIdentityNr;
struct CellInfoNr;
struct CellInfo;
struct NetworkScanResult;
struct DataProfileInfo;
struct CardStatus;
struct RadioCapability;
struct SetupDataCallResult;
enum class SimLockMultiSimPolicy : int32_t;
struct CarrierRestrictionsWithPriority;
struct SignalStrength;

// Order of inner types was changed for forward reference support.

enum class AccessNetwork : int32_t {
    /**
     * GSM EDGE Radio Access Network
     */
    GERAN = 1,
    /**
     * Universal Terrestrial Radio Access Network
     */
    UTRAN = 2,
    /**
     * Evolved Universal Terrestrial Radio Access Network
     */
    EUTRAN = 3,
    /**
     * CDMA 2000 network
     */
    CDMA2000 = 4,
    /**
     * Interworking Wireless LAN
     */
    IWLAN = 5,
    /**
     * Unknown access network
     */
    UNKNOWN = 0,
};

enum class ApnTypes : int32_t {
    NONE = 0,
    DEFAULT = 1 /* 1 << 0 */,
    MMS = 2 /* 1 << 1 */,
    SUPL = 4 /* 1 << 2 */,
    DUN = 8 /* 1 << 3 */,
    HIPRI = 16 /* 1 << 4 */,
    FOTA = 32 /* 1 << 5 */,
    IMS = 64 /* 1 << 6 */,
    CBS = 128 /* 1 << 7 */,
    IA = 256 /* 1 << 8 */,
    EMERGENCY = 512 /* 1 << 9 */,
    ALL = 1023 /* DEFAULT | MMS | SUPL | DUN | HIPRI | FOTA | IMS | CBS | IA | EMERGENCY */,
    /**
     * Due to the addition of this new value, the value ALL defined in 1.0::ApnTypes is now
     * deprecated and should not be used.
     */
    MCX = 1024 /* 1 << 10 */,
};

/**
 * Defining Emergency Service Category as follows:
 * - General emergency call, all categories;
 * - Police;
 * - Ambulance;
 * - Fire Brigade;
 * - Marine Guard;
 * - Mountain Rescue;
 * - Manually Initiated eCall (MIeC);
 * - Automatically Initiated eCall (AIeC);
 *
 * Category UNSPECIFIED (General emergency call, all categories) indicates that no specific
 * services are associated with this emergency number.
 *
 * Reference: 3gpp 22.101, Section 10 - Emergency Calls
 */
enum class EmergencyServiceCategory : int32_t {
    /**
     * General emergency call, all categories
     */
    UNSPECIFIED = 0,
    POLICE = 1 /* 1 << 0 */,
    AMBULANCE = 2 /* 1 << 1 */,
    FIRE_BRIGADE = 4 /* 1 << 2 */,
    MARINE_GUARD = 8 /* 1 << 3 */,
    MOUNTAIN_RESCUE = 16 /* 1 << 4 */,
    /**
     * Manually Initiated eCall (MIeC)
     */
    MIEC = 32 /* 1 << 5 */,
    /**
     * Automatically Initiated eCall (AIeC)
     */
    AIEC = 64 /* 1 << 6 */,
};

/**
 * The source to tell where the corresponding @1.4::EmergencyNumber comes from.
 *
 * Reference: 3gpp 22.101, Section 10 - Emergency Calls
 */
enum class EmergencyNumberSource : int32_t {
    /**
     * Indicates the number is from the network signal.
     */
    NETWORK_SIGNALING = 1 /* 1 << 0 */,
    /**
     * Indicates the number is from the sim card.
     */
    SIM = 2 /* 1 << 1 */,
    /**
     * Indicates the number is from the modem config.
     */
    MODEM_CONFIG = 4 /* 1 << 2 */,
    /**
     * Indicates the number is available as default. Per the reference, 112, 911 must always be
     * available; additionally, 000, 08, 110, 999, 118 and 119 must be available when sim is not
     * present.
     */
    DEFAULT = 8 /* 1 << 3 */,
};

/**
 * Emergency number contains information of number, one or more service category(s), zero or more
 * emergency uniform resource names, mobile country code (mcc), mobile network country (mnc) and
 * source(s) that indicate where it comes from.
 *
 * If the emergency number is associated with country, field ‘mcc’ must be provided, otherwise
 * field ‘mcc’ must be an empty string. If the emergency number is associated with network
 * operator, field ‘mcc’ and 'mnc' must be provided, otherwise field ‘mnc’ must be an empty
 * string. If the emergency number is specified with emergency service category(s), field
 * 'categories' must be provided, otherwise field 'categories' must be
 * @1.4::EmergencyServiceCategories::UNSPECIFIED. If the emergency number is specified with
 * emergency uniform resource names (URN), field 'urns' must be provided, otherwise field 'urns'
 * must be an empty list.
 *
 * A unique EmergencyNumber has a unique combination of ‘number’, ‘mcc’, 'mnc', 'categories' and
 * 'urns' fields. Multiple @1.4::EmergencyNumberSource should be merged into one 'sources' field
 * via bitwise-OR combination for the same EmergencyNumber.
 *
 * Reference: 3gpp 22.101, Section 10 - Emergency Calls;
 *            3gpp 23.167, Section 6 - Functional description;
 *            3gpp 24.503, Section 5.1.6.8.1 - General;
 *            RFC 5031
 */
struct EmergencyNumber final {
    /**
     * The emergency number. The character in the number string should only be the dial pad
     * character('0'-'9', '*', or '#'). For example: 911.
     */
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    /**
     * 3-digit Mobile Country Code, 0..999. Empty string if not applicable.
     */
    ::android::hardware::hidl_string mcc __attribute__ ((aligned(8)));
    /**
     * 2 or 3-digit Mobile Network Code, 0..999. Empty string if not applicable.
     */
    ::android::hardware::hidl_string mnc __attribute__ ((aligned(8)));
    /**
     * The bitfield of @1.4::EmergencyServiceCategory(s). See @1.4::EmergencyServiceCategory for
     * the value of each bit.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_4::EmergencyServiceCategory> categories __attribute__ ((aligned(4)));
    /**
     * The list of emergency Uniform Resource Names (URN).
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> urns __attribute__ ((aligned(8)));
    /**
     * The bitfield of @1.4::EmergencyNumberSource(s). See @1.4::EmergencyNumberSource for the
     * value of each bit.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_4::EmergencyNumberSource> sources __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::EmergencyNumber, number) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::EmergencyNumber, mcc) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::EmergencyNumber, mnc) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::EmergencyNumber, categories) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::EmergencyNumber, urns) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::EmergencyNumber, sources) == 72, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::EmergencyNumber) == 80, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::EmergencyNumber) == 8, "wrong alignment");

/**
 * Indicates how the implementation should handle the emergency call if it is required by Android.
 */
enum class EmergencyCallRouting : int32_t {
    /**
     * Indicates Android does not require how to handle the corresponding emergency call; it is
     * decided by implementation.
     */
    UNKNOWN = 0,
    /**
     * Indicates the implementation must handle the call through emergency routing.
     */
    EMERGENCY = 1,
    /**
     * Indicates the implementation must handle the call through normal call routing.
     */
    NORMAL = 2,
};

enum class RadioTechnology : int32_t {
    UNKNOWN = 0,
    GPRS = 1,
    EDGE = 2,
    UMTS = 3,
    IS95A = 4,
    IS95B = 5,
    ONE_X_RTT = 6,
    EVDO_0 = 7,
    EVDO_A = 8,
    HSDPA = 9,
    HSUPA = 10,
    HSPA = 11,
    EVDO_B = 12,
    EHRPD = 13,
    LTE = 14,
    HSPAP = 15,
    GSM = 16,
    TD_SCDMA = 17,
    IWLAN = 18,
    LTE_CA = 19,
    /**
     * 5G NR. This is only use in 5G Standalone mode.
     */
    NR = 20,
};

enum class RadioAccessFamily : int32_t {
    UNKNOWN = 1 /* 1 << RadioTechnology:UNKNOWN */,
    GPRS = 2 /* 1 << RadioTechnology:GPRS */,
    EDGE = 4 /* 1 << RadioTechnology:EDGE */,
    UMTS = 8 /* 1 << RadioTechnology:UMTS */,
    IS95A = 16 /* 1 << RadioTechnology:IS95A */,
    IS95B = 32 /* 1 << RadioTechnology:IS95B */,
    ONE_X_RTT = 64 /* 1 << RadioTechnology:ONE_X_RTT */,
    EVDO_0 = 128 /* 1 << RadioTechnology:EVDO_0 */,
    EVDO_A = 256 /* 1 << RadioTechnology:EVDO_A */,
    HSDPA = 512 /* 1 << RadioTechnology:HSDPA */,
    HSUPA = 1024 /* 1 << RadioTechnology:HSUPA */,
    HSPA = 2048 /* 1 << RadioTechnology:HSPA */,
    EVDO_B = 4096 /* 1 << RadioTechnology:EVDO_B */,
    EHRPD = 8192 /* 1 << RadioTechnology:EHRPD */,
    LTE = 16384 /* 1 << RadioTechnology:LTE */,
    HSPAP = 32768 /* 1 << RadioTechnology:HSPAP */,
    GSM = 65536 /* 1 << RadioTechnology:GSM */,
    TD_SCDMA = 131072 /* 1 << RadioTechnology:TD_SCDMA */,
    LTE_CA = 524288 /* 1 << RadioTechnology:LTE_CA */,
    /**
     * 5G NR. This is only use in 5G Standalone mode.
     */
    NR = 1048576 /* 1 << RadioTechnology:NR */,
};

/**
 * Mapping the frequency to a rough range.
 */
enum class FrequencyRange : int32_t {
    /**
     * Indicates the frequency range is below 1GHz.
     */
    LOW = 1,
    /**
     * Indicates the frequency range is between 1GHz and 3GHz.
     */
    MID = 2,
    /**
     * Indicates the frequency range is between 3GHz and 6GHz.
     */
    HIGH = 3,
    /**
     * Indicates the frequency range is above 6GHz (millimeter wave frequency).
     */
    MMWAVE = 4,
};

/**
 * Expose more setup data call failures.
 */
enum class DataCallFailCause : int32_t {
    NONE = 0,
    OPERATOR_BARRED = 8 /* 0x08 */,
    NAS_SIGNALLING = 14 /* 0x0E */,
    INSUFFICIENT_RESOURCES = 26 /* 0x1A */,
    MISSING_UKNOWN_APN = 27 /* 0x1B */,
    UNKNOWN_PDP_ADDRESS_TYPE = 28 /* 0x1C */,
    USER_AUTHENTICATION = 29 /* 0x1D */,
    ACTIVATION_REJECT_GGSN = 30 /* 0x1E */,
    ACTIVATION_REJECT_UNSPECIFIED = 31 /* 0x1F */,
    SERVICE_OPTION_NOT_SUPPORTED = 32 /* 0x20 */,
    SERVICE_OPTION_NOT_SUBSCRIBED = 33 /* 0x21 */,
    SERVICE_OPTION_OUT_OF_ORDER = 34 /* 0x22 */,
    NSAPI_IN_USE = 35 /* 0x23 */,
    REGULAR_DEACTIVATION = 36 /* 0x24 */,
    QOS_NOT_ACCEPTED = 37 /* 0x25 */,
    NETWORK_FAILURE = 38 /* 0x26 */,
    UMTS_REACTIVATION_REQ = 39 /* 0x27 */,
    FEATURE_NOT_SUPP = 40 /* 0x28 */,
    TFT_SEMANTIC_ERROR = 41 /* 0x29 */,
    TFT_SYTAX_ERROR = 42 /* 0x2A */,
    UNKNOWN_PDP_CONTEXT = 43 /* 0x2B */,
    FILTER_SEMANTIC_ERROR = 44 /* 0x2C */,
    FILTER_SYTAX_ERROR = 45 /* 0x2D */,
    PDP_WITHOUT_ACTIVE_TFT = 46 /* 0x2E */,
    ONLY_IPV4_ALLOWED = 50 /* 0x32 */,
    ONLY_IPV6_ALLOWED = 51 /* 0x33 */,
    ONLY_SINGLE_BEARER_ALLOWED = 52 /* 0x34 */,
    ESM_INFO_NOT_RECEIVED = 53 /* 0x35 */,
    PDN_CONN_DOES_NOT_EXIST = 54 /* 0x36 */,
    MULTI_CONN_TO_SAME_PDN_NOT_ALLOWED = 55 /* 0x37 */,
    MAX_ACTIVE_PDP_CONTEXT_REACHED = 65 /* 0x41 */,
    UNSUPPORTED_APN_IN_CURRENT_PLMN = 66 /* 0x42 */,
    INVALID_TRANSACTION_ID = 81 /* 0x51 */,
    MESSAGE_INCORRECT_SEMANTIC = 95 /* 0x5F */,
    INVALID_MANDATORY_INFO = 96 /* 0x60 */,
    MESSAGE_TYPE_UNSUPPORTED = 97 /* 0x61 */,
    MSG_TYPE_NONCOMPATIBLE_STATE = 98 /* 0x62 */,
    UNKNOWN_INFO_ELEMENT = 99 /* 0x63 */,
    CONDITIONAL_IE_ERROR = 100 /* 0x64 */,
    MSG_AND_PROTOCOL_STATE_UNCOMPATIBLE = 101 /* 0x65 */,
    PROTOCOL_ERRORS = 111 /* 0x6F */,
    APN_TYPE_CONFLICT = 112 /* 0x70 */,
    INVALID_PCSCF_ADDR = 113 /* 0x71 */,
    INTERNAL_CALL_PREEMPT_BY_HIGH_PRIO_APN = 114 /* 0x72 */,
    EMM_ACCESS_BARRED = 115 /* 0x73 */,
    EMERGENCY_IFACE_ONLY = 116 /* 0x74 */,
    IFACE_MISMATCH = 117 /* 0x75 */,
    COMPANION_IFACE_IN_USE = 118 /* 0x76 */,
    IP_ADDRESS_MISMATCH = 119 /* 0x77 */,
    IFACE_AND_POL_FAMILY_MISMATCH = 120 /* 0x78 */,
    EMM_ACCESS_BARRED_INFINITE_RETRY = 121 /* 0x79 */,
    AUTH_FAILURE_ON_EMERGENCY_CALL = 122 /* 0x7A */,
    OEM_DCFAILCAUSE_1 = 4097 /* 0x1001 */,
    OEM_DCFAILCAUSE_2 = 4098 /* 0x1002 */,
    OEM_DCFAILCAUSE_3 = 4099 /* 0x1003 */,
    OEM_DCFAILCAUSE_4 = 4100 /* 0x1004 */,
    OEM_DCFAILCAUSE_5 = 4101 /* 0x1005 */,
    OEM_DCFAILCAUSE_6 = 4102 /* 0x1006 */,
    OEM_DCFAILCAUSE_7 = 4103 /* 0x1007 */,
    OEM_DCFAILCAUSE_8 = 4104 /* 0x1008 */,
    OEM_DCFAILCAUSE_9 = 4105 /* 0x1009 */,
    OEM_DCFAILCAUSE_10 = 4106 /* 0x100A */,
    OEM_DCFAILCAUSE_11 = 4107 /* 0x100B */,
    OEM_DCFAILCAUSE_12 = 4108 /* 0x100C */,
    OEM_DCFAILCAUSE_13 = 4109 /* 0x100D */,
    OEM_DCFAILCAUSE_14 = 4110 /* 0x100E */,
    OEM_DCFAILCAUSE_15 = 4111 /* 0x100F */,
    VOICE_REGISTRATION_FAIL = -1 /* -1 */,
    DATA_REGISTRATION_FAIL = -2 /* -2 */,
    SIGNAL_LOST = -3 /* -3 */,
    PREF_RADIO_TECH_CHANGED = -4 /* -4 */,
    RADIO_POWER_OFF = -5 /* -5 */,
    TETHERED_CALL_ACTIVE = -6 /* -6 */,
    ERROR_UNSPECIFIED = 65535 /* 0xffff */,
    /**
     * Network cannot provide the requested service and PDP context is deactivated because of LLC
     * or SNDCP failure.
     */
    LLC_SNDCP = 25 /* 0x19 */,
    /**
     * UE requested to modify QoS parameters or the bearer control mode, which is not compatible
     * with the selected bearer control mode.
     */
    ACTIVATION_REJECTED_BCM_VIOLATION = 48 /* 0x30 */,
    /**
     * Network has already initiated the activation, modification, or deactivation of bearer
     * resources that was requested by the UE.
     */
    COLLISION_WITH_NETWORK_INITIATED_REQUEST = 56 /* 0x38 */,
    /**
     * Network supports IPv4v6 PDP type only. Non-IP type is not allowed. In LTE mode of operation,
     * this is a PDN throttling cause code, meaning the UE may throttle further requests to the
     * same APN.
     */
    ONLY_IPV4V6_ALLOWED = 57 /* 0x39 */,
    /**
     * Network supports non-IP PDP type only. IPv4, IPv6 and IPv4v6 is not allowed. In LTE mode of
     * operation, this is a PDN throttling cause code, meaning the UE can throttle further requests
     * to the same APN.
     */
    ONLY_NON_IP_ALLOWED = 58 /* 0x3A */,
    /**
     * QCI (QoS Class Identifier) indicated in the UE request cannot be supported.
     */
    UNSUPPORTED_QCI_VALUE = 59 /* 0x3B */,
    /**
     * Procedure requested by the UE was rejected because the bearer handling is not supported.
     */
    BEARER_HANDLING_NOT_SUPPORTED = 60 /* 0x3C */,
    /**
     * Not receiving a DNS address that was mandatory.
     */
    INVALID_DNS_ADDR = 123 /* 0x7B */,
    /**
     * Not receiving either a PCSCF or a DNS address, one of them being mandatory.
     */
    INVALID_PCSCF_OR_DNS_ADDRESS = 124 /* 0x7C */,
    /**
     * Emergency call bring up on a different ePDG.
     */
    CALL_PREEMPT_BY_EMERGENCY_APN = 127 /* 0x7F */,
    /**
     * UE performs a detach or disconnect PDN action based on TE requirements.
     */
    UE_INITIATED_DETACH_OR_DISCONNECT = 128 /* 0x80 */,
    /**
     * Reason unspecified for foreign agent rejected MIP (Mobile IP) registration.
     */
    MIP_FA_REASON_UNSPECIFIED = 2000 /* 0x7D0 */,
    /**
     * Foreign agent administratively prohibited MIP (Mobile IP) registration.
     */
    MIP_FA_ADMIN_PROHIBITED = 2001 /* 0x7D1 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of insufficient resources.
     */
    MIP_FA_INSUFFICIENT_RESOURCES = 2002 /* 0x7D2 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of MN-AAA authenticator was
     * wrong.
     */
    MIP_FA_MOBILE_NODE_AUTHENTICATION_FAILURE = 2003 /* 0x7D3 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of home agent authentication
     * failure.
     */
    MIP_FA_HOME_AGENT_AUTHENTICATION_FAILURE = 2004 /* 0x7D4 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of requested lifetime was too
     * long.
     */
    MIP_FA_REQUESTED_LIFETIME_TOO_LONG = 2005 /* 0x7D5 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of malformed request.
     */
    MIP_FA_MALFORMED_REQUEST = 2006 /* 0x7D6 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of malformed reply.
     */
    MIP_FA_MALFORMED_REPLY = 2007 /* 0x7D7 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of requested encapsulation was
     * unavailable.
     */
    MIP_FA_ENCAPSULATION_UNAVAILABLE = 2008 /* 0x7D8 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration of VJ Header Compression was unavailable.
     */
    MIP_FA_VJ_HEADER_COMPRESSION_UNAVAILABLE = 2009 /* 0x7D9 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of reverse tunnel was
     * unavailable.
     */
    MIP_FA_REVERSE_TUNNEL_UNAVAILABLE = 2010 /* 0x7DA */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of reverse tunnel was mandatory
     * but not requested by device.
     */
    MIP_FA_REVERSE_TUNNEL_IS_MANDATORY = 2011 /* 0x7DB */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of delivery style was not
     * supported.
     */
    MIP_FA_DELIVERY_STYLE_NOT_SUPPORTED = 2012 /* 0x7DC */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of missing NAI (Network Access
     * Identifier).
     */
    MIP_FA_MISSING_NAI = 2013 /* 0x7DD */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of missing Home Agent.
     */
    MIP_FA_MISSING_HOME_AGENT = 2014 /* 0x7DE */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of missing Home Address.
     */
    MIP_FA_MISSING_HOME_ADDRESS = 2015 /* 0x7DF */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of unknown challenge.
     */
    MIP_FA_UNKNOWN_CHALLENGE = 2016 /* 0x7E0 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of missing challenge.
     */
    MIP_FA_MISSING_CHALLENGE = 2017 /* 0x7E1 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of stale challenge.
     */
    MIP_FA_STALE_CHALLENGE = 2018 /* 0x7E2 */,
    /**
     * Reason unspecified for home agent rejected MIP (Mobile IP) registration.
     */
    MIP_HA_REASON_UNSPECIFIED = 2019 /* 0x7E3 */,
    /**
     * Home agent administratively prohibited MIP (Mobile IP) registration.
     */
    MIP_HA_ADMIN_PROHIBITED = 2020 /* 0x7E4 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of insufficient resources.
     */
    MIP_HA_INSUFFICIENT_RESOURCES = 2021 /* 0x7E5 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of MN-HA authenticator was wrong.
     */
    MIP_HA_MOBILE_NODE_AUTHENTICATION_FAILURE = 2022 /* 0x7E6 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of foreign agent authentication
     * failure.
     */
    MIP_HA_FOREIGN_AGENT_AUTHENTICATION_FAILURE = 2023 /* 0x7E7 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of registration id mismatch.
     */
    MIP_HA_REGISTRATION_ID_MISMATCH = 2024 /* 0x7E8 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of malformed request.
     */
    MIP_HA_MALFORMED_REQUEST = 2025 /* 0x7E9 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of unknown home agent address.
     */
    MIP_HA_UNKNOWN_HOME_AGENT_ADDRESS = 2026 /* 0x7EA */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of reverse tunnel was unavailable.
     */
    MIP_HA_REVERSE_TUNNEL_UNAVAILABLE = 2027 /* 0x7EB */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of reverse tunnel is mandatory but
     * not requested by device.
     */
    MIP_HA_REVERSE_TUNNEL_IS_MANDATORY = 2028 /* 0x7EC */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of encapsulation unavailable.
     */
    MIP_HA_ENCAPSULATION_UNAVAILABLE = 2029 /* 0x7ED */,
    /**
     * Tearing down is in progress.
     */
    CLOSE_IN_PROGRESS = 2030 /* 0x7EE */,
    /**
     * Brought down by the network.
     */
    NETWORK_INITIATED_TERMINATION = 2031 /* 0x7EF */,
    /**
     * Another application in modem preempts the data call.
     */
    MODEM_APP_PREEMPTED = 2032 /* 0x7F0 */,
    /**
     * IPV4 PDN is in throttled state due to network providing only IPV6 address during the previous
     * VSNCP bringup (subs_limited_to_v6).
     */
    PDN_IPV4_CALL_DISALLOWED = 2033 /* 0x7F1 */,
    /**
     * IPV4 PDN is in throttled state due to previous VSNCP bringup failure(s).
     */
    PDN_IPV4_CALL_THROTTLED = 2034 /* 0x7F2 */,
    /**
     * IPV6 PDN is in throttled state due to network providing only IPV4 address during the previous
     * VSNCP bringup (subs_limited_to_v4).
     */
    PDN_IPV6_CALL_DISALLOWED = 2035 /* 0x7F3 */,
    /**
     * IPV6 PDN is in throttled state due to previous VSNCP bringup failure(s).
     */
    PDN_IPV6_CALL_THROTTLED = 2036 /* 0x7F4 */,
    /**
     * Modem restart.
     */
    MODEM_RESTART = 2037 /* 0x7F5 */,
    /**
     * PDP PPP calls are not supported.
     */
    PDP_PPP_NOT_SUPPORTED = 2038 /* 0x7F6 */,
    /**
     * RAT on which the data call is attempted/connected is no longer the preferred RAT.
     */
    UNPREFERRED_RAT = 2039 /* 0x7F7 */,
    /**
     * Physical link is in the process of cleanup.
     */
    PHYSICAL_LINK_CLOSE_IN_PROGRESS = 2040 /* 0x7F8 */,
    /**
     * Interface bring up is attempted for an APN that is yet to be handed over to target RAT.
     */
    APN_PENDING_HANDOVER = 2041 /* 0x7F9 */,
    /**
     * APN bearer type in the profile does not match preferred network mode.
     */
    PROFILE_BEARER_INCOMPATIBLE = 2042 /* 0x7FA */,
    /**
     * Card was refreshed or removed.
     */
    SIM_CARD_CHANGED = 2043 /* 0x7FB */,
    /**
     * Device is going into lower power mode or powering down.
     */
    LOW_POWER_MODE_OR_POWERING_DOWN = 2044 /* 0x7FC */,
    /**
     * APN has been disabled.
     */
    APN_DISABLED = 2045 /* 0x7FD */,
    /**
     * Maximum PPP inactivity timer expired.
     */
    MAX_PPP_INACTIVITY_TIMER_EXPIRED = 2046 /* 0x7FE */,
    /**
     * IPv6 address transfer failed.
     */
    IPV6_ADDRESS_TRANSFER_FAILED = 2047 /* 0x7FF */,
    /**
     * Target RAT swap failed.
     */
    TRAT_SWAP_FAILED = 2048 /* 0x800 */,
    /**
     * Device falls back from eHRPD to HRPD.
     */
    EHRPD_TO_HRPD_FALLBACK = 2049 /* 0x801 */,
    /**
     * UE is in MIP-only configuration but the MIP configuration fails on call bring up due to
     * incorrect provisioning.
     */
    MIP_CONFIG_FAILURE = 2050 /* 0x802 */,
    /**
     * PDN inactivity timer expired due to no data transmission in a configurable duration of time.
     */
    PDN_INACTIVITY_TIMER_EXPIRED = 2051 /* 0x803 */,
    /**
     * IPv4 data call bring up is rejected because the UE already maintains the allotted maximum
     * number of IPv4 data connections.
     */
    MAX_IPV4_CONNECTIONS = 2052 /* 0x804 */,
    /**
     * IPv6 data call bring up is rejected because the UE already maintains the allotted maximum
     * number of IPv6 data connections.
     */
    MAX_IPV6_CONNECTIONS = 2053 /* 0x805 */,
    /**
     * New PDN bring up is rejected during interface selection because the UE has already allotted
     * the available interfaces for other PDNs.
     */
    APN_MISMATCH = 2054 /* 0x806 */,
    /**
     * New call bring up is rejected since the existing data call IP type doesn't match the
     * requested IP.
     */
    IP_VERSION_MISMATCH = 2055 /* 0x807 */,
    /**
     * Dial up networking (DUN) call bring up is rejected since UE is in eHRPD RAT.
     */
    DUN_CALL_DISALLOWED = 2056 /* 0x808 */,
    /**
     * Rejected/Brought down since UE is transition between EPC and NONEPC RAT.
     */
    INTERNAL_EPC_NONEPC_TRANSITION = 2057 /* 0x809 */,
    /**
     * The current interface is being in use.
     */
    INTERFACE_IN_USE = 2058 /* 0x80A */,
    /**
     * PDN connection to the APN is disallowed on the roaming network.
     */
    APN_DISALLOWED_ON_ROAMING = 2059 /* 0x80B */,
    /**
     * APN-related parameters are changed.
     */
    APN_PARAMETERS_CHANGED = 2060 /* 0x80C */,
    /**
     * PDN is attempted to be brought up with NULL APN but NULL APN is not supported.
     */
    NULL_APN_DISALLOWED = 2061 /* 0x80D */,
    /**
     * Thermal level increases and causes calls to be torn down when normal mode of operation is
     * not allowed.
     */
    THERMAL_MITIGATION = 2062 /* 0x80E */,
    /**
     * PDN Connection to a given APN is disallowed because data is disabled from the device user
     * interface settings.
     */
    DATA_SETTINGS_DISABLED = 2063 /* 0x80F */,
    /**
     * PDN Connection to a given APN is disallowed because data roaming is disabled from the device
     * user interface settings and the UE is roaming.
     */
    DATA_ROAMING_SETTINGS_DISABLED = 2064 /* 0x810 */,
    /**
     * DDS (Default data subscription) switch occurs.
     */
    DDS_SWITCHED = 2065 /* 0x811 */,
    /**
     * PDN being brought up with an APN that is part of forbidden APN Name list.
     */
    FORBIDDEN_APN_NAME = 2066 /* 0x812 */,
    /**
     * Default data subscription switch is in progress.
     */
    DDS_SWITCH_IN_PROGRESS = 2067 /* 0x813 */,
    /**
     * Roaming is disallowed during call bring up.
     */
    CALL_DISALLOWED_IN_ROAMING = 2068 /* 0x814 */,
    /**
     * UE is unable to bring up a non-IP data call because the device is not camped on a NB1 cell.
     */
    NON_IP_NOT_SUPPORTED = 2069 /* 0x815 */,
    /**
     * Non-IP PDN is in throttled state due to previous VSNCP bringup failure(s).
     */
    PDN_NON_IP_CALL_THROTTLED = 2070 /* 0x816 */,
    /**
     * Non-IP PDN is in disallowed state due to the network providing only an IP address.
     */
    PDN_NON_IP_CALL_DISALLOWED = 2071 /* 0x817 */,
    /**
     * Device in CDMA locked state.
     */
    CDMA_LOCK = 2072 /* 0x818 */,
    /**
     * Received an intercept order from the base station.
     */
    CDMA_INTERCEPT = 2073 /* 0x819 */,
    /**
     * Receiving a reorder from the base station.
     */
    CDMA_REORDER = 2074 /* 0x81A */,
    /**
     * Receiving a release from the base station with a SO (Service Option) Reject reason.
     */
    CDMA_RELEASE_DUE_TO_SO_REJECTION = 2075 /* 0x81B */,
    /**
     * Receiving an incoming call from the base station.
     */
    CDMA_INCOMING_CALL = 2076 /* 0x81C */,
    /**
     * Received an alert stop from the base station due to incoming only.
     */
    CDMA_ALERT_STOP = 2077 /* 0x81D */,
    /**
     * Channel acquisition failures. This indicates that device has failed acquiring all the
     * channels in the PRL.
     */
    CHANNEL_ACQUISITION_FAILURE = 2078 /* 0x81E */,
    /**
     * Maximum access probes transmitted.
     */
    MAX_ACCESS_PROBE = 2079 /* 0x81F */,
    /**
     * Concurrent service is not supported by base station.
     */
    CONCURRENT_SERVICE_NOT_SUPPORTED_BY_BASE_STATION = 2080 /* 0x820 */,
    /**
     * There was no response received from the base station.
     */
    NO_RESPONSE_FROM_BASE_STATION = 2081 /* 0x821 */,
    /**
     * The base station rejecting the call.
     */
    REJECTED_BY_BASE_STATION = 2082 /* 0x822 */,
    /**
     * The concurrent services requested were not compatible.
     */
    CONCURRENT_SERVICES_INCOMPATIBLE = 2083 /* 0x823 */,
    /**
     * Device does not have CDMA service.
     */
    NO_CDMA_SERVICE = 2084 /* 0x824 */,
    /**
     * RUIM not being present.
     */
    RUIM_NOT_PRESENT = 2085 /* 0x825 */,
    /**
     * Receiving a retry order from the base station.
     */
    CDMA_RETRY_ORDER = 2086 /* 0x826 */,
    /**
     * Access blocked by the base station.
     */
    ACCESS_BLOCK = 2087 /* 0x827 */,
    /**
     * Access blocked by the base station for all mobile devices.
     */
    ACCESS_BLOCK_ALL = 2088 /* 0x828 */,
    /**
     * Maximum access probes for the IS-707B call.
     */
    IS707B_MAX_ACCESS_PROBES = 2089 /* 0x829 */,
    /**
     * Put device in thermal emergency.
     */
    THERMAL_EMERGENCY = 2090 /* 0x82A */,
    /**
     * In favor of a voice call or SMS when concurrent voice and data are not supported.
     */
    CONCURRENT_SERVICES_NOT_ALLOWED = 2091 /* 0x82B */,
    /**
     * The other clients rejected incoming call.
     */
    INCOMING_CALL_REJECTED = 2092 /* 0x82C */,
    /**
     * No service on the gateway.
     */
    NO_SERVICE_ON_GATEWAY = 2093 /* 0x82D */,
    /**
     * GPRS context is not available.
     */
    NO_GPRS_CONTEXT = 2094 /* 0x82E */,
    /**
     * Network refuses service to the MS because either an identity of the MS is not acceptable to
     * the network or the MS does not pass the authentication check.
     */
    ILLEGAL_MS = 2095 /* 0x82F */,
    /**
     * ME could not be authenticated and the ME used is not acceptable to the network.
     */
    ILLEGAL_ME = 2096 /* 0x830 */,
    /**
     * Not allowed to operate either GPRS or non-GPRS services.
     */
    GPRS_SERVICES_AND_NON_GPRS_SERVICES_NOT_ALLOWED = 2097 /* 0x831 */,
    /**
     * MS is not allowed to operate GPRS services.
     */
    GPRS_SERVICES_NOT_ALLOWED = 2098 /* 0x832 */,
    /**
     * No matching identity or context could be found in the network.
     */
    MS_IDENTITY_CANNOT_BE_DERIVED_BY_THE_NETWORK = 2099 /* 0x833 */,
    /**
     * Mobile reachable timer has expired, or the GMM context data related to the subscription does
     * not exist in the SGSN.
     */
    IMPLICITLY_DETACHED = 2100 /* 0x834 */,
    /**
     * UE requests GPRS service, or the network initiates a detach request in a PLMN which does not
     * offer roaming for GPRS services to that MS.
     */
    PLMN_NOT_ALLOWED = 2101 /* 0x835 */,
    /**
     * MS requests service, or the network initiates a detach request, in a location area where the
     * HPLMN determines that the MS, by subscription, is not allowed to operate.
     */
    LOCATION_AREA_NOT_ALLOWED = 2102 /* 0x836 */,
    /**
     * UE requests GPRS service or the network initiates a detach request in a PLMN that does not
     * offer roaming for GPRS services.
     */
    GPRS_SERVICES_NOT_ALLOWED_IN_THIS_PLMN = 2103 /* 0x837 */,
    /**
     * PDP context already exists.
     */
    PDP_DUPLICATE = 2104 /* 0x838 */,
    /**
     * RAT change on the UE.
     */
    UE_RAT_CHANGE = 2105 /* 0x839 */,
    /**
     * Network cannot serve a request from the MS due to congestion.
     */
    CONGESTION = 2106 /* 0x83A */,
    /**
     * MS requests an establishment of the radio access bearers for all active PDP contexts by
     * sending a service request message indicating data to the network, but the SGSN does not have
     * any active PDP context.
     */
    NO_PDP_CONTEXT_ACTIVATED = 2107 /* 0x83B */,
    /**
     * Access class blocking restrictions for the current camped cell.
     */
    ACCESS_CLASS_DSAC_REJECTION = 2108 /* 0x83C */,
    /**
     * SM attempts PDP activation for a maximum of four attempts.
     */
    PDP_ACTIVATE_MAX_RETRY_FAILED = 2109 /* 0x83D */,
    /**
     * Radio access bearer failure.
     */
    RADIO_ACCESS_BEARER_FAILURE = 2110 /* 0x83E */,
    /**
     * Invalid EPS bearer identity in the request.
     */
    ESM_UNKNOWN_EPS_BEARER_CONTEXT = 2111 /* 0x83F */,
    /**
     * Data radio bearer is released by the RRC.
     */
    DRB_RELEASED_BY_RRC = 2112 /* 0x840 */,
    /**
     * Indicate the connection was released.
     */
    CONNECTION_RELEASED = 2113 /* 0x841 */,
    /**
     * UE is detached.
     */
    EMM_DETACHED = 2114 /* 0x842 */,
    /**
     * Attach procedure is rejected by the network.
     */
    EMM_ATTACH_FAILED = 2115 /* 0x843 */,
    /**
     * Attach procedure is started for EMC purposes.
     */
    EMM_ATTACH_STARTED = 2116 /* 0x844 */,
    /**
     * Service request procedure failure.
     */
    LTE_NAS_SERVICE_REQUEST_FAILED = 2117 /* 0x845 */,
    /**
     * Active dedicated bearer was requested using the same default bearer ID.
     */
    DUPLICATE_BEARER_ID = 2118 /* 0x846 */,
    /**
     * Collision scenarios for the UE and network-initiated procedures.
     */
    ESM_COLLISION_SCENARIOS = 2119 /* 0x847 */,
    /**
     * Bearer must be deactivated to synchronize with the network.
     */
    ESM_BEARER_DEACTIVATED_TO_SYNC_WITH_NETWORK = 2120 /* 0x848 */,
    /**
     * Active dedicated bearer was requested for an existing default bearer.
     */
    ESM_NW_ACTIVATED_DED_BEARER_WITH_ID_OF_DEF_BEARER = 2121 /* 0x849 */,
    /**
     * Bad OTA message is received from the network.
     */
    ESM_BAD_OTA_MESSAGE = 2122 /* 0x84A */,
    /**
     * Download server rejected the call.
     */
    ESM_DOWNLOAD_SERVER_REJECTED_THE_CALL = 2123 /* 0x84B */,
    /**
     * PDN was disconnected by the downlaod server due to IRAT.
     */
    ESM_CONTEXT_TRANSFERRED_DUE_TO_IRAT = 2124 /* 0x84C */,
    /**
     * Dedicated bearer will be deactivated regardless of the network response.
     */
    DS_EXPLICIT_DEACTIVATION = 2125 /* 0x84D */,
    /**
     * No specific local cause is mentioned, usually a valid OTA cause.
     */
    ESM_LOCAL_CAUSE_NONE = 2126 /* 0x84E */,
    /**
     * Throttling is not needed for this service request failure.
     */
    LTE_THROTTLING_NOT_REQUIRED = 2127 /* 0x84F */,
    /**
     * Access control list check failure at the lower layer.
     */
    ACCESS_CONTROL_LIST_CHECK_FAILURE = 2128 /* 0x850 */,
    /**
     * Service is not allowed on the requested PLMN.
     */
    SERVICE_NOT_ALLOWED_ON_PLMN = 2129 /* 0x851 */,
    /**
     * T3417 timer expiration of the service request procedure.
     */
    EMM_T3417_EXPIRED = 2130 /* 0x852 */,
    /**
     * Extended service request fails due to expiration of the T3417 EXT timer.
     */
    EMM_T3417_EXT_EXPIRED = 2131 /* 0x853 */,
    /**
     * Transmission failure of radio resource control (RRC) uplink data.
     */
    RRC_UPLINK_DATA_TRANSMISSION_FAILURE = 2132 /* 0x854 */,
    /**
     * Radio resource control (RRC) uplink data delivery failed due to a handover.
     */
    RRC_UPLINK_DELIVERY_FAILED_DUE_TO_HANDOVER = 2133 /* 0x855 */,
    /**
     * Radio resource control (RRC) uplink data delivery failed due to a connection release.
     */
    RRC_UPLINK_CONNECTION_RELEASE = 2134 /* 0x856 */,
    /**
     * Radio resource control (RRC) uplink data delivery failed due to a radio link failure.
     */
    RRC_UPLINK_RADIO_LINK_FAILURE = 2135 /* 0x857 */,
    /**
     * Radio resource control (RRC) is not connected but the non-access stratum (NAS) sends an
     * uplink data request.
     */
    RRC_UPLINK_ERROR_REQUEST_FROM_NAS = 2136 /* 0x858 */,
    /**
     * Radio resource control (RRC) connection failure at access stratum.
     */
    RRC_CONNECTION_ACCESS_STRATUM_FAILURE = 2137 /* 0x859 */,
    /**
     * Radio resource control (RRC) connection establishment is aborted due to another procedure.
     */
    RRC_CONNECTION_ANOTHER_PROCEDURE_IN_PROGRESS = 2138 /* 0x85A */,
    /**
     * Radio resource control (RRC) connection establishment failed due to access barrred.
     */
    RRC_CONNECTION_ACCESS_BARRED = 2139 /* 0x85B */,
    /**
     * Radio resource control (RRC) connection establishment failed due to cell reselection at
     * access stratum.
     */
    RRC_CONNECTION_CELL_RESELECTION = 2140 /* 0x85C */,
    /**
     * Connection establishment failed due to configuration failure at the radio resource control
     * (RRC).
     */
    RRC_CONNECTION_CONFIG_FAILURE = 2141 /* 0x85D */,
    /**
     * Radio resource control (RRC) connection could not be established in the time limit.
     */
    RRC_CONNECTION_TIMER_EXPIRED = 2142 /* 0x85E */,
    /**
     * Connection establishment failed due to a link failure at the radio resource control (RRC).
     */
    RRC_CONNECTION_LINK_FAILURE = 2143 /* 0x85F */,
    /**
     * Connection establishment failed as the radio resource control (RRC) is not camped on any
     * cell.
     */
    RRC_CONNECTION_CELL_NOT_CAMPED = 2144 /* 0x860 */,
    /**
     * Connection establishment failed due to a service interval failure at the radio resource
     * control (RRC).
     */
    RRC_CONNECTION_SYSTEM_INTERVAL_FAILURE = 2145 /* 0x861 */,
    /**
     * Radio resource control (RRC) connection establishment failed due to the network rejecting the
     * UE connection request.
     */
    RRC_CONNECTION_REJECT_BY_NETWORK = 2146 /* 0x862 */,
    /**
     * Normal radio resource control (RRC) connection release.
     */
    RRC_CONNECTION_NORMAL_RELEASE = 2147 /* 0x863 */,
    /**
     * Radio resource control (RRC) connection release failed due to radio link failure conditions.
     */
    RRC_CONNECTION_RADIO_LINK_FAILURE = 2148 /* 0x864 */,
    /**
     * Radio resource control (RRC) connection re-establishment failure.
     */
    RRC_CONNECTION_REESTABLISHMENT_FAILURE = 2149 /* 0x865 */,
    /**
     * UE is out of service during the call register.
     */
    RRC_CONNECTION_OUT_OF_SERVICE_DURING_CELL_REGISTER = 2150 /* 0x866 */,
    /**
     * Connection has been released by the radio resource control (RRC) due to an abort request.
     */
    RRC_CONNECTION_ABORT_REQUEST = 2151 /* 0x867 */,
    /**
     * Radio resource control (RRC) connection released due to a system information block read
     * error.
     */
    RRC_CONNECTION_SYSTEM_INFORMATION_BLOCK_READ_ERROR = 2152 /* 0x868 */,
    /**
     * Network-initiated detach with reattach.
     */
    NETWORK_INITIATED_DETACH_WITH_AUTO_REATTACH = 2153 /* 0x869 */,
    /**
     * Network-initiated detach without reattach.
     */
    NETWORK_INITIATED_DETACH_NO_AUTO_REATTACH = 2154 /* 0x86A */,
    /**
     * ESM procedure maximum attempt timeout failure.
     */
    ESM_PROCEDURE_TIME_OUT = 2155 /* 0x86B */,
    /**
     * No PDP exists with the given connection ID while modifying or deactivating or activation for
     * an already active PDP.
     */
    INVALID_CONNECTION_ID = 2156 /* 0x86C */,
    /**
     * Maximum NSAPIs have been exceeded during PDP activation.
     */
    MAXIMIUM_NSAPIS_EXCEEDED = 2157 /* 0x86D */,
    /**
     * Primary context for NSAPI does not exist.
     */
    INVALID_PRIMARY_NSAPI = 2158 /* 0x86E */,
    /**
     * Unable to encode the OTA message for MT PDP or deactivate PDP.
     */
    CANNOT_ENCODE_OTA_MESSAGE = 2159 /* 0x86F */,
    /**
     * Radio access bearer is not established by the lower layers during activation, modification,
     * or deactivation.
     */
    RADIO_ACCESS_BEARER_SETUP_FAILURE = 2160 /* 0x870 */,
    /**
     * Expiration of the PDP establish timer with a maximum of five retries.
     */
    PDP_ESTABLISH_TIMEOUT_EXPIRED = 2161 /* 0x871 */,
    /**
     * Expiration of the PDP modify timer with a maximum of four retries.
     */
    PDP_MODIFY_TIMEOUT_EXPIRED = 2162 /* 0x872 */,
    /**
     * Expiration of the PDP deactivate timer with a maximum of four retries.
     */
    PDP_INACTIVE_TIMEOUT_EXPIRED = 2163 /* 0x873 */,
    /**
     * PDP activation failed due to RRC_ABORT or a forbidden PLMN.
     */
    PDP_LOWERLAYER_ERROR = 2164 /* 0x874 */,
    /**
     * MO PDP modify collision when the MT PDP is already in progress.
     */
    PDP_MODIFY_COLLISION = 2165 /* 0x875 */,
    /**
     * Maximum size of the L2 message was exceeded.
     */
    MAXINUM_SIZE_OF_L2_MESSAGE_EXCEEDED = 2166 /* 0x876 */,
    /**
     * Non-access stratum (NAS) request was rejected by the network.
     */
    NAS_REQUEST_REJECTED_BY_NETWORK = 2167 /* 0x877 */,
    /**
     * Radio resource control (RRC) connection establishment failure due to an error in the request
     * message.
     */
    RRC_CONNECTION_INVALID_REQUEST = 2168 /* 0x878 */,
    /**
     * Radio resource control (RRC) connection establishment failure due to a change in the tracking
     * area ID.
     */
    RRC_CONNECTION_TRACKING_AREA_ID_CHANGED = 2169 /* 0x879 */,
    /**
     * Radio resource control (RRC) connection establishment failure due to the RF was unavailable.
     */
    RRC_CONNECTION_RF_UNAVAILABLE = 2170 /* 0x87A */,
    /**
     * Radio resource control (RRC) connection was aborted before deactivating the LTE stack due to
     * a successful LTE to WCDMA/GSM/TD-SCDMA IRAT change.
     */
    RRC_CONNECTION_ABORTED_DUE_TO_IRAT_CHANGE = 2171 /* 0x87B */,
    /**
     * If the UE has an LTE radio link failure before security is established, the radio resource
     * control (RRC) connection must be released and the UE must return to idle.
     */
    RRC_CONNECTION_RELEASED_SECURITY_NOT_ACTIVE = 2172 /* 0x87C */,
    /**
     * Radio resource control (RRC) connection was aborted by the non-access stratum (NAS) after an
     * IRAT to LTE IRAT handover.
     */
    RRC_CONNECTION_ABORTED_AFTER_HANDOVER = 2173 /* 0x87D */,
    /**
     * Radio resource control (RRC) connection was aborted before deactivating the LTE stack after a
     * successful LTE to GSM/EDGE IRAT cell change order procedure.
     */
    RRC_CONNECTION_ABORTED_AFTER_IRAT_CELL_CHANGE = 2174 /* 0x87E */,
    /**
     * Radio resource control (RRC) connection was aborted in the middle of a LTE to GSM IRAT cell
     * change order procedure.
     */
    RRC_CONNECTION_ABORTED_DURING_IRAT_CELL_CHANGE = 2175 /* 0x87F */,
    /**
     * IMSI present in the UE is unknown in the home subscriber server.
     */
    IMSI_UNKNOWN_IN_HOME_SUBSCRIBER_SERVER = 2176 /* 0x880 */,
    /**
     * IMEI of the UE is not accepted by the network.
     */
    IMEI_NOT_ACCEPTED = 2177 /* 0x881 */,
    /**
     * EPS and non-EPS services are not allowed by the network.
     */
    EPS_SERVICES_AND_NON_EPS_SERVICES_NOT_ALLOWED = 2178 /* 0x882 */,
    /**
     * EPS services are not allowed in the PLMN.
     */
    EPS_SERVICES_NOT_ALLOWED_IN_PLMN = 2179 /* 0x883 */,
    /**
     * Mobile switching center is temporarily unreachable.
     */
    MSC_TEMPORARILY_NOT_REACHABLE = 2180 /* 0x884 */,
    /**
     * CS domain is not available.
     */
    CS_DOMAIN_NOT_AVAILABLE = 2181 /* 0x885 */,
    /**
     * ESM level failure.
     */
    ESM_FAILURE = 2182 /* 0x886 */,
    /**
     * MAC level failure.
     */
    MAC_FAILURE = 2183 /* 0x887 */,
    /**
     * Synchronization failure.
     */
    SYNCHRONIZATION_FAILURE = 2184 /* 0x888 */,
    /**
     * UE security capabilities mismatch.
     */
    UE_SECURITY_CAPABILITIES_MISMATCH = 2185 /* 0x889 */,
    /**
     * Unspecified security mode reject.
     */
    SECURITY_MODE_REJECTED = 2186 /* 0x88A */,
    /**
     * Unacceptable non-EPS authentication.
     */
    UNACCEPTABLE_NON_EPS_AUTHENTICATION = 2187 /* 0x88B */,
    /**
     * CS fallback call establishment is not allowed.
     */
    CS_FALLBACK_CALL_ESTABLISHMENT_NOT_ALLOWED = 2188 /* 0x88C */,
    /**
     * No EPS bearer context was activated.
     */
    NO_EPS_BEARER_CONTEXT_ACTIVATED = 2189 /* 0x88D */,
    /**
     * Invalid EMM state.
     */
    INVALID_EMM_STATE = 2190 /* 0x88E */,
    /**
     * Non-Access Spectrum layer failure.
     */
    NAS_LAYER_FAILURE = 2191 /* 0x88F */,
    /**
     * Multiple PDP call feature is disabled.
     */
    MULTIPLE_PDP_CALL_NOT_ALLOWED = 2192 /* 0x890 */,
    /**
     * Data call has been brought down because EMBMS is not enabled at the RRC layer.
     */
    EMBMS_NOT_ENABLED = 2193 /* 0x891 */,
    /**
     * Data call was unsuccessfully transferred during the IRAT handover.
     */
    IRAT_HANDOVER_FAILED = 2194 /* 0x892 */,
    /**
     * EMBMS data call has been successfully brought down.
     */
    EMBMS_REGULAR_DEACTIVATION = 2195 /* 0x893 */,
    /**
     * Test loop-back data call has been successfully brought down.
     */
    TEST_LOOPBACK_REGULAR_DEACTIVATION = 2196 /* 0x894 */,
    /**
     * Lower layer registration failure.
     */
    LOWER_LAYER_REGISTRATION_FAILURE = 2197 /* 0x895 */,
    /**
     * Network initiates a detach on LTE with error cause "data plan has been replenished or has
     * expired".
     */
    DATA_PLAN_EXPIRED = 2198 /* 0x896 */,
    /**
     * UMTS interface is brought down due to handover from UMTS to iWLAN.
     */
    UMTS_HANDOVER_TO_IWLAN = 2199 /* 0x897 */,
    /**
     * Received a connection deny due to general or network busy on EVDO network.
     */
    EVDO_CONNECTION_DENY_BY_GENERAL_OR_NETWORK_BUSY = 2200 /* 0x898 */,
    /**
     * Received a connection deny due to billing or authentication failure on EVDO network.
     */
    EVDO_CONNECTION_DENY_BY_BILLING_OR_AUTHENTICATION_FAILURE = 2201 /* 0x899 */,
    /**
     * HDR system has been changed due to redirection or the PRL was not preferred.
     */
    EVDO_HDR_CHANGED = 2202 /* 0x89A */,
    /**
     * Device exited HDR due to redirection or the PRL was not preferred.
     */
    EVDO_HDR_EXITED = 2203 /* 0x89B */,
    /**
     * Device does not have an HDR session.
     */
    EVDO_HDR_NO_SESSION = 2204 /* 0x89C */,
    /**
     * It is ending an HDR call origination in favor of a GPS fix.
     */
    EVDO_USING_GPS_FIX_INSTEAD_OF_HDR_CALL = 2205 /* 0x89D */,
    /**
     * Connection setup on the HDR system was time out.
     */
    EVDO_HDR_CONNECTION_SETUP_TIMEOUT = 2206 /* 0x89E */,
    /**
     * Device failed to acquire a co-located HDR for origination.
     */
    FAILED_TO_ACQUIRE_COLOCATED_HDR = 2207 /* 0x89F */,
    /**
     * OTASP commit is in progress.
     */
    OTASP_COMMIT_IN_PROGRESS = 2208 /* 0x8A0 */,
    /**
     * Device has no hybrid HDR service.
     */
    NO_HYBRID_HDR_SERVICE = 2209 /* 0x8A1 */,
    /**
     * HDR module could not be obtained because of the RF locked.
     */
    HDR_NO_LOCK_GRANTED = 2210 /* 0x8A2 */,
    /**
     * DBM or SMS is in progress.
     */
    DBM_OR_SMS_IN_PROGRESS = 2211 /* 0x8A3 */,
    /**
     * HDR module released the call due to fade.
     */
    HDR_FADE = 2212 /* 0x8A4 */,
    /**
     * HDR system access failure.
     */
    HDR_ACCESS_FAILURE = 2213 /* 0x8A5 */,
    /**
     * P_rev supported by 1 base station is less than 6, which is not supported for a 1X data call.
     * The UE must be in the footprint of BS which has p_rev >= 6 to support this SO33 call.
     */
    UNSUPPORTED_1X_PREV = 2214 /* 0x8A6 */,
    /**
     * Client ended the data call.
     */
    LOCAL_END = 2215 /* 0x8A7 */,
    /**
     * Device has no service.
     */
    NO_SERVICE = 2216 /* 0x8A8 */,
    /**
     * Device lost the system due to fade.
     */
    FADE = 2217 /* 0x8A9 */,
    /**
     * Receiving a release from the base station with no reason.
     */
    NORMAL_RELEASE = 2218 /* 0x8AA */,
    /**
     * Access attempt is already in progress.
     */
    ACCESS_ATTEMPT_ALREADY_IN_PROGRESS = 2219 /* 0x8AB */,
    /**
     * Device is in the process of redirecting or handing off to a different target system.
     */
    REDIRECTION_OR_HANDOFF_IN_PROGRESS = 2220 /* 0x8AC */,
    /**
     * Device is operating in Emergency mode.
     */
    EMERGENCY_MODE = 2221 /* 0x8AD */,
    /**
     * Device is in use (e.g., voice call).
     */
    PHONE_IN_USE = 2222 /* 0x8AE */,
    /**
     * Device operational mode is different from the mode requested in the traffic channel bring up.
     */
    INVALID_MODE = 2223 /* 0x8AF */,
    /**
     * SIM was marked by the network as invalid for the circuit and/or packet service domain.
     */
    INVALID_SIM_STATE = 2224 /* 0x8B0 */,
    /**
     * There is no co-located HDR.
     */
    NO_COLLOCATED_HDR = 2225 /* 0x8B1 */,
    /**
     * UE is entering power save mode.
     */
    UE_IS_ENTERING_POWERSAVE_MODE = 2226 /* 0x8B2 */,
    /**
     * Dual switch from single standby to dual standby is in progress.
     */
    DUAL_SWITCH = 2227 /* 0x8B3 */,
    /**
     * Data call bring up fails in the PPP setup due to a timeout. (e.g., an LCP conf ack was not
     * received from the network)
     */
    PPP_TIMEOUT = 2228 /* 0x8B4 */,
    /**
     * Data call bring up fails in the PPP setup due to an authorization failure.
     * (e.g., authorization is required, but not negotiated with the network during an LCP phase)
     */
    PPP_AUTH_FAILURE = 2229 /* 0x8B5 */,
    /**
     * Data call bring up fails in the PPP setup due to an option mismatch.
     */
    PPP_OPTION_MISMATCH = 2230 /* 0x8B6 */,
    /**
     * Data call bring up fails in the PPP setup due to a PAP failure.
     */
    PPP_PAP_FAILURE = 2231 /* 0x8B7 */,
    /**
     * Data call bring up fails in the PPP setup due to a CHAP failure.
     */
    PPP_CHAP_FAILURE = 2232 /* 0x8B8 */,
    /**
     * Data call bring up fails in the PPP setup because the PPP is in the process of cleaning the
     * previous PPP session.
     */
    PPP_CLOSE_IN_PROGRESS = 2233 /* 0x8B9 */,
    /**
     * IPv6 interface bring up fails because the network provided only the IPv4 address for the
     * upcoming PDN permanent client can reattempt a IPv6 call bring up after the IPv4 interface is
     * also brought down. However, there is no guarantee that the network will provide a IPv6
     * address.
     */
    LIMITED_TO_IPV4 = 2234 /* 0x8BA */,
    /**
     * IPv4 interface bring up fails because the network provided only the IPv6 address for the
     * upcoming PDN permanent client can reattempt a IPv4 call bring up after the IPv6 interface is
     * also brought down. However there is no guarantee that the network will provide a IPv4
     * address.
     */
    LIMITED_TO_IPV6 = 2235 /* 0x8BB */,
    /**
     * Data call bring up fails in the VSNCP phase due to a VSNCP timeout error.
     */
    VSNCP_TIMEOUT = 2236 /* 0x8BC */,
    /**
     * Data call bring up fails in the VSNCP phase due to a general error. It's used when there is
     * no other specific error code available to report the failure.
     */
    VSNCP_GEN_ERROR = 2237 /* 0x8BD */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request because the requested APN is unauthorized.
     */
    VSNCP_APN_UNATHORIZED = 2238 /* 0x8BE */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request because the PDN limit has been exceeded.
     */
    VSNCP_PDN_LIMIT_EXCEEDED = 2239 /* 0x8BF */,
    /**
     * Data call bring up fails in the VSNCP phase due to the network rejected the VSNCP
     * configuration request due to no PDN gateway address.
     */
    VSNCP_NO_PDN_GATEWAY_ADDRESS = 2240 /* 0x8C0 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request because the PDN gateway is unreachable.
     */
    VSNCP_PDN_GATEWAY_UNREACHABLE = 2241 /* 0x8C1 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request due to a PDN gateway reject.
     */
    VSNCP_PDN_GATEWAY_REJECT = 2242 /* 0x8C2 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request with the reason of insufficient parameter.
     */
    VSNCP_INSUFFICIENT_PARAMETERS = 2243 /* 0x8C3 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request with the reason of resource unavailable.
     */
    VSNCP_RESOURCE_UNAVAILABLE = 2244 /* 0x8C4 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request with the reason of administratively prohibited at the HSGW.
     */
    VSNCP_ADMINISTRATIVELY_PROHIBITED = 2245 /* 0x8C5 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of PDN ID in use, or
     * all existing PDNs are brought down with this end reason because one of the PDN bring up was
     * rejected by the network with the reason of PDN ID in use.
     */
    VSNCP_PDN_ID_IN_USE = 2246 /* 0x8C6 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request for the reason of subscriber limitation.
     */
    VSNCP_SUBSCRIBER_LIMITATION = 2247 /* 0x8C7 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request because the PDN exists for this APN.
     */
    VSNCP_PDN_EXISTS_FOR_THIS_APN = 2248 /* 0x8C8 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request with reconnect to this PDN not allowed, or an active data call is
     * terminated by the network because reconnection to this PDN is not allowed. Upon receiving
     * this error code from the network, the modem infinitely throttles the PDN until the next power
     * cycle.
     */
    VSNCP_RECONNECT_NOT_ALLOWED = 2249 /* 0x8C9 */,
    /**
     * Device failure to obtain the prefix from the network.
     */
    IPV6_PREFIX_UNAVAILABLE = 2250 /* 0x8CA */,
    /**
     * System preference change back to SRAT during handoff
     */
    HANDOFF_PREFERENCE_CHANGED = 2251 /* 0x8CB */,
};

/**
 * Data connection active status
 */
enum class DataConnActiveStatus : int32_t {
    /**
     * Indicates the data connection is inactive.
     */
    INACTIVE = 0,
    /**
     * Indicates the data connection is active with physical link dormant.
     */
    DORMANT = 1,
    /**
     * Indicates the data connection is active with physical link up.
     */
    ACTIVE = 2,
};

/**
 * Specifies the type of packet data protocol which is defined in TS 27.007 section 10.1.1.
 */
enum class PdpProtocolType : int32_t {
    /**
     * Unknown protocol
     */
    UNKNOWN = -1 /* -1 */,
    /**
     * Internet protocol
     */
    IP = 0,
    /**
     * Internet protocol, version 6
     */
    IPV6 = 1,
    /**
     * Virtual PDP type introduced to handle dual IP stack UE capability.
     */
    IPV4V6 = 2,
    /**
     * Point to point protocol
     */
    PPP = 3,
    /**
     * Transfer of Non-IP data to external packet data network
     */
    NON_IP = 4,
    /**
     * Transfer of Unstructured data to the Data Network via N6
     */
    UNSTRUCTURED = 5,
};

struct RadioFrequencyInfo final {
    enum class hidl_discriminator : uint8_t {
        /**
         * A rough frequency range.
         */
        range = 0,  // ::android::hardware::radio::V1_4::FrequencyRange
        /**
         * The Absolute Radio Frequency Channel Number.
         */
        channelNumber = 1,  // int32_t
    };

    RadioFrequencyInfo();
    ~RadioFrequencyInfo();
    RadioFrequencyInfo(RadioFrequencyInfo&&);
    RadioFrequencyInfo(const RadioFrequencyInfo&);
    RadioFrequencyInfo& operator=(RadioFrequencyInfo&&);
    RadioFrequencyInfo& operator=(const RadioFrequencyInfo&);

    void range(::android::hardware::radio::V1_4::FrequencyRange);
    ::android::hardware::radio::V1_4::FrequencyRange& range();
    ::android::hardware::radio::V1_4::FrequencyRange range() const;

    void channelNumber(int32_t);
    int32_t& channelNumber();
    int32_t channelNumber() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::radio::V1_4::RadioFrequencyInfo, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hardware::radio::V1_4::FrequencyRange range __attribute__ ((aligned(4)));
        int32_t channelNumber __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::radio::V1_4::RadioFrequencyInfo::hidl_union) == 4, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_4::RadioFrequencyInfo::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::android::hardware::radio::V1_4::RadioFrequencyInfo::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_4::RadioFrequencyInfo::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::radio::V1_4::RadioFrequencyInfo) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::RadioFrequencyInfo) == 4, "wrong alignment");

struct PhysicalChannelConfig final {
    ::android::hardware::radio::V1_2::PhysicalChannelConfig base __attribute__ ((aligned(4)));
    /**
     * The radio technology for this physical channel.
     */
    ::android::hardware::radio::V1_4::RadioTechnology rat __attribute__ ((aligned(4)));
    /**
     * The radio frequency info.
     */
    ::android::hardware::radio::V1_4::RadioFrequencyInfo rfInfo __attribute__ ((aligned(4)));
    /**
     * A list of data calls mapped to this physical channel. The context id must match the cid of
     * @1.4::SetupDataCallResult. An empty list means the physical channel has no data call mapped
     * to it.
     */
    ::android::hardware::hidl_vec<int32_t> contextIds __attribute__ ((aligned(8)));
    /**
     * The physical cell identifier for this cell.
     *
     * In UTRAN, this value is primary scrambling code. The range is [0, 511].
     * Reference: 3GPP TS 25.213 section 5.2.2.
     *
     * In EUTRAN, this value is physical layer cell identity. The range is [0, 503].
     * Reference: 3GPP TS 36.211 section 6.11.
     *
     * In 5G RAN, this value is physical layer cell identity. The range is [0, 1008].
     * Reference: 3GPP TS 38.211 section 7.4.2.1.
     */
    uint32_t physicalCellId __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::PhysicalChannelConfig, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::PhysicalChannelConfig, rat) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::PhysicalChannelConfig, rfInfo) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::PhysicalChannelConfig, contextIds) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::PhysicalChannelConfig, physicalCellId) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::PhysicalChannelConfig) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::PhysicalChannelConfig) == 8, "wrong alignment");

/**
 * Type to define the LTE specific network capabilities for voice over PS including
 * emergency and normal voice calls.
 */
struct LteVopsInfo final {
    /**
     * This indicates if camped network support VoLTE services. This information is received
     * from LTE network during LTE NAS registration procedure through LTE ATTACH ACCEPT/TAU
     * ACCEPT. Refer 3GPP 24.301 EPS network feature support -> IMS VoPS
     */
    bool isVopsSupported __attribute__ ((aligned(1)));
    /**
     * This indicates if camped network support VoLTE emergency bearers. This information
     * is received from LTE network through two sources:
     * a. During LTE NAS registration procedure through LTE ATTACH ACCEPT/TAU ACCEPT. Refer
     *    3GPP 24.301 EPS network feature support -> EMC BS
     * b. In case device is not registered on network. Refer 3GPP 25.331 LTE RRC
     *    SIB1 : ims-EmergencySupport-r9
     * If device is registered on LTE, then this field indicates (a).
     * In case of limited service on LTE this field indicates (b).
     */
    bool isEmcBearerSupported __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::LteVopsInfo, isVopsSupported) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::LteVopsInfo, isEmcBearerSupported) == 1, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::LteVopsInfo) == 2, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::LteVopsInfo) == 1, "wrong alignment");

/**
 * The parameters of NR 5G Non-Standalone.
 */
struct NrIndicators final {
    /**
     * Indicates that if E-UTRA-NR Dual Connectivity (EN-DC) is supported by the primary serving
     * cell.
     *
     * True the primary serving cell is LTE cell and the plmn-InfoList-r15 is present in SIB2 and
     * at least one bit in this list is true, otherwise this value should be false.
     *
     * Reference: 3GPP TS 36.331 v15.2.2 6.3.1 System information blocks.
     */
    bool isEndcAvailable __attribute__ ((aligned(1)));
    /**
     * True if use of dual connectivity with NR is restricted.
     * Reference: 3GPP TS 24.301 v15.03 section 9.3.3.12A.
     */
    bool isDcNrRestricted __attribute__ ((aligned(1)));
    /**
     * True if the bit N is in the PLMN-InfoList-r15 is true and the selected PLMN is present in
     * plmn-IdentityList at position N.
     * Reference: 3GPP TS 36.331 v15.2.2 section 6.3.1 PLMN-InfoList-r15.
     *            3GPP TS 36.331 v15.2.2 section 6.2.2 SystemInformationBlockType1 message.
     */
    bool isNrAvailable __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::NrIndicators, isEndcAvailable) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::NrIndicators, isDcNrRestricted) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::NrIndicators, isNrAvailable) == 2, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::NrIndicators) == 3, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::NrIndicators) == 1, "wrong alignment");

struct DataRegStateResult final {
    // Forward declaration for forward reference support:
    struct VopsInfo;

    struct VopsInfo final {
        enum class hidl_discriminator : uint8_t {
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            lteVopsInfo = 1,  // ::android::hardware::radio::V1_4::LteVopsInfo
        };

        VopsInfo();
        ~VopsInfo();
        VopsInfo(VopsInfo&&);
        VopsInfo(const VopsInfo&);
        VopsInfo& operator=(VopsInfo&&);
        VopsInfo& operator=(const VopsInfo&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void lteVopsInfo(const ::android::hardware::radio::V1_4::LteVopsInfo&);
        void lteVopsInfo(::android::hardware::radio::V1_4::LteVopsInfo&&);
        ::android::hardware::radio::V1_4::LteVopsInfo& lteVopsInfo();
        const ::android::hardware::radio::V1_4::LteVopsInfo& lteVopsInfo() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_4::DataRegStateResult::VopsInfo, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            ::android::hardware::radio::V1_4::LteVopsInfo lteVopsInfo __attribute__ ((aligned(1)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_4::DataRegStateResult::VopsInfo::hidl_union) == 2, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_4::DataRegStateResult::VopsInfo::hidl_union) == 1, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_4::DataRegStateResult::VopsInfo::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_4::DataRegStateResult::VopsInfo::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_4::DataRegStateResult::VopsInfo) == 3, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_4::DataRegStateResult::VopsInfo) == 1, "wrong alignment");

    ::android::hardware::radio::V1_2::DataRegStateResult base __attribute__ ((aligned(8)));
    /**
     * Network capabilities for voice over PS services. This info is valid only on LTE network and
     * must be present when device is camped on LTE. vopsInfo must be empty when device is camped
     * only on 2G/3G.
     */
    ::android::hardware::radio::V1_4::DataRegStateResult::VopsInfo vopsInfo __attribute__ ((aligned(1)));
    /**
     * The parameters of NR 5G Non-Standalone. This value is only valid on E-UTRAN, otherwise
     * must be empty.
     */
    ::android::hardware::radio::V1_4::NrIndicators nrIndicators __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::DataRegStateResult, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataRegStateResult, vopsInfo) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataRegStateResult, nrIndicators) == 107, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::DataRegStateResult) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::DataRegStateResult) == 8, "wrong alignment");

/**
 * Contains the configuration of the LTE cell tower.
 */
struct CellConfigLte final {
    /**
     * Indicates that if E-UTRA-NR Dual Connectivity (EN-DC) is supported by the LTE cell.
     *
     * True if the plmn-InfoList-r15 is present in SIB2 and at least one bit in this list is true,
     * otherwise this value should be false.
     *
     * Reference: 3GPP TS 36.331 v15.2.2 6.3.1 System information blocks.
     */
    bool isEndcAvailable __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::CellConfigLte, isEndcAvailable) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::CellConfigLte) == 1, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::CellConfigLte) == 1, "wrong alignment");

/**
 * Inherits from @1.2::CellInfoLte, in order to add the LTE configuration.
 */
struct CellInfoLte final {
    ::android::hardware::radio::V1_2::CellInfoLte base __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_4::CellConfigLte cellConfig __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::CellInfoLte, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CellInfoLte, cellConfig) == 112, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::CellInfoLte) == 120, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::CellInfoLte) == 8, "wrong alignment");

struct NrSignalStrength final {
    /**
     * SS reference signal received power, multipled by -1.
     *
     * Reference: 3GPP TS 38.215.
     *
     * Range [44, 140], INT_MAX means invalid/unreported.
     */
    int32_t ssRsrp __attribute__ ((aligned(4)));
    /**
     * SS reference signal received quality, multipled by -1.
     *
     * Reference: 3GPP TS 38.215.
     *
     * Range [3, 20], INT_MAX means invalid/unreported.
     */
    int32_t ssRsrq __attribute__ ((aligned(4)));
    /**
     * SS signal-to-noise and interference ratio.
     *
     * Reference: 3GPP TS 38.215 section 5.1.*, 3GPP TS 38.133 section 10.1.16.1.
     *
     * Range [-23, 40], INT_MAX means invalid/unreported.
     */
    int32_t ssSinr __attribute__ ((aligned(4)));
    /**
     * CSI reference signal received power, multipled by -1.
     *
     * Reference: 3GPP TS 38.215.
     *
     * Range [44, 140], INT_MAX means invalid/unreported.
     */
    int32_t csiRsrp __attribute__ ((aligned(4)));
    /**
     * CSI reference signal received quality, multipled by -1.
     *
     * Reference: 3GPP TS 38.215.
     *
     * Range [3, 20], INT_MAX means invalid/unreported.
     */
    int32_t csiRsrq __attribute__ ((aligned(4)));
    /**
     * CSI signal-to-noise and interference ratio.
     *
     * Reference: 3GPP TS 138.215 section 5.1.*, 3GPP TS 38.133 section 10.1.16.1.
     *
     * Range [-23, 40], INT_MAX means invalid/unreported.
     */
    int32_t csiSinr __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::NrSignalStrength, ssRsrp) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::NrSignalStrength, ssRsrq) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::NrSignalStrength, ssSinr) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::NrSignalStrength, csiRsrp) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::NrSignalStrength, csiRsrq) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::NrSignalStrength, csiSinr) == 20, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::NrSignalStrength) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::NrSignalStrength) == 4, "wrong alignment");

struct CellIdentityNr final {
    /**
     * 3-digit Mobile Country Code, in range[0, 999]; This value must be valid for registered or
     *  camped cells; INT_MAX means invalid/unreported.
     */
    ::android::hardware::hidl_string mcc __attribute__ ((aligned(8)));
    /**
     * 2 or 3-digit Mobile Network Code, in range [0, 999], This value must be valid for
     * registered or camped cells; INT_MAX means invalid/unreported.
     */
    ::android::hardware::hidl_string mnc __attribute__ ((aligned(8)));
    /**
     * NR Cell Identity in range [0, 68719476735] (36 bits) described in 3GPP TS 38.331, which
     * unambiguously identifies a cell within a PLMN. This value must be valid for registered or
     * camped cells; LONG_MAX (2^63-1) means invalid/unreported.
     */
    uint64_t nci __attribute__ ((aligned(8)));
    /**
     * Physical cell id in range [0, 1007] described in 3GPP TS 38.331. This value must be valid.
     */
    uint32_t pci __attribute__ ((aligned(4)));
    /**
     * 16-bit tracking area code, INT_MAX means invalid/unreported.
     */
    int32_t tac __attribute__ ((aligned(4)));
    /**
     * NR Absolute Radio Frequency Channel Number, in range [0, 3279165].
     * Reference: 3GPP TS 38.101-1 and 3GPP TS 38.101-2 section 5.4.2.1.
     * This value must be valid.
     */
    int32_t nrarfcn __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_2::CellIdentityOperatorNames operatorNames __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::CellIdentityNr, mcc) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CellIdentityNr, mnc) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CellIdentityNr, nci) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CellIdentityNr, pci) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CellIdentityNr, tac) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CellIdentityNr, nrarfcn) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CellIdentityNr, operatorNames) == 56, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::CellIdentityNr) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::CellIdentityNr) == 8, "wrong alignment");

struct CellInfoNr final {
    ::android::hardware::radio::V1_4::NrSignalStrength signalStrength __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_4::CellIdentityNr cellidentity __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::CellInfoNr, signalStrength) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CellInfoNr, cellidentity) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::CellInfoNr) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::CellInfoNr) == 8, "wrong alignment");

/**
 * Overwritten from @1.2::CellInfo in order to update the CellInfoLte to 1.4 version.
 */
struct CellInfo final {
    // Forward declaration for forward reference support:
    struct Info;

    struct Info final {
        enum class hidl_discriminator : uint8_t {
            gsm = 0,  // ::android::hardware::radio::V1_2::CellInfoGsm
            cdma = 1,  // ::android::hardware::radio::V1_2::CellInfoCdma
            wcdma = 2,  // ::android::hardware::radio::V1_2::CellInfoWcdma
            tdscdma = 3,  // ::android::hardware::radio::V1_2::CellInfoTdscdma
            lte = 4,  // ::android::hardware::radio::V1_4::CellInfoLte
            nr = 5,  // ::android::hardware::radio::V1_4::CellInfoNr
        };

        Info();
        ~Info();
        Info(Info&&);
        Info(const Info&);
        Info& operator=(Info&&);
        Info& operator=(const Info&);

        void gsm(const ::android::hardware::radio::V1_2::CellInfoGsm&);
        void gsm(::android::hardware::radio::V1_2::CellInfoGsm&&);
        ::android::hardware::radio::V1_2::CellInfoGsm& gsm();
        const ::android::hardware::radio::V1_2::CellInfoGsm& gsm() const;

        void cdma(const ::android::hardware::radio::V1_2::CellInfoCdma&);
        void cdma(::android::hardware::radio::V1_2::CellInfoCdma&&);
        ::android::hardware::radio::V1_2::CellInfoCdma& cdma();
        const ::android::hardware::radio::V1_2::CellInfoCdma& cdma() const;

        void wcdma(const ::android::hardware::radio::V1_2::CellInfoWcdma&);
        void wcdma(::android::hardware::radio::V1_2::CellInfoWcdma&&);
        ::android::hardware::radio::V1_2::CellInfoWcdma& wcdma();
        const ::android::hardware::radio::V1_2::CellInfoWcdma& wcdma() const;

        void tdscdma(const ::android::hardware::radio::V1_2::CellInfoTdscdma&);
        void tdscdma(::android::hardware::radio::V1_2::CellInfoTdscdma&&);
        ::android::hardware::radio::V1_2::CellInfoTdscdma& tdscdma();
        const ::android::hardware::radio::V1_2::CellInfoTdscdma& tdscdma() const;

        void lte(const ::android::hardware::radio::V1_4::CellInfoLte&);
        void lte(::android::hardware::radio::V1_4::CellInfoLte&&);
        ::android::hardware::radio::V1_4::CellInfoLte& lte();
        const ::android::hardware::radio::V1_4::CellInfoLte& lte() const;

        void nr(const ::android::hardware::radio::V1_4::CellInfoNr&);
        void nr(::android::hardware::radio::V1_4::CellInfoNr&&);
        ::android::hardware::radio::V1_4::CellInfoNr& nr();
        const ::android::hardware::radio::V1_4::CellInfoNr& nr() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_4::CellInfo::Info, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::radio::V1_2::CellInfoGsm gsm __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_2::CellInfoCdma cdma __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_2::CellInfoWcdma wcdma __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_2::CellInfoTdscdma tdscdma __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_4::CellInfoLte lte __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_4::CellInfoNr nr __attribute__ ((aligned(8)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_4::CellInfo::Info::hidl_union) == 120, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_4::CellInfo::Info::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_4::CellInfo::Info::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_4::CellInfo::Info::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_4::CellInfo::Info) == 128, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_4::CellInfo::Info) == 8, "wrong alignment");

    /**
     * True if the phone is registered to a mobile network that provides service on this cell and
     * this cell is being used or would be used for network signaling.
     */
    bool isRegistered __attribute__ ((aligned(1)));
    /**
     * Connection status for the cell.
     */
    ::android::hardware::radio::V1_2::CellConnectionStatus connectionStatus __attribute__ ((aligned(4)));
    /**
     * CellInfo details, cellInfoType can tell which cell info should be used.
     */
    ::android::hardware::radio::V1_4::CellInfo::Info info __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::CellInfo, isRegistered) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CellInfo, connectionStatus) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CellInfo, info) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::CellInfo) == 136, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::CellInfo) == 8, "wrong alignment");

/**
 * Overwritten from @1.2::NetworkScanResult in order to update the CellInfo to 1.4 version.
 */
struct NetworkScanResult final {
    /**
     * The status of the scan.
     */
    ::android::hardware::radio::V1_1::ScanStatus status __attribute__ ((aligned(4)));
    /**
     * The error code of the incremental result.
     */
    ::android::hardware::radio::V1_0::RadioError error __attribute__ ((aligned(4)));
    /**
     * List of network information as CellInfo.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_4::CellInfo> networkInfos __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::NetworkScanResult, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::NetworkScanResult, error) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::NetworkScanResult, networkInfos) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::NetworkScanResult) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::NetworkScanResult) == 8, "wrong alignment");

/**
 * Overwritten from @1.0::DataProfileInfo in order to deprecate 'mvnoType', and 'mvnoMatchData'.
 * In the future, this must be extended instead of overwritten.
 * Also added 'preferred' and 'persistent' in this version.
 */
struct DataProfileInfo final {
    /**
     * id of the data profile
     */
    ::android::hardware::radio::V1_0::DataProfileId profileId __attribute__ ((aligned(4)));
    /**
     * The APN name
     */
    ::android::hardware::hidl_string apn __attribute__ ((aligned(8)));
    /**
     * PDP_type values
     */
    ::android::hardware::radio::V1_4::PdpProtocolType protocol __attribute__ ((aligned(4)));
    /**
     * PDP_type values used on roaming network
     */
    ::android::hardware::radio::V1_4::PdpProtocolType roamingProtocol __attribute__ ((aligned(4)));
    /**
     * APN authentication type
     */
    ::android::hardware::radio::V1_0::ApnAuthType authType __attribute__ ((aligned(4)));
    /**
     * The username for APN, or empty string
     */
    ::android::hardware::hidl_string user __attribute__ ((aligned(8)));
    /**
     * The password for APN, or empty string
     */
    ::android::hardware::hidl_string password __attribute__ ((aligned(8)));
    /**
     * Data profile technology type
     */
    ::android::hardware::radio::V1_0::DataProfileInfoType type __attribute__ ((aligned(4)));
    /**
     * The period in seconds to limit the maximum connections
     */
    int32_t maxConnsTime __attribute__ ((aligned(4)));
    /**
     * The maximum connections during maxConnsTime
     */
    int32_t maxConns __attribute__ ((aligned(4)));
    /**
     * The required wait time in seconds after a successful UE initiated disconnect of a given PDN
     * connection before the device can send a new PDN connection request for that given PDN.
     */
    int32_t waitTime __attribute__ ((aligned(4)));
    /**
     * True to enable the profile, false to disable
     */
    bool enabled __attribute__ ((aligned(1)));
    /**
     * Supported APN types bitmap. See ApnTypes for the value of each bit.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_4::ApnTypes> supportedApnTypesBitmap __attribute__ ((aligned(4)));
    /**
     * The bearer bitmap. See RadioAccessFamily for the value of each bit.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_4::RadioAccessFamily> bearerBitmap __attribute__ ((aligned(4)));
    /**
     * Maximum transmission unit (MTU) size in bytes
     */
    int32_t mtu __attribute__ ((aligned(4)));
    /**
     * True if this data profile was used to bring up the last default (i.e internet) data
     * connection successfully.
     */
    bool preferred __attribute__ ((aligned(1)));
    /**
     * If true, modem must persist this data profile and profileId must not be
     * set to DataProfileId.INVALID. If the same data profile exists, this data profile must
     * overwrite it.
     */
    bool persistent __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, profileId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, apn) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, protocol) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, roamingProtocol) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, authType) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, user) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, password) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, type) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, maxConnsTime) == 76, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, maxConns) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, waitTime) == 84, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, enabled) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, supportedApnTypesBitmap) == 92, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, bearerBitmap) == 96, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, mtu) == 100, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, preferred) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::DataProfileInfo, persistent) == 105, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::DataProfileInfo) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::DataProfileInfo) == 8, "wrong alignment");

struct CardStatus final {
    ::android::hardware::radio::V1_2::CardStatus base __attribute__ ((aligned(8)));
    /**
     * The EID is the eUICC identifier. The EID shall be stored within the ECASD and can be
     * retrieved by the Device at any time using the standard GlobalPlatform GET DATA command.
     *
     * This data is mandatory and applicable only when cardState is CardState:PRESENT and SIM card
     * supports eUICC.
     */
    ::android::hardware::hidl_string eid __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::CardStatus, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CardStatus, eid) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::CardStatus) == 96, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::CardStatus) == 8, "wrong alignment");

/**
 * Overwritten from @1.0::RadioCapability in order to use the latest RadioAccessFamily.
 */
struct RadioCapability final {
    /**
     * Unique session value defined by fr amework returned in all "responses/unslo".
     */
    int32_t session __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::RadioCapabilityPhase phase __attribute__ ((aligned(4)));
    /**
     * 32-bit bitmap of RadioAccessFamily.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_4::RadioAccessFamily> raf __attribute__ ((aligned(4)));
    /**
     * A UUID typically "com.xxxx.lmX" where X is the logical modem.
     * RadioConst:MAX_UUID_LENGTH is the max length.
     */
    ::android::hardware::hidl_string logicalModemUuid __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::RadioCapabilityStatus status __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::RadioCapability, session) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::RadioCapability, phase) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::RadioCapability, raf) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::RadioCapability, logicalModemUuid) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::RadioCapability, status) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::RadioCapability) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::RadioCapability) == 8, "wrong alignment");

/**
 * Overwritten from @1.0::SetupDataCallResult in order to update the DataCallFailCause to 1.4
 * version.
 */
struct SetupDataCallResult final {
    /**
     * Data call fail cause. DataCallFailCause.NONE if no error.
     */
    ::android::hardware::radio::V1_4::DataCallFailCause cause __attribute__ ((aligned(4)));
    /**
     * If status != DataCallFailCause.NONE, this field indicates the suggested retry back-off timer
     * value RIL wants to override the one pre-configured in FW. The unit is milliseconds.
     * The value < 0 means no value is suggested.
     * The value 0 means retry must be done ASAP.
     * The value of INT_MAX(0x7fffffff) means no retry.
     */
    int32_t suggestedRetryTime __attribute__ ((aligned(4)));
    /**
     * Context ID, uniquely identifies this call.
     */
    int32_t cid __attribute__ ((aligned(4)));
    /**
     * Data connection active status.
     */
    ::android::hardware::radio::V1_4::DataConnActiveStatus active __attribute__ ((aligned(4)));
    /**
     * PDP_type values. If cause is DataCallFailCause.ONLY_SINGLE_BEARER_ALLOWED, this is the type
     * supported such as "IP" or "IPV6".
     */
    ::android::hardware::radio::V1_4::PdpProtocolType type __attribute__ ((aligned(4)));
    /**
     * The network interface name.
     */
    ::android::hardware::hidl_string ifname __attribute__ ((aligned(8)));
    /**
     * List of addresses with optional "/" prefix length, e.g., "192.0.1.3" or
     * "192.0.1.11/16 2001:db8::1/64".  Typically one IPv4 or one IPv6 or one of each. If the
     * prefix length is absent the addresses are assumed to be point to point with IPv4 having a
     * prefix length of 32 and IPv6 128.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> addresses __attribute__ ((aligned(8)));
    /**
     * List of DNS server addresses, e.g., "192.0.1.3" or "192.0.1.11 2001:db8::1". Empty if no dns
     * server addresses returned.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> dnses __attribute__ ((aligned(8)));
    /**
     * List of default gateway addresses, e.g., "192.0.1.3" or "192.0.1.11 2001:db8::1".
     * When empty, the addresses represent point to point connections.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> gateways __attribute__ ((aligned(8)));
    /**
     * List of P-CSCF(Proxy Call State Control Function) addresses via PCO(Protocol Configuration
     * Option), e.g., "2001:db8::1 2001:db8::2 2001:db8::3". Empty if not IMS client.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> pcscf __attribute__ ((aligned(8)));
    /**
     * MTU received from network. Value <= 0 means network has either not sent a value or sent an
     * invalid value.
     */
    int32_t mtu __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::SetupDataCallResult, cause) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SetupDataCallResult, suggestedRetryTime) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SetupDataCallResult, cid) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SetupDataCallResult, active) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SetupDataCallResult, type) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SetupDataCallResult, ifname) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SetupDataCallResult, addresses) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SetupDataCallResult, dnses) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SetupDataCallResult, gateways) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SetupDataCallResult, pcscf) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SetupDataCallResult, mtu) == 104, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::SetupDataCallResult) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::SetupDataCallResult) == 8, "wrong alignment");

enum class SimLockMultiSimPolicy : int32_t {
    /**
     * Indicates that configuration applies to each slot independently.
     */
    NO_MULTISIM_POLICY = 0,
    /**
     * Indicates that any SIM card can be used as far as one valid card is present in the device.
     * For the modem, a SIM card is valid when its content (i.e. MCC, MNC, GID, SPN) matches the
     * carrier restriction configuration.
     */
    ONE_VALID_SIM_MUST_BE_PRESENT = 1,
};

struct CarrierRestrictionsWithPriority final {
    /**
     * List of allowed carriers.
     * The character '?' is used as wildcard character to match any value.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::Carrier> allowedCarriers __attribute__ ((aligned(8)));
    /**
     * List of excluded carriers.
     * The character '?' is used as wildcard character to match any value.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::Carrier> excludedCarriers __attribute__ ((aligned(8)));
    /**
     * True means that only carriers included in the allowed list and not in the excluded list
     * are permitted. Eg. allowedCarriers match mcc/mnc, excludedCarriers has same mcc/mnc and
     * gid1 is ABCD. It means except the carrier whose gid1 is ABCD, all carriers with the
     * same mcc/mnc are allowed.
     * False means that all carriers are allowed except those included in the excluded list
     * and not in the allowed list.
     */
    bool allowedCarriersPrioritized __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::CarrierRestrictionsWithPriority, allowedCarriers) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CarrierRestrictionsWithPriority, excludedCarriers) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::CarrierRestrictionsWithPriority, allowedCarriersPrioritized) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::CarrierRestrictionsWithPriority) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::CarrierRestrictionsWithPriority) == 8, "wrong alignment");

/**
 * Overwritten from @1.2::SignalStrength in order to add signal strength for NR.
 */
struct SignalStrength final {
    /**
     * If GSM measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::GsmSignalStrength gsm __attribute__ ((aligned(4)));
    /**
     * If CDMA measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::CdmaSignalStrength cdma __attribute__ ((aligned(4)));
    /**
     * If EvDO measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::EvdoSignalStrength evdo __attribute__ ((aligned(4)));
    /**
     * If LTE measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::LteSignalStrength lte __attribute__ ((aligned(4)));
    /**
     * If TD-SCDMA measurements are provided, this structure must contain valid measurements;
     * otherwise all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_2::TdscdmaSignalStrength tdscdma __attribute__ ((aligned(4)));
    /**
     * If WCDMA measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_2::WcdmaSignalStrength wcdma __attribute__ ((aligned(4)));
    /**
     * If NR 5G measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_4::NrSignalStrength nr __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_4::SignalStrength, gsm) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SignalStrength, cdma) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SignalStrength, evdo) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SignalStrength, lte) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SignalStrength, tdscdma) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SignalStrength, wcdma) == 68, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_4::SignalStrength, nr) == 84, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_4::SignalStrength) == 108, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_4::SignalStrength) == 4, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::radio::V1_4::AccessNetwork o);
static inline void PrintTo(::android::hardware::radio::V1_4::AccessNetwork o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::radio::V1_4::AccessNetwork lhs, const ::android::hardware::radio::V1_4::AccessNetwork rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::radio::V1_4::AccessNetwork rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::radio::V1_4::AccessNetwork lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
