{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" : [],
 "functions" :
 [
  {
   "function_name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler::DeathHandler",
   "linker_set_key" : "_ZN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerC1EOS4_",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    },
    {
     "referenced_type" : "_ZTION4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "function_name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler::DeathHandler",
   "linker_set_key" : "_ZN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerC2EOS4_",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    },
    {
     "referenced_type" : "_ZTION4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {

   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Buffer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2nn7VersionE",
   "name" : "const android::nn::Version",
   "referenced_type" : "_ZTIN7android2nn7VersionE",
   "self_type" : "_ZTIKN7android2nn7VersionE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks14IPreparedModelEEE",
   "name" : "const std::shared_ptr<aidl::android::hardware::neuralnetworks::IPreparedModel>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks14IPreparedModelEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks14IPreparedModelEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/PreparedModel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IBufferEEE",
   "name" : "const std::shared_ptr<aidl::android::hardware::neuralnetworks::IBuffer>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IBufferEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IBufferEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Buffer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IDeviceEEE",
   "name" : "const std::shared_ptr<aidl::android::hardware::neuralnetworks::IDevice>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IDeviceEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IDeviceEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIjjEE",
   "name" : "const std::pair<unsigned int, unsigned int>",
   "referenced_type" : "_ZTINSt3__14pairIjjEE",
   "self_type" : "_ZTIKNSt3__14pairIjjEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__15arrayIhLj32EEE",
   "name" : "const std::array<unsigned char, 32>",
   "referenced_type" : "_ZTINSt3__15arrayIhLj32EEE",
   "self_type" : "_ZTIKNSt3__15arrayIhLj32EEE",
   "size" : 32,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android2nn10BufferRoleENS_9allocatorIS3_EEEE",
   "name" : "const std::vector<android::nn::BufferRole, std::allocator<android::nn::BufferRole>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android2nn10BufferRoleENS_9allocatorIS3_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android2nn10BufferRoleENS_9allocatorIS3_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE",
   "name" : "const std::vector<android::nn::Extension, std::allocator<android::nn::Extension>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorINS_10shared_ptrIKN7android2nn14IPreparedModelEEENS_9allocatorIS6_EEEE",
   "name" : "const std::vector<std::shared_ptr<const android::nn::IPreparedModel>, std::allocator<std::shared_ptr<const android::nn::IPreparedModel>>>",
   "referenced_type" : "_ZTINSt3__16vectorINS_10shared_ptrIKN7android2nn14IPreparedModelEEENS_9allocatorIS6_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorINS_10shared_ptrIKN7android2nn14IPreparedModelEEENS_9allocatorIS6_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorINS_10shared_ptrIKN7android2nn6HandleEEENS_9allocatorIS6_EEEE",
   "name" : "const std::vector<std::shared_ptr<const android::nn::Handle>, std::allocator<std::shared_ptr<const android::nn::Handle>>>",
   "referenced_type" : "_ZTINSt3__16vectorINS_10shared_ptrIKN7android2nn6HandleEEENS_9allocatorIS6_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorINS_10shared_ptrIKN7android2nn6HandleEEENS_9allocatorIS6_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kObject",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    },
    {
     "access" : "private",
     "field_name" : "kDeathRecipient",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE"
    },
    {
     "access" : "private",
     "field_name" : "kDeathMonitor",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 20,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIPN7android8hardware14neuralnetworks5utils18IProtectedCallbackENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::DeathMonitor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModel21PrivateConstructorTagE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::PreparedModel::PrivateConstructorTag",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModel21PrivateConstructorTagE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModel21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/PreparedModel.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn14IPreparedModelE"
    },
    {
     "referenced_type" : "_ZTINSt3__123enable_shared_from_thisIN4aidl7android8hardware14neuralnetworks5utils13PreparedModelEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kPreparedModel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks14IPreparedModelEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModelE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::PreparedModel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModelE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModelE",
   "size" : 20,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/PreparedModel.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModelE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils13PreparedModel7executeERKN7android2nn7RequestENS6_13MeasureTimingERKNSt3__18optionalINSB_6chrono10time_pointINS5_4base10boot_clockENSD_8durationIxNSB_5ratioILx1ELx1000000000EEEEEEEEERKNSC_ISK_EE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils13PreparedModel13executeFencedERKN7android2nn7RequestERKNSt3__16vectorINS6_9SyncFenceENSA_9allocatorISC_EEEENS6_13MeasureTimingERKNSA_8optionalINSA_6chrono10time_pointINS5_4base10boot_clockENSK_8durationIxNSA_5ratioILx1ELx1000000000EEEEEEEEERKNSJ_ISR_EESY_"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils13PreparedModel23createReusableExecutionERKN7android2nn7RequestENS6_13MeasureTimingERKNSt3__18optionalINSB_6chrono8durationIxNSB_5ratioILx1ELx1000000000EEEEEEE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils13PreparedModel23configureExecutionBurstEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils13PreparedModel21getUnderlyingResourceEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils13PreparedModelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils13PreparedModelD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks23BnPreparedModelCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils13TransferValueINS_4base8expectedINSt3__110shared_ptrIKNS_2nn14IPreparedModelEEENS8_12GeneralErrorEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::PreparedModelCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackE",
   "size" : 60,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Callbacks.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks22IPreparedModelCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks22IPreparedModelCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallback6notifyENS2_11ErrorStatusERKNSt3__110shared_ptrINS2_14IPreparedModelEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks23BnPreparedModelCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks23BnPreparedModelCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks23BnPreparedModelCallback12createBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallback18notifyAsDeadObjectEv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackE"
    },
    {
     "mangled_component_name" : "_ZThn24_N4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallback18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackD0Ev"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6Buffer21PrivateConstructorTagE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::Buffer::PrivateConstructorTag",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6Buffer21PrivateConstructorTagE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6Buffer21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Buffer.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn7IBufferE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kBuffer",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IBufferEEE"
    },
    {
     "access" : "private",
     "field_name" : "kToken",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKN7android2nn7Request17MemoryDomainTokenE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6BufferE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::Buffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6BufferE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6BufferE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Buffer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6BufferE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Buffer8getTokenEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Buffer6copyToERKNSt3__110shared_ptrIKN7android2nn6MemoryEEE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Buffer8copyFromERKNSt3__110shared_ptrIKN7android2nn6MemoryEEERKNS5_6vectorIjNS5_9allocatorIjEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils6BufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils6BufferD0Ev"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6Device21PrivateConstructorTagE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::Device::PrivateConstructorTag",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6Device21PrivateConstructorTagE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6Device21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn7IDeviceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kName",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "kVersionString",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "kDeviceType",
     "field_offset" : 224,
     "referenced_type" : "_ZTIKN7android2nn10DeviceTypeE"
    },
    {
     "access" : "private",
     "field_name" : "kExtensions",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKNSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "kCapabilities",
     "field_offset" : 352,
     "referenced_type" : "_ZTIKN7android2nn12CapabilitiesE"
    },
    {
     "access" : "private",
     "field_name" : "kNumberOfCacheFilesNeeded",
     "field_offset" : 704,
     "referenced_type" : "_ZTIKNSt3__14pairIjjEE"
    },
    {
     "access" : "private",
     "field_name" : "kDevice",
     "field_offset" : 768,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IDeviceEEE"
    },
    {
     "access" : "private",
     "field_name" : "kDeathHandler",
     "field_offset" : 832,
     "referenced_type" : "_ZTIKN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6DeviceE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::Device",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6DeviceE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6DeviceE",
   "size" : 124,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6DeviceE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device7getNameEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device16getVersionStringEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device15getFeatureLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device7getTypeEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device22getSupportedExtensionsEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device15getCapabilitiesEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device27getNumberOfCacheFilesNeededEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device4waitEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device22getSupportedOperationsERKN7android2nn5ModelE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device12prepareModelERKN7android2nn5ModelENS6_19ExecutionPreferenceENS6_8PriorityENSt3__18optionalINSC_6chrono10time_pointINS5_4base10boot_clockENSE_8durationIxNSC_5ratioILx1ELx1000000000EEEEEEEEERKNSC_6vectorINSC_10shared_ptrIKNS6_6HandleEEENSC_9allocatorISS_EEEESX_RKNSC_5arrayIhLj32EEE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device21prepareModelFromCacheENSt3__18optionalINS5_6chrono10time_pointIN7android4base10boot_clockENS7_8durationIxNS5_5ratioILx1ELx1000000000EEEEEEEEERKNS5_6vectorINS5_10shared_ptrIKNS9_2nn6HandleEEENS5_9allocatorISN_EEEESS_RKNS5_5arrayIhLj32EEE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device8allocateERKN7android2nn10BufferDescERKNSt3__16vectorINSA_10shared_ptrIKNS6_14IPreparedModelEEENSA_9allocatorISF_EEEERKNSB_INS6_10BufferRoleENSG_ISL_EEEESP_"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils6DeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils6DeviceD0Ev"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler &&",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTION4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  }
 ]
}
