{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIx",
   "name" : "long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIx",
   "size" : 8
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" : [],
 "functions" :
 [
  {
   "function_name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler::DeathHandler",
   "linker_set_key" : "_ZN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerC1EOS4_",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    },
    {
     "referenced_type" : "_ZTION4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "function_name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler::DeathHandler",
   "linker_set_key" : "_ZN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerC2EOS4_",
   "parameters" :
   [
    {

   "name" : "const android::hardware::neuralnetworks::utils::RequestRelocation",
   "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "self_type" : "_ZTIKN7android8hardware14neuralnetworks5utils17RequestRelocationE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/PreparedModel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIKN4aidl7android8hardware14neuralnetworks5utils13PreparedModelEEE",
   "name" : "const std::shared_ptr<const aidl::android::hardware::neuralnetworks::utils::PreparedModel>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIKN4aidl7android8hardware14neuralnetworks5utils13PreparedModelEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIKN4aidl7android8hardware14neuralnetworks5utils13PreparedModelEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Execution.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks14IPreparedModelEEE",
   "name" : "const std::shared_ptr<aidl::android::hardware::neuralnetworks::IPreparedModel>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks14IPreparedModelEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks14IPreparedModelEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/PreparedModel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks5utils5Burst11MemoryCacheEEE",
   "name" : "const std::shared_ptr<aidl::android::hardware::neuralnetworks::utils::Burst::MemoryCache>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks5utils5Burst11MemoryCacheEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks5utils5Burst11MemoryCacheEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Burst.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks6IBurstEEE",
   "name" : "const std::shared_ptr<aidl::android::hardware::neuralnetworks::IBurst>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks6IBurstEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks6IBurstEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Burst.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE",
   "name" : "const std::vector<ndk::ScopedFileDescriptor, std::allocator<ndk::ScopedFileDescriptor>>",
   "referenced_type" : "_ZTINSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/PreparedModel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android2nn9SyncFenceENS_9allocatorIS3_EEEE",
   "name" : "const std::vector<android::nn::SyncFence, std::allocator<android::nn::SyncFence>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android2nn9SyncFenceENS_9allocatorIS3_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android2nn9SyncFenceENS_9allocatorIS3_EEEE",
   "size" : 12,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/PreparedModel.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6chrono10time_pointIN7android4base10boot_clockENS1_8durationIxNS_5ratioILx1ELx1000000000EEEEEEEEE",
   "name" : "const std::optional<std::chrono::time_point<android::base::boot_clock, std::chrono::duration<long long, std::ratio<1, 1000000000>>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6chrono10time_pointIN7android4base10boot_clockENS1_8durationIxNS_5ratioILx1ELx1000000000EEEEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6chrono10time_pointIN7android4base10boot_clockENS1_8durationIxNS_5ratioILx1ELx1000000000EEEEEEEEE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/PreparedModel.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEE",
   "name" : "const std::optional<std::chrono::duration<long long, std::ratio<1, 1000000000>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/PreparedModel.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Execution.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Execution.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kObject",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    },
    {
     "access" : "private",
     "field_name" : "kDeathRecipient",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE"
    },
    {
     "access" : "private",
     "field_name" : "kDeathMonitor",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 20,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIPN7android8hardware14neuralnetworks5utils18IProtectedCallbackENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::DeathMonitor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModel21PrivateConstructorTagE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::PreparedModel::PrivateConstructorTag",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModel21PrivateConstructorTagE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModel21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/PreparedModel.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn14IPreparedModelE"
    },
    {
     "referenced_type" : "_ZTINSt3__123enable_shared_from_thisIN4aidl7android8hardware14neuralnetworks5utils13PreparedModelEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kPreparedModel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks14IPreparedModelEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModelE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::PreparedModel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModelE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModelE",
   "size" : 20,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/PreparedModel.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils13PreparedModelE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils13PreparedModel7executeERKN7android2nn7RequestENS6_13MeasureTimingERKNSt3__18optionalINSB_6chrono10time_pointINS5_4base10boot_clockENSD_8durationIxNSB_5ratioILx1ELx1000000000EEEEEEEEERKNSC_ISK_EE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils13PreparedModel13executeFencedERKN7android2nn7RequestERKNSt3__16vectorINS6_9SyncFenceENSA_9allocatorISC_EEEENS6_13MeasureTimingERKNSA_8optionalINSA_6chrono10time_pointINS5_4base10boot_clockENSK_8durationIxNSA_5ratioILx1ELx1000000000EEEEEEEEERKNSJ_ISR_EESY_"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils13PreparedModel23createReusableExecutionERKN7android2nn7RequestENS6_13MeasureTimingERKNSt3__18optionalINSB_6chrono8durationIxNSB_5ratioILx1ELx1000000000EEEEEEE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils13PreparedModel23configureExecutionBurstEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils13PreparedModel21getUnderlyingResourceEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils13PreparedModelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils13PreparedModelD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks23BnPreparedModelCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils18IProtectedCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN7android8hardware14neuralnetworks5utils13TransferValueINS_4base8expectedINSt3__110shared_ptrIKNS_2nn14IPreparedModelEEENS8_12GeneralErrorEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::PreparedModelCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackE",
   "size" : 60,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Callbacks.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks22IPreparedModelCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks22IPreparedModelCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallback6notifyENS2_11ErrorStatusERKNSt3__110shared_ptrINS2_14IPreparedModelEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks23BnPreparedModelCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks23BnPreparedModelCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks23BnPreparedModelCallback12createBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallback18notifyAsDeadObjectEv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackE"
    },
    {
     "mangled_component_name" : "_ZThn24_N4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallback18notifyAsDeadObjectEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N4aidl7android8hardware14neuralnetworks5utils21PreparedModelCallbackD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__123enable_shared_from_thisIN4aidl7android8hardware14neuralnetworks5utils5Burst11MemoryCacheEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kBurst",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks6IBurstEEE"
    },
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mUnusedIdentifier",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "mCache",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__113unordered_mapINS_10shared_ptrIKN7android2nn6MemoryEEENS_4pairIxNS_8weak_ptrIKNS2_4base10ScopeGuardINS_8functionIFvvEEEEEEEEENS_4hashIS6_EENS_8equal_toIS6_EENS_9allocatorINS7_IKS6_SH_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils5Burst11MemoryCacheE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::Burst::MemoryCache",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils5Burst11MemoryCacheE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils5Burst11MemoryCacheE",
   "size" : 56,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Burst.h"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils5Burst21PrivateConstructorTagE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::Burst::PrivateConstructorTag",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils5Burst21PrivateConstructorTagE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils5Burst21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Burst.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn6IBurstE"
    },
    {
     "referenced_type" : "_ZTINSt3__123enable_shared_from_thisIN4aidl7android8hardware14neuralnetworks5utils5BurstEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mExecutionInFlight",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__111atomic_flagE"
    },
    {
     "access" : "private",
     "field_name" : "kBurst",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks6IBurstEEE"
    },
    {
     "access" : "private",
     "field_name" : "kMemoryCache",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks5utils5Burst11MemoryCacheEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils5BurstE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::Burst",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils5BurstE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils5BurstE",
   "size" : 32,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Burst.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils5BurstE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils5Burst11cacheMemoryERKNSt3__110shared_ptrIKN7android2nn6MemoryEEE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils5Burst7executeERKN7android2nn7RequestENS6_13MeasureTimingERKNSt3__18optionalINSB_6chrono10time_pointINS5_4base10boot_clockENSD_8durationIxNSB_5ratioILx1ELx1000000000EEEEEEEEERKNSC_ISK_EE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils5Burst23createReusableExecutionERKN7android2nn7RequestENS6_13MeasureTimingERKNSt3__18optionalINSB_6chrono8durationIxNSB_5ratioILx1ELx1000000000EEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils5BurstD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils5BurstD0Ev"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils9Execution21PrivateConstructorTagE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::Execution::PrivateConstructorTag",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils9Execution21PrivateConstructorTagE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils9Execution21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Execution.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn10IExecutionE"
    },
    {
     "referenced_type" : "_ZTINSt3__123enable_shared_from_thisIN4aidl7android8hardware14neuralnetworks5utils9ExecutionEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kPreparedModel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIKN4aidl7android8hardware14neuralnetworks5utils13PreparedModelEEE"
    },
    {
     "access" : "private",
     "field_name" : "kRequest",
     "field_offset" : 160,
     "referenced_type" : "_ZTIKN4aidl7android8hardware14neuralnetworks7RequestE"
    },
    {
     "access" : "private",
     "field_name" : "kRelocation",
     "field_offset" : 448,
     "referenced_type" : "_ZTIKN7android8hardware14neuralnetworks5utils17RequestRelocationE"
    },
    {
     "access" : "private",
     "field_name" : "kMeasure",
     "field_offset" : 512,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "private",
     "field_name" : "kLoopTimeoutDuration",
     "field_offset" : 576,
     "referenced_type" : "_ZTIKx"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils9ExecutionE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::Execution",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils9ExecutionE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils9ExecutionE",
   "size" : 80,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Execution.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils9ExecutionE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils9Execution7computeERKNSt3__18optionalINS5_6chrono10time_pointIN7android4base10boot_clockENS7_8durationIxNS5_5ratioILx1ELx1000000000EEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils9Execution13computeFencedERKNSt3__16vectorIN7android2nn9SyncFenceENS5_9allocatorIS9_EEEERKNS5_8optionalINS5_6chrono10time_pointINS7_4base10boot_clockENSG_8durationIxNS5_5ratioILx1ELx1000000000EEEEEEEEERKNSF_ISN_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils9ExecutionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils9ExecutionD0Ev"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler &&",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTION4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  }
 ]
}
