<abi-corpus-group version='2.0' architecture='elf-amd-x86_64'>
  <abi-corpus version='2.0' path='vmlinux' architecture='elf-amd-x86_64'>
    <elf-function-symbols>
      <elf-symbol name='__SCT__tp_func_android_fs_dataread_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x98aec175'/>
      <elf-symbol name='__SCT__tp_func_android_fs_dataread_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x7ba47bcb'/>
      <elf-symbol name='__SCT__tp_func_android_fs_datawrite_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x66b60986'/>
      <elf-symbol name='__SCT__tp_func_android_fs_datawrite_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x5abc5dc0'/>
      <elf-symbol name='__SCT__tp_func_android_rvh_account_irq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x405c6fae'/>
      <elf-symbol name='__SCT__tp_func_android_rvh_after_dequeue_task' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x820b2194'/>
      <elf-symbol name='__SCT__tp_func_android_rvh_after_enqueue_task' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x37eeefcd'/>

      <elf-symbol name='__x86_indirect_thunk_rsi' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa1f9a134'/>
      <elf-symbol name='__x86_retpoline_r10' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x8c15fe3e'/>
      <elf-symbol name='__x86_retpoline_r11' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4d9b21fe'/>
      <elf-symbol name='__x86_retpoline_r12' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd47947ff'/>
      <elf-symbol name='__x86_retpoline_r13' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x15f7983f'/>
      <elf-symbol name='__x86_retpoline_r14' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x3ccc8dbc'/>
      <elf-symbol name='__x86_retpoline_r15' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xfd42527c'/>
      <elf-symbol name='__x86_retpoline_r8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x3b4d3fca'/>
      <elf-symbol name='__x86_retpoline_r9' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xfac3e00a'/>
      <elf-symbol name='__x86_retpoline_rax' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xdce55c98'/>
      <elf-symbol name='__x86_retpoline_rbp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x11b86f2d'/>
      <elf-symbol name='__x86_retpoline_rbx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xab7b8e68'/>
      <elf-symbol name='__x86_retpoline_rcx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x30dec207'/>
      <elf-symbol name='__x86_retpoline_rdi' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x2b3e3083'/>
      <elf-symbol name='__x86_retpoline_rdx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x44462b88'/>
      <elf-symbol name='__x86_retpoline_rsi' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x53be34f0'/>
      <elf-symbol name='asm_load_gs_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa931af8a'/>
      <elf-symbol name='clear_page_erms' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x9084b044'/>
      <elf-symbol name='clear_page_orig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x925493f'/>
      <elf-symbol name='clear_page_rep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x23b4e0d7'/>
      <elf-symbol name='copy_page' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x33b84f74'/>
      <elf-symbol name='copy_user_enhanced_fast_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x26948d96'/>
      <elf-symbol name='copy_user_generic_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xafb8c6ff'/>
      <elf-symbol name='copy_user_generic_unrolled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x72a98fdb'/>
      <elf-symbol name='memcpy' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes' crc='0x69acdf38'/>
      <elf-symbol name='memmove' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes' crc='0xb0e602eb'/>
      <elf-symbol name='memset' type='func-type' binding='weak-binding' visibility='default-visibility' alias='__memset' is-defined='yes' crc='0xfb578fc5'/>
      <elf-symbol name='native_restore_fl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x597f54c0'/>
      <elf-symbol name='native_save_fl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x9d70541a'/>
      <elf-symbol name='preempt_schedule_notrace_thunk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x3b72f08d'/>
      <elf-symbol name='preempt_schedule_thunk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd6742002'/>
      <elf-symbol name='rdmsr_safe_regs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4cd5bc5e'/>
      <elf-symbol name='wrmsr_safe_regs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa836ba02'/>
    </elf-function-symbols>
    <elf-variable-symbols>
      <elf-symbol name='empty_zero_page' size='4096' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x815f2897'/>
      <elf-symbol name='jiffies' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x15ba50a6'/>
      <elf-symbol name='phys_base' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4c9d28b0'/>
    </elf-variable-symbols>
    <abi-instr address-size='64' path='arch/x86/crypto/aesni-intel_glue.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='1920' id='08b4ad9f'>
        <subrange length='60' type-id='7ff19f0f' id='b114e3c3'/>
      </array-type-def>
      <class-decl name='crypto_aes_ctx' size-in-bits='3872' is-struct='yes' visibility='default' filepath='include/crypto/aes.h' line='25' column='1' id='b5b9216e'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='key_enc' type-id='08b4ad9f' visibility='default' filepath='include/crypto/aes.h' line='26' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='key_dec' type-id='08b4ad9f' visibility='default' filepath='include/crypto/aes.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3840'>
          <var-decl name='key_length' type-id='19c2251e' visibility='default' filepath='include/crypto/aes.h' line='28' column='1'/>
        </data-member>
      </class-decl>
      <qualified-type-def type-id='b5b9216e' const='yes' id='09f052f7'/>
      <pointer-type-def type-id='09f052f7' size-in-bits='64' id='825271e7'/>
      <pointer-type-def type-id='b5b9216e' size-in-bits='64' id='21370cb4'/>
      <function-decl name='aesni_set_key' filepath='arch/x86/crypto/aesni-intel_glue.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='aesni_enc' filepath='arch/x86/crypto/aesni-intel_glue.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_dec' filepath='arch/x86/crypto/aesni-intel_glue.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_ecb_enc' filepath='arch/x86/crypto/aesni-intel_glue.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_ecb_dec' filepath='arch/x86/crypto/aesni-intel_glue.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_cbc_enc' filepath='arch/x86/crypto/aesni-intel_glue.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='cf536864'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_cbc_dec' filepath='arch/x86/crypto/aesni-intel_glue.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='cf536864'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_xts_decrypt' filepath='arch/x86/crypto/aesni-intel_glue.c' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='825271e7'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='cf536864'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_xts_encrypt' filepath='arch/x86/crypto/aesni-intel_glue.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='825271e7'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='cf536864'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aes_ctr_enc_128_avx_by8' filepath='arch/x86/crypto/aesni-intel_glue.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aes_ctr_enc_192_avx_by8' filepath='arch/x86/crypto/aesni-intel_glue.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aes_ctr_enc_256_avx_by8' filepath='arch/x86/crypto/aesni-intel_glue.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
      <pointer-type-def type-id='ea86de29' size-in-bits='64' id='354f7eb9'/>
      <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
      <typedef-decl name='u32' type-id='3f1a6b60' filepath='include/asm-generic/int-ll64.h' line='21' column='1' id='19c2251e'/>
      <pointer-type-def type-id='002ac4a6' size-in-bits='64' id='cf536864'/>
      <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
      <type-decl name='void' id='48b5725f'/>
      <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
      <qualified-type-def type-id='002ac4a6' const='yes' id='ea86de29'/>
      <typedef-decl name='__u32' type-id='f0981eeb' filepath='include/uapi/asm-generic/int-ll64.h' line='27' column='1' id='3f1a6b60'/>
      <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/crypto/blake2s-glue.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='64' id='1872161b'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='256' id='1c6311dd'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <class-decl name='blake2s_state' size-in-bits='960' is-struct='yes' visibility='default' filepath='include/crypto/blake2s.h' line='25' column='1' id='d93b0d0b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='h' type-id='1c6311dd' visibility='default' filepath='include/crypto/blake2s.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='t' type-id='1872161b' visibility='default' filepath='include/crypto/blake2s.h' line='28' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='f' type-id='1872161b' visibility='default' filepath='include/crypto/blake2s.h' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='buf' type-id='47ba3182' visibility='default' filepath='include/crypto/blake2s.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='buflen' type-id='f0981eeb' visibility='default' filepath='include/crypto/blake2s.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='928'>
          <var-decl name='outlen' type-id='f0981eeb' visibility='default' filepath='include/crypto/blake2s.h' line='32' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='d93b0d0b' size-in-bits='64' id='2c07f8cb'/>
      <function-decl name='blake2s_compress_ssse3' filepath='arch/x86/crypto/blake2s-glue.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='2c07f8cb'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='blake2s_compress_avx512' filepath='arch/x86/crypto/blake2s-glue.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='2c07f8cb'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='512' id='47ba3182'>
        <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
      </array-type-def>
      <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
      <typedef-decl name='u8' type-id='8f048e17' filepath='include/asm-generic/int-ll64.h' line='17' column='1' id='f9b06939'/>
      <typedef-decl name='__u8' type-id='002ac4a6' filepath='include/uapi/asm-generic/int-ll64.h' line='21' column='1' id='8f048e17'/>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/crypto/chacha_glue.c' language='LANG_C89'>
      <pointer-type-def type-id='20f5f452' size-in-bits='64' id='5b2fd8e8'/>
      <pointer-type-def type-id='002ac4a6' size-in-bits='64' id='cf536864'/>
      <function-decl name='hchacha_block_ssse3' filepath='arch/x86/crypto/chacha_glue.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='5b2fd8e8'/>
        <parameter type-id='807869d3'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_8block_xor_avx512vl' filepath='arch/x86/crypto/chacha_glue.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='807869d3'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_4block_xor_avx512vl' filepath='arch/x86/crypto/chacha_glue.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='807869d3'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_2block_xor_avx512vl' filepath='arch/x86/crypto/chacha_glue.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='807869d3'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_8block_xor_avx2' filepath='arch/x86/crypto/chacha_glue.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='807869d3'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_4block_xor_avx2' filepath='arch/x86/crypto/chacha_glue.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='807869d3'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_2block_xor_avx2' filepath='arch/x86/crypto/chacha_glue.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='807869d3'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_4block_xor_ssse3' filepath='arch/x86/crypto/chacha_glue.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='807869d3'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_block_xor_ssse3' filepath='arch/x86/crypto/chacha_glue.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='807869d3'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <qualified-type-def type-id='f0981eeb' const='yes' id='20f5f452'/>
      <pointer-type-def type-id='f0981eeb' size-in-bits='64' id='807869d3'/>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/crypto/poly1305_glue.c' language='LANG_C89'>
      <function-decl name='poly1305_emit_avx' filepath='arch/x86/crypto/poly1305_glue.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='5b2fd8e8'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_emit_x86_64' filepath='arch/x86/crypto/poly1305_glue.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='cf536864'/>
        <parameter type-id='5b2fd8e8'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_blocks_x86_64' filepath='arch/x86/crypto/poly1305_glue.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_blocks_avx2' filepath='arch/x86/crypto/poly1305_glue.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_blocks_avx' filepath='arch/x86/crypto/poly1305_glue.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_blocks_avx512' filepath='arch/x86/crypto/poly1305_glue.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_init_x86_64' filepath='arch/x86/crypto/poly1305_glue.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='354f7eb9'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/kernel/acpi/sleep.c' language='LANG_C89'>
      <function-decl name='do_suspend_lowlevel' filepath='arch/x86/kernel/acpi/sleep.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/kernel/cpu/amd.c' language='LANG_C89'>
      <function-decl name='rdmsr_safe_regs' filepath='arch/x86/include/asm/msr.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='807869d3'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='wrmsr_safe_regs' filepath='arch/x86/include/asm/msr.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='807869d3'/>
        <return type-id='95e97e5e'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/kernel/dumpstack.c' language='LANG_C89'>
      <function-decl name='rewind_stack_do_exit' filepath='arch/x86/kernel/dumpstack.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/kernel/irq.c' language='LANG_C89'>
      <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
      <array-type-def dimensions='1' type-id='3f1a6b60' size-in-bits='64' id='839e8989'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='infinite' id='52cd3f2c'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='128' id='9396cabb'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='192' id='26f0765c'>
        <subrange length='24' type-id='7ff19f0f' id='fdd3342b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='24' id='c216126b'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='32' id='c213d3d4'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='72' id='060772ed'>
        <subrange length='9' type-id='7ff19f0f' id='12e4273c'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f22a8abb' size-in-bits='768' id='84ab35b9'>
        <subrange length='12' type-id='7ff19f0f' id='84827bdc'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f22a8abb' size-in-bits='2368' id='9dc8e502'>
        <subrange length='37' type-id='7ff19f0f' id='aa6426fb'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f22a8abb' size-in-bits='2560' id='a08a3908'>
        <subrange length='40' type-id='7ff19f0f' id='8f80b239'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f22a8abb' size-in-bits='256' id='b6b7435e'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f22a8abb' size-in-bits='512' id='7698c98a'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f22a8abb' size-in-bits='5888' id='5dc501b1'>
        <subrange length='92' type-id='7ff19f0f' id='1deb94f4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f22a8abb' size-in-bits='infinite' id='a922812c'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='49178f86' size-in-bits='320' id='a4e509bc'>
        <subrange length='10' type-id='7ff19f0f' id='487da03a'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='40af3608' size-in-bits='infinite' id='7289e834'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a3274c4b' size-in-bits='5120' id='8574e02e'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='0f8f80b0' size-in-bits='320' id='39e1fe03'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='3213e875' size-in-bits='320' id='f5665670'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <type-decl name='bool' size-in-bits='8' id='c894953d'/>
      <array-type-def dimensions='1' type-id='531c24d0' size-in-bits='128' id='dcd9fb4c'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='380c7edc' size-in-bits='2432' id='dade5b69'>
        <subrange length='38' type-id='7ff19f0f' id='aa4ccdac'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f67e137c' size-in-bits='infinite' id='3f814540'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='162c1c01' size-in-bits='256' id='68694f49'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='cfff5953' size-in-bits='448' id='75781a60'>
        <subrange length='7' type-id='7ff19f0f' id='16fc326e'/>
      </array-type-def>
      <type-decl name='char' size-in-bits='8' id='a84c031d'/>
      <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='192' id='461c9ed2'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='4096' id='31147867'>
        <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1024' id='e3204322'>
        <subrange length='128' type-id='7ff19f0f' id='1eb1687a'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='128' id='ac1fa8c0'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='16384' id='41bf80f3'>
        <subrange length='2048' type-id='7ff19f0f' id='e5323efb'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='176' id='aa4fa8f1'>
        <subrange length='22' type-id='7ff19f0f' id='41cf2209'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='256' id='16dc656a'>
        <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='296' id='12e4ade3'>
        <subrange length='37' type-id='7ff19f0f' id='aa6426fb'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32768' id='d16c6df4'>
        <subrange length='4096' type-id='7ff19f0f' id='bc1b5ddc'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='448' id='6093ff7c'>
        <subrange length='56' type-id='7ff19f0f' id='f8137894'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' id='59daf3ef'>
        <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='48' id='4a008bc3'>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' id='8e100159'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='infinite' id='e84913bd'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <class-decl name='anon_vma' is-struct='yes' visibility='default' is-declaration-only='yes' id='14f332cc'/>
      <class-decl name='array_buffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='1984aef9'/>
      <class-decl name='assoc_array_ptr' is-struct='yes' visibility='default' is-declaration-only='yes' id='3249e303'/>
      <class-decl name='audit_context' is-struct='yes' visibility='default' is-declaration-only='yes' id='82d9d5d4'/>
      <class-decl name='badblocks' is-struct='yes' visibility='default' is-declaration-only='yes' id='cacf0f56'/>
      <class-decl name='bio_crypt_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='b545ce08'/>
      <class-decl name='blk_flush_queue' is-struct='yes' visibility='default' is-declaration-only='yes' id='1d120221'/>
      <class-decl name='blk_keyslot_manager' is-struct='yes' visibility='default' is-declaration-only='yes' id='13fcfe64'/>
      <class-decl name='blk_ksm_keyslot' is-struct='yes' visibility='default' is-declaration-only='yes' id='479d017a'/>
      <class-decl name='blk_mq_alloc_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='afd9eb4a'/>
      <class-decl name='blk_mq_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='cde99b39'/>
      <class-decl name='blk_mq_debugfs_attr' is-struct='yes' visibility='default' is-declaration-only='yes' id='d53ee986'/>
      <class-decl name='blk_mq_hw_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='e063028f'/>
      <class-decl name='blk_mq_ops' is-struct='yes' visibility='default' is-declaration-only='yes' id='b785b938'/>
      <class-decl name='blk_mq_tag_set' is-struct='yes' visibility='default' is-declaration-only='yes' id='651086d7'/>
      <class-decl name='blk_queue_stats' is-struct='yes' visibility='default' is-declaration-only='yes' id='99d089ec'/>
      <class-decl name='blk_stat_callback' is-struct='yes' visibility='default' is-declaration-only='yes' id='be8f4983'/>
      <class-decl name='bpf_cgroup_storage_map' is-struct='yes' visibility='default' is-declaration-only='yes' id='0ad68707'/>
      <class-decl name='bpf_prog' is-struct='yes' visibility='default' is-declaration-only='yes' id='facd5338'/>
      <class-decl name='bus_dma_region' is-struct='yes' visibility='default' is-declaration-only='yes' id='db9db9b1'/>
      <class-decl name='capture_control' is-struct='yes' visibility='default' is-declaration-only='yes' id='978e8e27'/>
      <class-decl name='cdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='22f86351'/>
      <class-decl name='cfs_rq' is-struct='yes' visibility='default' is-declaration-only='yes' id='feeb4c2f'/>
      <class-decl name='cgroup_taskset' is-struct='yes' visibility='default' is-declaration-only='yes' id='19596889'/>
      <class-decl name='cma' is-struct='yes' visibility='default' is-declaration-only='yes' id='6110442c'/>
      <class-decl name='compat_robust_list_head' is-struct='yes' visibility='default' is-declaration-only='yes' id='1b9c6d35'/>
      <class-decl name='dev_iommu' is-struct='yes' visibility='default' is-declaration-only='yes' id='db396bce'/>
      <class-decl name='dev_pm_qos' is-struct='yes' visibility='default' is-declaration-only='yes' id='7d93f824'/>
      <class-decl name='device_private' is-struct='yes' visibility='default' is-declaration-only='yes' id='d066d157'/>
      <class-decl name='disk_events' is-struct='yes' visibility='default' is-declaration-only='yes' id='ec1aac50'/>
      <class-decl name='disk_stats' is-struct='yes' visibility='default' is-declaration-only='yes' id='acfd9368'/>
      <class-decl name='driver_private' is-struct='yes' visibility='default' is-declaration-only='yes' id='e44b8083'/>
      <class-decl name='event_filter' is-struct='yes' visibility='default' is-declaration-only='yes' id='5ff1273a'/>
      <class-decl name='eventfd_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='77dc8383'/>
      <class-decl name='export_operations' is-struct='yes' visibility='default' is-declaration-only='yes' id='1a0c5572'/>
      <class-decl name='fiemap_extent_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='8ffe5745'/>
      <class-decl name='files_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='bccdf330'/>
      <class-decl name='fs_context' is-struct='yes' visibility='default' is-declaration-only='yes' id='8d0295a2'/>
      <class-decl name='fs_parameter_spec' is-struct='yes' visibility='default' is-declaration-only='yes' id='077208d0'/>
      <class-decl name='fs_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='7dc87302'/>
      <class-decl name='fscrypt_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='9441bb37'/>
      <class-decl name='fscrypt_operations' is-struct='yes' visibility='default' is-declaration-only='yes' id='fa21a7e9'/>
      <class-decl name='fsnotify_mark_connector' is-struct='yes' visibility='default' is-declaration-only='yes' id='aadc8ce9'/>
      <class-decl name='fsverity_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='43489bca'/>
      <class-decl name='fsverity_operations' is-struct='yes' visibility='default' is-declaration-only='yes' id='5f0d764c'/>
      <class-decl name='futex_pi_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='62bd013f'/>
      <class-decl name='hd_geometry' is-struct='yes' visibility='default' is-declaration-only='yes' id='28e89e7e'/>
      <class-decl name='io_uring_task' is-struct='yes' visibility='default' is-declaration-only='yes' id='156a7d89'/>
      <class-decl name='iommu_group' is-struct='yes' visibility='default' is-declaration-only='yes' id='2352f3ae'/>
      <class-decl name='iommu_ops' is-struct='yes' visibility='default' is-declaration-only='yes' id='8b7a2cd1'/>
      <class-decl name='iov_iter' is-struct='yes' visibility='default' is-declaration-only='yes' id='f2b4d088'/>
      <class-decl name='ipc_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='dd74f3ed'/>
      <class-decl name='irq_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='a667f60e'/>
      <class-decl name='kernfs_iattrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='7b5435ce'/>
      <class-decl name='kernfs_open_node' is-struct='yes' visibility='default' is-declaration-only='yes' id='cc9b8e48'/>
      <class-decl name='key_type' is-struct='yes' visibility='default' is-declaration-only='yes' id='71e87d49'/>
      <class-decl name='key_user' is-struct='yes' visibility='default' is-declaration-only='yes' id='696d238e'/>
      <class-decl name='kioctx_table' is-struct='yes' visibility='default' is-declaration-only='yes' id='5d0f15d4'/>
      <class-decl name='kmem_cache' is-struct='yes' visibility='default' is-declaration-only='yes' id='a3119fea'/>
      <class-decl name='kstatfs' is-struct='yes' visibility='default' is-declaration-only='yes' id='ff1c7c9b'/>
      <class-decl name='ldt_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='c8d30e55'/>
      <class-decl name='linux_binfmt' is-struct='yes' visibility='default' is-declaration-only='yes' id='47d6e76e'/>
      <class-decl name='mmu_notifier_subscriptions' is-struct='yes' visibility='default' is-declaration-only='yes' id='b7e6b484'/>
      <class-decl name='mnt_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='de031042'/>
      <class-decl name='module_notes_attrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='96b6b914'/>
      <class-decl name='module_param_attrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='9e045430'/>
      <class-decl name='module_sect_attrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='b43b0dce'/>
      <class-decl name='msi_desc' is-struct='yes' visibility='default' is-declaration-only='yes' id='d2b46ce8'/>
      <class-decl name='msi_msg' is-struct='yes' visibility='default' is-declaration-only='yes' id='03ba410a'/>
      <class-decl name='mtd_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='25dc4075'/>
      <class-decl name='nameidata' is-struct='yes' visibility='default' is-declaration-only='yes' id='0319fc05'/>
      <class-decl name='net' is-struct='yes' visibility='default' is-declaration-only='yes' id='bd965180'/>
      <class-decl name='nfs4_lock_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='a558a366'/>
      <class-decl name='nlm_lockowner' is-struct='yes' visibility='default' is-declaration-only='yes' id='92afe5f3'/>
      <class-decl name='perf_buffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='2d5955d9'/>
      <class-decl name='pipe_inode_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='bed94322'/>
      <class-decl name='posix_acl' is-struct='yes' visibility='default' is-declaration-only='yes' id='605b61bb'/>
      <class-decl name='pr_ops' is-struct='yes' visibility='default' is-declaration-only='yes' id='b45c773c'/>
      <class-decl name='proc_dir_entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='fe4ffa7a'/>
      <class-decl name='proc_ns_operations' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ba71bf0'/>
      <class-decl name='rcu_node' is-struct='yes' visibility='default' is-declaration-only='yes' id='67b24a02'/>
      <class-decl name='reclaim_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='b9b792e2'/>
      <class-decl name='ring_buffer_iter' is-struct='yes' visibility='default' is-declaration-only='yes' id='563595d9'/>
      <class-decl name='robust_list_head' is-struct='yes' visibility='default' is-declaration-only='yes' id='999b38a0'/>
      <class-decl name='rq_qos' is-struct='yes' visibility='default' is-declaration-only='yes' id='e0a68fea'/>
      <class-decl name='rt_mutex_waiter' is-struct='yes' visibility='default' is-declaration-only='yes' id='afb04a62'/>
      <class-decl name='sched_class' is-struct='yes' visibility='default' is-declaration-only='yes' id='74191d27'/>
      <class-decl name='seccomp_filter' is-struct='yes' visibility='default' is-declaration-only='yes' id='e290c28c'/>
      <class-decl name='sock' is-struct='yes' visibility='default' is-declaration-only='yes' id='a240f41d'/>
      <class-decl name='static_key_mod' is-struct='yes' visibility='default' is-declaration-only='yes' id='5081ed08'/>
      <class-decl name='subsys_private' is-struct='yes' visibility='default' is-declaration-only='yes' id='4a19d21e'/>
      <class-decl name='swap_info_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='3eb82749'/>
      <class-decl name='task_delay_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='32197ce9'/>
      <class-decl name='task_group' is-struct='yes' visibility='default' is-declaration-only='yes' id='2d863538'/>
      <class-decl name='time_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='5deff74c'/>
      <class-decl name='timer_rand_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='f308a7ce'/>
      <class-decl name='trace_array' is-struct='yes' visibility='default' is-declaration-only='yes' id='e27b4e90'/>
      <class-decl name='tracer' is-struct='yes' visibility='default' is-declaration-only='yes' id='fd1f8b7c'/>
      <class-decl name='tty_audit_buf' is-struct='yes' visibility='default' is-declaration-only='yes' id='9127cd0e'/>
      <class-decl name='tty_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='4c8d9cac'/>
      <class-decl name='unicode_map' is-struct='yes' visibility='default' is-declaration-only='yes' id='a24978a1'/>
      <class-decl name='uprobe' is-struct='yes' visibility='default' is-declaration-only='yes' id='b7e0fed2'/>
      <class-decl name='userfaultfd_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='526b1662'/>
      <class-decl name='uts_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='44f52e9d'/>
      <class-decl name='vfsmount' is-struct='yes' visibility='default' is-declaration-only='yes' id='19e88833'/>
      <class-decl name='wake_irq' is-struct='yes' visibility='default' is-declaration-only='yes' id='4657336c'/>
      <class-decl name='workqueue_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='a5159c01'/>
      <class-decl name='xattr_handler' is-struct='yes' visibility='default' is-declaration-only='yes' id='2d3dd5e3'/>
      <class-decl name='xol_area' is-struct='yes' visibility='default' is-declaration-only='yes' id='c39df2b8'/>
      <array-type-def dimensions='1' type-id='bd561d05' size-in-bits='192' id='59bd9302'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='47841236' size-in-bits='256' id='bb2d0d4e'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='1354385d' size-in-bits='64' id='db98c084'>
        <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='9d622a50' size-in-bits='192' id='bad020e9'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='39ec6fe5' size-in-bits='9152' id='be1ad65f'>
        <subrange length='11' type-id='7ff19f0f' id='847bc017'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='84dc82b7' size-in-bits='infinite' id='f7aeb09b'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e151255a' size-in-bits='256' id='fc3a8480'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e151255a' size-in-bits='4096' id='53b70d6c'>
        <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='03a4a074' size-in-bits='512' id='3f6e320a'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='1851ab9f' size-in-bits='4096' id='cb01bf4b'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7e666abe' size-in-bits='192' id='e6ff92fb'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
      <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='320' id='b7bd1749'>
        <subrange length='10' type-id='7ff19f0f' id='487da03a'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='128' id='2020bac4'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a21c4412' size-in-bits='16384' id='02d77f24'>
        <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='094d8048' size-in-bits='infinite' id='da6e2919'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='72f469ec' size-in-bits='4864' id='3b873ed1'>
        <subrange length='38' type-id='7ff19f0f' id='aa4ccdac'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='72f469ec' size-in-bits='512' id='a8e1fb22'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='72f469ec' size-in-bits='640' id='e4e01aff'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='72f469ec' size-in-bits='768' id='e4e6d6c4'>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='72f469ec' size-in-bits='896' id='a8e439b9'>
        <subrange length='7' type-id='7ff19f0f' id='16fc326e'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f6507b0a' size-in-bits='infinite' id='b969bd7a'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='47479831' id='9c02e2a6'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
      <array-type-def dimensions='1' type-id='bd54fe1a' size-in-bits='2368' id='8f03feb8'>
        <subrange length='37' type-id='7ff19f0f' id='aa6426fb'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='bd54fe1a' size-in-bits='2560' id='4d41a616'>
        <subrange length='40' type-id='7ff19f0f' id='8f80b239'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='bd54fe1a' size-in-bits='256' id='5d4602e8'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
      <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
      <array-type-def dimensions='1' type-id='97851996' size-in-bits='infinite' id='687d975e'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='ad98c82f' size-in-bits='infinite' id='31f1649b'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='b0690d78' size-in-bits='1728' id='83ae09a1'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='aac38d0b' size-in-bits='1280' id='f53c5bdb'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='b92c8d0d' size-in-bits='1280' id='aca5b9e5'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='ce848ab1' size-in-bits='2304' id='a09ef5a6'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='c25adaa0' size-in-bits='infinite' id='6b9809bc'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='2bf16f59' size-in-bits='128' id='e0f8c0f3'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='2bf16f59' size-in-bits='256' id='a4f3e551'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='b9419dc5' size-in-bits='128' id='c7e7059f'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='b94e5398' size-in-bits='256' id='3449295e'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e710f78e' size-in-bits='576' id='0e685653'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e878d564' size-in-bits='1344' id='55d1e02d'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='3fbb40da' size-in-bits='infinite' id='7c4ce442'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='2a8a6332' size-in-bits='384' id='d46544fa'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='60dcbf6c' size-in-bits='2048' id='80f344e1'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='fdbf7a0f' size-in-bits='96' id='9ea8c1bf'>
        <subrange length='12' type-id='7ff19f0f' id='84827bdc'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='fdbf7a0f' size-in-bits='296' id='c43f382c'>
        <subrange length='37' type-id='7ff19f0f' id='aa6426fb'/>
      </array-type-def>
      <type-decl name='short int' size-in-bits='16' id='a2185560'/>
      <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
      <array-type-def dimensions='1' type-id='8dee6d89' size-in-bits='192' id='2f7565c6'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='56798c81' size-in-bits='2304' id='01115b96'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f23e2572' size-in-bits='1024' id='2a143e6f'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='384' id='030879c0'>
        <subrange length='12' type-id='7ff19f0f' id='84827bdc'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='640' id='bd3c8c13'>
        <subrange length='20' type-id='7ff19f0f' id='fdca39cf'/>
      </array-type-def>
      <array-type-def dimensions='2' type-id='19c2251e' size-in-bits='384' id='4e00dfcd'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='1024' id='6dcfc3c6'>
        <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='1216' id='69e7c260'>
        <subrange length='38' type-id='7ff19f0f' id='aa4ccdac'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='160' id='586ea944'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='2048' id='48be0cbb'>
        <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='192' id='5867ed7f'>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='128' id='24a375b2'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='2' type-id='91ce1af9' size-in-bits='640' id='a4295685'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='2048' id='ef7c8fe9'>
        <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='192' id='20a130cf'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='320' id='64af1365'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='4096' id='4b516a9c'>
        <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='384' id='64acd4ce'>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='512' id='6094c99c'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='infinite' id='09b35382'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='24' id='930ea9f9'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='32768' id='cd367bc1'>
        <subrange length='4096' type-id='7ff19f0f' id='bc1b5ddc'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='512' id='47ba3182'>
        <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='infinite' id='29c3368c'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='0888126c' size-in-bits='64' id='c6e3c250'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a9d71093' size-in-bits='480' id='df6d2206'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
      <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
      <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='256' id='fc872715'>
        <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f0981eeb' size-in-bits='128' id='49580a63'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='65536' id='e3e3fc30'>
        <subrange length='1024' type-id='7ff19f0f' id='c60446f8'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='64' id='f066dd3c'>
        <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='128' id='f05e8e77'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='192' id='3461381a'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='2944' id='d964a553'>
        <subrange length='46' type-id='7ff19f0f' id='8b86bc1b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='256' id='f46d9f4d'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='2' type-id='7359adad' size-in-bits='1280' id='15030b38'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <array-type-def dimensions='2' type-id='7359adad' size-in-bits='960' id='625e8699'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='5888' id='3946fddc'>
        <subrange length='92' type-id='7ff19f0f' id='1deb94f4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='infinite' id='c99b5ecd'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
      <array-type-def dimensions='1' type-id='120c01b5' size-in-bits='128' id='9a69aeec'>
        <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='2ae08426' size-in-bits='256' id='ae25b7bc'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='128' id='24ae0315'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='256' id='209ef23f'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='be9189df' size-in-bits='51200' id='839d9607'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='459f31a7' size-in-bits='640' id='9509a9de'>
        <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='caf9c470' size-in-bits='640' id='7eec0d6b'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <class-decl name='irq_desc' size-in-bits='4096' is-struct='yes' visibility='default' filepath='include/linux/irqdesc.h' line='55' column='1' id='911b5feb'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='irq_common_data' type-id='f1a268ec' visibility='default' filepath='include/linux/irqdesc.h' line='56' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='irq_data' type-id='064acd7a' visibility='default' filepath='include/linux/irqdesc.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='kstat_irqs' type-id='807869d3' visibility='default' filepath='include/linux/irqdesc.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='handle_irq' type-id='cdb741d3' visibility='default' filepath='include/linux/irqdesc.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='action' type-id='ba361e53' visibility='default' filepath='include/linux/irqdesc.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='status_use_accessors' type-id='f0981eeb' visibility='default' filepath='include/linux/irqdesc.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='992'>
          <var-decl name='core_internal_state__do_not_mess_with_it' type-id='f0981eeb' visibility='default' filepath='include/linux/irqdesc.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='depth' type-id='f0981eeb' visibility='default' filepath='include/linux/irqdesc.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1056'>
          <var-decl name='wake_depth' type-id='f0981eeb' visibility='default' filepath='include/linux/irqdesc.h' line='64' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='tot_count' type-id='f0981eeb' visibility='default' filepath='include/linux/irqdesc.h' line='65' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1120'>
          <var-decl name='irq_count' type-id='f0981eeb' visibility='default' filepath='include/linux/irqdesc.h' line='66' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='last_unhandled' type-id='7359adad' visibility='default' filepath='include/linux/irqdesc.h' line='67' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='irqs_unhandled' type-id='f0981eeb' visibility='default' filepath='include/linux/irqdesc.h' line='68' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1248'>
          <var-decl name='threads_handled' type-id='49178f86' visibility='default' filepath='include/linux/irqdesc.h' line='69' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='threads_handled_last' type-id='95e97e5e' visibility='default' filepath='include/linux/irqdesc.h' line='70' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1312'>
          <var-decl name='lock' type-id='f5c90b3f' visibility='default' filepath='include/linux/irqdesc.h' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='percpu_enabled' type-id='74bccedd' visibility='default' filepath='include/linux/irqdesc.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='percpu_affinity' type-id='5f8a1ac4' visibility='default' filepath='include/linux/irqdesc.h' line='73' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='affinity_hint' type-id='5f8a1ac4' visibility='default' filepath='include/linux/irqdesc.h' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='affinity_notify' type-id='7ca8e198' visibility='default' filepath='include/linux/irqdesc.h' line='76' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='pending_mask' type-id='b16b461b' visibility='default' filepath='include/linux/irqdesc.h' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='threads_oneshot' type-id='7359adad' visibility='default' filepath='include/linux/irqdesc.h' line='81' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='threads_active' type-id='49178f86' visibility='default' filepath='include/linux/irqdesc.h' line='82' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='wait_for_threads' type-id='b5ab048f' visibility='default' filepath='include/linux/irqdesc.h' line='83' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='nr_actions' type-id='f0981eeb' visibility='default' filepath='include/linux/irqdesc.h' line='85' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2016'>
          <var-decl name='no_suspend_depth' type-id='f0981eeb' visibility='default' filepath='include/linux/irqdesc.h' line='86' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='cond_suspend_depth' type-id='f0981eeb' visibility='default' filepath='include/linux/irqdesc.h' line='87' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2080'>
          <var-decl name='force_resume_depth' type-id='f0981eeb' visibility='default' filepath='include/linux/irqdesc.h' line='88' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='dir' type-id='d077e928' visibility='default' filepath='include/linux/irqdesc.h' line='91' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='include/linux/irqdesc.h' line='98' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='kobj' type-id='b6ab8849' visibility='default' filepath='include/linux/irqdesc.h' line='99' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='request_mutex' type-id='925167dc' visibility='default' filepath='include/linux/irqdesc.h' line='101' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3456'>
          <var-decl name='parent_irq' type-id='95e97e5e' visibility='default' filepath='include/linux/irqdesc.h' line='102' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3520'>
          <var-decl name='owner' type-id='2730d015' visibility='default' filepath='include/linux/irqdesc.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3584'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/irqdesc.h' line='104' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='irq_common_data' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/irq.h' line='147' column='1' id='f1a268ec'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='state_use_accessors' type-id='f0981eeb' visibility='default' filepath='include/linux/irq.h' line='148' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='handler_data' type-id='eaa32e2f' visibility='default' filepath='include/linux/irq.h' line='152' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='msi_desc' type-id='b11825ce' visibility='default' filepath='include/linux/irq.h' line='153' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='affinity' type-id='b16b461b' visibility='default' filepath='include/linux/irq.h' line='154' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='effective_affinity' type-id='b16b461b' visibility='default' filepath='include/linux/irq.h' line='156' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='cpumask_var_t' type-id='db98c084' filepath='include/linux/cpumask.h' line='756' column='1' id='b16b461b'/>
      <class-decl name='cpumask' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/cpumask.h' line='17' column='1' id='1354385d'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='bits' type-id='f066dd3c' visibility='default' filepath='include/linux/cpumask.h' line='17' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='irq_data' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/irq.h' line='177' column='1' id='064acd7a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='mask' type-id='19c2251e' visibility='default' filepath='include/linux/irq.h' line='178' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='irq' type-id='f0981eeb' visibility='default' filepath='include/linux/irq.h' line='179' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='hwirq' type-id='7359adad' visibility='default' filepath='include/linux/irq.h' line='180' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='common' type-id='a4a39eba' visibility='default' filepath='include/linux/irq.h' line='181' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='chip' type-id='8846a616' visibility='default' filepath='include/linux/irq.h' line='182' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='domain' type-id='7544e824' visibility='default' filepath='include/linux/irq.h' line='183' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='parent_data' type-id='1c475548' visibility='default' filepath='include/linux/irq.h' line='185' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='chip_data' type-id='eaa32e2f' visibility='default' filepath='include/linux/irq.h' line='187' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='u32' type-id='3f1a6b60' filepath='include/asm-generic/int-ll64.h' line='21' column='1' id='19c2251e'/>
      <typedef-decl name='__u32' type-id='f0981eeb' filepath='include/uapi/asm-generic/int-ll64.h' line='27' column='1' id='3f1a6b60'/>
      <class-decl name='irq_chip' size-in-bits='2304' is-struct='yes' visibility='default' filepath='include/linux/irq.h' line='505' column='1' id='0f5f7920'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='parent_device' type-id='fa0b179b' visibility='default' filepath='include/linux/irq.h' line='506' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/irq.h' line='507' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='irq_startup' type-id='1cb2627d' visibility='default' filepath='include/linux/irq.h' line='508' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='irq_shutdown' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='509' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='irq_enable' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='510' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='irq_disable' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='511' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='irq_ack' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='513' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='irq_mask' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='514' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='irq_mask_ack' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='515' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='irq_unmask' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='516' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='irq_eoi' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='517' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='irq_set_affinity' type-id='d72a0292' visibility='default' filepath='include/linux/irq.h' line='519' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='irq_retrigger' type-id='ed9f97a6' visibility='default' filepath='include/linux/irq.h' line='520' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='irq_set_type' type-id='f3bd9244' visibility='default' filepath='include/linux/irq.h' line='521' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='irq_set_wake' type-id='f3bd9244' visibility='default' filepath='include/linux/irq.h' line='522' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='irq_bus_lock' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='524' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='irq_bus_sync_unlock' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='525' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='irq_cpu_online' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='527' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='irq_cpu_offline' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='528' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='irq_suspend' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='530' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='irq_resume' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='531' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='irq_pm_shutdown' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='532' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='irq_calc_mask' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='534' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='irq_print_chip' type-id='9438aa05' visibility='default' filepath='include/linux/irq.h' line='536' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='irq_request_resources' type-id='ed9f97a6' visibility='default' filepath='include/linux/irq.h' line='537' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='irq_release_resources' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='538' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='irq_compose_msi_msg' type-id='3a3e6b6c' visibility='default' filepath='include/linux/irq.h' line='540' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='irq_write_msi_msg' type-id='3a3e6b6c' visibility='default' filepath='include/linux/irq.h' line='541' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='irq_get_irqchip_state' type-id='f12b668c' visibility='default' filepath='include/linux/irq.h' line='543' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='irq_set_irqchip_state' type-id='ecf8d02d' visibility='default' filepath='include/linux/irq.h' line='544' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='irq_set_vcpu_affinity' type-id='cb5b8228' visibility='default' filepath='include/linux/irq.h' line='546' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='ipi_send_single' type-id='19c5fc2b' visibility='default' filepath='include/linux/irq.h' line='548' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='ipi_send_mask' type-id='eb0bccd8' visibility='default' filepath='include/linux/irq.h' line='549' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='irq_nmi_setup' type-id='ed9f97a6' visibility='default' filepath='include/linux/irq.h' line='551' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='irq_nmi_teardown' type-id='185ccd91' visibility='default' filepath='include/linux/irq.h' line='552' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='flags' type-id='7359adad' visibility='default' filepath='include/linux/irq.h' line='554' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='device' size-in-bits='6912' is-struct='yes' visibility='default' filepath='include/linux/device.h' line='459' column='1' id='66e487eb'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='kobj' type-id='b6ab8849' visibility='default' filepath='include/linux/device.h' line='460' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='parent' type-id='fa0b179b' visibility='default' filepath='include/linux/device.h' line='461' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='p' type-id='0d3b0dcf' visibility='default' filepath='include/linux/device.h' line='463' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='init_name' type-id='80f4b756' visibility='default' filepath='include/linux/device.h' line='465' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='type' type-id='cd28613b' visibility='default' filepath='include/linux/device.h' line='466' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='bus' type-id='5e2671f8' visibility='default' filepath='include/linux/device.h' line='468' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='driver' type-id='00c7b870' visibility='default' filepath='include/linux/device.h' line='469' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='platform_data' type-id='eaa32e2f' visibility='default' filepath='include/linux/device.h' line='471' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='driver_data' type-id='eaa32e2f' visibility='default' filepath='include/linux/device.h' line='473' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='mutex' type-id='925167dc' visibility='default' filepath='include/linux/device.h' line='478' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='links' type-id='2d178f63' visibility='default' filepath='include/linux/device.h' line='482' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='power' type-id='f3166b6b' visibility='default' filepath='include/linux/device.h' line='483' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4864'>
          <var-decl name='pm_domain' type-id='a4375c03' visibility='default' filepath='include/linux/device.h' line='484' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4928'>
          <var-decl name='msi_domain' type-id='7544e824' visibility='default' filepath='include/linux/device.h' line='491' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4992'>
          <var-decl name='msi_list' type-id='72f469ec' visibility='default' filepath='include/linux/device.h' line='497' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5120'>
          <var-decl name='dma_mask' type-id='3df9fd28' visibility='default' filepath='include/linux/device.h' line='502' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5184'>
          <var-decl name='coherent_dma_mask' type-id='91ce1af9' visibility='default' filepath='include/linux/device.h' line='503' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5248'>
          <var-decl name='bus_dma_limit' type-id='91ce1af9' visibility='default' filepath='include/linux/device.h' line='508' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5312'>
          <var-decl name='dma_range_map' type-id='fdd592fa' visibility='default' filepath='include/linux/device.h' line='509' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5376'>
          <var-decl name='dma_parms' type-id='9b4aaf1f' visibility='default' filepath='include/linux/device.h' line='511' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5440'>
          <var-decl name='dma_pools' type-id='72f469ec' visibility='default' filepath='include/linux/device.h' line='513' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5568'>
          <var-decl name='cma_area' type-id='6f67b38a' visibility='default' filepath='include/linux/device.h' line='520' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5632'>
          <var-decl name='archdata' type-id='d3e142f5' visibility='default' filepath='include/linux/device.h' line='524' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5632'>
          <var-decl name='of_node' type-id='9a537bbe' visibility='default' filepath='include/linux/device.h' line='526' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5696'>
          <var-decl name='fwnode' type-id='4a935625' visibility='default' filepath='include/linux/device.h' line='527' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5760'>
          <var-decl name='devt' type-id='8504f260' visibility='default' filepath='include/linux/device.h' line='532' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5792'>
          <var-decl name='id' type-id='19c2251e' visibility='default' filepath='include/linux/device.h' line='533' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5824'>
          <var-decl name='devres_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/device.h' line='535' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5888'>
          <var-decl name='devres_head' type-id='72f469ec' visibility='default' filepath='include/linux/device.h' line='536' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6016'>
          <var-decl name='class' type-id='67aca04f' visibility='default' filepath='include/linux/device.h' line='538' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6080'>
          <var-decl name='groups' type-id='c97de1ac' visibility='default' filepath='include/linux/device.h' line='539' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6144'>
          <var-decl name='release' type-id='dd787f72' visibility='default' filepath='include/linux/device.h' line='541' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6208'>
          <var-decl name='iommu_group' type-id='0b19fc54' visibility='default' filepath='include/linux/device.h' line='542' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6272'>
          <var-decl name='iommu' type-id='12ad7b84' visibility='default' filepath='include/linux/device.h' line='543' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='offline_disabled' type-id='b50a4934' visibility='default' filepath='include/linux/device.h' line='545' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1'>
          <var-decl name='offline' type-id='b50a4934' visibility='default' filepath='include/linux/device.h' line='546' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2'>
          <var-decl name='of_node_reused' type-id='b50a4934' visibility='default' filepath='include/linux/device.h' line='547' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3'>
          <var-decl name='state_synced' type-id='b50a4934' visibility='default' filepath='include/linux/device.h' line='548' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6400'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/device.h' line='557' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6464'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/device.h' line='558' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6528'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='include/linux/device.h' line='559' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6592'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='include/linux/device.h' line='560' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6656'>
          <var-decl name='android_kabi_reserved5' type-id='91ce1af9' visibility='default' filepath='include/linux/device.h' line='561' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6720'>
          <var-decl name='android_kabi_reserved6' type-id='91ce1af9' visibility='default' filepath='include/linux/device.h' line='562' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6784'>
          <var-decl name='android_kabi_reserved7' type-id='91ce1af9' visibility='default' filepath='include/linux/device.h' line='563' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6848'>
          <var-decl name='android_kabi_reserved8' type-id='91ce1af9' visibility='default' filepath='include/linux/device.h' line='564' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kobject' size-in-bits='768' is-struct='yes' visibility='default' filepath='include/linux/kobject.h' line='65' column='1' id='b6ab8849'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/kobject.h' line='66' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='entry' type-id='72f469ec' visibility='default' filepath='include/linux/kobject.h' line='67' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='parent' type-id='d30bdc51' visibility='default' filepath='include/linux/kobject.h' line='68' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='kset' type-id='89b70200' visibility='default' filepath='include/linux/kobject.h' line='69' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='ktype' type-id='c48b394e' visibility='default' filepath='include/linux/kobject.h' line='70' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='sd' type-id='150efd3f' visibility='default' filepath='include/linux/kobject.h' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='kref' type-id='400fb07b' visibility='default' filepath='include/linux/kobject.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='state_initialized' type-id='f0981eeb' visibility='default' filepath='include/linux/kobject.h' line='76' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1'>
          <var-decl name='state_in_sysfs' type-id='f0981eeb' visibility='default' filepath='include/linux/kobject.h' line='77' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2'>
          <var-decl name='state_add_uevent_sent' type-id='f0981eeb' visibility='default' filepath='include/linux/kobject.h' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3'>
          <var-decl name='state_remove_uevent_sent' type-id='f0981eeb' visibility='default' filepath='include/linux/kobject.h' line='79' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4'>
          <var-decl name='uevent_suppress' type-id='f0981eeb' visibility='default' filepath='include/linux/kobject.h' line='80' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='82' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='83' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='84' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='85' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/types.h' line='178' column='1' id='72f469ec'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='next' type-id='e84b031a' visibility='default' filepath='include/linux/types.h' line='179' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='prev' type-id='e84b031a' visibility='default' filepath='include/linux/types.h' line='179' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kset' size-in-bits='1280' is-struct='yes' visibility='default' filepath='include/linux/kobject.h' line='203' column='1' id='8cf069a2'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='include/linux/kobject.h' line='204' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='list_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/kobject.h' line='205' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='kobj' type-id='b6ab8849' visibility='default' filepath='include/linux/kobject.h' line='206' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='uevent_ops' type-id='86462700' visibility='default' filepath='include/linux/kobject.h' line='207' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='209' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='210' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='211' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='212' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='spinlock_t' type-id='53fb272e' filepath='include/linux/spinlock_types.h' line='83' column='1' id='fb4018a0'/>
      <class-decl name='spinlock' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/linux/spinlock_types.h' line='71' column='1' id='53fb272e'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='' type-id='1076cffc' visibility='default' filepath='include/linux/spinlock_types.h' line='72' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='include/linux/spinlock_types.h' line='72' column='1' id='1076cffc'>
        <data-member access='public'>
          <var-decl name='rlock' type-id='f106d0e5' visibility='default' filepath='include/linux/spinlock_types.h' line='73' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='raw_spinlock' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/linux/spinlock_types.h' line='20' column='1' id='f106d0e5'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='raw_lock' type-id='641c41d1' visibility='default' filepath='include/linux/spinlock_types.h' line='21' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='arch_spinlock_t' type-id='c167abfb' filepath='include/asm-generic/qspinlock_types.h' line='44' column='1' id='641c41d1'/>
      <class-decl name='qspinlock' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='14' column='1' id='c167abfb'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='' type-id='16e927d3' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='15' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__1' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='15' column='1' id='16e927d3'>
        <data-member access='public'>
          <var-decl name='val' type-id='49178f86' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='16' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='' type-id='e56340ee' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='24' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='' type-id='33729b5d' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='28' column='1'/>
        </data-member>
      </union-decl>
      <typedef-decl name='atomic_t' type-id='79faeff3' filepath='include/linux/types.h' line='168' column='1' id='49178f86'/>
      <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='49178f86' visibility='default' filepath='include/linux/types.h' line='166' column='1' id='79faeff3'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='counter' type-id='95e97e5e' visibility='default' filepath='include/linux/types.h' line='167' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__1' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='24' column='1' id='e56340ee'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='locked' type-id='f9b06939' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='25' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='pending' type-id='f9b06939' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='26' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='u8' type-id='8f048e17' filepath='include/asm-generic/int-ll64.h' line='17' column='1' id='f9b06939'/>
      <typedef-decl name='__u8' type-id='002ac4a6' filepath='include/uapi/asm-generic/int-ll64.h' line='21' column='1' id='8f048e17'/>
      <class-decl name='__anonymous_struct__2' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='28' column='1' id='33729b5d'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='locked_pending' type-id='1dc6a898' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='tail' type-id='1dc6a898' visibility='default' filepath='include/asm-generic/qspinlock_types.h' line='30' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='u16' type-id='d315442e' filepath='include/asm-generic/int-ll64.h' line='19' column='1' id='1dc6a898'/>
      <typedef-decl name='__u16' type-id='8efea9e5' filepath='include/uapi/asm-generic/int-ll64.h' line='24' column='1' id='d315442e'/>
      <class-decl name='kset_uevent_ops' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/kobject.h' line='167' column='1' id='9f6abc71'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='filter' type-id='2a3ad845' visibility='default' filepath='include/linux/kobject.h' line='168' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='name' type-id='1ea91ded' visibility='default' filepath='include/linux/kobject.h' line='169' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='uevent' type-id='9125ffcd' visibility='default' filepath='include/linux/kobject.h' line='170' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kobj_uevent_env' size-in-bits='20736' is-struct='yes' visibility='default' filepath='include/linux/kobject.h' line='159' column='1' id='a5179659'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='argv' type-id='461c9ed2' visibility='default' filepath='include/linux/kobject.h' line='160' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='envp' type-id='31147867' visibility='default' filepath='include/linux/kobject.h' line='161' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4288'>
          <var-decl name='envp_idx' type-id='95e97e5e' visibility='default' filepath='include/linux/kobject.h' line='162' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4320'>
          <var-decl name='buf' type-id='41bf80f3' visibility='default' filepath='include/linux/kobject.h' line='163' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='20704'>
          <var-decl name='buflen' type-id='95e97e5e' visibility='default' filepath='include/linux/kobject.h' line='164' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='u64' type-id='d3130597' filepath='include/asm-generic/int-ll64.h' line='23' column='1' id='91ce1af9'/>
      <typedef-decl name='__u64' type-id='3a47d82b' filepath='include/uapi/asm-generic/int-ll64.h' line='31' column='1' id='d3130597'/>
      <class-decl name='kobj_type' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/linux/kobject.h' line='144' column='1' id='1a08fab8'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='release' type-id='aa377a8c' visibility='default' filepath='include/linux/kobject.h' line='145' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='sysfs_ops' type-id='ebd313ed' visibility='default' filepath='include/linux/kobject.h' line='146' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='default_attrs' type-id='862c676f' visibility='default' filepath='include/linux/kobject.h' line='147' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='default_groups' type-id='c97de1ac' visibility='default' filepath='include/linux/kobject.h' line='148' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='child_ns_type' type-id='10f0a819' visibility='default' filepath='include/linux/kobject.h' line='149' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='namespace' type-id='9c1150bc' visibility='default' filepath='include/linux/kobject.h' line='150' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='get_ownership' type-id='96b6fff2' visibility='default' filepath='include/linux/kobject.h' line='151' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='153' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='154' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='155' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='include/linux/kobject.h' line='156' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='sysfs_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/sysfs.h' line='230' column='1' id='e7826ffa'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='show' type-id='434e45fe' visibility='default' filepath='include/linux/sysfs.h' line='231' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='store' type-id='855e70d2' visibility='default' filepath='include/linux/sysfs.h' line='232' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='ssize_t' type-id='b6b3ebaf' filepath='include/linux/types.h' line='60' column='1' id='79a0948f'/>
      <typedef-decl name='__kernel_ssize_t' type-id='6a11bd61' filepath='include/uapi/asm-generic/posix_types.h' line='73' column='1' id='b6b3ebaf'/>
      <typedef-decl name='__kernel_long_t' type-id='bd54fe1a' filepath='include/uapi/asm-generic/posix_types.h' line='15' column='1' id='6a11bd61'/>
      <class-decl name='attribute' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/sysfs.h' line='30' column='1' id='a6222917'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/sysfs.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mode' type-id='2594b00f' visibility='default' filepath='include/linux/sysfs.h' line='32' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='umode_t' type-id='8efea9e5' filepath='include/linux/types.h' line='19' column='1' id='2594b00f'/>
      <typedef-decl name='size_t' type-id='9e19ad6e' filepath='include/linux/types.h' line='55' column='1' id='b59d7dce'/>
      <typedef-decl name='__kernel_size_t' type-id='447da2ae' filepath='include/uapi/asm-generic/posix_types.h' line='72' column='1' id='9e19ad6e'/>
      <typedef-decl name='__kernel_ulong_t' type-id='7359adad' filepath='include/uapi/asm-generic/posix_types.h' line='16' column='1' id='447da2ae'/>
      <class-decl name='attribute_group' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/sysfs.h' line='84' column='1' id='e4af473b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/sysfs.h' line='85' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='is_visible' type-id='f69fcfe1' visibility='default' filepath='include/linux/sysfs.h' line='86' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='is_bin_visible' type-id='cc3e2efb' visibility='default' filepath='include/linux/sysfs.h' line='88' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='attrs' type-id='862c676f' visibility='default' filepath='include/linux/sysfs.h' line='90' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='bin_attrs' type-id='87d62959' visibility='default' filepath='include/linux/sysfs.h' line='91' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='bin_attribute' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/sysfs.h' line='168' column='1' id='d83a2db1'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='attr' type-id='a6222917' visibility='default' filepath='include/linux/sysfs.h' line='169' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='include/linux/sysfs.h' line='170' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='private' type-id='eaa32e2f' visibility='default' filepath='include/linux/sysfs.h' line='171' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='read' type-id='afa767ca' visibility='default' filepath='include/linux/sysfs.h' line='172' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='write' type-id='afa767ca' visibility='default' filepath='include/linux/sysfs.h' line='174' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='mmap' type-id='a02c170c' visibility='default' filepath='include/linux/sysfs.h' line='176' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='file' size-in-bits='2368' is-struct='yes' visibility='default' filepath='include/linux/fs.h' line='931' column='1' id='b4b8adeb'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='f_u' type-id='8c8e2781' visibility='default' filepath='include/linux/fs.h' line='935' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='f_path' type-id='b5382ece' visibility='default' filepath='include/linux/fs.h' line='936' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='f_inode' type-id='7e666abe' visibility='default' filepath='include/linux/fs.h' line='937' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='f_op' type-id='61758ee5' visibility='default' filepath='include/linux/fs.h' line='938' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='f_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/fs.h' line='944' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='f_write_hint' type-id='0d20c3dd' visibility='default' filepath='include/linux/fs.h' line='945' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='f_count' type-id='f22a8abb' visibility='default' filepath='include/linux/fs.h' line='946' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='f_flags' type-id='f0981eeb' visibility='default' filepath='include/linux/fs.h' line='947' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='544'>
          <var-decl name='f_mode' type-id='2665334e' visibility='default' filepath='include/linux/fs.h' line='948' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='f_pos_lock' type-id='925167dc' visibility='default' filepath='include/linux/fs.h' line='949' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='f_pos' type-id='69bf7bee' visibility='default' filepath='include/linux/fs.h' line='950' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='f_owner' type-id='6b640edd' visibility='default' filepath='include/linux/fs.h' line='951' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='f_cred' type-id='bc33861a' visibility='default' filepath='include/linux/fs.h' line='952' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='f_ra' type-id='b31f003f' visibility='default' filepath='include/linux/fs.h' line='953' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='f_version' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='955' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='f_security' type-id='eaa32e2f' visibility='default' filepath='include/linux/fs.h' line='957' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='private_data' type-id='eaa32e2f' visibility='default' filepath='include/linux/fs.h' line='960' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='f_ep_links' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='964' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='f_tfile_llink' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='965' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='f_mapping' type-id='f57039f0' visibility='default' filepath='include/linux/fs.h' line='967' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='f_wb_err' type-id='1da55f79' visibility='default' filepath='include/linux/fs.h' line='968' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2144'>
          <var-decl name='f_sb_err' type-id='1da55f79' visibility='default' filepath='include/linux/fs.h' line='969' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='971' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='972' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='android_oem_data1' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='973' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='include/linux/fs.h' line='932' column='1' id='8c8e2781'>
        <data-member access='public'>
          <var-decl name='fu_llist' type-id='c5ccfee8' visibility='default' filepath='include/linux/fs.h' line='933' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='fu_rcuhead' type-id='e3d8ce29' visibility='default' filepath='include/linux/fs.h' line='934' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='llist_node' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/llist.h' line='58' column='1' id='c5ccfee8'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='next' type-id='023b769e' visibility='default' filepath='include/linux/llist.h' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='callback_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/types.h' line='216' column='1' id='e3d8ce29'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='next' type-id='69c138b1' visibility='default' filepath='include/linux/types.h' line='217' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='func' type-id='eb839374' visibility='default' filepath='include/linux/types.h' line='218' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='path' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/path.h' line='8' column='1' id='b5382ece'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='mnt' type-id='549da823' visibility='default' filepath='include/linux/path.h' line='9' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='dentry' type-id='27675065' visibility='default' filepath='include/linux/path.h' line='10' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dentry' size-in-bits='1664' is-struct='yes' visibility='default' filepath='include/linux/dcache.h' line='90' column='1' id='d6ebca75'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='d_flags' type-id='f0981eeb' visibility='default' filepath='include/linux/dcache.h' line='92' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='d_seq' type-id='0b9c5397' visibility='default' filepath='include/linux/dcache.h' line='93' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='d_hash' type-id='8db0df1b' visibility='default' filepath='include/linux/dcache.h' line='94' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='d_parent' type-id='27675065' visibility='default' filepath='include/linux/dcache.h' line='95' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='d_name' type-id='02244303' visibility='default' filepath='include/linux/dcache.h' line='96' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='d_inode' type-id='7e666abe' visibility='default' filepath='include/linux/dcache.h' line='97' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='d_iname' type-id='fc872715' visibility='default' filepath='include/linux/dcache.h' line='99' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='d_lockref' type-id='60efdfd3' visibility='default' filepath='include/linux/dcache.h' line='102' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='d_op' type-id='1ee57353' visibility='default' filepath='include/linux/dcache.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='d_sb' type-id='42c8f564' visibility='default' filepath='include/linux/dcache.h' line='104' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='d_time' type-id='7359adad' visibility='default' filepath='include/linux/dcache.h' line='105' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='d_fsdata' type-id='eaa32e2f' visibility='default' filepath='include/linux/dcache.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='' type-id='ba311a3a' visibility='default' filepath='include/linux/dcache.h' line='108' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='d_child' type-id='72f469ec' visibility='default' filepath='include/linux/dcache.h' line='112' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='d_subdirs' type-id='72f469ec' visibility='default' filepath='include/linux/dcache.h' line='113' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='d_u' type-id='ba0a0e48' visibility='default' filepath='include/linux/dcache.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/dcache.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/dcache.h' line='124' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='seqcount_spinlock_t' type-id='0f5450f3' filepath='include/linux/seqlock.h' line='277' column='1' id='0b9c5397'/>
      <class-decl name='seqcount_spinlock' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/linux/seqlock.h' line='277' column='1' id='0f5450f3'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='seqcount' type-id='e14c3b11' visibility='default' filepath='include/linux/seqlock.h' line='277' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='seqcount_t' type-id='3a74ff0b' filepath='include/linux/seqlock.h' line='70' column='1' id='e14c3b11'/>
      <class-decl name='seqcount' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/linux/seqlock.h' line='65' column='1' id='3a74ff0b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='sequence' type-id='f0981eeb' visibility='default' filepath='include/linux/seqlock.h' line='66' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='hlist_bl_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/list_bl.h' line='38' column='1' id='8db0df1b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='next' type-id='d09d4bab' visibility='default' filepath='include/linux/list_bl.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pprev' type-id='e89ddc13' visibility='default' filepath='include/linux/list_bl.h' line='39' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='qstr' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/dcache.h' line='48' column='1' id='02244303'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='' type-id='c047989c' visibility='default' filepath='include/linux/dcache.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='name' type-id='354f7eb9' visibility='default' filepath='include/linux/dcache.h' line='55' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/dcache.h' line='49' column='1' id='c047989c'>
        <data-member access='public'>
          <var-decl name='' type-id='7a2c0764' visibility='default' filepath='include/linux/dcache.h' line='50' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='hash_len' type-id='91ce1af9' visibility='default' filepath='include/linux/dcache.h' line='53' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__anonymous_struct__3' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/dcache.h' line='50' column='1' id='7a2c0764'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='hash' type-id='19c2251e' visibility='default' filepath='include/linux/dcache.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='len' type-id='19c2251e' visibility='default' filepath='include/linux/dcache.h' line='51' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='inode' size-in-bits='5632' is-struct='yes' visibility='default' filepath='include/linux/fs.h' line='622' column='1' id='fe070fe8'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='i_mode' type-id='2594b00f' visibility='default' filepath='include/linux/fs.h' line='623' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='i_opflags' type-id='8efea9e5' visibility='default' filepath='include/linux/fs.h' line='624' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='i_uid' type-id='d80b72e6' visibility='default' filepath='include/linux/fs.h' line='625' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='i_gid' type-id='094d8048' visibility='default' filepath='include/linux/fs.h' line='626' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='i_flags' type-id='f0981eeb' visibility='default' filepath='include/linux/fs.h' line='627' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='i_acl' type-id='2871909b' visibility='default' filepath='include/linux/fs.h' line='630' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='i_default_acl' type-id='2871909b' visibility='default' filepath='include/linux/fs.h' line='631' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='i_op' type-id='de2c232c' visibility='default' filepath='include/linux/fs.h' line='634' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='i_sb' type-id='42c8f564' visibility='default' filepath='include/linux/fs.h' line='635' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='i_mapping' type-id='f57039f0' visibility='default' filepath='include/linux/fs.h' line='636' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='i_security' type-id='eaa32e2f' visibility='default' filepath='include/linux/fs.h' line='639' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='i_ino' type-id='7359adad' visibility='default' filepath='include/linux/fs.h' line='643' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='' type-id='3ee18b51' visibility='default' filepath='include/linux/fs.h' line='651' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='608'>
          <var-decl name='i_rdev' type-id='8504f260' visibility='default' filepath='include/linux/fs.h' line='655' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='i_size' type-id='69bf7bee' visibility='default' filepath='include/linux/fs.h' line='656' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='i_atime' type-id='40a816ad' visibility='default' filepath='include/linux/fs.h' line='657' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='i_mtime' type-id='40a816ad' visibility='default' filepath='include/linux/fs.h' line='658' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='i_ctime' type-id='40a816ad' visibility='default' filepath='include/linux/fs.h' line='659' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='i_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/fs.h' line='660' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1120'>
          <var-decl name='i_bytes' type-id='8efea9e5' visibility='default' filepath='include/linux/fs.h' line='661' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1136'>
          <var-decl name='i_blkbits' type-id='f9b06939' visibility='default' filepath='include/linux/fs.h' line='662' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1144'>
          <var-decl name='i_write_hint' type-id='f9b06939' visibility='default' filepath='include/linux/fs.h' line='663' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='i_blocks' type-id='17345459' visibility='default' filepath='include/linux/fs.h' line='664' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='i_state' type-id='7359adad' visibility='default' filepath='include/linux/fs.h' line='671' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='i_rwsem' type-id='f19fdb93' visibility='default' filepath='include/linux/fs.h' line='672' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='dirtied_when' type-id='7359adad' visibility='default' filepath='include/linux/fs.h' line='674' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='dirtied_time_when' type-id='7359adad' visibility='default' filepath='include/linux/fs.h' line='675' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='i_hash' type-id='03a4a074' visibility='default' filepath='include/linux/fs.h' line='677' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='i_io_list' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='678' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='i_wb' type-id='f885ca7d' visibility='default' filepath='include/linux/fs.h' line='680' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='i_wb_frn_winner' type-id='95e97e5e' visibility='default' filepath='include/linux/fs.h' line='683' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2272'>
          <var-decl name='i_wb_frn_avg_time' type-id='1dc6a898' visibility='default' filepath='include/linux/fs.h' line='684' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2288'>
          <var-decl name='i_wb_frn_history' type-id='1dc6a898' visibility='default' filepath='include/linux/fs.h' line='685' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='i_lru' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='687' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='i_sb_list' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='688' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='i_wb_list' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='689' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='' type-id='cbd4a95b' visibility='default' filepath='include/linux/fs.h' line='690' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='i_version' type-id='28ee064c' visibility='default' filepath='include/linux/fs.h' line='694' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2880'>
          <var-decl name='i_sequence' type-id='28ee064c' visibility='default' filepath='include/linux/fs.h' line='695' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2944'>
          <var-decl name='i_count' type-id='49178f86' visibility='default' filepath='include/linux/fs.h' line='696' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2976'>
          <var-decl name='i_dio_count' type-id='49178f86' visibility='default' filepath='include/linux/fs.h' line='697' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3008'>
          <var-decl name='i_writecount' type-id='49178f86' visibility='default' filepath='include/linux/fs.h' line='698' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3040'>
          <var-decl name='i_readcount' type-id='49178f86' visibility='default' filepath='include/linux/fs.h' line='700' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='' type-id='67f3b119' visibility='default' filepath='include/linux/fs.h' line='702' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3136'>
          <var-decl name='i_flctx' type-id='731257ff' visibility='default' filepath='include/linux/fs.h' line='706' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3200'>
          <var-decl name='i_data' type-id='0fd82dc2' visibility='default' filepath='include/linux/fs.h' line='707' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4992'>
          <var-decl name='i_devices' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='708' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5120'>
          <var-decl name='' type-id='d1afa4fe' visibility='default' filepath='include/linux/fs.h' line='709' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5184'>
          <var-decl name='i_generation' type-id='3f1a6b60' visibility='default' filepath='include/linux/fs.h' line='717' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5216'>
          <var-decl name='i_fsnotify_mask' type-id='3f1a6b60' visibility='default' filepath='include/linux/fs.h' line='720' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5248'>
          <var-decl name='i_fsnotify_marks' type-id='994d9d61' visibility='default' filepath='include/linux/fs.h' line='721' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5312'>
          <var-decl name='i_crypt_info' type-id='1ea8c5af' visibility='default' filepath='include/linux/fs.h' line='725' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5376'>
          <var-decl name='i_verity_info' type-id='ba18e248' visibility='default' filepath='include/linux/fs.h' line='729' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5440'>
          <var-decl name='i_private' type-id='eaa32e2f' visibility='default' filepath='include/linux/fs.h' line='732' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5504'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='734' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5568'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='735' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='kuid_t' type-id='e8b29774' filepath='include/linux/uidgid.h' line='23' column='1' id='d80b72e6'/>
      <class-decl name='__anonymous_struct__4' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='d80b72e6' visibility='default' filepath='include/linux/uidgid.h' line='21' column='1' id='e8b29774'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='val' type-id='354978ed' visibility='default' filepath='include/linux/uidgid.h' line='22' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='uid_t' type-id='70734f24' filepath='include/linux/types.h' line='32' column='1' id='354978ed'/>
      <typedef-decl name='__kernel_uid32_t' type-id='f0981eeb' filepath='include/uapi/asm-generic/posix_types.h' line='49' column='1' id='70734f24'/>
      <typedef-decl name='kgid_t' type-id='bac1227a' filepath='include/linux/uidgid.h' line='28' column='1' id='094d8048'/>
      <class-decl name='__anonymous_struct__5' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='094d8048' visibility='default' filepath='include/linux/uidgid.h' line='26' column='1' id='bac1227a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='val' type-id='2bb2b96f' visibility='default' filepath='include/linux/uidgid.h' line='27' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='gid_t' type-id='b4413cee' filepath='include/linux/types.h' line='33' column='1' id='2bb2b96f'/>
      <typedef-decl name='__kernel_gid32_t' type-id='f0981eeb' filepath='include/uapi/asm-generic/posix_types.h' line='50' column='1' id='b4413cee'/>
      <class-decl name='inode_operations' size-in-bits='2048' is-struct='yes' visibility='default' filepath='include/linux/fs.h' line='1903' column='1' id='5f5aa1ff'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lookup' type-id='02f90a61' visibility='default' filepath='include/linux/fs.h' line='1904' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='get_link' type-id='76ae8e1d' visibility='default' filepath='include/linux/fs.h' line='1905' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='permission' type-id='f4f91b99' visibility='default' filepath='include/linux/fs.h' line='1906' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='get_acl' type-id='7f30b822' visibility='default' filepath='include/linux/fs.h' line='1907' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='readlink' type-id='a57bd028' visibility='default' filepath='include/linux/fs.h' line='1909' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='create' type-id='c9cd0e09' visibility='default' filepath='include/linux/fs.h' line='1911' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='link' type-id='4b872e00' visibility='default' filepath='include/linux/fs.h' line='1912' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='unlink' type-id='7f5be7f6' visibility='default' filepath='include/linux/fs.h' line='1913' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='symlink' type-id='234843b5' visibility='default' filepath='include/linux/fs.h' line='1914' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='mkdir' type-id='98c2d938' visibility='default' filepath='include/linux/fs.h' line='1915' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='rmdir' type-id='7f5be7f6' visibility='default' filepath='include/linux/fs.h' line='1916' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='mknod' type-id='f9e0c0e5' visibility='default' filepath='include/linux/fs.h' line='1917' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='rename' type-id='7733ef81' visibility='default' filepath='include/linux/fs.h' line='1918' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='setattr' type-id='c237e829' visibility='default' filepath='include/linux/fs.h' line='1920' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='getattr' type-id='0b787edf' visibility='default' filepath='include/linux/fs.h' line='1921' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='listxattr' type-id='3494e4bb' visibility='default' filepath='include/linux/fs.h' line='1922' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='fiemap' type-id='0508acce' visibility='default' filepath='include/linux/fs.h' line='1923' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='update_time' type-id='64ecf6a5' visibility='default' filepath='include/linux/fs.h' line='1925' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='atomic_open' type-id='d3807eb0' visibility='default' filepath='include/linux/fs.h' line='1926' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='tmpfile' type-id='98c2d938' visibility='default' filepath='include/linux/fs.h' line='1929' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='set_acl' type-id='820976ef' visibility='default' filepath='include/linux/fs.h' line='1930' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='1932' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='1933' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='1934' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='1935' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='delayed_call' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/delayed_call.h' line='10' column='1' id='f1fbc58e'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='fn' type-id='b7f9d8e6' visibility='default' filepath='include/linux/delayed_call.h' line='11' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='arg' type-id='eaa32e2f' visibility='default' filepath='include/linux/delayed_call.h' line='12' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='bool' type-id='c894953d' filepath='include/linux/types.h' line='30' column='1' id='b50a4934'/>
      <typedef-decl name='dev_t' type-id='8f336000' filepath='include/linux/types.h' line='16' column='1' id='8504f260'/>
      <typedef-decl name='__kernel_dev_t' type-id='19c2251e' filepath='include/linux/types.h' line='13' column='1' id='8f336000'/>
      <class-decl name='iattr' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/linux/fs.h' line='221' column='1' id='a9ef191f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='ia_valid' type-id='f0981eeb' visibility='default' filepath='include/linux/fs.h' line='222' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='ia_mode' type-id='2594b00f' visibility='default' filepath='include/linux/fs.h' line='223' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='ia_uid' type-id='d80b72e6' visibility='default' filepath='include/linux/fs.h' line='224' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='ia_gid' type-id='094d8048' visibility='default' filepath='include/linux/fs.h' line='225' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='ia_size' type-id='69bf7bee' visibility='default' filepath='include/linux/fs.h' line='226' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='ia_atime' type-id='40a816ad' visibility='default' filepath='include/linux/fs.h' line='227' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='ia_mtime' type-id='40a816ad' visibility='default' filepath='include/linux/fs.h' line='228' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='ia_ctime' type-id='40a816ad' visibility='default' filepath='include/linux/fs.h' line='229' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='ia_file' type-id='77e79a4b' visibility='default' filepath='include/linux/fs.h' line='236' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='loff_t' type-id='537a730e' filepath='include/linux/types.h' line='46' column='1' id='69bf7bee'/>
      <typedef-decl name='__kernel_loff_t' type-id='1eb56b1e' filepath='include/uapi/asm-generic/posix_types.h' line='88' column='1' id='537a730e'/>
      <class-decl name='timespec64' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/time64.h' line='13' column='1' id='40a816ad'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tv_sec' type-id='1afd27ac' visibility='default' filepath='include/linux/time64.h' line='14' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='tv_nsec' type-id='bd54fe1a' visibility='default' filepath='include/linux/time64.h' line='15' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='time64_t' type-id='49659421' filepath='include/linux/time64.h' line='8' column='1' id='1afd27ac'/>
      <typedef-decl name='__s64' type-id='1eb56b1e' filepath='include/uapi/asm-generic/int-ll64.h' line='30' column='1' id='49659421'/>
      <class-decl name='kstat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='include/linux/stat.h' line='22' column='1' id='5f5c9d88'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='result_mask' type-id='19c2251e' visibility='default' filepath='include/linux/stat.h' line='23' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='mode' type-id='2594b00f' visibility='default' filepath='include/linux/stat.h' line='24' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='nlink' type-id='f0981eeb' visibility='default' filepath='include/linux/stat.h' line='25' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='blksize' type-id='8f92235e' visibility='default' filepath='include/linux/stat.h' line='26' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='attributes' type-id='91ce1af9' visibility='default' filepath='include/linux/stat.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='attributes_mask' type-id='91ce1af9' visibility='default' filepath='include/linux/stat.h' line='28' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='ino' type-id='91ce1af9' visibility='default' filepath='include/linux/stat.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='dev' type-id='8504f260' visibility='default' filepath='include/linux/stat.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='352'>
          <var-decl name='rdev' type-id='8504f260' visibility='default' filepath='include/linux/stat.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='uid' type-id='d80b72e6' visibility='default' filepath='include/linux/stat.h' line='40' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='gid' type-id='094d8048' visibility='default' filepath='include/linux/stat.h' line='41' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='size' type-id='69bf7bee' visibility='default' filepath='include/linux/stat.h' line='42' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='atime' type-id='40a816ad' visibility='default' filepath='include/linux/stat.h' line='43' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='mtime' type-id='40a816ad' visibility='default' filepath='include/linux/stat.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='ctime' type-id='40a816ad' visibility='default' filepath='include/linux/stat.h' line='45' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='btime' type-id='40a816ad' visibility='default' filepath='include/linux/stat.h' line='46' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='blocks' type-id='91ce1af9' visibility='default' filepath='include/linux/stat.h' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='mnt_id' type-id='91ce1af9' visibility='default' filepath='include/linux/stat.h' line='48' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='uint32_t' type-id='19c2251e' filepath='include/linux/types.h' line='104' column='1' id='8f92235e'/>
      <class-decl name='super_block' size-in-bits='12800' is-struct='yes' visibility='default' filepath='include/linux/fs.h' line='1445' column='1' id='bc39a8be'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='s_list' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='1446' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='s_dev' type-id='8504f260' visibility='default' filepath='include/linux/fs.h' line='1447' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='s_blocksize_bits' type-id='002ac4a6' visibility='default' filepath='include/linux/fs.h' line='1448' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='s_blocksize' type-id='7359adad' visibility='default' filepath='include/linux/fs.h' line='1449' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='s_maxbytes' type-id='69bf7bee' visibility='default' filepath='include/linux/fs.h' line='1450' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='s_type' type-id='21e53d44' visibility='default' filepath='include/linux/fs.h' line='1451' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='s_op' type-id='f7c6dcac' visibility='default' filepath='include/linux/fs.h' line='1452' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='dq_op' type-id='85741a2a' visibility='default' filepath='include/linux/fs.h' line='1453' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='s_qcop' type-id='2cb49514' visibility='default' filepath='include/linux/fs.h' line='1454' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='s_export_op' type-id='ab932c45' visibility='default' filepath='include/linux/fs.h' line='1455' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='s_flags' type-id='7359adad' visibility='default' filepath='include/linux/fs.h' line='1456' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='s_iflags' type-id='7359adad' visibility='default' filepath='include/linux/fs.h' line='1457' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='s_magic' type-id='7359adad' visibility='default' filepath='include/linux/fs.h' line='1458' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='s_root' type-id='27675065' visibility='default' filepath='include/linux/fs.h' line='1459' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='s_umount' type-id='f19fdb93' visibility='default' filepath='include/linux/fs.h' line='1460' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='s_count' type-id='95e97e5e' visibility='default' filepath='include/linux/fs.h' line='1461' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1440'>
          <var-decl name='s_active' type-id='49178f86' visibility='default' filepath='include/linux/fs.h' line='1462' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='s_security' type-id='eaa32e2f' visibility='default' filepath='include/linux/fs.h' line='1464' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='s_xattr' type-id='cb49d4b8' visibility='default' filepath='include/linux/fs.h' line='1466' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='s_cop' type-id='8d31a8d6' visibility='default' filepath='include/linux/fs.h' line='1468' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='s_master_keys' type-id='204a4632' visibility='default' filepath='include/linux/fs.h' line='1469' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='s_vop' type-id='e3008443' visibility='default' filepath='include/linux/fs.h' line='1472' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='s_encoding' type-id='72835629' visibility='default' filepath='include/linux/fs.h' line='1475' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='s_encoding_flags' type-id='d315442e' visibility='default' filepath='include/linux/fs.h' line='1476' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='s_roots' type-id='def98e71' visibility='default' filepath='include/linux/fs.h' line='1478' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='s_mounts' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='1479' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='s_bdev' type-id='b88dd945' visibility='default' filepath='include/linux/fs.h' line='1480' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='s_bdi' type-id='ef4fae1b' visibility='default' filepath='include/linux/fs.h' line='1481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='s_mtd' type-id='58ed56f5' visibility='default' filepath='include/linux/fs.h' line='1482' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='s_instances' type-id='03a4a074' visibility='default' filepath='include/linux/fs.h' line='1483' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='s_quota_types' type-id='f0981eeb' visibility='default' filepath='include/linux/fs.h' line='1484' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='s_dquot' type-id='c26e4ad8' visibility='default' filepath='include/linux/fs.h' line='1485' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5184'>
          <var-decl name='s_writers' type-id='fb476a2b' visibility='default' filepath='include/linux/fs.h' line='1487' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7744'>
          <var-decl name='s_fs_info' type-id='eaa32e2f' visibility='default' filepath='include/linux/fs.h' line='1494' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7808'>
          <var-decl name='s_time_gran' type-id='19c2251e' visibility='default' filepath='include/linux/fs.h' line='1497' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7872'>
          <var-decl name='s_time_min' type-id='1afd27ac' visibility='default' filepath='include/linux/fs.h' line='1499' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7936'>
          <var-decl name='s_time_max' type-id='1afd27ac' visibility='default' filepath='include/linux/fs.h' line='1500' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8000'>
          <var-decl name='s_fsnotify_mask' type-id='3f1a6b60' visibility='default' filepath='include/linux/fs.h' line='1502' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8064'>
          <var-decl name='s_fsnotify_marks' type-id='994d9d61' visibility='default' filepath='include/linux/fs.h' line='1503' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8128'>
          <var-decl name='s_id' type-id='16dc656a' visibility='default' filepath='include/linux/fs.h' line='1506' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8384'>
          <var-decl name='s_uuid' type-id='ec55eb74' visibility='default' filepath='include/linux/fs.h' line='1507' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8512'>
          <var-decl name='s_max_links' type-id='f0981eeb' visibility='default' filepath='include/linux/fs.h' line='1509' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8544'>
          <var-decl name='s_mode' type-id='2665334e' visibility='default' filepath='include/linux/fs.h' line='1510' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8576'>
          <var-decl name='s_vfs_rename_mutex' type-id='925167dc' visibility='default' filepath='include/linux/fs.h' line='1516' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8960'>
          <var-decl name='s_subtype' type-id='80f4b756' visibility='default' filepath='include/linux/fs.h' line='1522' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9024'>
          <var-decl name='s_d_op' type-id='1ee57353' visibility='default' filepath='include/linux/fs.h' line='1524' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9088'>
          <var-decl name='cleancache_poolid' type-id='95e97e5e' visibility='default' filepath='include/linux/fs.h' line='1529' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9152'>
          <var-decl name='s_shrink' type-id='27cb404f' visibility='default' filepath='include/linux/fs.h' line='1531' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9664'>
          <var-decl name='s_remove_count' type-id='f22a8abb' visibility='default' filepath='include/linux/fs.h' line='1534' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9728'>
          <var-decl name='s_fsnotify_inode_refs' type-id='f22a8abb' visibility='default' filepath='include/linux/fs.h' line='1537' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9792'>
          <var-decl name='s_readonly_remount' type-id='95e97e5e' visibility='default' filepath='include/linux/fs.h' line='1540' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9824'>
          <var-decl name='s_wb_err' type-id='1da55f79' visibility='default' filepath='include/linux/fs.h' line='1543' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9856'>
          <var-decl name='s_dio_done_wq' type-id='242e3d19' visibility='default' filepath='include/linux/fs.h' line='1546' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9920'>
          <var-decl name='s_pins' type-id='e151255a' visibility='default' filepath='include/linux/fs.h' line='1547' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9984'>
          <var-decl name='s_user_ns' type-id='c0ced320' visibility='default' filepath='include/linux/fs.h' line='1554' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10048'>
          <var-decl name='s_dentry_lru' type-id='c653aac7' visibility='default' filepath='include/linux/fs.h' line='1561' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10304'>
          <var-decl name='s_inode_lru' type-id='c653aac7' visibility='default' filepath='include/linux/fs.h' line='1562' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10560'>
          <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='include/linux/fs.h' line='1563' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10688'>
          <var-decl name='destroy_work' type-id='ef9025d0' visibility='default' filepath='include/linux/fs.h' line='1564' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11072'>
          <var-decl name='s_sync_lock' type-id='925167dc' visibility='default' filepath='include/linux/fs.h' line='1566' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11456'>
          <var-decl name='s_stack_depth' type-id='95e97e5e' visibility='default' filepath='include/linux/fs.h' line='1571' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11776'>
          <var-decl name='s_inode_list_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/fs.h' line='1574' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11840'>
          <var-decl name='s_inodes' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='1575' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11968'>
          <var-decl name='s_inode_wblist_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/fs.h' line='1577' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12032'>
          <var-decl name='s_inodes_wb' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='1578' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12160'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='1580' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12224'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='1581' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12288'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='1582' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12352'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='1583' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='file_system_type' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/linux/fs.h' line='2277' column='1' id='2f5a60be'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/fs.h' line='2278' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='fs_flags' type-id='95e97e5e' visibility='default' filepath='include/linux/fs.h' line='2279' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='init_fs_context' type-id='57f0383a' visibility='default' filepath='include/linux/fs.h' line='2287' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='parameters' type-id='8d4f223b' visibility='default' filepath='include/linux/fs.h' line='2288' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='mount' type-id='d9394db1' visibility='default' filepath='include/linux/fs.h' line='2289' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='kill_sb' type-id='1ff54a45' visibility='default' filepath='include/linux/fs.h' line='2291' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='owner' type-id='2730d015' visibility='default' filepath='include/linux/fs.h' line='2292' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='next' type-id='21e53d44' visibility='default' filepath='include/linux/fs.h' line='2293' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='fs_supers' type-id='e151255a' visibility='default' filepath='include/linux/fs.h' line='2294' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='s_lock_key' type-id='47479831' visibility='default' filepath='include/linux/fs.h' line='2296' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='s_umount_key' type-id='47479831' visibility='default' filepath='include/linux/fs.h' line='2297' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='s_vfs_rename_key' type-id='47479831' visibility='default' filepath='include/linux/fs.h' line='2298' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='s_writers_key' type-id='9c02e2a6' visibility='default' filepath='include/linux/fs.h' line='2299' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='i_lock_key' type-id='47479831' visibility='default' filepath='include/linux/fs.h' line='2301' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='i_mutex_key' type-id='47479831' visibility='default' filepath='include/linux/fs.h' line='2302' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='i_mutex_dir_key' type-id='47479831' visibility='default' filepath='include/linux/fs.h' line='2303' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='2305' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='2306' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='2307' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='include/linux/fs.h' line='2308' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='module' size-in-bits='8704' is-struct='yes' visibility='default' filepath='include/linux/module.h' line='368' column='1' id='29476915'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='state' type-id='327e04c6' visibility='default' filepath='include/linux/module.h' line='369' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='include/linux/module.h' line='372' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='name' type-id='6093ff7c' visibility='default' filepath='include/linux/module.h' line='375' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='mkobj' type-id='7bd9942c' visibility='default' filepath='include/linux/module.h' line='378' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='modinfo_attrs' type-id='063da268' visibility='default' filepath='include/linux/module.h' line='379' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='version' type-id='80f4b756' visibility='default' filepath='include/linux/module.h' line='380' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='srcversion' type-id='80f4b756' visibility='default' filepath='include/linux/module.h' line='381' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='scmversion' type-id='80f4b756' visibility='default' filepath='include/linux/module.h' line='382' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='holders_dir' type-id='d30bdc51' visibility='default' filepath='include/linux/module.h' line='383' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='syms' type-id='fcd64690' visibility='default' filepath='include/linux/module.h' line='386' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='crcs' type-id='e0a2e3a6' visibility='default' filepath='include/linux/module.h' line='387' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='num_syms' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='388' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='cfi_check' type-id='d7c6106c' visibility='default' filepath='include/linux/module.h' line='391' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='param_lock' type-id='925167dc' visibility='default' filepath='include/linux/module.h' line='396' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='kp' type-id='a7c6e908' visibility='default' filepath='include/linux/module.h' line='398' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='num_kp' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='399' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2720'>
          <var-decl name='num_gpl_syms' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='402' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='gpl_syms' type-id='fcd64690' visibility='default' filepath='include/linux/module.h' line='403' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='gpl_crcs' type-id='e0a2e3a6' visibility='default' filepath='include/linux/module.h' line='404' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2880'>
          <var-decl name='using_gplonly_symbols' type-id='b50a4934' visibility='default' filepath='include/linux/module.h' line='405' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2944'>
          <var-decl name='unused_syms' type-id='fcd64690' visibility='default' filepath='include/linux/module.h' line='409' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3008'>
          <var-decl name='unused_crcs' type-id='e0a2e3a6' visibility='default' filepath='include/linux/module.h' line='410' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='num_unused_syms' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='411' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3104'>
          <var-decl name='num_unused_gpl_syms' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='414' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3136'>
          <var-decl name='unused_gpl_syms' type-id='fcd64690' visibility='default' filepath='include/linux/module.h' line='415' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3200'>
          <var-decl name='unused_gpl_crcs' type-id='e0a2e3a6' visibility='default' filepath='include/linux/module.h' line='416' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3264'>
          <var-decl name='sig_ok' type-id='b50a4934' visibility='default' filepath='include/linux/module.h' line='424' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3272'>
          <var-decl name='async_probe_requested' type-id='b50a4934' visibility='default' filepath='include/linux/module.h' line='426' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3328'>
          <var-decl name='gpl_future_syms' type-id='fcd64690' visibility='default' filepath='include/linux/module.h' line='429' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3392'>
          <var-decl name='gpl_future_crcs' type-id='e0a2e3a6' visibility='default' filepath='include/linux/module.h' line='430' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3456'>
          <var-decl name='num_gpl_future_syms' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='431' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3488'>
          <var-decl name='num_exentries' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='434' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3520'>
          <var-decl name='extable' type-id='7f0eb64c' visibility='default' filepath='include/linux/module.h' line='435' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3584'>
          <var-decl name='init' type-id='1db260e5' visibility='default' filepath='include/linux/module.h' line='438' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4096'>
          <var-decl name='core_layout' type-id='68b3d9a8' visibility='default' filepath='include/linux/module.h' line='441' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4736'>
          <var-decl name='init_layout' type-id='68b3d9a8' visibility='default' filepath='include/linux/module.h' line='442' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5376'>
          <var-decl name='arch' type-id='ea05c185' visibility='default' filepath='include/linux/module.h' line='445' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5376'>
          <var-decl name='taints' type-id='7359adad' visibility='default' filepath='include/linux/module.h' line='447' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5440'>
          <var-decl name='num_bugs' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='451' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5504'>
          <var-decl name='bug_list' type-id='72f469ec' visibility='default' filepath='include/linux/module.h' line='452' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5632'>
          <var-decl name='bug_table' type-id='c250b0e4' visibility='default' filepath='include/linux/module.h' line='453' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5696'>
          <var-decl name='kallsyms' type-id='209d601e' visibility='default' filepath='include/linux/module.h' line='458' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5760'>
          <var-decl name='core_kallsyms' type-id='6a003ee8' visibility='default' filepath='include/linux/module.h' line='459' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6016'>
          <var-decl name='sect_attrs' type-id='3f4455c4' visibility='default' filepath='include/linux/module.h' line='462' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6080'>
          <var-decl name='notes_attrs' type-id='f0cb8b62' visibility='default' filepath='include/linux/module.h' line='465' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6144'>
          <var-decl name='args' type-id='26a90f95' visibility='default' filepath='include/linux/module.h' line='470' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6208'>
          <var-decl name='percpu' type-id='eaa32e2f' visibility='default' filepath='include/linux/module.h' line='474' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6272'>
          <var-decl name='percpu_size' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='475' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6336'>
          <var-decl name='noinstr_text_start' type-id='eaa32e2f' visibility='default' filepath='include/linux/module.h' line='477' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6400'>
          <var-decl name='noinstr_text_size' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='478' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6432'>
          <var-decl name='num_tracepoints' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6464'>
          <var-decl name='tracepoints_ptrs' type-id='700727c0' visibility='default' filepath='include/linux/module.h' line='482' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6528'>
          <var-decl name='num_srcu_structs' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='485' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6592'>
          <var-decl name='srcu_struct_ptrs' type-id='57933490' visibility='default' filepath='include/linux/module.h' line='486' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6656'>
          <var-decl name='num_bpf_raw_events' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='489' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6720'>
          <var-decl name='bpf_raw_events' type-id='1f7f0216' visibility='default' filepath='include/linux/module.h' line='490' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6784'>
          <var-decl name='jump_entries' type-id='7a35228c' visibility='default' filepath='include/linux/module.h' line='493' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6848'>
          <var-decl name='num_jump_entries' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='494' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6880'>
          <var-decl name='num_trace_bprintk_fmt' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='497' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6912'>
          <var-decl name='trace_bprintk_fmt_start' type-id='7d3cd834' visibility='default' filepath='include/linux/module.h' line='498' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6976'>
          <var-decl name='trace_events' type-id='109cc752' visibility='default' filepath='include/linux/module.h' line='501' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7040'>
          <var-decl name='num_trace_events' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='502' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7104'>
          <var-decl name='trace_evals' type-id='69881700' visibility='default' filepath='include/linux/module.h' line='503' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7168'>
          <var-decl name='num_trace_evals' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='504' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7232'>
          <var-decl name='kprobes_text_start' type-id='eaa32e2f' visibility='default' filepath='include/linux/module.h' line='511' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7296'>
          <var-decl name='kprobes_text_size' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='512' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7360'>
          <var-decl name='kprobe_blacklist' type-id='1d2c2b85' visibility='default' filepath='include/linux/module.h' line='513' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7424'>
          <var-decl name='num_kprobe_blacklist' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='514' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7456'>
          <var-decl name='num_static_call_sites' type-id='95e97e5e' visibility='default' filepath='include/linux/module.h' line='517' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7488'>
          <var-decl name='static_call_sites' type-id='35d6ace8' visibility='default' filepath='include/linux/module.h' line='518' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7552'>
          <var-decl name='source_list' type-id='72f469ec' visibility='default' filepath='include/linux/module.h' line='531' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7680'>
          <var-decl name='target_list' type-id='72f469ec' visibility='default' filepath='include/linux/module.h' line='533' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7808'>
          <var-decl name='exit' type-id='953b12f8' visibility='default' filepath='include/linux/module.h' line='536' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7872'>
          <var-decl name='refcnt' type-id='49178f86' visibility='default' filepath='include/linux/module.h' line='538' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7936'>
          <var-decl name='ei_funcs' type-id='7f79f20e' visibility='default' filepath='include/linux/module.h' line='548' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8000'>
          <var-decl name='num_ei_funcs' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='549' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8064'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/module.h' line='551' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8128'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/module.h' line='552' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8192'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='include/linux/module.h' line='553' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8256'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='include/linux/module.h' line='554' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='module_state' filepath='include/linux/module.h' line='316' column='1' id='327e04c6'>
        <underlying-type type-id='9cac1fee'/>
        <enumerator name='MODULE_STATE_LIVE' value='0'/>
        <enumerator name='MODULE_STATE_COMING' value='1'/>
        <enumerator name='MODULE_STATE_GOING' value='2'/>
        <enumerator name='MODULE_STATE_UNFORMED' value='3'/>
      </enum-decl>
      <class-decl name='module_kobject' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/linux/module.h' line='48' column='1' id='7bd9942c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='kobj' type-id='b6ab8849' visibility='default' filepath='include/linux/module.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='mod' type-id='2730d015' visibility='default' filepath='include/linux/module.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='drivers_dir' type-id='d30bdc51' visibility='default' filepath='include/linux/module.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='mp' type-id='ad9e36e6' visibility='default' filepath='include/linux/module.h' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='kobj_completion' type-id='389faaf7' visibility='default' filepath='include/linux/module.h' line='53' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='completion' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/completion.h' line='26' column='1' id='f9fef04f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='done' type-id='f0981eeb' visibility='default' filepath='include/linux/completion.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='wait' type-id='944dbe72' visibility='default' filepath='include/linux/completion.h' line='28' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='swait_queue_head' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/swait.h' line='43' column='1' id='944dbe72'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock' type-id='f5c90b3f' visibility='default' filepath='include/linux/swait.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='task_list' type-id='72f469ec' visibility='default' filepath='include/linux/swait.h' line='45' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='raw_spinlock_t' type-id='f106d0e5' filepath='include/linux/spinlock_types.h' line='29' column='1' id='f5c90b3f'/>
      <class-decl name='module_attribute' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/module.h' line='56' column='1' id='8f90cd2a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='attr' type-id='a6222917' visibility='default' filepath='include/linux/module.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='show' type-id='9a6e3348' visibility='default' filepath='include/linux/module.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='store' type-id='96948294' visibility='default' filepath='include/linux/module.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='setup' type-id='537ed613' visibility='default' filepath='include/linux/module.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='test' type-id='fe3af88b' visibility='default' filepath='include/linux/module.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='free' type-id='d6f1846c' visibility='default' filepath='include/linux/module.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kernel_symbol' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/linux/export.h' line='60' column='1' id='9493d3c9'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='value_offset' type-id='95e97e5e' visibility='default' filepath='include/linux/export.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='name_offset' type-id='95e97e5e' visibility='default' filepath='include/linux/export.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='namespace_offset' type-id='95e97e5e' visibility='default' filepath='include/linux/export.h' line='63' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='s32' type-id='3158a266' filepath='include/asm-generic/int-ll64.h' line='20' column='1' id='a7832498'/>
      <typedef-decl name='__s32' type-id='95e97e5e' filepath='include/uapi/asm-generic/int-ll64.h' line='26' column='1' id='3158a266'/>
      <typedef-decl name='cfi_check_fn' type-id='64115f6c' filepath='include/linux/cfi.h' line='11' column='1' id='d7c6106c'/>
      <typedef-decl name='uint64_t' type-id='91ce1af9' filepath='include/linux/types.h' line='107' column='1' id='9c313c2d'/>
      <class-decl name='mutex' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/linux/mutex.h' line='54' column='1' id='925167dc'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='owner' type-id='f22a8abb' visibility='default' filepath='include/linux/mutex.h' line='55' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='wait_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/mutex.h' line='56' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='osq' type-id='0c3105cd' visibility='default' filepath='include/linux/mutex.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='wait_list' type-id='72f469ec' visibility='default' filepath='include/linux/mutex.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='android_oem_data1' type-id='24a375b2' visibility='default' filepath='include/linux/mutex.h' line='67' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='atomic_long_t' type-id='28ee064c' filepath='include/asm-generic/atomic-long.h' line='13' column='1' id='f22a8abb'/>
      <typedef-decl name='atomic64_t' type-id='4efbf2c5' filepath='include/linux/types.h' line='175' column='1' id='28ee064c'/>
      <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='28ee064c' visibility='default' filepath='include/linux/types.h' line='173' column='1' id='4efbf2c5'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='counter' type-id='9b7c55ef' visibility='default' filepath='include/linux/types.h' line='174' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='s64' type-id='49659421' filepath='include/asm-generic/int-ll64.h' line='22' column='1' id='9b7c55ef'/>
      <class-decl name='optimistic_spin_queue' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/linux/osq_lock.h' line='15' column='1' id='0c3105cd'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tail' type-id='49178f86' visibility='default' filepath='include/linux/osq_lock.h' line='20' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kernel_param' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/moduleparam.h' line='69' column='1' id='ca10d3ca'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/moduleparam.h' line='70' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mod' type-id='2730d015' visibility='default' filepath='include/linux/moduleparam.h' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='ops' type-id='99beed66' visibility='default' filepath='include/linux/moduleparam.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='perm' type-id='d5c0a628' visibility='default' filepath='include/linux/moduleparam.h' line='73' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='208'>
          <var-decl name='level' type-id='fdbf7a0f' visibility='default' filepath='include/linux/moduleparam.h' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='216'>
          <var-decl name='flags' type-id='f9b06939' visibility='default' filepath='include/linux/moduleparam.h' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='' type-id='cbb4664d' visibility='default' filepath='include/linux/moduleparam.h' line='76' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kernel_param_ops' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/moduleparam.h' line='47' column='1' id='1740bab9'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='include/linux/moduleparam.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='set' type-id='388a7f2a' visibility='default' filepath='include/linux/moduleparam.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='get' type-id='d1c62993' visibility='default' filepath='include/linux/moduleparam.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='free' type-id='b7f9d8e6' visibility='default' filepath='include/linux/moduleparam.h' line='55' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='s8' type-id='8af57d41' filepath='include/asm-generic/int-ll64.h' line='16' column='1' id='fdbf7a0f'/>
      <typedef-decl name='__s8' type-id='28577a57' filepath='include/uapi/asm-generic/int-ll64.h' line='20' column='1' id='8af57d41'/>
      <union-decl name='__anonymous_union__4' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/moduleparam.h' line='76' column='1' id='cbb4664d'>
        <data-member access='public'>
          <var-decl name='arg' type-id='eaa32e2f' visibility='default' filepath='include/linux/moduleparam.h' line='77' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='str' type-id='db4b7928' visibility='default' filepath='include/linux/moduleparam.h' line='78' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='arr' type-id='ffa2ea6a' visibility='default' filepath='include/linux/moduleparam.h' line='79' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='kparam_string' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/moduleparam.h' line='86' column='1' id='744e4af5'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='maxlen' type-id='f0981eeb' visibility='default' filepath='include/linux/moduleparam.h' line='87' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='string' type-id='26a90f95' visibility='default' filepath='include/linux/moduleparam.h' line='88' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kparam_array' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/moduleparam.h' line='92' column='1' id='3b156a69'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='max' type-id='f0981eeb' visibility='default' filepath='include/linux/moduleparam.h' line='94' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='elemsize' type-id='f0981eeb' visibility='default' filepath='include/linux/moduleparam.h' line='95' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='num' type-id='807869d3' visibility='default' filepath='include/linux/moduleparam.h' line='96' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='ops' type-id='99beed66' visibility='default' filepath='include/linux/moduleparam.h' line='97' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='elem' type-id='eaa32e2f' visibility='default' filepath='include/linux/moduleparam.h' line='98' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='exception_table_entry' size-in-bits='96' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/extable.h' line='17' column='1' id='da1095b6'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='insn' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/extable.h' line='18' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='fixup' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/extable.h' line='18' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='handler' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/extable.h' line='18' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='module_layout' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/linux/module.h' line='328' column='1' id='68b3d9a8'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='base' type-id='eaa32e2f' visibility='default' filepath='include/linux/module.h' line='330' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='size' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='332' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='text_size' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='334' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='ro_size' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='336' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='ro_after_init_size' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='338' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='mtn' type-id='3351dce1' visibility='default' filepath='include/linux/module.h' line='341' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='mod_tree_node' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/module.h' line='323' column='1' id='3351dce1'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='mod' type-id='2730d015' visibility='default' filepath='include/linux/module.h' line='324' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='node' type-id='dc9cc7c7' visibility='default' filepath='include/linux/module.h' line='325' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='latch_tree_node' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/linux/rbtree_latch.h' line='40' column='1' id='dc9cc7c7'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='node' type-id='d46544fa' visibility='default' filepath='include/linux/rbtree_latch.h' line='41' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='rb_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/rbtree.h' line='24' column='1' id='2a8a6332'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='__rb_parent_color' type-id='7359adad' visibility='default' filepath='include/linux/rbtree.h' line='25' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='rb_right' type-id='e6532500' visibility='default' filepath='include/linux/rbtree.h' line='26' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='rb_left' type-id='e6532500' visibility='default' filepath='include/linux/rbtree.h' line='27' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='mod_arch_specific' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/module.h' line='8' column='1' id='ea05c185'/>
      <class-decl name='bug_entry' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/asm-generic/bug.h' line='25' column='1' id='93630c4e'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='bug_addr_disp' type-id='95e97e5e' visibility='default' filepath='include/asm-generic/bug.h' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='file_disp' type-id='95e97e5e' visibility='default' filepath='include/asm-generic/bug.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='line' type-id='8efea9e5' visibility='default' filepath='include/asm-generic/bug.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='80'>
          <var-decl name='flags' type-id='8efea9e5' visibility='default' filepath='include/asm-generic/bug.h' line='39' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='mod_kallsyms' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/module.h' line='352' column='1' id='6a003ee8'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='symtab' type-id='7d71a706' visibility='default' filepath='include/linux/module.h' line='353' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='num_symtab' type-id='f0981eeb' visibility='default' filepath='include/linux/module.h' line='354' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='strtab' type-id='26a90f95' visibility='default' filepath='include/linux/module.h' line='355' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='typetab' type-id='26a90f95' visibility='default' filepath='include/linux/module.h' line='356' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='Elf64_Sym' type-id='30bf9720' filepath='include/uapi/linux/elf.h' line='200' column='1' id='7cdfe313'/>
      <class-decl name='elf64_sym' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/uapi/linux/elf.h' line='193' column='1' id='30bf9720'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='st_name' type-id='e57120d4' visibility='default' filepath='include/uapi/linux/elf.h' line='194' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='st_info' type-id='002ac4a6' visibility='default' filepath='include/uapi/linux/elf.h' line='195' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='40'>
          <var-decl name='st_other' type-id='002ac4a6' visibility='default' filepath='include/uapi/linux/elf.h' line='196' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='48'>
          <var-decl name='st_shndx' type-id='101a70d5' visibility='default' filepath='include/uapi/linux/elf.h' line='197' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='st_value' type-id='e14340cf' visibility='default' filepath='include/uapi/linux/elf.h' line='198' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='st_size' type-id='c87c44e4' visibility='default' filepath='include/uapi/linux/elf.h' line='199' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='Elf64_Word' type-id='3f1a6b60' filepath='include/uapi/linux/elf.h' line='21' column='1' id='e57120d4'/>
      <typedef-decl name='Elf64_Half' type-id='d315442e' filepath='include/uapi/linux/elf.h' line='17' column='1' id='101a70d5'/>
      <typedef-decl name='Elf64_Addr' type-id='d3130597' filepath='include/uapi/linux/elf.h' line='16' column='1' id='e14340cf'/>
      <typedef-decl name='Elf64_Xword' type-id='d3130597' filepath='include/uapi/linux/elf.h' line='22' column='1' id='c87c44e4'/>
      <typedef-decl name='tracepoint_ptr_t' type-id='2448a865' filepath='include/linux/tracepoint-defs.h' line='44' column='1' id='e431ac27'/>
      <class-decl name='srcu_struct' size-in-bits='5568' is-struct='yes' visibility='default' filepath='include/linux/srcutree.h' line='64' column='1' id='e4a7867c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='node' type-id='01115b96' visibility='default' filepath='include/linux/srcutree.h' line='65' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='level' type-id='2f7565c6' visibility='default' filepath='include/linux/srcutree.h' line='66' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='srcu_cb_mutex' type-id='925167dc' visibility='default' filepath='include/linux/srcutree.h' line='68' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2880'>
          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='include/linux/srcutree.h' line='69' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2944'>
          <var-decl name='srcu_gp_mutex' type-id='925167dc' visibility='default' filepath='include/linux/srcutree.h' line='70' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3328'>
          <var-decl name='srcu_idx' type-id='f0981eeb' visibility='default' filepath='include/linux/srcutree.h' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3392'>
          <var-decl name='srcu_gp_seq' type-id='7359adad' visibility='default' filepath='include/linux/srcutree.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3456'>
          <var-decl name='srcu_gp_seq_needed' type-id='7359adad' visibility='default' filepath='include/linux/srcutree.h' line='73' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3520'>
          <var-decl name='srcu_gp_seq_needed_exp' type-id='7359adad' visibility='default' filepath='include/linux/srcutree.h' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3584'>
          <var-decl name='srcu_last_gp_end' type-id='7359adad' visibility='default' filepath='include/linux/srcutree.h' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3648'>
          <var-decl name='sda' type-id='2a5ff2f1' visibility='default' filepath='include/linux/srcutree.h' line='76' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3712'>
          <var-decl name='srcu_barrier_seq' type-id='7359adad' visibility='default' filepath='include/linux/srcutree.h' line='77' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3776'>
          <var-decl name='srcu_barrier_mutex' type-id='925167dc' visibility='default' filepath='include/linux/srcutree.h' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4160'>
          <var-decl name='srcu_barrier_completion' type-id='f9fef04f' visibility='default' filepath='include/linux/srcutree.h' line='79' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4416'>
          <var-decl name='srcu_barrier_cpu_cnt' type-id='49178f86' visibility='default' filepath='include/linux/srcutree.h' line='81' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4480'>
          <var-decl name='work' type-id='5ad6e0ef' visibility='default' filepath='include/linux/srcutree.h' line='84' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='srcu_node' size-in-bits='768' is-struct='yes' visibility='default' filepath='include/linux/srcutree.h' line='48' column='1' id='56798c81'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='include/linux/srcutree.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='srcu_have_cbs' type-id='f46d9f4d' visibility='default' filepath='include/linux/srcutree.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='srcu_data_have_cbs' type-id='f46d9f4d' visibility='default' filepath='include/linux/srcutree.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='srcu_gp_seq_needed_exp' type-id='7359adad' visibility='default' filepath='include/linux/srcutree.h' line='55' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='srcu_parent' type-id='8dee6d89' visibility='default' filepath='include/linux/srcutree.h' line='56' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='grplo' type-id='95e97e5e' visibility='default' filepath='include/linux/srcutree.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='736'>
          <var-decl name='grphi' type-id='95e97e5e' visibility='default' filepath='include/linux/srcutree.h' line='58' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='srcu_data' size-in-bits='3072' is-struct='yes' visibility='default' filepath='include/linux/srcutree.h' line='24' column='1' id='1207cfa9'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='srcu_lock_count' type-id='f05e8e77' visibility='default' filepath='include/linux/srcutree.h' line='26' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='srcu_unlock_count' type-id='f05e8e77' visibility='default' filepath='include/linux/srcutree.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='include/linux/srcutree.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='srcu_cblist' type-id='541c023a' visibility='default' filepath='include/linux/srcutree.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='srcu_gp_seq_needed' type-id='7359adad' visibility='default' filepath='include/linux/srcutree.h' line='32' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='srcu_gp_seq_needed_exp' type-id='7359adad' visibility='default' filepath='include/linux/srcutree.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='srcu_cblist_invoking' type-id='b50a4934' visibility='default' filepath='include/linux/srcutree.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='delay_work' type-id='abe41e67' visibility='default' filepath='include/linux/srcutree.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='work' type-id='ef9025d0' visibility='default' filepath='include/linux/srcutree.h' line='36' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='srcu_barrier_head' type-id='e3d8ce29' visibility='default' filepath='include/linux/srcutree.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='mynode' type-id='8dee6d89' visibility='default' filepath='include/linux/srcutree.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='grpmask' type-id='7359adad' visibility='default' filepath='include/linux/srcutree.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='cpu' type-id='95e97e5e' visibility='default' filepath='include/linux/srcutree.h' line='41' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='ssp' type-id='f7d7131a' visibility='default' filepath='include/linux/srcutree.h' line='42' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='rcu_segcblist' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/linux/rcu_segcblist.h' line='66' column='1' id='541c023a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='head' type-id='69c138b1' visibility='default' filepath='include/linux/rcu_segcblist.h' line='67' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='tails' type-id='68694f49' visibility='default' filepath='include/linux/rcu_segcblist.h' line='68' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='gp_seq' type-id='f46d9f4d' visibility='default' filepath='include/linux/rcu_segcblist.h' line='69' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='len' type-id='f22a8abb' visibility='default' filepath='include/linux/rcu_segcblist.h' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='enabled' type-id='f9b06939' visibility='default' filepath='include/linux/rcu_segcblist.h' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='648'>
          <var-decl name='offloaded' type-id='f9b06939' visibility='default' filepath='include/linux/rcu_segcblist.h' line='76' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='timer_list' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/timer.h' line='12' column='1' id='abe41e67'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='entry' type-id='03a4a074' visibility='default' filepath='include/linux/timer.h' line='17' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='expires' type-id='7359adad' visibility='default' filepath='include/linux/timer.h' line='18' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='function' type-id='9582ad9a' visibility='default' filepath='include/linux/timer.h' line='19' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='flags' type-id='19c2251e' visibility='default' filepath='include/linux/timer.h' line='20' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/timer.h' line='26' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/timer.h' line='27' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='hlist_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/types.h' line='186' column='1' id='03a4a074'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='next' type-id='08cbad52' visibility='default' filepath='include/linux/types.h' line='187' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pprev' type-id='50a213e8' visibility='default' filepath='include/linux/types.h' line='187' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='work_struct' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/linux/workqueue.h' line='103' column='1' id='ef9025d0'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='data' type-id='f22a8abb' visibility='default' filepath='include/linux/workqueue.h' line='104' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='entry' type-id='72f469ec' visibility='default' filepath='include/linux/workqueue.h' line='105' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='func' type-id='72666d3f' visibility='default' filepath='include/linux/workqueue.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/workqueue.h' line='110' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/workqueue.h' line='111' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='work_func_t' type-id='939280af' filepath='include/linux/workqueue.h' line='22' column='1' id='72666d3f'/>
      <class-decl name='delayed_work' size-in-bits='1088' is-struct='yes' visibility='default' filepath='include/linux/workqueue.h' line='118' column='1' id='5ad6e0ef'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='work' type-id='ef9025d0' visibility='default' filepath='include/linux/workqueue.h' line='119' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='timer' type-id='abe41e67' visibility='default' filepath='include/linux/workqueue.h' line='120' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='wq' type-id='242e3d19' visibility='default' filepath='include/linux/workqueue.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='cpu' type-id='95e97e5e' visibility='default' filepath='include/linux/workqueue.h' line='124' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/workqueue.h' line='126' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/workqueue.h' line='127' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='bpf_raw_event_map' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/tracepoint-defs.h' line='49' column='1' id='72790540'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tp' type-id='08e531de' visibility='default' filepath='include/linux/tracepoint-defs.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='bpf_func' type-id='eaa32e2f' visibility='default' filepath='include/linux/tracepoint-defs.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='num_args' type-id='19c2251e' visibility='default' filepath='include/linux/tracepoint-defs.h' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='writable_size' type-id='19c2251e' visibility='default' filepath='include/linux/tracepoint-defs.h' line='53' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='tracepoint' size-in-bits='576' is-struct='yes' visibility='default' filepath='include/linux/tracepoint-defs.h' line='32' column='1' id='4ca0c298'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/tracepoint-defs.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='key' type-id='00205383' visibility='default' filepath='include/linux/tracepoint-defs.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='static_call_key' type-id='f859cd7e' visibility='default' filepath='include/linux/tracepoint-defs.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='static_call_tramp' type-id='eaa32e2f' visibility='default' filepath='include/linux/tracepoint-defs.h' line='36' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='iterator' type-id='eaa32e2f' visibility='default' filepath='include/linux/tracepoint-defs.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='regfunc' type-id='1db260e5' visibility='default' filepath='include/linux/tracepoint-defs.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='unregfunc' type-id='953b12f8' visibility='default' filepath='include/linux/tracepoint-defs.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='funcs' type-id='484b400f' visibility='default' filepath='include/linux/tracepoint-defs.h' line='40' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='static_key' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/jump_label.h' line='87' column='1' id='00205383'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='enabled' type-id='49178f86' visibility='default' filepath='include/linux/jump_label.h' line='88' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='' type-id='7792d5a2' visibility='default' filepath='include/linux/jump_label.h' line='102' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__5' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/jump_label.h' line='102' column='1' id='7792d5a2'>
        <data-member access='public'>
          <var-decl name='type' type-id='7359adad' visibility='default' filepath='include/linux/jump_label.h' line='103' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='entries' type-id='7a35228c' visibility='default' filepath='include/linux/jump_label.h' line='104' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='next' type-id='c77a71ce' visibility='default' filepath='include/linux/jump_label.h' line='105' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='jump_entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/jump_label.h' line='122' column='1' id='ca0c09a6'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='code' type-id='a7832498' visibility='default' filepath='include/linux/jump_label.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='target' type-id='a7832498' visibility='default' filepath='include/linux/jump_label.h' line='124' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='key' type-id='bd54fe1a' visibility='default' filepath='include/linux/jump_label.h' line='125' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='static_call_key' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/static_call.h' line='131' column='1' id='849bbac8'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='func' type-id='eaa32e2f' visibility='default' filepath='include/linux/static_call.h' line='132' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='' type-id='ff7eea03' visibility='default' filepath='include/linux/static_call.h' line='133' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__6' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/static_call.h' line='133' column='1' id='ff7eea03'>
        <data-member access='public'>
          <var-decl name='type' type-id='7359adad' visibility='default' filepath='include/linux/static_call.h' line='135' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='mods' type-id='2f468277' visibility='default' filepath='include/linux/static_call.h' line='136' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='sites' type-id='35d6ace8' visibility='default' filepath='include/linux/static_call.h' line='137' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='static_call_mod' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/static_call.h' line='125' column='1' id='6cbf000f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='next' type-id='2f468277' visibility='default' filepath='include/linux/static_call.h' line='126' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mod' type-id='2730d015' visibility='default' filepath='include/linux/static_call.h' line='127' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='sites' type-id='35d6ace8' visibility='default' filepath='include/linux/static_call.h' line='128' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='static_call_site' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/static_call_types.h' line='32' column='1' id='453024fa'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='addr' type-id='a7832498' visibility='default' filepath='include/linux/static_call_types.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='key' type-id='a7832498' visibility='default' filepath='include/linux/static_call_types.h' line='34' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='tracepoint_func' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/tracepoint-defs.h' line='26' column='1' id='3132e187'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='func' type-id='eaa32e2f' visibility='default' filepath='include/linux/tracepoint-defs.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='include/linux/tracepoint-defs.h' line='28' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='prio' type-id='95e97e5e' visibility='default' filepath='include/linux/tracepoint-defs.h' line='29' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='trace_event_call' size-in-bits='1152' is-struct='yes' visibility='default' filepath='include/linux/trace_events.h' line='278' column='1' id='fd48a6e6'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='include/linux/trace_events.h' line='279' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='class' type-id='3570c570' visibility='default' filepath='include/linux/trace_events.h' line='280' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='' type-id='7d3eb798' visibility='default' filepath='include/linux/trace_events.h' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='event' type-id='78b26ac9' visibility='default' filepath='include/linux/trace_events.h' line='286' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='print_fmt' type-id='26a90f95' visibility='default' filepath='include/linux/trace_events.h' line='287' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='filter' type-id='26461068' visibility='default' filepath='include/linux/trace_events.h' line='288' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='mod' type-id='eaa32e2f' visibility='default' filepath='include/linux/trace_events.h' line='289' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='include/linux/trace_events.h' line='290' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='flags' type-id='95e97e5e' visibility='default' filepath='include/linux/trace_events.h' line='300' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='928'>
          <var-decl name='perf_refcount' type-id='95e97e5e' visibility='default' filepath='include/linux/trace_events.h' line='303' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='perf_events' type-id='030d0b18' visibility='default' filepath='include/linux/trace_events.h' line='304' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='prog_array' type-id='380c7edc' visibility='default' filepath='include/linux/trace_events.h' line='305' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='perf_perm' type-id='7fa32aba' visibility='default' filepath='include/linux/trace_events.h' line='307' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='trace_event_class' size-in-bits='576' is-struct='yes' visibility='default' filepath='include/linux/trace_events.h' line='213' column='1' id='a2689372'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='system' type-id='80f4b756' visibility='default' filepath='include/linux/trace_events.h' line='214' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='probe' type-id='eaa32e2f' visibility='default' filepath='include/linux/trace_events.h' line='215' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='perf_probe' type-id='eaa32e2f' visibility='default' filepath='include/linux/trace_events.h' line='217' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='reg' type-id='50ec573b' visibility='default' filepath='include/linux/trace_events.h' line='219' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='fields_array' type-id='0e587527' visibility='default' filepath='include/linux/trace_events.h' line='221' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='get_fields' type-id='17898fce' visibility='default' filepath='include/linux/trace_events.h' line='222' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='fields' type-id='72f469ec' visibility='default' filepath='include/linux/trace_events.h' line='223' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='raw_init' type-id='9a5ed472' visibility='default' filepath='include/linux/trace_events.h' line='224' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='trace_reg' filepath='include/linux/trace_events.h' line='177' column='1' id='7fa6eeb8'>
        <underlying-type type-id='9cac1fee'/>
        <enumerator name='TRACE_REG_REGISTER' value='0'/>
        <enumerator name='TRACE_REG_UNREGISTER' value='1'/>
        <enumerator name='TRACE_REG_PERF_REGISTER' value='2'/>
        <enumerator name='TRACE_REG_PERF_UNREGISTER' value='3'/>
        <enumerator name='TRACE_REG_PERF_OPEN' value='4'/>
        <enumerator name='TRACE_REG_PERF_CLOSE' value='5'/>
        <enumerator name='TRACE_REG_PERF_ADD' value='6'/>
        <enumerator name='TRACE_REG_PERF_DEL' value='7'/>
      </enum-decl>
      <class-decl name='trace_event_fields' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/trace_events.h' line='199' column='1' id='1119a98f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='type' type-id='80f4b756' visibility='default' filepath='include/linux/trace_events.h' line='200' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='' type-id='4edaf017' visibility='default' filepath='include/linux/trace_events.h' line='201' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__7' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='include/linux/trace_events.h' line='201' column='1' id='4edaf017'>
        <data-member access='public'>
          <var-decl name='' type-id='cdff40da' visibility='default' filepath='include/linux/trace_events.h' line='202' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='define_fields' type-id='9a5ed472' visibility='default' filepath='include/linux/trace_events.h' line='209' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__anonymous_struct__7' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/trace_events.h' line='202' column='1' id='cdff40da'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/trace_events.h' line='203' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='size' type-id='2448a865' visibility='default' filepath='include/linux/trace_events.h' line='204' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='align' type-id='2448a865' visibility='default' filepath='include/linux/trace_events.h' line='205' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='is_signed' type-id='2448a865' visibility='default' filepath='include/linux/trace_events.h' line='206' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='filter_type' type-id='2448a865' visibility='default' filepath='include/linux/trace_events.h' line='207' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__8' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/trace_events.h' line='281' column='1' id='7d3eb798'>
        <data-member access='public'>
          <var-decl name='name' type-id='26a90f95' visibility='default' filepath='include/linux/trace_events.h' line='282' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='tp' type-id='08e531de' visibility='default' filepath='include/linux/trace_events.h' line='284' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='trace_event' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/linux/trace_events.h' line='131' column='1' id='78b26ac9'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='node' type-id='03a4a074' visibility='default' filepath='include/linux/trace_events.h' line='132' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='include/linux/trace_events.h' line='133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='type' type-id='95e97e5e' visibility='default' filepath='include/linux/trace_events.h' line='134' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='funcs' type-id='d6d37d27' visibility='default' filepath='include/linux/trace_events.h' line='135' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='trace_event_functions' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/trace_events.h' line='124' column='1' id='195ea87f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='trace' type-id='8e7f627c' visibility='default' filepath='include/linux/trace_events.h' line='125' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='raw' type-id='8e7f627c' visibility='default' filepath='include/linux/trace_events.h' line='126' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='hex' type-id='8e7f627c' visibility='default' filepath='include/linux/trace_events.h' line='127' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='binary' type-id='8e7f627c' visibility='default' filepath='include/linux/trace_events.h' line='128' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='trace_print_func' type-id='ff826f29' filepath='include/linux/trace_events.h' line='121' column='1' id='8e7f627c'/>
      <enum-decl name='print_line_t' filepath='include/linux/trace_events.h' line='142' column='1' id='b1a0a119'>
        <underlying-type type-id='9cac1fee'/>
        <enumerator name='TRACE_TYPE_PARTIAL_LINE' value='0'/>
        <enumerator name='TRACE_TYPE_HANDLED' value='1'/>
        <enumerator name='TRACE_TYPE_UNHANDLED' value='2'/>
        <enumerator name='TRACE_TYPE_NO_CONSUME' value='3'/>
      </enum-decl>
      <class-decl name='trace_iterator' size-in-bits='67712' is-struct='yes' visibility='default' filepath='include/linux/trace_events.h' line='79' column='1' id='60588bb1'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tr' type-id='898c1076' visibility='default' filepath='include/linux/trace_events.h' line='80' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='trace' type-id='0a18715a' visibility='default' filepath='include/linux/trace_events.h' line='81' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='array_buffer' type-id='5c928f21' visibility='default' filepath='include/linux/trace_events.h' line='82' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='private' type-id='eaa32e2f' visibility='default' filepath='include/linux/trace_events.h' line='83' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='cpu_file' type-id='95e97e5e' visibility='default' filepath='include/linux/trace_events.h' line='84' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='mutex' type-id='925167dc' visibility='default' filepath='include/linux/trace_events.h' line='85' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='buffer_iter' type-id='93407a41' visibility='default' filepath='include/linux/trace_events.h' line='86' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='iter_flags' type-id='7359adad' visibility='default' filepath='include/linux/trace_events.h' line='87' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='temp' type-id='eaa32e2f' visibility='default' filepath='include/linux/trace_events.h' line='88' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='temp_size' type-id='f0981eeb' visibility='default' filepath='include/linux/trace_events.h' line='89' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='tmp_seq' type-id='c5078f42' visibility='default' filepath='include/linux/trace_events.h' line='92' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='34048'>
          <var-decl name='started' type-id='b16b461b' visibility='default' filepath='include/linux/trace_events.h' line='94' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='34112'>
          <var-decl name='snapshot' type-id='b50a4934' visibility='default' filepath='include/linux/trace_events.h' line='97' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='34176'>
          <var-decl name='seq' type-id='c5078f42' visibility='default' filepath='include/linux/trace_events.h' line='100' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='67264'>
          <var-decl name='ent' type-id='aa4b1eb5' visibility='default' filepath='include/linux/trace_events.h' line='101' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='67328'>
          <var-decl name='lost_events' type-id='7359adad' visibility='default' filepath='include/linux/trace_events.h' line='102' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='67392'>
          <var-decl name='leftover' type-id='95e97e5e' visibility='default' filepath='include/linux/trace_events.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='67424'>
          <var-decl name='ent_size' type-id='95e97e5e' visibility='default' filepath='include/linux/trace_events.h' line='104' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='67456'>
          <var-decl name='cpu' type-id='95e97e5e' visibility='default' filepath='include/linux/trace_events.h' line='105' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='67520'>
          <var-decl name='ts' type-id='91ce1af9' visibility='default' filepath='include/linux/trace_events.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='67584'>
          <var-decl name='pos' type-id='69bf7bee' visibility='default' filepath='include/linux/trace_events.h' line='108' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='67648'>
          <var-decl name='idx' type-id='bd54fe1a' visibility='default' filepath='include/linux/trace_events.h' line='109' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='trace_seq' size-in-bits='33088' is-struct='yes' visibility='default' filepath='include/linux/trace_seq.h' line='14' column='1' id='c5078f42'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='buffer' type-id='d16c6df4' visibility='default' filepath='include/linux/trace_seq.h' line='15' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32768'>
          <var-decl name='seq' type-id='857188d6' visibility='default' filepath='include/linux/trace_seq.h' line='16' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='33024'>
          <var-decl name='full' type-id='95e97e5e' visibility='default' filepath='include/linux/trace_seq.h' line='17' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='seq_buf' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/seq_buf.h' line='19' column='1' id='857188d6'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='buffer' type-id='26a90f95' visibility='default' filepath='include/linux/seq_buf.h' line='20' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='include/linux/seq_buf.h' line='21' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='len' type-id='b59d7dce' visibility='default' filepath='include/linux/seq_buf.h' line='22' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='readpos' type-id='69bf7bee' visibility='default' filepath='include/linux/seq_buf.h' line='23' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='trace_entry' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/trace_events.h' line='65' column='1' id='1986ca65'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='type' type-id='8efea9e5' visibility='default' filepath='include/linux/trace_events.h' line='66' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='flags' type-id='002ac4a6' visibility='default' filepath='include/linux/trace_events.h' line='67' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='preempt_count' type-id='002ac4a6' visibility='default' filepath='include/linux/trace_events.h' line='68' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='pid' type-id='95e97e5e' visibility='default' filepath='include/linux/trace_events.h' line='69' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='hlist_head' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/types.h' line='182' column='1' id='e151255a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='08cbad52' visibility='default' filepath='include/linux/types.h' line='183' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='bpf_prog_array' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/bpf.h' line='1062' column='1' id='c75c7b06'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='include/linux/bpf.h' line='1063' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='items' type-id='3f814540' visibility='default' filepath='include/linux/bpf.h' line='1064' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='bpf_prog_array_item' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/bpf.h' line='1057' column='1' id='f67e137c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='prog' type-id='bdcee7ae' visibility='default' filepath='include/linux/bpf.h' line='1058' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='cgroup_storage' type-id='dcd9fb4c' visibility='default' filepath='include/linux/bpf.h' line='1059' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='bpf_cgroup_storage' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/linux/bpf-cgroup.h' line='53' column='1' id='15881542'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='' type-id='dad3eb71' visibility='default' filepath='include/linux/bpf-cgroup.h' line='54' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='map' type-id='b6a33eaf' visibility='default' filepath='include/linux/bpf-cgroup.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='key' type-id='d8d7111e' visibility='default' filepath='include/linux/bpf-cgroup.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='list_map' type-id='72f469ec' visibility='default' filepath='include/linux/bpf-cgroup.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='list_cg' type-id='72f469ec' visibility='default' filepath='include/linux/bpf-cgroup.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='node' type-id='2a8a6332' visibility='default' filepath='include/linux/bpf-cgroup.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='include/linux/bpf-cgroup.h' line='63' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__9' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/bpf-cgroup.h' line='54' column='1' id='dad3eb71'>
        <data-member access='public'>
          <var-decl name='buf' type-id='b1253746' visibility='default' filepath='include/linux/bpf-cgroup.h' line='55' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='percpu_buf' type-id='eaa32e2f' visibility='default' filepath='include/linux/bpf-cgroup.h' line='56' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='bpf_storage_buffer' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/bpf-cgroup.h' line='48' column='1' id='0ef5c7e0'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='include/linux/bpf-cgroup.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='data' type-id='e84913bd' visibility='default' filepath='include/linux/bpf-cgroup.h' line='50' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='bpf_cgroup_storage_key' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/uapi/linux/bpf.h' line='79' column='1' id='d8d7111e'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='cgroup_inode_id' type-id='d3130597' visibility='default' filepath='include/uapi/linux/bpf.h' line='80' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='attach_type' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/bpf.h' line='81' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='perf_event' size-in-bits='8192' is-struct='yes' visibility='default' filepath='include/linux/perf_event.h' line='627' column='1' id='7263c471'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='event_entry' type-id='72f469ec' visibility='default' filepath='include/linux/perf_event.h' line='634' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='sibling_list' type-id='72f469ec' visibility='default' filepath='include/linux/perf_event.h' line='640' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='active_list' type-id='72f469ec' visibility='default' filepath='include/linux/perf_event.h' line='641' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='group_node' type-id='2a8a6332' visibility='default' filepath='include/linux/perf_event.h' line='645' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='group_index' type-id='91ce1af9' visibility='default' filepath='include/linux/perf_event.h' line='646' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='migrate_entry' type-id='72f469ec' visibility='default' filepath='include/linux/perf_event.h' line='652' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='hlist_entry' type-id='03a4a074' visibility='default' filepath='include/linux/perf_event.h' line='654' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='active_entry' type-id='72f469ec' visibility='default' filepath='include/linux/perf_event.h' line='655' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='nr_siblings' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='656' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1056'>
          <var-decl name='event_caps' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='659' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='group_caps' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='661' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='group_leader' type-id='2bf16f59' visibility='default' filepath='include/linux/perf_event.h' line='663' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='pmu' type-id='0906f5b9' visibility='default' filepath='include/linux/perf_event.h' line='664' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='pmu_private' type-id='eaa32e2f' visibility='default' filepath='include/linux/perf_event.h' line='665' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='state' type-id='31fdb95a' visibility='default' filepath='include/linux/perf_event.h' line='667' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1376'>
          <var-decl name='attach_state' type-id='f0981eeb' visibility='default' filepath='include/linux/perf_event.h' line='668' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='count' type-id='7da7300e' visibility='default' filepath='include/linux/perf_event.h' line='669' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='child_count' type-id='28ee064c' visibility='default' filepath='include/linux/perf_event.h' line='670' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='total_time_enabled' type-id='91ce1af9' visibility='default' filepath='include/linux/perf_event.h' line='678' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='total_time_running' type-id='91ce1af9' visibility='default' filepath='include/linux/perf_event.h' line='679' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='tstamp' type-id='91ce1af9' visibility='default' filepath='include/linux/perf_event.h' line='680' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='shadow_ctx_time' type-id='91ce1af9' visibility='default' filepath='include/linux/perf_event.h' line='690' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='attr' type-id='e57536d9' visibility='default' filepath='include/linux/perf_event.h' line='692' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='header_size' type-id='1dc6a898' visibility='default' filepath='include/linux/perf_event.h' line='693' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2768'>
          <var-decl name='id_header_size' type-id='1dc6a898' visibility='default' filepath='include/linux/perf_event.h' line='694' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2784'>
          <var-decl name='read_size' type-id='1dc6a898' visibility='default' filepath='include/linux/perf_event.h' line='695' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='hw' type-id='b594b0c9' visibility='default' filepath='include/linux/perf_event.h' line='696' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4352'>
          <var-decl name='ctx' type-id='b9419dc5' visibility='default' filepath='include/linux/perf_event.h' line='698' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4416'>
          <var-decl name='refcount' type-id='f22a8abb' visibility='default' filepath='include/linux/perf_event.h' line='699' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4480'>
          <var-decl name='child_total_time_enabled' type-id='28ee064c' visibility='default' filepath='include/linux/perf_event.h' line='705' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4544'>
          <var-decl name='child_total_time_running' type-id='28ee064c' visibility='default' filepath='include/linux/perf_event.h' line='706' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4608'>
          <var-decl name='child_mutex' type-id='925167dc' visibility='default' filepath='include/linux/perf_event.h' line='711' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4992'>
          <var-decl name='child_list' type-id='72f469ec' visibility='default' filepath='include/linux/perf_event.h' line='712' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5120'>
          <var-decl name='parent' type-id='2bf16f59' visibility='default' filepath='include/linux/perf_event.h' line='713' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5184'>
          <var-decl name='oncpu' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='715' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5216'>
          <var-decl name='cpu' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='716' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5248'>
          <var-decl name='owner_entry' type-id='72f469ec' visibility='default' filepath='include/linux/perf_event.h' line='718' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5376'>
          <var-decl name='owner' type-id='f23e2572' visibility='default' filepath='include/linux/perf_event.h' line='719' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5440'>
          <var-decl name='mmap_mutex' type-id='925167dc' visibility='default' filepath='include/linux/perf_event.h' line='722' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5824'>
          <var-decl name='mmap_count' type-id='49178f86' visibility='default' filepath='include/linux/perf_event.h' line='723' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5888'>
          <var-decl name='rb' type-id='35b814e1' visibility='default' filepath='include/linux/perf_event.h' line='725' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5952'>
          <var-decl name='rb_entry' type-id='72f469ec' visibility='default' filepath='include/linux/perf_event.h' line='726' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6080'>
          <var-decl name='rcu_batches' type-id='7359adad' visibility='default' filepath='include/linux/perf_event.h' line='727' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6144'>
          <var-decl name='rcu_pending' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='728' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6208'>
          <var-decl name='waitq' type-id='b5ab048f' visibility='default' filepath='include/linux/perf_event.h' line='731' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6400'>
          <var-decl name='fasync' type-id='5bb9c75d' visibility='default' filepath='include/linux/perf_event.h' line='732' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6464'>
          <var-decl name='pending_wakeup' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='735' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6496'>
          <var-decl name='pending_kill' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='736' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6528'>
          <var-decl name='pending_disable' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='737' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6592'>
          <var-decl name='pending' type-id='9281c70f' visibility='default' filepath='include/linux/perf_event.h' line='738' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6784'>
          <var-decl name='event_limit' type-id='49178f86' visibility='default' filepath='include/linux/perf_event.h' line='740' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6848'>
          <var-decl name='addr_filters' type-id='54885433' visibility='default' filepath='include/linux/perf_event.h' line='743' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7040'>
          <var-decl name='addr_filter_ranges' type-id='200ffa89' visibility='default' filepath='include/linux/perf_event.h' line='745' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7104'>
          <var-decl name='addr_filters_gen' type-id='7359adad' visibility='default' filepath='include/linux/perf_event.h' line='746' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7168'>
          <var-decl name='aux_event' type-id='2bf16f59' visibility='default' filepath='include/linux/perf_event.h' line='749' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7232'>
          <var-decl name='destroy' type-id='aed2baa8' visibility='default' filepath='include/linux/perf_event.h' line='751' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7296'>
          <var-decl name='callback_head' type-id='e3d8ce29' visibility='default' filepath='include/linux/perf_event.h' line='752' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7424'>
          <var-decl name='ns' type-id='b816e1d0' visibility='default' filepath='include/linux/perf_event.h' line='754' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7488'>
          <var-decl name='id' type-id='91ce1af9' visibility='default' filepath='include/linux/perf_event.h' line='755' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7552'>
          <var-decl name='clock' type-id='0e70db3e' visibility='default' filepath='include/linux/perf_event.h' line='757' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7616'>
          <var-decl name='overflow_handler' type-id='20a2e4e6' visibility='default' filepath='include/linux/perf_event.h' line='758' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7680'>
          <var-decl name='overflow_handler_context' type-id='eaa32e2f' visibility='default' filepath='include/linux/perf_event.h' line='759' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7744'>
          <var-decl name='orig_overflow_handler' type-id='20a2e4e6' visibility='default' filepath='include/linux/perf_event.h' line='761' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7808'>
          <var-decl name='prog' type-id='bdcee7ae' visibility='default' filepath='include/linux/perf_event.h' line='762' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7872'>
          <var-decl name='tp_event' type-id='23d6768c' visibility='default' filepath='include/linux/perf_event.h' line='766' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7936'>
          <var-decl name='filter' type-id='26461068' visibility='default' filepath='include/linux/perf_event.h' line='767' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8000'>
          <var-decl name='security' type-id='eaa32e2f' visibility='default' filepath='include/linux/perf_event.h' line='778' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8064'>
          <var-decl name='sb_list' type-id='72f469ec' visibility='default' filepath='include/linux/perf_event.h' line='780' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pmu' size-in-bits='2368' is-struct='yes' visibility='default' filepath='include/linux/perf_event.h' line='278' column='1' id='e205b6f1'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='entry' type-id='72f469ec' visibility='default' filepath='include/linux/perf_event.h' line='279' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='module' type-id='2730d015' visibility='default' filepath='include/linux/perf_event.h' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='include/linux/perf_event.h' line='282' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='attr_groups' type-id='c97de1ac' visibility='default' filepath='include/linux/perf_event.h' line='283' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='attr_update' type-id='c97de1ac' visibility='default' filepath='include/linux/perf_event.h' line='284' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/perf_event.h' line='285' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='type' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='286' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='480'>
          <var-decl name='capabilities' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='291' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='pmu_disable_count' type-id='7292109c' visibility='default' filepath='include/linux/perf_event.h' line='293' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='pmu_cpu_context' type-id='090503c3' visibility='default' filepath='include/linux/perf_event.h' line='294' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='exclusive_cnt' type-id='49178f86' visibility='default' filepath='include/linux/perf_event.h' line='295' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='672'>
          <var-decl name='task_ctx_nr' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='296' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='hrtimer_interval_ms' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='297' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='736'>
          <var-decl name='nr_addr_filters' type-id='f0981eeb' visibility='default' filepath='include/linux/perf_event.h' line='300' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='pmu_enable' type-id='dae07608' visibility='default' filepath='include/linux/perf_event.h' line='306' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='pmu_disable' type-id='dae07608' visibility='default' filepath='include/linux/perf_event.h' line='307' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='event_init' type-id='8d78edef' visibility='default' filepath='include/linux/perf_event.h' line='325' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='event_mapped' type-id='eddb9394' visibility='default' filepath='include/linux/perf_event.h' line='331' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='event_unmapped' type-id='eddb9394' visibility='default' filepath='include/linux/perf_event.h' line='332' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='add' type-id='afc38bc6' visibility='default' filepath='include/linux/perf_event.h' line='360' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='del' type-id='6c534e17' visibility='default' filepath='include/linux/perf_event.h' line='361' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='start' type-id='6c534e17' visibility='default' filepath='include/linux/perf_event.h' line='381' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='stop' type-id='6c534e17' visibility='default' filepath='include/linux/perf_event.h' line='382' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='read' type-id='aed2baa8' visibility='default' filepath='include/linux/perf_event.h' line='390' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='start_txn' type-id='f865774a' visibility='default' filepath='include/linux/perf_event.h' line='402' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='commit_txn' type-id='0cd76695' visibility='default' filepath='include/linux/perf_event.h' line='411' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='cancel_txn' type-id='dae07608' visibility='default' filepath='include/linux/perf_event.h' line='418' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='event_idx' type-id='8d78edef' visibility='default' filepath='include/linux/perf_event.h' line='424' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='sched_task' type-id='54df184d' visibility='default' filepath='include/linux/perf_event.h' line='429' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='task_ctx_cache' type-id='f3b4aca8' visibility='default' filepath='include/linux/perf_event.h' line='435' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='swap_task_ctx' type-id='7d55f1e4' visibility='default' filepath='include/linux/perf_event.h' line='443' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='setup_aux' type-id='e91cc304' visibility='default' filepath='include/linux/perf_event.h' line='450' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='free_aux' type-id='b7f9d8e6' visibility='default' filepath='include/linux/perf_event.h' line='457' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='snapshot_aux' type-id='eb8bb0cb' visibility='default' filepath='include/linux/perf_event.h' line='468' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='addr_filters_validate' type-id='6668d13a' visibility='default' filepath='include/linux/perf_event.h' line='480' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='addr_filters_sync' type-id='aed2baa8' visibility='default' filepath='include/linux/perf_event.h' line='494' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='aux_output_match' type-id='8d78edef' visibility='default' filepath='include/linux/perf_event.h' line='504' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='filter_match' type-id='8d78edef' visibility='default' filepath='include/linux/perf_event.h' line='510' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='check_period' type-id='36f91979' visibility='default' filepath='include/linux/perf_event.h' line='515' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='perf_cpu_context' size-in-bits='3520' is-struct='yes' visibility='default' filepath='include/linux/perf_event.h' line='861' column='1' id='4448fdd3'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='ctx' type-id='9d67acd5' visibility='default' filepath='include/linux/perf_event.h' line='862' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='task_ctx' type-id='b9419dc5' visibility='default' filepath='include/linux/perf_event.h' line='863' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='active_oncpu' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='864' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2272'>
          <var-decl name='exclusive' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='865' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='hrtimer_lock' type-id='f5c90b3f' visibility='default' filepath='include/linux/perf_event.h' line='867' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='hrtimer' type-id='b6993efc' visibility='default' filepath='include/linux/perf_event.h' line='868' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2944'>
          <var-decl name='hrtimer_interval' type-id='fbc017ef' visibility='default' filepath='include/linux/perf_event.h' line='869' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3008'>
          <var-decl name='hrtimer_active' type-id='f0981eeb' visibility='default' filepath='include/linux/perf_event.h' line='870' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='sched_cb_entry' type-id='72f469ec' visibility='default' filepath='include/linux/perf_event.h' line='877' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3200'>
          <var-decl name='sched_cb_usage' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='878' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3232'>
          <var-decl name='online' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='880' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3264'>
          <var-decl name='heap_size' type-id='95e97e5e' visibility='default' filepath='include/linux/perf_event.h' line='885' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3328'>
          <var-decl name='heap' type-id='a0127209' visibility='default' filepath='include/linux/perf_event.h' line='886' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3392'>
          <var-decl name='heap_default' type-id='e0f8c0f3' visibility='default' filepath='include/linux/perf_event.h' line='887' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='perf_event_context' size-in-bits='2176' is-struct='yes' visibility='default' filepath='include/linux/perf_event.h' line='795' column='1' id='9d67acd5'>
