#ifndef HIDL_GENERATED_ANDROID_HARDWARE_USB_V1_2_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_USB_V1_2_TYPES_H

#include <android/hardware/usb/1.0/types.h>
#include <android/hardware/usb/1.1/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace usb {
namespace V1_2 {

// Forward declaration for forward reference support:
enum class Status : uint32_t;
enum class ContaminantDetectionStatus : uint32_t;
enum class ContaminantProtectionMode : uint32_t;
enum class ContaminantProtectionStatus : uint32_t;
struct PortStatus;

enum class Status : uint32_t {
    SUCCESS = 0u,
    /**
     * error value when the HAL operation fails for reasons not listed here.
     */
    ERROR = 1u,
    /**
     * error value returned when input argument is invalid.
     */
    INVALID_ARGUMENT = 2u,
    /**
     * error value returned when role string is unrecognized.
     */
    UNRECOGNIZED_ROLE = 3u,
    /**
     * Error value returned when the operation is not supported.
     */
    NOT_SUPPORTED = 4u,
};

enum class ContaminantDetectionStatus : uint32_t {
    /**
     * Contaminant presence detection is not supported.
     */
    NOT_SUPPORTED = 0u,
    /**
     * Contaminant presence detection is supported but disabled.
     */
    DISABLED = 1u,
    /**
     * Contaminant presence detection is enabled and contaminant not detected.
     */
    NOT_DETECTED = 2u,
    /**
     * Contaminant presence detection is enabled and contaminant detected.
     */
    DETECTED = 3u,
};

enum class ContaminantProtectionMode : uint32_t {
    /**
     * No action performed upon detection of contaminant presence.
     */
    NONE = 0u,
    /**
     * Upon detection of contaminant presence, Port is forced to sink only
     * mode where a port shall only detect chargers until contaminant presence
     * is no longer detected.
     */
    FORCE_SINK = 1u /* 1 << 0 */,
    /**
     * Upon detection of contaminant presence, Port is forced to source only
     * mode where a port shall only detect usb accessories such as headsets
     * until contaminant presence is no longer detected.
     */
    FORCE_SOURCE = 2u /* 1 << 1 */,
    /**
     * Upon detection of contaminant presence, port is disabled until contaminant
     * presence is no longer detected. In the disabled state port will
     * not respond to connection of chargers or usb accessories.
     */
    FORCE_DISABLE = 4u /* 1 << 2 */,
};

enum class ContaminantProtectionStatus : uint32_t {
    /**
     * No action performed upon detection of contaminant presence.
     */
    NONE = 0u,
    /**
     * Upon detection of contaminant presence, Port is forced to sink only
     * mode where a port shall only detect chargers until contaminant presence
     * is no longer detected.
     */
    FORCE_SINK = 1u /* 1 << 0 */,
    /**
     * Upon detection of contaminant presence, Port is forced to source only
     * mode where a port shall only detect usb accessories such as headsets
     * until contaminant presence is no longer detected.
     */
    FORCE_SOURCE = 2u /* 1 << 1 */,
    /**
     * Upon detection of contaminant presence, port is disabled until contaminant
     * presence is no longer detected. In the disabled state port will
     * not respond to connection of chargers or usb accessories.
     */
    FORCE_DISABLE = 4u /* 1 << 2 */,
    /**
     * Client disabled cotaminant protection by calling
     * enableContaminantPresencePortProtection set to false. Low level drivers should
     * not autmomously take any corrective action when contaminant presence is detected.
     */
    DISABLED = 8u /* 1 << 3 */,
};

struct PortStatus final {
    ::android::hardware::usb::V1_1::PortStatus_1_1 status_1_1 __attribute__ ((aligned(8)));
    /**
     * Contaminant presence protection modes supported by the port.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::usb::V1_2::ContaminantProtectionMode> supportedContaminantProtectionModes __attribute__ ((aligned(4)));
    /**
     * Client can enable/disable contaminant presence protection through
     * enableContaminantPresenceProtection when true.
     */
    bool supportsEnableContaminantPresenceProtection __attribute__ ((aligned(1)));
    /**
     * Contaminant presence protection modes currently active for the port.
     */
    ::android::hardware::usb::V1_2::ContaminantProtectionStatus contaminantProtectionStatus __attribute__ ((aligned(4)));
    /**
     * Client can enable/disable contaminant presence detection through
     * enableContaminantPresenceDetection when true.
     */
    bool supportsEnableContaminantPresenceDetection __attribute__ ((aligned(1)));
    /**
     * Current status of contaminant detection algorithm.
     */
    ::android::hardware::usb::V1_2::ContaminantDetectionStatus contaminantDetectionStatus __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::usb::V1_2::PortStatus, status_1_1) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_2::PortStatus, supportedContaminantProtectionModes) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_2::PortStatus, supportsEnableContaminantPresenceProtection) == 52, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_2::PortStatus, contaminantProtectionStatus) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_2::PortStatus, supportsEnableContaminantPresenceDetection) == 60, "wrong offset");
static_assert(offsetof(::android::hardware::usb::V1_2::PortStatus, contaminantDetectionStatus) == 64, "wrong offset");
static_assert(sizeof(::android::hardware::usb::V1_2::PortStatus) == 72, "wrong size");
static_assert(__alignof(::android::hardware::usb::V1_2::PortStatus) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint32_t o);
static inline std::string toString(::android::hardware::usb::V1_2::Status o);
static inline void PrintTo(::android::hardware::usb::V1_2::Status o, ::std::ostream* os);
constexpr uint32_t operator|(const ::android::hardware::usb::V1_2::Status lhs, const ::android::hardware::usb::V1_2::Status rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const uint32_t lhs, const ::android::hardware::usb::V1_2::Status rhs) {
    return static_cast<uint32_t>(lhs | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const ::android::hardware::usb::V1_2::Status lhs, const uint32_t rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | rhs);
}
