{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIDn",
   "name" : "nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }

   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "name" : "const std::optional<std::vector<long, std::allocator<long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long, std::allocator<unsigned long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/neuralnetworks/aidl/android.hardware.neuralnetworks-V1-ndk_platform-source/gen/include/aidl/android/hardware/neuralnetworks/Memory.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/neuralnetworks/aidl/android.hardware.neuralnetworks-V1-ndk_platform-source/gen/include/aidl/android/hardware/neuralnetworks/IBuffer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks7IBufferE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::neuralnetworks::IBuffer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware14neuralnetworks7IBufferE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer8copyFromERKNS2_6MemoryERKNSt3__16vectorIiNS7_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer6copyToERKNS2_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks7IBufferE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::neuralnetworks::IBuffer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware14neuralnetworks7IBufferE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer8copyFromERKNS2_6MemoryERKNSt3__16vectorIiNS7_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer6copyToERKNS2_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP13AIBinder_Weak" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP23AIBinder_DeathRecipient" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP7AParcel" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP7AStatus" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IBufferEEE"
    },
    {
     "field_name" : "token",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks12DeviceBufferE",
   "name" : "aidl::android::hardware::neuralnetworks::DeviceBuffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks12DeviceBufferE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks12DeviceBufferE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/neuralnetworks/aidl/android.hardware.neuralnetworks-V1-ndk_platform-source/gen/include/aidl/android/hardware/neuralnetworks/DeviceBuffer.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks7IBufferE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks14IBufferDefaultE",
   "name" : "aidl::android::hardware::neuralnetworks::IBufferDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks14IBufferDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks14IBufferDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/neuralnetworks/aidl/android.hardware.neuralnetworks-V1-ndk_platform-source/gen/include/aidl/android/hardware/neuralnetworks/IBuffer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks14IBufferDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks14IBufferDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks14IBufferDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks14IBufferDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks14IBufferDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks14IBufferDefault8copyFromERKNS2_6MemoryERKNSt3__16vectorIiNS7_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks14IBufferDefault6copyToERKNS2_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks14IBufferDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks14IBufferDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJN4aidl7android8hardware6common6AshmemENS4_12MappableFileENS3_8graphics6common14HardwareBufferEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks6MemoryE",
   "name" : "aidl::android::hardware::neuralnetworks::Memory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks6MemoryE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks6MemoryE",
   "size" : 88,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/neuralnetworks/aidl/android.hardware.neuralnetworks-V1-ndk_platform-source/gen/include/aidl/android/hardware/neuralnetworks/Memory.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks7IBufferE",
   "name" : "aidl::android::hardware::neuralnetworks::IBuffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks7IBufferE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks7IBufferE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/neuralnetworks/aidl/android.hardware.neuralnetworks-V1-ndk_platform-source/gen/include/aidl/android/hardware/neuralnetworks/IBuffer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks7IBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBufferD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer8copyFromERKNS2_6MemoryERKNSt3__16vectorIiNS7_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer6copyToERKNS2_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks8BnBufferE",
   "name" : "aidl::android::hardware::neuralnetworks::BnBuffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks8BnBufferE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks8BnBufferE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/neuralnetworks/aidl/android.hardware.neuralnetworks-V1-ndk_platform-source/gen/include/aidl/android/hardware/neuralnetworks/BnBuffer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks8BnBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks8BnBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks8BnBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer8copyFromERKNS2_6MemoryERKNSt3__16vectorIiNS7_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks7IBuffer6copyToERKNS2_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks8BnBuffer19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks8BnBuffer16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks8BnBuffer12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks8BpBufferE",
   "name" : "aidl::android::hardware::neuralnetworks::BpBuffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks8BpBufferE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks8BpBufferE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/neuralnetworks/aidl/android.hardware.neuralnetworks-V1-ndk_platform-source/gen/include/aidl/android/hardware/neuralnetworks/BpBuffer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks8BpBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks8BpBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks8BpBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware14neuralnetworks7IBufferEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks8BpBuffer8copyFromERKNS2_6MemoryERKNSt3__16vectorIiNS7_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks8BpBuffer6copyToERKNS2_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks8BpBuffer19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks8BpBuffer16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "length",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "prot",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fd",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common12MappableFileE",
   "name" : "aidl::android::hardware::common::MappableFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common12MappableFileE",
   "self_type" : "_ZTIN4aidl7android8hardware6common12MappableFileE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/aidl/android.hardware.common-V2-ndk_platform-source/gen/include/aidl/android/hardware/common/MappableFile.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds",
     "referenced_type" : "_ZTINSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE"
    },
    {
     "field_name" : "ints",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "name" : "aidl::android::hardware::common::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "self_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/aidl/android.hardware.common-V2-ndk_platform-source/gen/include/aidl/android/hardware/common/NativeHandle.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common6AshmemE",
   "name" : "aidl::android::hardware::common::Ashmem",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common6AshmemE",
   "self_type" : "_ZTIN4aidl7android8hardware6common6AshmemE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/aidl/android.hardware.common-V2-ndk_platform-source/gen/include/aidl/android/hardware/common/Ashmem.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "description",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common25HardwareBufferDescriptionE"
    },
    {
     "field_name" : "handle",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common14HardwareBufferE",
   "name" : "aidl::android::hardware::graphics::common::HardwareBuffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common14HardwareBufferE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common14HardwareBufferE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-V2-ndk_platform-source/gen/include/aidl/android/hardware/graphics/common/HardwareBuffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11PixelFormatE"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11BufferUsageE"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common25HardwareBufferDescriptionE",
   "name" : "aidl::android::hardware::graphics::common::HardwareBufferDescription",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common25HardwareBufferDescriptionE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common25HardwareBufferDescriptionE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-V2-ndk_platform-source/gen/include/aidl/android/hardware/graphics/common/HardwareBufferDescription.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN3ndk20ScopedFileDescriptorENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<ndk::ScopedFileDescriptor, std::allocator<ndk::ScopedFileDescriptor>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN3ndk20ScopedFileDescriptorENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN3ndk20ScopedFileDescriptorENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<int, std::allocator<int>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIiNS3_9allocatorIiEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6common12MappableFileEEE",
   "name" : "android::internal::details::IsPointerLike<aidl::android::hardware::common::MappableFile>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6common12MappableFileEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6common12MappableFileEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware6common12MappableFileE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6common12NativeHandleEEE",
   "name" : "android::internal::details::IsPointerLike<aidl::android::hardware::common::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6common12NativeHandleEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6common12NativeHandleEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" : [ "_ZTIN4aidl7android8hardware6common12NativeHandleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6common6AshmemEEE",
   "name" : "android::internal::details::IsPointerLike<aidl::android::hardware::common::Ashmem>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6common6AshmemEEE",
