{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIy",
   "name" : "unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIy",
   "size" : 8
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" :
 [
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 0,

  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPy",
   "name" : "unsigned long long *",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIPy",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include_private/ui/FlattenableHelpers.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android16LightFlattenableINS_17DeviceProductInfoEEE",
   "name" : "const android::LightFlattenable<android::DeviceProductInfo>",
   "referenced_type" : "_ZTIN7android16LightFlattenableINS_17DeviceProductInfoEEE",
   "self_type" : "_ZTIKN7android16LightFlattenableINS_17DeviceProductInfoEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android17DeviceProductInfoE",
   "name" : "const android::DeviceProductInfo",
   "referenced_type" : "_ZTIN7android17DeviceProductInfoE",
   "self_type" : "_ZTIKN7android17DeviceProductInfoE",
   "size" : 52,
   "source_file" : "frameworks/native/libs/ui/include/ui/DeviceProductInfo.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2ui17StaticDisplayInfoE",
   "name" : "const android::ui::StaticDisplayInfo",
   "referenced_type" : "_ZTIN7android2ui17StaticDisplayInfoE",
   "self_type" : "_ZTIKN7android2ui17StaticDisplayInfoE",
   "size" : 68,
   "source_file" : "frameworks/native/libs/ui/include/ui/StaticDisplayInfo.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2ui21DisplayConnectionTypeE",
   "name" : "const android::ui::DisplayConnectionType",
   "referenced_type" : "_ZTIN7android2ui21DisplayConnectionTypeE",
   "self_type" : "_ZTIKN7android2ui21DisplayConnectionTypeE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/ui/include_private/ui/FlattenableHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalIN7android17DeviceProductInfoEEE",
   "name" : "const std::optional<android::DeviceProductInfo>",
   "referenced_type" : "_ZTINSt3__18optionalIN7android17DeviceProductInfoEEE",
   "self_type" : "_ZTIKNSt3__18optionalIN7android17DeviceProductInfoEEE",
   "size" : 56,
   "source_file" : "frameworks/native/libs/ui/include_private/ui/FlattenableHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/core/libutils/include/utils/Flattenable.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16FlattenableUtilsE",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16FlattenableUtilsE",
   "self_type" : "_ZTIN7android16FlattenableUtilsE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16LightFlattenableINS_17DeviceProductInfoEEE",
   "name" : "android::LightFlattenable<android::DeviceProductInfo>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16LightFlattenableINS_17DeviceProductInfoEEE",
   "self_type" : "_ZTIN7android16LightFlattenableINS_17DeviceProductInfoEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android17DeviceProductInfoE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16LightFlattenableINS_2ui17StaticDisplayInfoEEE",
   "name" : "android::LightFlattenable<android::ui::StaticDisplayInfo>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16LightFlattenableINS_2ui17StaticDisplayInfoEEE",
   "self_type" : "_ZTIN7android16LightFlattenableINS_2ui17StaticDisplayInfoEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android2ui17StaticDisplayInfoE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android17DeviceProductInfo9ModelYearE"
    }
   ],
   "linker_set_key" : "_ZTIN7android17DeviceProductInfo15ManufactureYearE",
   "name" : "android::DeviceProductInfo::ManufactureYear",
   "referenced_type" : "_ZTIN7android17DeviceProductInfo15ManufactureYearE",
   "self_type" : "_ZTIN7android17DeviceProductInfo15ManufactureYearE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/DeviceProductInfo.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android17DeviceProductInfo15ManufactureYearE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "week",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTIN7android17DeviceProductInfo22ManufactureWeekAndYearE",
   "name" : "android::DeviceProductInfo::ManufactureWeekAndYear",
   "referenced_type" : "_ZTIN7android17DeviceProductInfo22ManufactureWeekAndYearE",
   "self_type" : "_ZTIN7android17DeviceProductInfo22ManufactureWeekAndYearE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/ui/include/ui/DeviceProductInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "year",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android17DeviceProductInfo9ModelYearE",
   "name" : "android::DeviceProductInfo::ModelYear",
   "referenced_type" : "_ZTIN7android17DeviceProductInfo9ModelYearE",
   "self_type" : "_ZTIN7android17DeviceProductInfo9ModelYearE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/DeviceProductInfo.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android16LightFlattenableINS_17DeviceProductInfoEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "manufacturerPnpId",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__15arrayIcLj4EEE"
    },
    {
     "field_name" : "productId",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "manufactureOrModelDate",
     "field_offset" : 224,
     "referenced_type" : "_ZTINSt3__17variantIJN7android17DeviceProductInfo9ModelYearENS2_15ManufactureYearENS2_22ManufactureWeekAndYearEEEE"
    },
    {
     "field_name" : "relativeAddress",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android17DeviceProductInfoE",
   "name" : "android::DeviceProductInfo",
   "referenced_type" : "_ZTIN7android17DeviceProductInfoE",
   "self_type" : "_ZTIN7android17DeviceProductInfoE",
   "size" : 52,
   "source_file" : "frameworks/native/libs/ui/include/ui/DeviceProductInfo.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18FlattenableHelpersE",
   "name" : "android::FlattenableHelpers",
   "referenced_type" : "_ZTIN7android18FlattenableHelpersE",
   "self_type" : "_ZTIN7android18FlattenableHelpersE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include_private/ui/FlattenableHelpers.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android16LightFlattenableINS_2ui17StaticDisplayInfoEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "connectionType",
     "referenced_type" : "_ZTIN7android2ui21DisplayConnectionTypeE"
    },
    {
     "field_name" : "density",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "secure",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "deviceProductInfo",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__18optionalIN7android17DeviceProductInfoEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2ui17StaticDisplayInfoE",
   "name" : "android::ui::StaticDisplayInfo",
   "referenced_type" : "_ZTIN7android2ui17StaticDisplayInfoE",
   "self_type" : "_ZTIN7android2ui17StaticDisplayInfoE",
   "size" : 68,
   "source_file" : "frameworks/native/libs/ui/include/ui/StaticDisplayInfo.h"
  }
 ],
 "rvalue_reference_types" : []
}
