{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1_h",
   "name" : "unsigned char [1]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA1_h",
   "size" : 1,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA256_t",
   "name" : "unsigned short [256]",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIA256_t",
   "size" : 512,
   "source_file" : "external/libpng/pngpriv.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA29_c",
   "name" : "char [29]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA29_c",
   "size" : 29,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4_PFvP19png_row_info_structPhPKhE",
   "name" : "void (*[4])(png_row_info_struct *, unsigned char *, const unsigned char *)",
   "referenced_type" : "_ZTIPFvP19png_row_info_structPhPKhE",
   "self_type" : "_ZTIA4_PFvP19png_row_info_structPhPKhE",
   "size" : 16,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA512_h",
   "name" : "unsigned char [512]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA512_h",
   "size" : 512,
   "source_file" : "external/libpng/pngpriv.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA512_t",
   "name" : "unsigned short [512]",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIA512_t",
   "size" : 1024,

   "name" : "void (*)(png_struct_def *, png_row_info_struct *, unsigned char *)",
   "referenced_type" : "_ZTIFvP14png_struct_defP19png_row_info_structPhE",
   "self_type" : "_ZTIPFvP14png_struct_defP19png_row_info_structPhE",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14png_struct_defPKcE",
   "name" : "void (*)(png_struct_def *, const char *)",
   "referenced_type" : "_ZTIFvP14png_struct_defPKcE",
   "self_type" : "_ZTIPFvP14png_struct_defPKcE",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14png_struct_defPhjE",
   "name" : "void (*)(png_struct_def *, unsigned char *, unsigned int)",
   "referenced_type" : "_ZTIFvP14png_struct_defPhjE",
   "self_type" : "_ZTIPFvP14png_struct_defPhjE",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14png_struct_defPhjiE",
   "name" : "void (*)(png_struct_def *, unsigned char *, unsigned int, int)",
   "referenced_type" : "_ZTIFvP14png_struct_defPhjiE",
   "self_type" : "_ZTIPFvP14png_struct_defPhjiE",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14png_struct_defPvE",
   "name" : "void (*)(png_struct_def *, void *)",
   "referenced_type" : "_ZTIFvP14png_struct_defPvE",
   "self_type" : "_ZTIPFvP14png_struct_defPvE",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP14png_struct_defjiE",
   "name" : "void (*)(png_struct_def *, unsigned int, int)",
   "referenced_type" : "_ZTIFvP14png_struct_defjiE",
   "self_type" : "_ZTIPFvP14png_struct_defjiE",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvP19png_row_info_structPhPKhE",
   "name" : "void (*)(png_row_info_struct *, unsigned char *, const unsigned char *)",
   "referenced_type" : "_ZTIFvP19png_row_info_structPhPKhE",
   "self_type" : "_ZTIPFvP19png_row_info_structPhPKhE",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvPliE",
   "name" : "void (*)(long *, int)",
   "referenced_type" : "_ZTIFvPliE",
   "self_type" : "_ZTIPFvPliE",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPc",
   "name" : "char **",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIPPc",
   "size" : 4,
   "source_file" : "external/libpng/pnginfo.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPh",
   "name" : "unsigned char **",
   "referenced_type" : "_ZTIPh",
   "self_type" : "_ZTIPPh",
   "size" : 4,
   "source_file" : "external/libpng/pnginfo.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPt",
   "name" : "unsigned short **",
   "referenced_type" : "_ZTIPt",
   "self_type" : "_ZTIPPt",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "external/libpng/png.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "external/libpng/png.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPl",
   "name" : "long *",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIPl",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPt",
   "name" : "unsigned short *",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIPt",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/libpng/pngstruct.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIA256_Kt",
   "name" : "unsigned short const[256]",
   "referenced_type" : "_ZTIA256_t",
   "self_type" : "_ZTIA256_Kt",
   "size" : 512,
   "source_file" : "external/libpng/pngpriv.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIA512_Kh",
   "name" : "unsigned char const[512]",
   "referenced_type" : "_ZTIA512_h",
   "self_type" : "_ZTIA512_Kh",
   "size" : 512,
   "source_file" : "external/libpng/pngpriv.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIA512_Kt",
   "name" : "unsigned short const[512]",
   "referenced_type" : "_ZTIA512_t",
   "self_type" : "_ZTIA512_Kt",
   "size" : 1024,
   "source_file" : "external/libpng/pngpriv.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/libpng/pngstruct.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "png_ptr",
     "referenced_type" : "_ZTIP14png_struct_def"
    },
    {
     "field_name" : "info_ptr",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP12png_info_def"
    },
    {
     "field_name" : "error_buf",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "memory",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "for_write",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "owned_file",
     "field_offset" : 161,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11png_control",
   "name" : "png_control",
   "referenced_type" : "_ZTI11png_control",
   "self_type" : "_ZTI11png_control",
   "size" : 24,
   "source_file" : "external/libpng/pngpriv.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "valid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rowbytes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "palette",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP16png_color_struct"
    },
    {
     "field_name" : "num_palette",
     "field_offset" : 160,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "num_trans",
     "field_offset" : 176,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "bit_depth",
     "field_offset" : 192,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "color_type",
     "field_offset" : 200,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "compression_type",
     "field_offset" : 208,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "filter_type",
     "field_offset" : 216,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "interlace_type",
     "field_offset" : 224,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "channels",
     "field_offset" : 232,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pixel_depth",
     "field_offset" : 240,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "spare_byte",
     "field_offset" : 248,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "signature",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "colorspace",
     "field_offset" : 320,
     "referenced_type" : "_ZTI14png_colorspace"
    },
    {
     "field_name" : "iccp_name",
     "field_offset" : 928,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "iccp_profile",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "iccp_proflen",
     "field_offset" : 992,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_text",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "max_text",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "text",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIP15png_text_struct"
    },
    {
     "field_name" : "mod_time",
     "field_offset" : 1120,
     "referenced_type" : "_ZTI15png_time_struct"
    },
    {
     "field_name" : "sig_bit",
     "field_offset" : 1184,
     "referenced_type" : "_ZTI18png_color_8_struct"
    },
    {
     "field_name" : "trans_alpha",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "trans_color",
     "field_offset" : 1280,
     "referenced_type" : "_ZTI19png_color_16_struct"
    },
    {
     "field_name" : "background",
     "field_offset" : 1360,
     "referenced_type" : "_ZTI19png_color_16_struct"
    },
    {
     "field_name" : "x_offset",
     "field_offset" : 1440,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "y_offset",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "offset_unit_type",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "x_pixels_per_unit",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "y_pixels_per_unit",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "phys_unit_type",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "num_exif",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "exif",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "eXIf_buf",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "hist",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPt"
    },
    {
     "field_name" : "pcal_purpose",
     "field_offset" : 1760,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pcal_X0",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pcal_X1",
     "field_offset" : 1824,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pcal_units",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pcal_params",
     "field_offset" : 1888,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "pcal_type",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pcal_nparams",
     "field_offset" : 1928,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "free_me",
     "field_offset" : 1952,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unknown_chunks",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIP19png_unknown_chunk_t"
    },
    {
     "field_name" : "unknown_chunks_num",
     "field_offset" : 2016,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "splt_palettes",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIP15png_sPLT_struct"
    },
    {
     "field_name" : "splt_palettes_num",
     "field_offset" : 2080,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "scal_unit",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "scal_s_width",
     "field_offset" : 2144,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "scal_s_height",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "row_pointers",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIPPh"
    }
   ],
   "linker_set_key" : "_ZTI12png_info_def",
   "name" : "png_info_def",
   "referenced_type" : "_ZTI12png_info_def",
   "self_type" : "_ZTI12png_info_def",
   "size" : 280,
   "source_file" : "external/libpng/pnginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gamma",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "end_points_xy",
     "field_offset" : 32,
     "referenced_type" : "_ZTI6png_xy"
    },
    {
     "field_name" : "end_points_XYZ",
     "field_offset" : 288,
     "referenced_type" : "_ZTI7png_XYZ"
    },
    {
     "field_name" : "rendering_intent",
     "field_offset" : 576,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "flags",
     "field_offset" : 592,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI14png_colorspace",
   "name" : "png_colorspace",
   "referenced_type" : "_ZTI14png_colorspace",
   "self_type" : "_ZTI14png_colorspace",
   "size" : 76,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "jmp_buf_local",
     "referenced_type" : "_ZTIA64_l"
    },
    {
     "field_name" : "longjmp_fn",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIPFvPliE"
    },
    {
     "field_name" : "jmp_buf_ptr",
     "field_offset" : 2080,
     "referenced_type" : "_ZTIPA64_l"
    },
    {
     "field_name" : "jmp_buf_size",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "error_fn",
     "field_offset" : 2144,
     "referenced_type" : "_ZTIPFvP14png_struct_defPKcE"
    },
    {
     "field_name" : "error_ptr",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "write_data_fn",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIPFvP14png_struct_defPhjE"
    },
    {
     "field_name" : "read_data_fn",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPFvP14png_struct_defPhjE"
    },
    {
     "field_name" : "io_ptr",
     "field_offset" : 2272,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "read_user_transform_fn",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIPFvP14png_struct_defP19png_row_info_structPhE"
    },
    {
     "field_name" : "write_user_transform_fn",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIPFvP14png_struct_defP19png_row_info_structPhE"
    },
    {
     "field_name" : "user_transform_ptr",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "user_transform_depth",
     "field_offset" : 2400,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "user_transform_channels",
     "field_offset" : 2408,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "mode",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 2464,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "transformations",
     "field_offset" : 2496,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "zowner",
     "field_offset" : 2528,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "zstream",
     "field_offset" : 2560,
     "referenced_type" : "_ZTI10z_stream_s"
    },
    {
     "field_name" : "zbuffer_list",
     "field_offset" : 3008,
     "referenced_type" : "_ZTIP22png_compression_buffer"
    },
    {
     "field_name" : "zbuffer_size",
     "field_offset" : 3040,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "zlib_level",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_method",
     "field_offset" : 3104,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_window_bits",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_mem_level",
     "field_offset" : 3168,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_strategy",
     "field_offset" : 3200,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_text_level",
     "field_offset" : 3232,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_text_method",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_text_window_bits",
     "field_offset" : 3296,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_text_mem_level",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_text_strategy",
     "field_offset" : 3360,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_set_level",
     "field_offset" : 3392,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_set_method",
     "field_offset" : 3424,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_set_window_bits",
     "field_offset" : 3456,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_set_mem_level",
     "field_offset" : 3488,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zlib_set_strategy",
     "field_offset" : 3520,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "width",
     "field_offset" : 3552,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 3584,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_rows",
     "field_offset" : 3616,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usr_width",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rowbytes",
     "field_offset" : 3680,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "iwidth",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "row_number",
     "field_offset" : 3744,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "chunk_name",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "prev_row",
     "field_offset" : 3808,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "row_buf",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "try_row",
     "field_offset" : 3872,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "tst_row",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "info_rowbytes",
     "field_offset" : 3936,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idat_size",
     "field_offset" : 3968,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "crc",
     "field_offset" : 4000,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "palette",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIP16png_color_struct"
    },
    {
     "field_name" : "num_palette",
     "field_offset" : 4064,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "num_palette_max",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_trans",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "compression",
     "field_offset" : 4144,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "filter",
     "field_offset" : 4152,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "interlaced",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pass",
     "field_offset" : 4168,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "do_filter",
     "field_offset" : 4176,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "color_type",
     "field_offset" : 4184,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "bit_depth",
     "field_offset" : 4192,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "usr_bit_depth",
     "field_offset" : 4200,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pixel_depth",
     "field_offset" : 4208,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "channels",
     "field_offset" : 4216,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "usr_channels",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "sig_bytes",
     "field_offset" : 4232,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "maximum_pixel_depth",
     "field_offset" : 4240,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "transformed_pixel_depth",
     "field_offset" : 4248,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "zstream_start",
     "field_offset" : 4256,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "filler",
     "field_offset" : 4272,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "background_gamma_type",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "background_gamma",
     "field_offset" : 4320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "background",
     "field_offset" : 4352,
     "referenced_type" : "_ZTI19png_color_16_struct"
    },
    {
     "field_name" : "background_1",
     "field_offset" : 4432,
     "referenced_type" : "_ZTI19png_color_16_struct"
    },
    {
     "field_name" : "output_flush_fn",
     "field_offset" : 4512,
     "referenced_type" : "_ZTIPFvP14png_struct_defE"
    },
    {
     "field_name" : "flush_dist",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flush_rows",
     "field_offset" : 4576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gamma_shift",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "screen_gamma",
     "field_offset" : 4640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "gamma_table",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "gamma_16_table",
     "field_offset" : 4704,
     "referenced_type" : "_ZTIPPt"
    },
    {
     "field_name" : "gamma_from_1",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "gamma_to_1",
     "field_offset" : 4768,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "gamma_16_from_1",
     "field_offset" : 4800,
     "referenced_type" : "_ZTIPPt"
    },
    {
     "field_name" : "gamma_16_to_1",
     "field_offset" : 4832,
     "referenced_type" : "_ZTIPPt"
    },
    {
     "field_name" : "sig_bit",
     "field_offset" : 4864,
     "referenced_type" : "_ZTI18png_color_8_struct"
    },
    {
     "field_name" : "shift",
     "field_offset" : 4904,
     "referenced_type" : "_ZTI18png_color_8_struct"
    },
    {
     "field_name" : "trans_alpha",
     "field_offset" : 4960,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "trans_color",
     "field_offset" : 4992,
     "referenced_type" : "_ZTI19png_color_16_struct"
    },
    {
     "field_name" : "read_row_fn",
     "field_offset" : 5088,
     "referenced_type" : "_ZTIPFvP14png_struct_defjiE"
    },
    {
     "field_name" : "write_row_fn",
     "field_offset" : 5120,
     "referenced_type" : "_ZTIPFvP14png_struct_defjiE"
    },
    {
     "field_name" : "info_fn",
     "field_offset" : 5152,
     "referenced_type" : "_ZTIPFvP14png_struct_defP12png_info_defE"
    },
    {
     "field_name" : "row_fn",
     "field_offset" : 5184,
     "referenced_type" : "_ZTIPFvP14png_struct_defPhjiE"
    },
    {
     "field_name" : "end_fn",
     "field_offset" : 5216,
     "referenced_type" : "_ZTIPFvP14png_struct_defP12png_info_defE"
    },
    {
     "field_name" : "save_buffer_ptr",
     "field_offset" : 5248,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "save_buffer",
     "field_offset" : 5280,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "current_buffer_ptr",
     "field_offset" : 5312,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "current_buffer",
     "field_offset" : 5344,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "push_length",
     "field_offset" : 5376,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "skip_length",
     "field_offset" : 5408,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "save_buffer_size",
     "field_offset" : 5440,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "save_buffer_max",
     "field_offset" : 5472,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_size",
     "field_offset" : 5504,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "current_buffer_size",
     "field_offset" : 5536,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "process_mode",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cur_palette",
     "field_offset" : 5600,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "palette_lookup",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "quantize_index",
     "field_offset" : 5664,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "options",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "time_buffer",
     "field_offset" : 5728,
     "referenced_type" : "_ZTIA29_c"
    },
    {
     "field_name" : "free_me",
     "field_offset" : 5984,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "user_chunk_ptr",
     "field_offset" : 6016,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "read_user_chunk_fn",
     "field_offset" : 6048,
     "referenced_type" : "_ZTIPFiP14png_struct_defP19png_unknown_chunk_tE"
    },
    {
     "field_name" : "unknown_default",
     "field_offset" : 6080,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_chunk_list",
     "field_offset" : 6112,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "chunk_list",
     "field_offset" : 6144,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "rgb_to_gray_status",
     "field_offset" : 6176,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rgb_to_gray_coefficients_set",
     "field_offset" : 6184,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rgb_to_gray_red_coeff",
     "field_offset" : 6192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rgb_to_gray_green_coeff",
     "field_offset" : 6208,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "riffled_palette",
     "field_offset" : 6240,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "mng_features_permitted",
     "field_offset" : 6272,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "filter_type",
     "field_offset" : 6304,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "mem_ptr",
     "field_offset" : 6336,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "malloc_fn",
     "field_offset" : 6368,
     "referenced_type" : "_ZTIPFPvP14png_struct_defjE"
    },
    {
     "field_name" : "free_fn",
     "field_offset" : 6400,
     "referenced_type" : "_ZTIPFvP14png_struct_defPvE"
    },
    {
     "field_name" : "big_row_buf",
     "field_offset" : 6432,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "quantize_sort",
     "field_offset" : 6464,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "index_to_palette",
     "field_offset" : 6496,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "palette_to_index",
     "field_offset" : 6528,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "compression_type",
     "field_offset" : 6560,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "user_width_max",
     "field_offset" : 6592,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "user_height_max",
     "field_offset" : 6624,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "user_chunk_cache_max",
     "field_offset" : 6656,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "user_chunk_malloc_max",
     "field_offset" : 6688,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unknown_chunk",
     "field_offset" : 6720,
     "referenced_type" : "_ZTI19png_unknown_chunk_t"
    },
    {
     "field_name" : "old_big_row_buf_size",
     "field_offset" : 6880,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "read_buffer",
     "field_offset" : 6912,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "read_buffer_size",
     "field_offset" : 6944,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "IDAT_read_size",
     "field_offset" : 6976,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "io_state",
     "field_offset" : 7008,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "big_prev_row",
     "field_offset" : 7040,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "read_filter",
     "field_offset" : 7072,
     "referenced_type" : "_ZTIA4_PFvP19png_row_info_structPhPKhE"
    },
    {
     "field_name" : "colorspace",
     "field_offset" : 7200,
     "referenced_type" : "_ZTI14png_colorspace"
    }
   ],
   "linker_set_key" : "_ZTI14png_struct_def",
   "name" : "png_struct_def",
   "referenced_type" : "_ZTI14png_struct_def",
   "self_type" : "_ZTI14png_struct_def",
   "size" : 976,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "depth",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "entries",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP21png_sPLT_entry_struct"
    },
    {
     "field_name" : "nentries",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI15png_sPLT_struct",
   "name" : "png_sPLT_struct",
   "referenced_type" : "_ZTI15png_sPLT_struct",
   "self_type" : "_ZTI15png_sPLT_struct",
   "size" : 16,
   "source_file" : "external/libpng/png.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "compression",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "key",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "text",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "text_length",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "itxt_length",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lang",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "lang_key",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI15png_text_struct",
   "name" : "png_text_struct",
   "referenced_type" : "_ZTI15png_text_struct",
   "self_type" : "_ZTI15png_text_struct",
   "size" : 28,
   "source_file" : "external/libpng/png.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "year",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "month",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "day",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "hour",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "minute",
     "field_offset" : 40,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "second",
     "field_offset" : 48,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI15png_time_struct",
   "name" : "png_time_struct",
   "referenced_type" : "_ZTI15png_time_struct",
   "self_type" : "_ZTI15png_time_struct",
   "size" : 8,
   "source_file" : "external/libpng/png.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "red",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "green",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "blue",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI16png_color_struct",
   "name" : "png_color_struct",
   "referenced_type" : "_ZTI16png_color_struct",
   "self_type" : "_ZTI16png_color_struct",
   "size" : 3,
   "source_file" : "external/libpng/png.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "red",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "green",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "blue",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "gray",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "alpha",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI18png_color_8_struct",
   "name" : "png_color_8_struct",
   "referenced_type" : "_ZTI18png_color_8_struct",
   "self_type" : "_ZTI18png_color_8_struct",
   "size" : 5,
   "source_file" : "external/libpng/png.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "red",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "green",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "blue",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "gray",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI19png_color_16_struct",
   "name" : "png_color_16_struct",
   "referenced_type" : "_ZTI19png_color_16_struct",
   "self_type" : "_ZTI19png_color_16_struct",
   "size" : 10,
   "source_file" : "external/libpng/png.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rowbytes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "color_type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "bit_depth",
     "field_offset" : 72,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "channels",
     "field_offset" : 80,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pixel_depth",
     "field_offset" : 88,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI19png_row_info_struct",
   "name" : "png_row_info_struct",
   "referenced_type" : "_ZTI19png_row_info_struct",
   "self_type" : "_ZTI19png_row_info_struct",
   "size" : 12,
   "source_file" : "external/libpng/png.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIA5_h"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "location",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI19png_unknown_chunk_t",
   "name" : "png_unknown_chunk_t",
   "referenced_type" : "_ZTI19png_unknown_chunk_t",
   "self_type" : "_ZTI19png_unknown_chunk_t",
   "size" : 20,
   "source_file" : "external/libpng/png.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "red",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "green",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "blue",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "alpha",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "frequency",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI21png_sPLT_entry_struct",
   "name" : "png_sPLT_entry_struct",
   "referenced_type" : "_ZTI21png_sPLT_entry_struct",
   "self_type" : "_ZTI21png_sPLT_entry_struct",
   "size" : 10,
   "source_file" : "external/libpng/png.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP22png_compression_buffer"
    },
    {
     "field_name" : "output",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI22png_compression_buffer",
   "name" : "png_compression_buffer",
   "referenced_type" : "_ZTI22png_compression_buffer",
   "self_type" : "_ZTI22png_compression_buffer",
   "size" : 8,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "redx",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "redy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "greenx",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "greeny",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bluex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bluey",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "whitex",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "whitey",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6png_xy",
   "name" : "png_xy",
   "referenced_type" : "_ZTI6png_xy",
   "self_type" : "_ZTI6png_xy",
   "size" : 32,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "red_X",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "red_Y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "red_Z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "green_X",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "green_Y",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "green_Z",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "blue_X",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "blue_Y",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "blue_Z",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7png_XYZ",
   "name" : "png_XYZ",
   "referenced_type" : "_ZTI7png_XYZ",
   "self_type" : "_ZTI7png_XYZ",
   "size" : 36,
   "source_file" : "external/libpng/pngstruct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "opaque",
     "referenced_type" : "_ZTIP11png_control"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "width",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "colormap_entries",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "warning_or_error",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA64_c"
    }
   ],
   "linker_set_key" : "_ZTI9png_image",
   "name" : "png_image",
   "referenced_type" : "_ZTI9png_image",
   "self_type" : "_ZTI9png_image",
   "size" : 96,
   "source_file" : "external/libpng/png.h"
  }
 ],
 "rvalue_reference_types" : []
}
