{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" :
 [
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 1,
     "name" : "android::trait_trivial_copy<android::Rect>::value"
    }
   ],
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_4RectEE6$valueE",
   "name" : "android::trait_trivial_copy<Rect>::(anonymous enum at frameworks/native/libs/ui/include/ui/Rect.h:234:1)",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_4RectEE6$valueE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_4RectEE6$valueE",
   "size" : 4,

   "name" : "const android::ui::Size *",
   "referenced_type" : "_ZTIKN7android2ui4SizeE",
   "self_type" : "_ZTIPKN7android2ui4SizeE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/Size.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKN7android4RectE",
   "name" : "const android::Rect *",
   "referenced_type" : "_ZTIKN7android4RectE",
   "self_type" : "_ZTIPKN7android4RectE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKN7android5PointE",
   "name" : "const android::Point *",
   "referenced_type" : "_ZTIKN7android5PointE",
   "self_type" : "_ZTIPKN7android5PointE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKN7android9FloatRectE",
   "name" : "const android::FloatRect *",
   "referenced_type" : "_ZTIKN7android9FloatRectE",
   "self_type" : "_ZTIPKN7android9FloatRectE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/FloatRect.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKNSt3__14hashIN7android4RectEEE",
   "name" : "const std::hash<android::Rect> *",
   "referenced_type" : "_ZTIKNSt3__14hashIN7android4RectEEE",
   "self_type" : "_ZTIPKNSt3__14hashIN7android4RectEEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKNSt3__14hashIN7android9FloatRectEEE",
   "name" : "const std::hash<android::FloatRect> *",
   "referenced_type" : "_ZTIKNSt3__14hashIN7android9FloatRectEEE",
   "self_type" : "_ZTIPKNSt3__14hashIN7android9FloatRectEEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/FloatRect.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN7android2ui4SizeE",
   "name" : "android::ui::Size *",
   "referenced_type" : "_ZTIN7android2ui4SizeE",
   "self_type" : "_ZTIPN7android2ui4SizeE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/Size.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN7android4RectE",
   "name" : "android::Rect *",
   "referenced_type" : "_ZTIN7android4RectE",
   "self_type" : "_ZTIPN7android4RectE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN7android5PointE",
   "name" : "android::Point *",
   "referenced_type" : "_ZTIN7android5PointE",
   "self_type" : "_ZTIPN7android5PointE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN7android9FloatRectE",
   "name" : "android::FloatRect *",
   "referenced_type" : "_ZTIN7android9FloatRectE",
   "self_type" : "_ZTIPN7android9FloatRectE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/FloatRect.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE",
   "name" : "std::basic_ostream<char, std::char_traits<char>> *",
   "referenced_type" : "_ZTINSt3__113basic_ostreamIcNS_11char_traitsIcEEEE",
   "self_type" : "_ZTIPNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2ui4SizeE",
   "name" : "const android::ui::Size",
   "referenced_type" : "_ZTIN7android2ui4SizeE",
   "self_type" : "_ZTIKN7android2ui4SizeE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/ui/include/ui/Size.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android4RectE",
   "name" : "const android::Rect",
   "referenced_type" : "_ZTIN7android4RectE",
   "self_type" : "_ZTIKN7android4RectE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android5PointE",
   "name" : "const android::Point",
   "referenced_type" : "_ZTIN7android5PointE",
   "self_type" : "_ZTIKN7android5PointE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android9FloatRectE",
   "name" : "const android::FloatRect",
   "referenced_type" : "_ZTIN7android9FloatRectE",
   "self_type" : "_ZTIKN7android9FloatRectE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/ui/include/ui/FloatRect.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14hashIN7android4RectEEE",
   "name" : "const std::hash<android::Rect>",
   "referenced_type" : "_ZTINSt3__14hashIN7android4RectEEE",
   "self_type" : "_ZTIKNSt3__14hashIN7android4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14hashIN7android9FloatRectEEE",
   "name" : "const std::hash<android::FloatRect>",
   "referenced_type" : "_ZTINSt3__14hashIN7android9FloatRectEEE",
   "self_type" : "_ZTIKNSt3__14hashIN7android9FloatRectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/FloatRect.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Size.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/Size.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5ARect",
   "name" : "ARect",
   "referenced_type" : "_ZTI5ARect",
   "self_type" : "_ZTI5ARect",
   "size" : 16,
   "source_file" : "frameworks/native/libs/arect/include/android/rect.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_4RectEEE",
   "name" : "android::trait_trivial_copy<android::Rect>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_4RectEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_5PointEEE",
   "name" : "android::trait_trivial_copy<android::Point>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_5PointEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_5PointEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "_ZTIN7android5PointE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_4RectEEE",
   "name" : "android::trait_trivial_ctor<android::Rect>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_4RectEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_5PointEEE",
   "name" : "android::trait_trivial_ctor<android::Point>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_5PointEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_5PointEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "_ZTIN7android5PointE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_4RectEEE",
   "name" : "android::trait_trivial_dtor<android::Rect>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_4RectEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_5PointEEE",
   "name" : "android::trait_trivial_dtor<android::Point>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_5PointEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_5PointEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "_ZTIN7android5PointE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_4RectEEE",
   "name" : "android::trait_trivial_move<android::Rect>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_4RectEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_5PointEEE",
   "name" : "android::trait_trivial_move<android::Point>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_5PointEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_5PointEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "_ZTIN7android5PointE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android2ui4SizeE",
   "name" : "android::ui::Size",
   "referenced_type" : "_ZTIN7android2ui4SizeE",
   "self_type" : "_ZTIN7android2ui4SizeE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/ui/include/ui/Size.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI5ARect"
    },
    {
     "referenced_type" : "_ZTIN7android19LightFlattenablePodINS_4RectEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4RectE",
   "name" : "android::Rect",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4RectE",
   "self_type" : "_ZTIN7android4RectE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android19LightFlattenablePodINS_5PointEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android5PointE",
   "name" : "android::Point",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5PointE",
   "self_type" : "_ZTIN7android5PointE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN7android9FloatRectE",
   "name" : "android::FloatRect",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android9FloatRectE",
   "self_type" : "_ZTIN7android9FloatRectE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/ui/include/ui/FloatRect.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN7android4RectEEE",
   "name" : "std::hash<android::Rect>",
   "referenced_type" : "_ZTINSt3__14hashIN7android4RectEEE",
   "self_type" : "_ZTINSt3__14hashIN7android4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN7android9FloatRectEEE",
   "name" : "std::hash<android::FloatRect>",
   "referenced_type" : "_ZTINSt3__14hashIN7android9FloatRectEEE",
   "self_type" : "_ZTINSt3__14hashIN7android9FloatRectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/FloatRect.h",
   "template_args" : [ "_ZTIN7android9FloatRectE" ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIOi",
   "name" : "int &&",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIOi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/Size.h"
  }
 ]
}
