{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA11_c",
   "name" : "char [11]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA11_c",
   "size" : 11,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA128_m",
   "name" : "unsigned long [128]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA128_m",
   "size" : 512,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA13_i",
   "name" : "int [13]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA13_i",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",
   "name" : "unsigned char [16]",

   "size" : 4,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt16initializer_listIbE",
   "name" : "const std::initializer_list<bool>",
   "referenced_type" : "_ZTISt16initializer_listIbE",
   "self_type" : "_ZTIKSt16initializer_listIbE",
   "size" : 8,
   "source_file" : "external/libcxx/include/initializer_list"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt16nested_exception",
   "name" : "const std::nested_exception",
   "referenced_type" : "_ZTISt16nested_exception",
   "self_type" : "_ZTIKSt16nested_exception",
   "size" : 8,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "_ZTISt9nothrow_t",
   "self_type" : "_ZTIKSt9nothrow_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "self_type" : "_ZTIKSt9type_info",
   "size" : 8,
   "source_file" : "external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/signal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTIVNSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_jPKvE",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvS_jPKvE",
   "self_type" : "_ZTIVPFPvS_jPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjPKvE",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjPKvE",
   "self_type" : "_ZTIVPFPvjPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjjPKvE",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjjPKvE",
   "self_type" : "_ZTIVPFPvjjPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cgroup",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "referenced_type" : "_ZTI10clone_args",
   "self_type" : "_ZTI10clone_args",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 84,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA2_m"
    }
   ],
   "linker_set_key" : "_ZTI10sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "_ZTI10sigset64_t",
   "self_type" : "_ZTI10sigset64_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "referenced_type" : "_ZTI11sched_param",
   "self_type" : "_ZTI11sched_param",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA8_N11user_fpregs6fp_regE"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "_ZTI11user_fpregs",
   "self_type" : "_ZTI11user_fpregs",
   "size" : 116,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "_ZTI12user_vfp_exc",
   "self_type" : "_ZTI12user_vfp_exc",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA8_i"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "_ZTI19__pthread_cleanup_t",
   "self_type" : "_ZTI19__pthread_cleanup_t",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/pthread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 44,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTI9user_regs"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP9user_regs"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI11user_fpregs"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIP11user_fpregs"
    }
   ],
   "linker_set_key" : "_ZTI4user",
   "name" : "user",
   "referenced_type" : "_ZTI4user",
   "self_type" : "_ZTI4user",
   "size" : 296,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/select.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rlim_cur",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rlim_max",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI6rlimit",
   "name" : "rlimit",
   "referenced_type" : "_ZTI6rlimit",
   "self_type" : "_ZTI6rlimit",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/resource.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ru_utime",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "ru_stime",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "ru_maxrss",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_ixrss",
     "field_offset" : 160,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_idrss",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_isrss",
     "field_offset" : 224,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_minflt",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_majflt",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_nswap",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_inblock",
     "field_offset" : 352,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_oublock",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_msgsnd",
     "field_offset" : 416,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_msgrcv",
     "field_offset" : 448,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_nsignals",
     "field_offset" : 480,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_nvcsw",
     "field_offset" : 512,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_nivcsw",
     "field_offset" : 544,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6rusage",
   "name" : "rusage",
   "referenced_type" : "_ZTI6rusage",
   "self_type" : "_ZTI6rusage",
   "size" : 72,
   "source_file" : "bionic/libc/kernel/uapi/linux/resource.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "rlim_cur",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rlim_max",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI8rlimit64",
   "name" : "rlimit64",
   "referenced_type" : "_ZTI8rlimit64",
   "self_type" : "_ZTI8rlimit64",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/resource.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/timespec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10sigcontext"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIA128_m"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 744,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA32_y"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "_ZTI8user_vfp",
   "self_type" : "_ZTI8user_vfp",
   "size" : 264,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "_ZTI9cpu_set_t",
   "self_type" : "_ZTI9cpu_set_t",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "_ZTIA18_m"
    }
   ],
   "linker_set_key" : "_ZTI9user_regs",
   "name" : "user_regs",
   "referenced_type" : "_ZTI9user_regs",
   "self_type" : "_ZTI9user_regs",
   "size" : 72,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt0_E",
   "self_type" : "_ZTIN10__sifieldsUt0_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt1_E",
   "self_type" : "_ZTIN10__sifieldsUt1_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt2_E",
   "self_type" : "_ZTIN10__sifieldsUt2_E",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_E",
   "self_type" : "_ZTIN10__sifieldsUt3_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt4_E",
   "self_type" : "_ZTIN10__sifieldsUt4_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt5_E",
   "self_type" : "_ZTIN10__sifieldsUt5_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/signal_types.h:100:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN11user_fpregs6fp_regE",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "_ZTIN11user_fpregs6fp_regE",
   "self_type" : "_ZTIN11user_fpregs6fp_regE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN18__kernel_sigactionUt_E",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:68:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN18__kernel_sigactionUt_E",
   "self_type" : "_ZTIN18__kernel_sigactionUt_E",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA13_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:232:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN8ucontextUt_Ut_E"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/ucontext.h:90:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_Ut_E",
   "name" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/ucontext.h:91:5)",
   "referenced_type" : "_ZTIN8ucontextUt_Ut_E",
   "self_type" : "_ZTIN8ucontextUt_Ut_E",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/signal_types.h:89:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__110__function16__policy_storageE",
   "self_type" : "_ZTINSt3__110__function16__policy_storageE",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "referenced_type" : "_ZTINSt3__110__function8__policyE",
   "self_type" : "_ZTINSt3__110__function8__policyE",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj0EEE",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj1EEE",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteIKcEEEE",
   "name" : "std::__identity<std::default_delete<const char>>",
   "referenced_type" : "_ZTINSt3__110__identityINS_14default_deleteIKcEEEE",
   "self_type" : "_ZTINSt3__110__identityINS_14default_deleteIKcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteIKcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "_ZTINSt3__110__ignore_tIhEE",
   "self_type" : "_ZTINSt3__110__ignore_tIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "referenced_type" : "_ZTINSt3__110in_place_tE",
   "self_type" : "_ZTINSt3__110in_place_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteIKcEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteIKcEEEE",
   "name" : "std::is_pointer<std::default_delete<const char>>",
   "referenced_type" : "_ZTINSt3__110is_pointerINS_14default_deleteIKcEEEE",
   "self_type" : "_ZTINSt3__110is_pointerINS_14default_deleteIKcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteIKcEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDiEE",
   "name" : "std::is_trivial<char32_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDiEE",
   "self_type" : "_ZTINSt3__110is_trivialIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDsEE",
   "name" : "std::is_trivial<char16_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDsEE",
   "self_type" : "_ZTINSt3__110is_trivialIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "referenced_type" : "_ZTINSt3__110is_trivialIcEE",
   "self_type" : "_ZTINSt3__110is_trivialIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIwEE",
   "self_type" : "_ZTINSt3__110is_trivialIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110less_equalIvEE",
   "name" : "std::less_equal<void>",
   "referenced_type" : "_ZTINSt3__110less_equalIvEE",
   "self_type" : "_ZTINSt3__110less_equalIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110logical_orIvEE",
   "name" : "std::logical_or<void>",
   "referenced_type" : "_ZTINSt3__110logical_orIvEE",
   "self_type" : "_ZTINSt3__110logical_orIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110multipliesIvEE",
   "name" : "std::multiplies<void>",
   "referenced_type" : "_ZTINSt3__110multipliesIvEE",
   "self_type" : "_ZTINSt3__110multipliesIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "referenced_type" : "_ZTINSt3__110owner_lessIvEE",
   "self_type" : "_ZTINSt3__110owner_lessIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPKcNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIKcNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<const char, std::default_delete<const char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIKcNS_14default_deleteIS1_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIKcNS_14default_deleteIS1_EEEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKc", "_ZTINSt3__114default_deleteIKcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char32_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDiEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char16_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDsEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__nat>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__nat>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<const char *, std::default_delete<const char>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPKcNS_14default_deleteIS1_EEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIPKcEE",
   "name" : "std::add_pointer<const char *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIPKcEE",
   "self_type" : "_ZTINSt3__111add_pointerIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDiEE",
   "name" : "std::char_traits<char32_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDiEE",
   "self_type" : "_ZTINSt3__111char_traitsIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDsEE",
   "name" : "std::char_traits<char16_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDsEE",
   "self_type" : "_ZTINSt3__111char_traitsIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIcEE",
   "name" : "std::char_traits<char>",
   "referenced_type" : "_ZTINSt3__111char_traitsIcEE",
   "self_type" : "_ZTINSt3__111char_traitsIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIwEE",
   "name" : "std::char_traits<wchar_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIwEE",
   "self_type" : "_ZTINSt3__111char_traitsIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "name" : "std::conditional<false, std::pointer_traits<char32_t *>::__nat, char32_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPDiE5__natE", "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "name" : "std::conditional<false, std::pointer_traits<char16_t *>::__nat, char16_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPDsE5__natE", "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "name" : "std::conditional<false, std::pointer_traits<const char *>::__nat, const char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPKcE5__natE", "_ZTIKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "name" : "std::conditional<false, std::pointer_traits<char *>::__nat, char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPcE5__natE", "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "name" : "std::conditional<false, std::pointer_traits<wchar_t *>::__nat, wchar_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPwE5__natE", "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<const char *, std::default_delete<const char>> *, std::__compressed_pair<const char *, std::default_delete<const char>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPKcNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIPKcNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<const char>, 1, true> *, std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPKcLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<const char *, 0, false> *, std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPKcLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPKcLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPKcLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPKcLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<const char>, 1, true> *, std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPKcLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<const char *, 0, false> *, std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPKcLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPKcLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPKcLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPKcLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPPKcS2_EE",
   "name" : "std::conditional<false, const char **, const char *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPPKcS2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPPKcS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPPKc", "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char32_t, std::char_traits<char32_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIDiNS_11char_traitsIDiEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char16_t, std::char_traits<char16_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIDsNS_11char_traitsIDsEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char, std::char_traits<char>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<wchar_t, std::char_traits<wchar_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIwNS_11char_traitsIwEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDiEE",
   "name" : "std::is_abstract<const char32_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKDiEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDsEE",
   "name" : "std::is_abstract<const char16_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKDsEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKcEE",
   "name" : "std::is_abstract<const char *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKwEE",
   "name" : "std::is_abstract<const wchar_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKwEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<const char *, std::default_delete<const char>>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPKcNS_14default_deleteIS1_EEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPKcLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKcLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKcEE",
   "name" : "std::is_function<const char>",
   "referenced_type" : "_ZTINSt3__111is_functionIKcEE",
   "self_type" : "_ZTINSt3__111is_functionIKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIPKcLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIPKcLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIPKcEE",
   "name" : "std::is_function<const char *>",
   "referenced_type" : "_ZTINSt3__111is_functionIPKcEE",
   "self_type" : "_ZTINSt3__111is_functionIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIdEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIdEE",
   "name" : "std::is_integral<double>",
   "referenced_type" : "_ZTINSt3__111is_integralIdEE",
   "self_type" : "_ZTINSt3__111is_integralIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIiEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIiEE",
   "name" : "std::is_integral<int>",
   "referenced_type" : "_ZTINSt3__111is_integralIiEE",
   "self_type" : "_ZTINSt3__111is_integralIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIjEE",
   "name" : "std::is_integral<unsigned int>",
   "referenced_type" : "_ZTINSt3__111is_integralIjEE",
   "self_type" : "_ZTINSt3__111is_integralIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_andIvEE",
   "name" : "std::logical_and<void>",
   "referenced_type" : "_ZTINSt3__111logical_andIvEE",
   "self_type" : "_ZTINSt3__111logical_andIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_notIvEE",
   "name" : "std::logical_not<void>",
   "referenced_type" : "_ZTINSt3__111logical_notIvEE",
   "self_type" : "_ZTINSt3__111logical_notIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__115__struct_doubleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__116__struct_double4E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIPiEE",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "_ZTINSt3__112__align_typeIPiEE",
   "self_type" : "_ZTINSt3__112__align_typeIPiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIdEE",
   "name" : "std::__align_type<double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIdEE",
   "self_type" : "_ZTINSt3__112__align_typeIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIeEE",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIeEE",
   "self_type" : "_ZTINSt3__112__align_typeIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIhEE",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "_ZTINSt3__112__align_typeIhEE",
   "self_type" : "_ZTINSt3__112__align_typeIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIjEE",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "_ZTINSt3__112__align_typeIjEE",
   "self_type" : "_ZTINSt3__112__align_typeIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeImEE",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "_ZTINSt3__112__align_typeImEE",
   "self_type" : "_ZTINSt3__112__align_typeImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeItEE",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "_ZTINSt3__112__align_typeItEE",
   "self_type" : "_ZTINSt3__112__align_typeItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIyEE",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112__align_typeIyEE",
   "self_type" : "_ZTINSt3__112__align_typeIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__destruct_nE",
   "name" : "std::__destruct_n",
   "referenced_type" : "_ZTINSt3__112__destruct_nE",
   "self_type" : "_ZTINSt3__112__destruct_nE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__second_tagE",
   "name" : "std::__second_tag",
   "referenced_type" : "_ZTINSt3__112__second_tagE",
   "self_type" : "_ZTINSt3__112__second_tagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__tuple_lessILj0EEE",
   "name" : "std::__tuple_less<0>",
   "referenced_type" : "_ZTINSt3__112__tuple_lessILj0EEE",
   "self_type" : "_ZTINSt3__112__tuple_lessILj0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "name" : "std::alignment_of<std::__struct_double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "self_type" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__115__struct_doubleE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "name" : "std::alignment_of<std::__struct_double4>",
   "referenced_type" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "self_type" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__116__struct_double4E" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj4EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIPiEE",
   "name" : "std::alignment_of<int *>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIPiEE",
   "self_type" : "_ZTINSt3__112alignment_ofIPiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIdEE",
   "name" : "std::alignment_of<double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIdEE",
   "self_type" : "_ZTINSt3__112alignment_ofIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIeEE",
   "name" : "std::alignment_of<long double>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIeEE",
   "self_type" : "_ZTINSt3__112alignment_ofIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIhEE",
   "name" : "std::alignment_of<unsigned char>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIhEE",
   "self_type" : "_ZTINSt3__112alignment_ofIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj4EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIjEE",
   "name" : "std::alignment_of<unsigned int>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIjEE",
   "self_type" : "_ZTINSt3__112alignment_ofIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj4EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofImEE",
   "name" : "std::alignment_of<unsigned long>",
   "referenced_type" : "_ZTINSt3__112alignment_ofImEE",
   "self_type" : "_ZTINSt3__112alignment_ofImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofItEE",
   "name" : "std::alignment_of<unsigned short>",
   "referenced_type" : "_ZTINSt3__112alignment_ofItEE",
   "self_type" : "_ZTINSt3__112alignment_ofItEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIjLj8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIyEE",
   "name" : "std::alignment_of<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112alignment_ofIyEE",
   "self_type" : "_ZTINSt3__112alignment_ofIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112bad_weak_ptrE",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112bad_weak_ptrE",
   "self_type" : "_ZTINSt3__112bad_weak_ptrE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__ulxE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__ulxE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPDi"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA2_Di"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIDi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E",
   "name" : "std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E",
   "size" : 4,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEEE",
   "name" : "std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEEE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string",
   "template_args" :
   [
    "_ZTIDi",
    "_ZTINSt3__111char_traitsIDiEE",
    "_ZTINSt3__19allocatorIDiEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__ulxE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__ulxE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPDs"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 2,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA5_Ds"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIDs"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E",
   "name" : "std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E",
   "size" : 2,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEEE",
   "name" : "std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEEE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string",
   "template_args" :
   [
    "_ZTIDs",
    "_ZTINSt3__111char_traitsIDsEE",
    "_ZTINSt3__19allocatorIDsEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "name" : "std::basic_string<char>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "name" : "std::basic_string<char>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "name" : "std::basic_string<char>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "name" : "std::basic_string<char>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "name" : "std::basic_string<char>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA11_c"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "name" : "std::basic_string<char>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIc"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "name" : "std::basic_string<char>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "size" : 1,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string",
   "template_args" : [ "_ZTIc", "_ZTINSt3__111char_traitsIcEE", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "name" : "std::basic_string<wchar_t>::__raw",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "name" : "std::basic_string<wchar_t>::__rep",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "name" : "std::basic_string<wchar_t>::__rep::(anonymous union at external/libcxx/include/string:777:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "name" : "std::basic_string<wchar_t>::__ulx",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPw"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "name" : "std::basic_string<wchar_t>::__long",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA2_w"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "name" : "std::basic_string<wchar_t>::__short",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIw"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "name" : "std::basic_string<wchar_t>::__short::(anonymous union at external/libcxx/include/string:756:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "size" : 4,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "size" : 12,
   "source_file" : "external/libcxx/include/string",
   "template_args" : [ "_ZTIw", "_ZTINSt3__111char_traitsIwEE", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "name" : "std::is_reference<const std::__compressed_pair<const char *, std::default_delete<const char>>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPKcNS_14default_deleteIS1_EEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKcEE",
   "name" : "std::is_reference<const char>",
   "referenced_type" : "_ZTINSt3__112is_referenceIKcEE",
   "self_type" : "_ZTINSt3__112is_referenceIKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_14default_deleteIKcEEEE",
   "name" : "std::is_reference<std::default_delete<const char>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_14default_deleteIKcEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_14default_deleteIKcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteIKcEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_9allocatorIcEEEE",
   "name" : "std::is_reference<std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112is_referenceINS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__112is_referenceINS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIPKcEE",
   "name" : "std::is_reference<const char *>",
   "referenced_type" : "_ZTINSt3__112is_referenceIPKcEE",
   "self_type" : "_ZTINSt3__112is_referenceIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112not_equal_toIvEE",
   "name" : "std::not_equal_to<void>",
   "referenced_type" : "_ZTINSt3__112not_equal_toIvEE",
   "self_type" : "_ZTINSt3__112not_equal_toIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "name" : "std::placeholders::__ph<10>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "name" : "std::placeholders::__ph<1>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "name" : "std::placeholders::__ph<2>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "name" : "std::placeholders::__ph<3>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "name" : "std::placeholders::__ph<4>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "name" : "std::placeholders::__ph<5>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "name" : "std::placeholders::__ph<6>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "name" : "std::placeholders::__ph<7>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "name" : "std::placeholders::__ph<8>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "name" : "std::placeholders::__ph<9>",
   "referenced_type" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "self_type" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIDiEE",
   "name" : "std::remove_const<char32_t>",
   "referenced_type" : "_ZTINSt3__112remove_constIDiEE",
   "self_type" : "_ZTINSt3__112remove_constIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIDsEE",
   "name" : "std::remove_const<char16_t>",
   "referenced_type" : "_ZTINSt3__112remove_constIDsEE",
   "self_type" : "_ZTINSt3__112remove_constIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_const<const std::__compressed_pair<const char *, std::default_delete<const char>>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPKcNS_14default_deleteIS1_EEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKcEE",
   "name" : "std::remove_const<const char>",
   "referenced_type" : "_ZTINSt3__112remove_constIKcEE",
   "self_type" : "_ZTINSt3__112remove_constIKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_14default_deleteIKcEEEE",
   "name" : "std::remove_const<std::default_delete<const char>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_14default_deleteIKcEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_14default_deleteIKcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteIKcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIPKcEE",
   "name" : "std::remove_const<const char *>",
   "referenced_type" : "_ZTINSt3__112remove_constIPKcEE",
   "self_type" : "_ZTINSt3__112remove_constIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIcEE",
   "name" : "std::remove_const<char>",
   "referenced_type" : "_ZTINSt3__112remove_constIcEE",
   "self_type" : "_ZTINSt3__112remove_constIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIdEE",
   "name" : "std::remove_const<double>",
   "referenced_type" : "_ZTINSt3__112remove_constIdEE",
   "self_type" : "_ZTINSt3__112remove_constIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIiEE",
   "name" : "std::remove_const<int>",
   "referenced_type" : "_ZTINSt3__112remove_constIiEE",
   "self_type" : "_ZTINSt3__112remove_constIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIjEE",
   "name" : "std::remove_const<unsigned int>",
   "referenced_type" : "_ZTINSt3__112remove_constIjEE",
   "self_type" : "_ZTINSt3__112remove_constIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIwEE",
   "name" : "std::remove_const<wchar_t>",
   "referenced_type" : "_ZTINSt3__112remove_constIwEE",
   "self_type" : "_ZTINSt3__112remove_constIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "referenced_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "self_type" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "name" : "std::__make_signed<bool, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "name" : "std::__make_signed<int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "name" : "std::__make_signed<unsigned int, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "name" : "std::__make_signed<long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedImLb1EEE",
   "name" : "std::__make_signed<unsigned long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedImLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "name" : "std::__make_signed<short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedItLb1EEE",
   "name" : "std::__make_signed<unsigned short, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedItLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "name" : "std::__make_signed<long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "name" : "std::__make_signed<unsigned long long, true>",
   "referenced_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "self_type" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionINS_6_PairTEjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashINS_6_PairTELj2EEE",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashINS_6_PairTELj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__16_PairTE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIdjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIdLj2EEE",
   "name" : "std::__scalar_hash<double, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIdLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIdLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIejEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIeLj2EEE",
   "name" : "std::__scalar_hash<long double, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIeLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIeLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIfjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIfLj1EEE",
   "name" : "std::__scalar_hash<float, 1>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIfLj1EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIfLj1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIxjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIxLj2EEE",
   "name" : "std::__scalar_hash<long long, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIxLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIxLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIyjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIyLj2EEE",
   "name" : "std::__scalar_hash<unsigned long long, 2>",
   "referenced_type" : "_ZTINSt3__113__scalar_hashIyLj2EEE",
   "self_type" : "_ZTINSt3__113__scalar_hashIyLj2EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_equalILj0EEE",
   "name" : "std::__tuple_equal<0>",
   "referenced_type" : "_ZTINSt3__113__tuple_equalILj0EEE",
   "self_type" : "_ZTINSt3__113__tuple_equalILj0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_typesIJEEE",
   "name" : "std::__tuple_types<>",
   "referenced_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "self_type" : "_ZTINSt3__113__tuple_typesIJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113greater_equalIvEE",
   "name" : "std::greater_equal<void>",
   "referenced_type" : "_ZTINSt3__113greater_equalIvEE",
   "self_type" : "_ZTINSt3__113greater_equalIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIiEE",
   "name" : "std::is_arithmetic<int>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIiEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIjEE",
   "name" : "std::is_arithmetic<unsigned int>",
   "referenced_type" : "_ZTINSt3__113is_arithmeticIjEE",
   "self_type" : "_ZTINSt3__113is_arithmeticIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair<const char *, std::default_delete<const char>>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPKcNS_14default_deleteIS1_EEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIPKcEE",
   "name" : "std::remove_extent<const char *>",
   "referenced_type" : "_ZTINSt3__113remove_extentIPKcEE",
   "self_type" : "_ZTINSt3__113remove_extentIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDiEEEE",
   "name" : "std::__has_max_size<const std::allocator<char32_t>>",
   "referenced_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDiEEEE",
   "self_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDiEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKNSt3__19allocatorIDiEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDsEEEE",
   "name" : "std::__has_max_size<const std::allocator<char16_t>>",
   "referenced_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDsEEEE",
   "self_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDsEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKNSt3__19allocatorIDsEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIcEEEE",
   "name" : "std::__has_max_size<const std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKNSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIwEEEE",
   "name" : "std::__has_max_size<const std::allocator<wchar_t>>",
   "referenced_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIwEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKNSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDiEEvvEE",
   "name" : "std::__is_allocator<std::allocator<char32_t>, void, void>",
   "referenced_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDiEEvvEE",
   "self_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDiEEvvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDiEE", "_ZTIv", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDsEEvvEE",
   "name" : "std::__is_allocator<std::allocator<char16_t>, void, void>",
   "referenced_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDsEEvvEE",
   "self_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDsEEvvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDsEE", "_ZTIv", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIcEEvvEE",
   "name" : "std::__is_allocator<std::allocator<char>, void, void>",
   "referenced_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIcEEvvEE",
   "self_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIcEEvvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIv", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIwEEvvEE",
   "name" : "std::__is_allocator<std::allocator<wchar_t>, void, void>",
   "referenced_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIwEEvvEE",
   "self_type" : "_ZTINSt3__114__is_allocatorINS_9allocatorIwEEvvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIv", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__is_construct5__natE",
   "name" : "std::__is_construct::__nat",
   "referenced_type" : "_ZTINSt3__114__is_construct5__natE",
   "self_type" : "_ZTINSt3__114__is_construct5__natE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair<const char *, std::default_delete<const char>>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPKcNS_14default_deleteIS1_EEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implIcEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKcEE",
   "name" : "std::__is_nullptr_t<const char>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIKcEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::default_delete<const char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIKcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<const char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemIPKcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPKcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implIPKcEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIPKcEE",
   "name" : "std::__is_nullptr_t<const char *>",
   "referenced_type" : "_ZTINSt3__114__is_nullptr_tIPKcEE",
   "self_type" : "_ZTINSt3__114__is_nullptr_tIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "name" : "std::__lazy_or_impl<false>",
   "referenced_type" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "self_type" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__numeric_typeIvEE",
   "name" : "std::__numeric_type<void>",
   "referenced_type" : "_ZTINSt3__114__numeric_typeIvEE",
   "self_type" : "_ZTINSt3__114__numeric_typeIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIDiNS_9allocatorIDiEEEE",
   "name" : "std::__pointer_type<char32_t, std::allocator<char32_t>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIDiNS_9allocatorIDiEEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIDiNS_9allocatorIDiEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIDi", "_ZTINSt3__19allocatorIDiEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIDsNS_9allocatorIDsEEEE",
   "name" : "std::__pointer_type<char16_t, std::allocator<char16_t>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIDsNS_9allocatorIDsEEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIDsNS_9allocatorIDsEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIDs", "_ZTINSt3__19allocatorIDsEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIKcNS_14default_deleteIS1_EEEE",
   "name" : "std::__pointer_type<const char, std::default_delete<const char>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIKcNS_14default_deleteIS1_EEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIKcNS_14default_deleteIS1_EEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKc", "_ZTINSt3__114default_deleteIKcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIcNS_9allocatorIcEEEE",
   "name" : "std::__pointer_type<char, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIcNS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIcNS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIc", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIwNS_9allocatorIwEEEE",
   "name" : "std::__pointer_type<wchar_t, std::allocator<wchar_t>>",
   "referenced_type" : "_ZTINSt3__114__pointer_typeIwNS_9allocatorIwEEEE",
   "self_type" : "_ZTINSt3__114__pointer_typeIwNS_9allocatorIwEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIw", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILj12ELj1ELj8EEE",
   "name" : "std::__select_align<12, 1, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILj12ELj1ELj8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILj12ELj1ELj8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILj12ELj2ELj8EEE",
   "name" : "std::__select_align<12, 2, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILj12ELj2ELj8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILj12ELj2ELj8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILj12ELj4ELj8EEE",
   "name" : "std::__select_align<12, 4, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILj12ELj4ELj8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILj12ELj4ELj8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILj12ELj8ELj4EEE",
   "name" : "std::__select_align<12, 8, 4>",
   "referenced_type" : "_ZTINSt3__114__select_alignILj12ELj8ELj4EEE",
   "self_type" : "_ZTINSt3__114__select_alignILj12ELj8ELj4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILj12ELj8ELj8EEE",
   "name" : "std::__select_align<12, 8, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILj12ELj8ELj8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILj12ELj8ELj8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILj16ELj1ELj8EEE",
   "name" : "std::__select_align<16, 1, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILj16ELj1ELj8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILj16ELj1ELj8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILj16ELj2ELj8EEE",
   "name" : "std::__select_align<16, 2, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILj16ELj2ELj8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILj16ELj2ELj8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILj16ELj4ELj8EEE",
   "name" : "std::__select_align<16, 4, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILj16ELj4ELj8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILj16ELj4ELj8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILj16ELj8ELj4EEE",
   "name" : "std::__select_align<16, 8, 4>",
   "referenced_type" : "_ZTINSt3__114__select_alignILj16ELj8ELj4EEE",
   "self_type" : "_ZTINSt3__114__select_alignILj16ELj8ELj4EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILj16ELj8ELj8EEE",
   "name" : "std::__select_align<16, 8, 8>",
   "referenced_type" : "_ZTINSt3__114__select_alignILj16ELj8ELj8EEE",
   "self_type" : "_ZTINSt3__114__select_alignILj16ELj8ELj8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__shared_owners_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__shared_countE",
   "name" : "std::__shared_count",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114__shared_countE",
   "self_type" : "_ZTINSt3__114__shared_countE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114__shared_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPDiNS_9allocatorIDiEELb0EEE",
   "name" : "std::__void_pointer<char32_t *, std::allocator<char32_t>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPDiNS_9allocatorIDiEELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPDiNS_9allocatorIDiEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPDi", "_ZTINSt3__19allocatorIDiEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPDsNS_9allocatorIDsEELb0EEE",
   "name" : "std::__void_pointer<char16_t *, std::allocator<char16_t>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPDsNS_9allocatorIDsEELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPDsNS_9allocatorIDsEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPDs", "_ZTINSt3__19allocatorIDsEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPcNS_9allocatorIcEELb0EEE",
   "name" : "std::__void_pointer<char *, std::allocator<char>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPcNS_9allocatorIcEELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPcNS_9allocatorIcEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPc", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPwNS_9allocatorIwEELb0EEE",
   "name" : "std::__void_pointer<wchar_t *, std::allocator<wchar_t>, false>",
   "referenced_type" : "_ZTINSt3__114__void_pointerIPwNS_9allocatorIwEELb0EEE",
   "self_type" : "_ZTINSt3__114__void_pointerIPwNS_9allocatorIwEELb0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPw", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114default_deleteIKcEE",
   "name" : "std::default_delete<const char>",
   "referenced_type" : "_ZTINSt3__114default_deleteIKcEE",
   "self_type" : "_ZTINSt3__114default_deleteIKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIPKcS2_EE",
   "name" : "std::is_convertible<const char *, const char *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIPKcS2_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIPKcS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc", "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRA2_KcNS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_convertible<char const (&)[2], std::basic_string_view<char, std::char_traits<char>>>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRA2_KcNS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRA2_KcNS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRA2_Kc",
    "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRA2_KcPS1_EE",
   "name" : "std::is_convertible<char const (&)[2], const char *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRA2_KcPS1_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIRA2_KcPS1_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRA2_Kc", "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDiNS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "name" : "std::is_convertible<const char32_t *const &, std::basic_string_view<char32_t, std::char_traits<char32_t>>>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKDiNS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKDiNS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKDi",
    "_ZTINSt3__117basic_string_viewIDiNS_11char_traitsIDiEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDiS2_EE",
   "name" : "std::is_convertible<const char32_t *const &, const char32_t *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKDiS2_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKDiS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKDi", "_ZTIPKDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDsNS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "name" : "std::is_convertible<const char16_t *const &, std::basic_string_view<char16_t, std::char_traits<char16_t>>>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKDsNS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKDsNS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKDs",
    "_ZTINSt3__117basic_string_viewIDsNS_11char_traitsIDsEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDsS2_EE",
   "name" : "std::is_convertible<const char16_t *const &, const char16_t *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKDsS2_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKDsS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKDs", "_ZTIPKDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKcNS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_convertible<const char *const &, std::basic_string_view<char, std::char_traits<char>>>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKcNS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKcNS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKc", "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKcS2_EE",
   "name" : "std::is_convertible<const char *const &, const char *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKcS2_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKcS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKc", "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKwNS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "name" : "std::is_convertible<const wchar_t *const &, std::basic_string_view<wchar_t, std::char_traits<wchar_t>>>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKwNS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKwNS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKw", "_ZTINSt3__117basic_string_viewIwNS_11char_traitsIwEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKwS2_EE",
   "name" : "std::is_convertible<const wchar_t *const &, const wchar_t *>",
   "referenced_type" : "_ZTINSt3__114is_convertibleIRKPKwS2_EE",
   "self_type" : "_ZTINSt3__114is_convertibleIRKPKwS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRKPKw", "_ZTIPKw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIiLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIiEE",
   "name" : "std::numeric_limits<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114numeric_limitsIiEE",
   "self_type" : "_ZTINSt3__114numeric_limitsIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIjLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIjEE",
   "name" : "std::numeric_limits<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114numeric_limitsIjEE",
   "self_type" : "_ZTINSt3__114numeric_limitsIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__v_",
     "referenced_type" : "_ZTINSt3__114pointer_safety4__lxE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114pointer_safetyE",
   "name" : "std::pointer_safety",
   "referenced_type" : "_ZTINSt3__114pointer_safetyE",
   "self_type" : "_ZTINSt3__114pointer_safetyE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPDiEE",
   "name" : "std::pointer_traits<char32_t *>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPDiEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPDsEE",
   "name" : "std::pointer_traits<char16_t *>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPDsEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPKcEE",
   "name" : "std::pointer_traits<const char *>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPKcEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPcEE",
   "name" : "std::pointer_traits<char *>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPcEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114pointer_traitsIPwEE",
   "name" : "std::pointer_traits<wchar_t *>",
   "referenced_type" : "_ZTINSt3__114pointer_traitsIPwEE",
   "self_type" : "_ZTINSt3__114pointer_traitsIPwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIPw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIDijEE",
   "name" : "std::unary_function<char32_t, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIDijEE",
   "self_type" : "_ZTINSt3__114unary_functionIDijEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDi", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIDnjEE",
   "name" : "std::unary_function<nullptr_t, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIDnjEE",
   "self_type" : "_ZTINSt3__114unary_functionIDnjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDn", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIDsjEE",
   "name" : "std::unary_function<char16_t, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIDsjEE",
   "self_type" : "_ZTINSt3__114unary_functionIDsjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIDs", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionINS_6_PairTEjEE",
   "name" : "std::unary_function<std::_PairT, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionINS_6_PairTEjEE",
   "self_type" : "_ZTINSt3__114unary_functionINS_6_PairTEjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTINSt3__16_PairTE", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIajEE",
   "name" : "std::unary_function<signed char, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIajEE",
   "self_type" : "_ZTINSt3__114unary_functionIajEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIa", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIbjEE",
   "name" : "std::unary_function<bool, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIbjEE",
   "self_type" : "_ZTINSt3__114unary_functionIbjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIb", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIcjEE",
   "name" : "std::unary_function<char, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIcjEE",
   "self_type" : "_ZTINSt3__114unary_functionIcjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIc", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIdjEE",
   "name" : "std::unary_function<double, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIdjEE",
   "self_type" : "_ZTINSt3__114unary_functionIdjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTId", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIejEE",
   "name" : "std::unary_function<long double, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIejEE",
   "self_type" : "_ZTINSt3__114unary_functionIejEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIe", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIfjEE",
   "name" : "std::unary_function<float, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIfjEE",
   "self_type" : "_ZTINSt3__114unary_functionIfjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIf", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIhjEE",
   "name" : "std::unary_function<unsigned char, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIhjEE",
   "self_type" : "_ZTINSt3__114unary_functionIhjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIh", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIijEE",
   "name" : "std::unary_function<int, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIijEE",
   "self_type" : "_ZTINSt3__114unary_functionIijEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIi", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIjjEE",
   "name" : "std::unary_function<unsigned int, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIjjEE",
   "self_type" : "_ZTINSt3__114unary_functionIjjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIljEE",
   "name" : "std::unary_function<long, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIljEE",
   "self_type" : "_ZTINSt3__114unary_functionIljEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIl", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionImjEE",
   "name" : "std::unary_function<unsigned long, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionImjEE",
   "self_type" : "_ZTINSt3__114unary_functionImjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIm", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIsjEE",
   "name" : "std::unary_function<short, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIsjEE",
   "self_type" : "_ZTINSt3__114unary_functionIsjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIs", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionItjEE",
   "name" : "std::unary_function<unsigned short, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionItjEE",
   "self_type" : "_ZTINSt3__114unary_functionItjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIt", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIwjEE",
   "name" : "std::unary_function<wchar_t, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIwjEE",
   "self_type" : "_ZTINSt3__114unary_functionIwjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIw", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIxjEE",
   "name" : "std::unary_function<long long, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIxjEE",
   "self_type" : "_ZTINSt3__114unary_functionIxjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIx", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114unary_functionIyjEE",
   "name" : "std::unary_function<unsigned long long, unsigned int>",
   "referenced_type" : "_ZTINSt3__114unary_functionIyjEE",
   "self_type" : "_ZTINSt3__114unary_functionIyjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" : [ "_ZTIy", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__const_pointerIDiPDiNS_9allocatorIDiEELb1EEE",
   "name" : "std::__const_pointer<char32_t, char32_t *, std::allocator<char32_t>, true>",
   "referenced_type" : "_ZTINSt3__115__const_pointerIDiPDiNS_9allocatorIDiEELb1EEE",
   "self_type" : "_ZTINSt3__115__const_pointerIDiPDiNS_9allocatorIDiEELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIDi", "_ZTIPDi", "_ZTINSt3__19allocatorIDiEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__const_pointerIDsPDsNS_9allocatorIDsEELb1EEE",
   "name" : "std::__const_pointer<char16_t, char16_t *, std::allocator<char16_t>, true>",
   "referenced_type" : "_ZTINSt3__115__const_pointerIDsPDsNS_9allocatorIDsEELb1EEE",
   "self_type" : "_ZTINSt3__115__const_pointerIDsPDsNS_9allocatorIDsEELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIDs", "_ZTIPDs", "_ZTINSt3__19allocatorIDsEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__const_pointerIcPcNS_9allocatorIcEELb1EEE",
   "name" : "std::__const_pointer<char, char *, std::allocator<char>, true>",
   "referenced_type" : "_ZTINSt3__115__const_pointerIcPcNS_9allocatorIcEELb1EEE",
   "self_type" : "_ZTINSt3__115__const_pointerIcPcNS_9allocatorIcEELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIc", "_ZTIPc", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__const_pointerIwPwNS_9allocatorIwEELb1EEE",
   "name" : "std::__const_pointer<wchar_t, wchar_t *, std::allocator<wchar_t>, true>",
   "referenced_type" : "_ZTINSt3__115__const_pointerIwPwNS_9allocatorIwEELb1EEE",
   "self_type" : "_ZTINSt3__115__const_pointerIwPwNS_9allocatorIwEELb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIw", "_ZTIPw", "_ZTINSt3__19allocatorIwEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__has_size_typeINS_9allocatorIDiEEvEE",
   "name" : "std::__has_size_type<std::allocator<char32_t>, void>",
   "referenced_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIDiEEvEE",
   "self_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIDiEEvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDiEE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__has_size_typeINS_9allocatorIDsEEvEE",
   "name" : "std::__has_size_type<std::allocator<char16_t>, void>",
   "referenced_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIDsEEvEE",
   "self_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIDsEEvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDsEE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__has_size_typeINS_9allocatorIcEEvEE",
   "name" : "std::__has_size_type<std::allocator<char>, void>",
   "referenced_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIcEEvEE",
   "self_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIcEEvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__has_size_typeINS_9allocatorIwEEvEE",
   "name" : "std::__has_size_type<std::allocator<wchar_t>, void>",
   "referenced_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIwEEvEE",
   "self_type" : "_ZTINSt3__115__has_size_typeINS_9allocatorIwEEvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__lazy_and_implILb1EJEEE",
   "name" : "std::__lazy_and_impl<true>",
   "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJEEE",
   "self_type" : "_ZTINSt3__115__lazy_and_implILb1EJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIbLb1EEE",
   "name" : "std::__make_unsigned<bool, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIbLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIbLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIiLb1EEE",
   "name" : "std::__make_unsigned<int, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIiLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIjLb1EEE",
   "name" : "std::__make_unsigned<unsigned int, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIjLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIjLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIlLb1EEE",
   "name" : "std::__make_unsigned<long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIlLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIlLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedImLb1EEE",
   "name" : "std::__make_unsigned<unsigned long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedImLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedImLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIsLb1EEE",
   "name" : "std::__make_unsigned<short, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIsLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIsLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedItLb1EEE",
   "name" : "std::__make_unsigned<unsigned short, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedItLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedItLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIxLb1EEE",
   "name" : "std::__make_unsigned<long long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIxLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIxLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__make_unsignedIyLb1EEE",
   "name" : "std::__make_unsigned<unsigned long long, true>",
   "referenced_type" : "_ZTINSt3__115__make_unsignedIyLb1EEE",
   "self_type" : "_ZTINSt3__115__make_unsignedIyLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115__struct_doubleE",
   "name" : "std::__struct_double",
   "referenced_type" : "_ZTINSt3__115__struct_doubleE",
   "self_type" : "_ZTINSt3__115__struct_doubleE",
   "size" : 8,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115__tuple_indicesIJEEE",
   "name" : "std::__tuple_indices<>",
   "referenced_type" : "_ZTINSt3__115__tuple_indicesIJEEE",
   "self_type" : "_ZTINSt3__115__tuple_indicesIJEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIA16_h"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115aligned_storageILj12ELj8EE4typeE",
   "name" : "std::aligned_storage<12, 8>::type",
   "referenced_type" : "_ZTINSt3__115aligned_storageILj12ELj8EE4typeE",
   "self_type" : "_ZTINSt3__115aligned_storageILj12ELj8EE4typeE",
   "size" : 16,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115aligned_storageILj12ELj8EEE",
   "name" : "std::aligned_storage<12, 8>",
   "referenced_type" : "_ZTINSt3__115aligned_storageILj12ELj8EEE",
   "self_type" : "_ZTINSt3__115aligned_storageILj12ELj8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIA16_h"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115aligned_storageILj16ELj8EE4typeE",
   "name" : "std::aligned_storage<16, 8>::type",
   "referenced_type" : "_ZTINSt3__115aligned_storageILj16ELj8EE4typeE",
   "self_type" : "_ZTINSt3__115aligned_storageILj16ELj8EE4typeE",
   "size" : 16,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115aligned_storageILj16ELj8EEE",
   "name" : "std::aligned_storage<16, 8>",
   "referenced_type" : "_ZTINSt3__115aligned_storageILj16ELj8EEE",
   "self_type" : "_ZTINSt3__115aligned_storageILj16ELj8EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115allocator_arg_tE",
   "name" : "std::allocator_arg_t",
   "referenced_type" : "_ZTINSt3__115allocator_arg_tE",
   "self_type" : "_ZTINSt3__115allocator_arg_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__functional_base"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__115is_destructibleIvEE",
   "name" : "std::is_destructible<void>",
   "referenced_type" : "_ZTINSt3__115is_destructibleIvEE",
   "self_type" : "_ZTINSt3__115is_destructibleIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIDiEE",
   "name" : "std::remove_volatile<char32_t>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIDiEE",
   "self_type" : "_ZTINSt3__115remove_volatileIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileIDsEE",
   "name" : "std::remove_volatile<char16_t>",
   "referenced_type" : "_ZTINSt3__115remove_volatileIDsEE",
   "self_type" : "_ZTINSt3__115remove_volatileIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileINS_14default_deleteIKcEEEE",
   "name" : "std::remove_volatile<std::default_delete<const char>>",
   "referenced_type" : "_ZTINSt3__115remove_volatileINS_14default_deleteIKcEEEE",
   "self_type" : "_ZTINSt3__115remove_volatileINS_14default_deleteIKcEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114default_deleteIKcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileINS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "name" : "std::remove_volatile<std::__compressed_pair<const char *, std::default_delete<const char>>>",
   "referenced_type" : "_ZTINSt3__115remove_volatileINS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "self_type" : "_ZTINSt3__115remove_volatileINS_17__compressed_pairIPKcNS_14default_deleteIS2_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117__compressed_pairIPKcNS_14default_deleteIS1_EEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_volatile<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__115remove_volatileINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__115remove_volatileINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__115remove_volatileINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_volatile<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__115remove_volatileINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__115remove_volatileINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
