#ifndef HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace radio {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class RadioConst : int32_t;
enum class RadioCdmaSmsConst : int32_t;
enum class RadioError : int32_t;
enum class RadioResponseType : int32_t;
enum class RadioIndicationType : int32_t;
enum class RestrictedState : int32_t;
enum class CardState : int32_t;
enum class PinState : int32_t;
enum class AppType : int32_t;
enum class AppState : int32_t;
enum class PersoSubstate : int32_t;
enum class RadioState : int32_t;
enum class SapConnectRsp : int32_t;
enum class SapDisconnectType : int32_t;
enum class SapApduType : int32_t;
enum class SapResultCode : int32_t;
enum class SapStatus : int32_t;
enum class SapTransferProtocol : int32_t;
enum class CallState : int32_t;
enum class UusType : int32_t;
enum class UusDcs : int32_t;
enum class CallPresentation : int32_t;
enum class Clir : int32_t;
enum class LastCallFailCause : int32_t;
enum class DataCallFailCause : int32_t;
enum class RegState : int32_t;
enum class RadioTechnology : int32_t;
enum class DataProfileId : int32_t;
enum class SmsAcknowledgeFailCause : int32_t;
enum class CallForwardInfoStatus : int32_t;
enum class ClipStatus : int32_t;

enum class CdmaSmsErrorClass : int32_t;
enum class CdmaSmsWriteArgsStatus : int32_t;
enum class CellInfoType : int32_t;
enum class TimeStampType : int32_t;
enum class ApnAuthType : int32_t;
enum class RadioTechnologyFamily : int32_t;
enum class RadioCapabilityPhase : int32_t;
enum class RadioCapabilityStatus : int32_t;
enum class RadioAccessFamily : int32_t;
enum class UssdModeType : int32_t;
enum class SimRefreshType : int32_t;
enum class SrvccState : int32_t;
enum class UiccSubActStatus : int32_t;
enum class SubscriptionType : int32_t;
enum class DataProfileInfoType : int32_t;
enum class PhoneRestrictedState : int32_t;
enum class CdmaCallWaitingNumberPresentation : int32_t;
enum class CdmaCallWaitingNumberType : int32_t;
enum class CdmaCallWaitingNumberPlan : int32_t;
enum class CdmaOtaProvisionStatus : int32_t;
enum class CdmaInfoRecName : int32_t;
enum class CdmaRedirectingReason : int32_t;
enum class SsServiceType : int32_t;
enum class SsRequestType : int32_t;
enum class SsTeleserviceType : int32_t;
enum class SuppServiceClass : int32_t;
enum class ApnTypes : int32_t;
enum class IndicationFilter : int32_t;
enum class MvnoType : int32_t;
enum class DeviceStateType : int32_t;
enum class P2Constant : int32_t;
struct RadioResponseInfo;
struct AppStatus;
struct CardStatus;
struct UusInfo;
struct Call;
struct Dial;
struct LastCallFailCauseInfo;
struct GsmSignalStrength;
struct WcdmaSignalStrength;
struct CdmaSignalStrength;
struct EvdoSignalStrength;
struct LteSignalStrength;
struct TdScdmaSignalStrength;
struct SignalStrength;
struct SendSmsResult;
struct SetupDataCallResult;
struct IccIo;
struct IccIoResult;
struct CallForwardInfo;
struct OperatorInfo;
struct SmsWriteArgs;
struct CdmaSmsAddress;
struct CdmaSmsSubaddress;
struct CdmaSmsMessage;
struct CdmaSmsAck;
struct CdmaBroadcastSmsConfigInfo;
struct CdmaSmsWriteArgs;
struct GsmBroadcastSmsConfigInfo;
struct CellIdentityGsm;
struct CellIdentityWcdma;
struct CellIdentityCdma;
struct CellIdentityLte;
struct CellIdentityTdscdma;
struct CellInfoGsm;
struct CellInfoWcdma;
struct CellInfoCdma;
struct CellInfoLte;
struct CellInfoTdscdma;
struct CellInfo;
struct CellIdentity;
struct VoiceRegStateResult;
struct DataRegStateResult;
struct GsmSmsMessage;
struct ImsSmsMessage;
struct SimApdu;
struct NvWriteItem;
struct SelectUiccSub;
struct HardwareConfigModem;
struct HardwareConfigSim;
struct HardwareConfig;
struct DataProfileInfo;
struct RadioCapability;
struct LceStatusInfo;
struct LceDataInfo;
struct ActivityStatsInfo;
struct Carrier;
struct CarrierRestrictions;
struct SuppSvcNotification;
struct SimRefreshResult;
struct CdmaSignalInfoRecord;
struct CdmaCallWaiting;
struct CdmaDisplayInfoRecord;
struct CdmaNumberInfoRecord;
struct CdmaRedirectingNumberInfoRecord;
struct CdmaLineControlInfoRecord;
struct CdmaT53ClirInfoRecord;
struct CdmaT53AudioControlInfoRecord;
struct CdmaInformationRecord;
struct CdmaInformationRecords;
struct CfData;
struct SsInfoData;
struct StkCcUnsolSsResult;
struct PcoDataInfo;

enum class RadioConst : int32_t {
    CDMA_ALPHA_INFO_BUFFER_LENGTH = 64,
    CDMA_NUMBER_INFO_BUFFER_LENGTH = 81,
    MAX_RILDS = 3,
    MAX_SOCKET_NAME_LENGTH = 6,
    MAX_CLIENT_ID_LENGTH = 2,
    MAX_DEBUG_SOCKET_NAME_LENGTH = 12,
    MAX_QEMU_PIPE_NAME_LENGTH = 11,
    MAX_UUID_LENGTH = 64,
    CARD_MAX_APPS = 8,
    CDMA_MAX_NUMBER_OF_INFO_RECS = 10,
    SS_INFO_MAX = 4,
    NUM_SERVICE_CLASSES = 7,
    NUM_TX_POWER_LEVELS = 5,
};

enum class RadioCdmaSmsConst : int32_t {
    ADDRESS_MAX = 36,
    SUBADDRESS_MAX = 36,
    BEARER_DATA_MAX = 255,
    UDH_MAX_SND_SIZE = 128,
    UDH_EO_DATA_SEGMENT_MAX = 131,
    MAX_UD_HEADERS = 7,
    USER_DATA_MAX = 229,
    UDH_LARGE_PIC_SIZE = 128,
    UDH_SMALL_PIC_SIZE = 32,
    UDH_VAR_PIC_SIZE = 134,
    UDH_ANIM_NUM_BITMAPS = 4,
    UDH_LARGE_BITMAP_SIZE = 32,
    UDH_SMALL_BITMAP_SIZE = 8,
    UDH_OTHER_SIZE = 226,
    IP_ADDRESS_SIZE = 4,
};

enum class RadioError : int32_t {
    NONE = 0,
    RADIO_NOT_AVAILABLE = 1,
    GENERIC_FAILURE = 2,
    PASSWORD_INCORRECT = 3,
    SIM_PIN2 = 4,
    SIM_PUK2 = 5,
    REQUEST_NOT_SUPPORTED = 6,
    CANCELLED = 7,
    OP_NOT_ALLOWED_DURING_VOICE_CALL = 8,
    OP_NOT_ALLOWED_BEFORE_REG_TO_NW = 9,
    SMS_SEND_FAIL_RETRY = 10,
    SIM_ABSENT = 11,
    SUBSCRIPTION_NOT_AVAILABLE = 12,
    MODE_NOT_SUPPORTED = 13,
    FDN_CHECK_FAILURE = 14,
    ILLEGAL_SIM_OR_ME = 15,
    MISSING_RESOURCE = 16,
    NO_SUCH_ELEMENT = 17,
    DIAL_MODIFIED_TO_USSD = 18,
    DIAL_MODIFIED_TO_SS = 19,
    DIAL_MODIFIED_TO_DIAL = 20,
    USSD_MODIFIED_TO_DIAL = 21,
    USSD_MODIFIED_TO_SS = 22,
    USSD_MODIFIED_TO_USSD = 23,
    SS_MODIFIED_TO_DIAL = 24,
    SS_MODIFIED_TO_USSD = 25,
    SUBSCRIPTION_NOT_SUPPORTED = 26,
    SS_MODIFIED_TO_SS = 27,
    LCE_NOT_SUPPORTED = 36,
    NO_MEMORY = 37,
    INTERNAL_ERR = 38,
    SYSTEM_ERR = 39,
    MODEM_ERR = 40,
    INVALID_STATE = 41,
    NO_RESOURCES = 42,
    SIM_ERR = 43,
    INVALID_ARGUMENTS = 44,
    INVALID_SIM_STATE = 45,
    INVALID_MODEM_STATE = 46,
    INVALID_CALL_ID = 47,
    NO_SMS_TO_ACK = 48,
    NETWORK_ERR = 49,
    REQUEST_RATE_LIMITED = 50,
    SIM_BUSY = 51,
    SIM_FULL = 52,
    NETWORK_REJECT = 53,
    OPERATION_NOT_ALLOWED = 54,
    EMPTY_RECORD = 55,
    INVALID_SMS_FORMAT = 56,
    ENCODING_ERR = 57,
    INVALID_SMSC_ADDRESS = 58,
    NO_SUCH_ENTRY = 59,
    NETWORK_NOT_READY = 60,
    NOT_PROVISIONED = 61,
    NO_SUBSCRIPTION = 62,
    NO_NETWORK_FOUND = 63,
    DEVICE_IN_USE = 64,
    ABORTED = 65,
    INVALID_RESPONSE = 66,
    OEM_ERROR_1 = 501,
    OEM_ERROR_2 = 502,
    OEM_ERROR_3 = 503,
    OEM_ERROR_4 = 504,
    OEM_ERROR_5 = 505,
    OEM_ERROR_6 = 506,
    OEM_ERROR_7 = 507,
    OEM_ERROR_8 = 508,
    OEM_ERROR_9 = 509,
    OEM_ERROR_10 = 510,
    OEM_ERROR_11 = 511,
    OEM_ERROR_12 = 512,
    OEM_ERROR_13 = 513,
    OEM_ERROR_14 = 514,
    OEM_ERROR_15 = 515,
    OEM_ERROR_16 = 516,
    OEM_ERROR_17 = 517,
    OEM_ERROR_18 = 518,
    OEM_ERROR_19 = 519,
    OEM_ERROR_20 = 520,
    OEM_ERROR_21 = 521,
    OEM_ERROR_22 = 522,
    OEM_ERROR_23 = 523,
    OEM_ERROR_24 = 524,
    OEM_ERROR_25 = 525,
};

enum class RadioResponseType : int32_t {
    SOLICITED = 0,
    SOLICITED_ACK = 1 /* ::android::hardware::radio::V1_0::RadioResponseType.SOLICITED implicitly + 1 */,
    SOLICITED_ACK_EXP = 2 /* ::android::hardware::radio::V1_0::RadioResponseType.SOLICITED_ACK implicitly + 1 */,
};

enum class RadioIndicationType : int32_t {
    UNSOLICITED = 0,
    UNSOLICITED_ACK_EXP = 1 /* ::android::hardware::radio::V1_0::RadioIndicationType.UNSOLICITED implicitly + 1 */,
};

enum class RestrictedState : int32_t {
    NONE = 0 /* 0x00 */,
    CS_EMERGENCY = 1 /* 0x01 */,
    CS_NORMAL = 2 /* 0x02 */,
    CS_ALL = 4 /* 0x04 */,
    PS_ALL = 16 /* 0x10 */,
};

enum class CardState : int32_t {
    ABSENT = 0,
    PRESENT = 1 /* ::android::hardware::radio::V1_0::CardState.ABSENT implicitly + 1 */,
    ERROR = 2 /* ::android::hardware::radio::V1_0::CardState.PRESENT implicitly + 1 */,
    RESTRICTED = 3 /* ::android::hardware::radio::V1_0::CardState.ERROR implicitly + 1 */,
};

enum class PinState : int32_t {
    UNKNOWN = 0,
    ENABLED_NOT_VERIFIED = 1 /* ::android::hardware::radio::V1_0::PinState.UNKNOWN implicitly + 1 */,
    ENABLED_VERIFIED = 2 /* ::android::hardware::radio::V1_0::PinState.ENABLED_NOT_VERIFIED implicitly + 1 */,
    DISABLED = 3 /* ::android::hardware::radio::V1_0::PinState.ENABLED_VERIFIED implicitly + 1 */,
    ENABLED_BLOCKED = 4 /* ::android::hardware::radio::V1_0::PinState.DISABLED implicitly + 1 */,
    ENABLED_PERM_BLOCKED = 5 /* ::android::hardware::radio::V1_0::PinState.ENABLED_BLOCKED implicitly + 1 */,
};

enum class AppType : int32_t {
    UNKNOWN = 0,
    SIM = 1 /* ::android::hardware::radio::V1_0::AppType.UNKNOWN implicitly + 1 */,
    USIM = 2 /* ::android::hardware::radio::V1_0::AppType.SIM implicitly + 1 */,
    RUIM = 3 /* ::android::hardware::radio::V1_0::AppType.USIM implicitly + 1 */,
    CSIM = 4 /* ::android::hardware::radio::V1_0::AppType.RUIM implicitly + 1 */,
    ISIM = 5 /* ::android::hardware::radio::V1_0::AppType.CSIM implicitly + 1 */,
};

enum class AppState : int32_t {
    UNKNOWN = 0,
    DETECTED = 1 /* ::android::hardware::radio::V1_0::AppState.UNKNOWN implicitly + 1 */,
    PIN = 2 /* ::android::hardware::radio::V1_0::AppState.DETECTED implicitly + 1 */,
    PUK = 3 /* ::android::hardware::radio::V1_0::AppState.PIN implicitly + 1 */,
    SUBSCRIPTION_PERSO = 4 /* ::android::hardware::radio::V1_0::AppState.PUK implicitly + 1 */,
    READY = 5 /* ::android::hardware::radio::V1_0::AppState.SUBSCRIPTION_PERSO implicitly + 1 */,
};

enum class PersoSubstate : int32_t {
    UNKNOWN = 0,
    IN_PROGRESS = 1 /* ::android::hardware::radio::V1_0::PersoSubstate.UNKNOWN implicitly + 1 */,
    READY = 2 /* ::android::hardware::radio::V1_0::PersoSubstate.IN_PROGRESS implicitly + 1 */,
    SIM_NETWORK = 3 /* ::android::hardware::radio::V1_0::PersoSubstate.READY implicitly + 1 */,
    SIM_NETWORK_SUBSET = 4 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_NETWORK implicitly + 1 */,
    SIM_CORPORATE = 5 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_NETWORK_SUBSET implicitly + 1 */,
    SIM_SERVICE_PROVIDER = 6 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_CORPORATE implicitly + 1 */,
    SIM_SIM = 7 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_SERVICE_PROVIDER implicitly + 1 */,
    SIM_NETWORK_PUK = 8 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_SIM implicitly + 1 */,
    SIM_NETWORK_SUBSET_PUK = 9 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_NETWORK_PUK implicitly + 1 */,
    SIM_CORPORATE_PUK = 10 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_NETWORK_SUBSET_PUK implicitly + 1 */,
    SIM_SERVICE_PROVIDER_PUK = 11 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_CORPORATE_PUK implicitly + 1 */,
    SIM_SIM_PUK = 12 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_SERVICE_PROVIDER_PUK implicitly + 1 */,
    RUIM_NETWORK1 = 13 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_SIM_PUK implicitly + 1 */,
    RUIM_NETWORK2 = 14 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_NETWORK1 implicitly + 1 */,
    RUIM_HRPD = 15 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_NETWORK2 implicitly + 1 */,
    RUIM_CORPORATE = 16 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_HRPD implicitly + 1 */,
    RUIM_SERVICE_PROVIDER = 17 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_CORPORATE implicitly + 1 */,
    RUIM_RUIM = 18 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_SERVICE_PROVIDER implicitly + 1 */,
    RUIM_NETWORK1_PUK = 19 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_RUIM implicitly + 1 */,
    RUIM_NETWORK2_PUK = 20 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_NETWORK1_PUK implicitly + 1 */,
    RUIM_HRPD_PUK = 21 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_NETWORK2_PUK implicitly + 1 */,
    RUIM_CORPORATE_PUK = 22 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_HRPD_PUK implicitly + 1 */,
    RUIM_SERVICE_PROVIDER_PUK = 23 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_CORPORATE_PUK implicitly + 1 */,
    RUIM_RUIM_PUK = 24 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_SERVICE_PROVIDER_PUK implicitly + 1 */,
};

enum class RadioState : int32_t {
    OFF = 0,
    UNAVAILABLE = 1,
    ON = 10,
};

enum class SapConnectRsp : int32_t {
    SUCCESS = 0,
    CONNECT_FAILURE = 1 /* ::android::hardware::radio::V1_0::SapConnectRsp.SUCCESS implicitly + 1 */,
    MSG_SIZE_TOO_LARGE = 2 /* ::android::hardware::radio::V1_0::SapConnectRsp.CONNECT_FAILURE implicitly + 1 */,
    MSG_SIZE_TOO_SMALL = 3 /* ::android::hardware::radio::V1_0::SapConnectRsp.MSG_SIZE_TOO_LARGE implicitly + 1 */,
    CONNECT_OK_CALL_ONGOING = 4 /* ::android::hardware::radio::V1_0::SapConnectRsp.MSG_SIZE_TOO_SMALL implicitly + 1 */,
};

enum class SapDisconnectType : int32_t {
    GRACEFUL = 0,
    IMMEDIATE = 1 /* ::android::hardware::radio::V1_0::SapDisconnectType.GRACEFUL implicitly + 1 */,
};

enum class SapApduType : int32_t {
    APDU = 0,
    APDU7816 = 1 /* ::android::hardware::radio::V1_0::SapApduType.APDU implicitly + 1 */,
};

enum class SapResultCode : int32_t {
    SUCCESS = 0,
    GENERIC_FAILURE = 1 /* ::android::hardware::radio::V1_0::SapResultCode.SUCCESS implicitly + 1 */,
    CARD_NOT_ACCESSSIBLE = 2 /* ::android::hardware::radio::V1_0::SapResultCode.GENERIC_FAILURE implicitly + 1 */,
    CARD_ALREADY_POWERED_OFF = 3 /* ::android::hardware::radio::V1_0::SapResultCode.CARD_NOT_ACCESSSIBLE implicitly + 1 */,
    CARD_REMOVED = 4 /* ::android::hardware::radio::V1_0::SapResultCode.CARD_ALREADY_POWERED_OFF implicitly + 1 */,
    CARD_ALREADY_POWERED_ON = 5 /* ::android::hardware::radio::V1_0::SapResultCode.CARD_REMOVED implicitly + 1 */,
    DATA_NOT_AVAILABLE = 6 /* ::android::hardware::radio::V1_0::SapResultCode.CARD_ALREADY_POWERED_ON implicitly + 1 */,
    NOT_SUPPORTED = 7 /* ::android::hardware::radio::V1_0::SapResultCode.DATA_NOT_AVAILABLE implicitly + 1 */,
};

enum class SapStatus : int32_t {
    UNKNOWN_ERROR = 0,
    CARD_RESET = 1 /* ::android::hardware::radio::V1_0::SapStatus.UNKNOWN_ERROR implicitly + 1 */,
    CARD_NOT_ACCESSIBLE = 2 /* ::android::hardware::radio::V1_0::SapStatus.CARD_RESET implicitly + 1 */,
    CARD_REMOVED = 3 /* ::android::hardware::radio::V1_0::SapStatus.CARD_NOT_ACCESSIBLE implicitly + 1 */,
    CARD_INSERTED = 4 /* ::android::hardware::radio::V1_0::SapStatus.CARD_REMOVED implicitly + 1 */,
    RECOVERED = 5 /* ::android::hardware::radio::V1_0::SapStatus.CARD_INSERTED implicitly + 1 */,
};

enum class SapTransferProtocol : int32_t {
    T0 = 0,
    T1 = 1 /* ::android::hardware::radio::V1_0::SapTransferProtocol.T0 implicitly + 1 */,
};

enum class CallState : int32_t {
    ACTIVE = 0,
    HOLDING = 1 /* ::android::hardware::radio::V1_0::CallState.ACTIVE implicitly + 1 */,
    DIALING = 2 /* ::android::hardware::radio::V1_0::CallState.HOLDING implicitly + 1 */,
    ALERTING = 3 /* ::android::hardware::radio::V1_0::CallState.DIALING implicitly + 1 */,
    INCOMING = 4 /* ::android::hardware::radio::V1_0::CallState.ALERTING implicitly + 1 */,
    WAITING = 5 /* ::android::hardware::radio::V1_0::CallState.INCOMING implicitly + 1 */,
};

/**
 * User-to-User signaling Info activation types derived from 3GPP 23.087 v8.0
 */
enum class UusType : int32_t {
    TYPE1_IMPLICIT = 0,
    TYPE1_REQUIRED = 1 /* ::android::hardware::radio::V1_0::UusType.TYPE1_IMPLICIT implicitly + 1 */,
    TYPE1_NOT_REQUIRED = 2 /* ::android::hardware::radio::V1_0::UusType.TYPE1_REQUIRED implicitly + 1 */,
    TYPE2_REQUIRED = 3 /* ::android::hardware::radio::V1_0::UusType.TYPE1_NOT_REQUIRED implicitly + 1 */,
    TYPE2_NOT_REQUIRED = 4 /* ::android::hardware::radio::V1_0::UusType.TYPE2_REQUIRED implicitly + 1 */,
    TYPE3_REQUIRED = 5 /* ::android::hardware::radio::V1_0::UusType.TYPE2_NOT_REQUIRED implicitly + 1 */,
    TYPE3_NOT_REQUIRED = 6 /* ::android::hardware::radio::V1_0::UusType.TYPE3_REQUIRED implicitly + 1 */,
};

/**
 * User-to-User Signaling Information data coding schemes. Possible values for
 * Octet 3 (Protocol Discriminator field) in the UUIE. The values have been
 * specified in section 10.5.4.25 of 3GPP TS 24.008
 */
enum class UusDcs : int32_t {
    USP = 0,
    OSIHLP = 1 /* ::android::hardware::radio::V1_0::UusDcs.USP implicitly + 1 */,
    X244 = 2 /* ::android::hardware::radio::V1_0::UusDcs.OSIHLP implicitly + 1 */,
    RMCF = 3 /* ::android::hardware::radio::V1_0::UusDcs.X244 implicitly + 1 */,
    IA5C = 4 /* ::android::hardware::radio::V1_0::UusDcs.RMCF implicitly + 1 */,
};

enum class CallPresentation : int32_t {
    ALLOWED = 0,
    RESTRICTED = 1 /* ::android::hardware::radio::V1_0::CallPresentation.ALLOWED implicitly + 1 */,
    UNKNOWN = 2 /* ::android::hardware::radio::V1_0::CallPresentation.RESTRICTED implicitly + 1 */,
    PAYPHONE = 3 /* ::android::hardware::radio::V1_0::CallPresentation.UNKNOWN implicitly + 1 */,
};

enum class Clir : int32_t {
    DEFAULT = 0,
    INVOCATION = 1 /* ::android::hardware::radio::V1_0::Clir.DEFAULT implicitly + 1 */,
    SUPPRESSION = 2 /* ::android::hardware::radio::V1_0::Clir.INVOCATION implicitly + 1 */,
};

enum class LastCallFailCause : int32_t {
    UNOBTAINABLE_NUMBER = 1,
    NO_ROUTE_TO_DESTINATION = 3,
    CHANNEL_UNACCEPTABLE = 6,
    OPERATOR_DETERMINED_BARRING = 8,
    NORMAL = 16,
    BUSY = 17,
    NO_USER_RESPONDING = 18,
    NO_ANSWER_FROM_USER = 19,
    CALL_REJECTED = 21,
    NUMBER_CHANGED = 22,
    PREEMPTION = 25,
    DESTINATION_OUT_OF_ORDER = 27,
    INVALID_NUMBER_FORMAT = 28,
    FACILITY_REJECTED = 29,
    RESP_TO_STATUS_ENQUIRY = 30,
    NORMAL_UNSPECIFIED = 31,
    CONGESTION = 34,
    NETWORK_OUT_OF_ORDER = 38,
    TEMPORARY_FAILURE = 41,
    SWITCHING_EQUIPMENT_CONGESTION = 42,
    ACCESS_INFORMATION_DISCARDED = 43,
    REQUESTED_CIRCUIT_OR_CHANNEL_NOT_AVAILABLE = 44,
    RESOURCES_UNAVAILABLE_OR_UNSPECIFIED = 47,
    QOS_UNAVAILABLE = 49,
    REQUESTED_FACILITY_NOT_SUBSCRIBED = 50,
    INCOMING_CALLS_BARRED_WITHIN_CUG = 55,
    BEARER_CAPABILITY_NOT_AUTHORIZED = 57,
    BEARER_CAPABILITY_UNAVAILABLE = 58,
    SERVICE_OPTION_NOT_AVAILABLE = 63,
    BEARER_SERVICE_NOT_IMPLEMENTED = 65,
    ACM_LIMIT_EXCEEDED = 68,
    REQUESTED_FACILITY_NOT_IMPLEMENTED = 69,
    ONLY_DIGITAL_INFORMATION_BEARER_AVAILABLE = 70,
    SERVICE_OR_OPTION_NOT_IMPLEMENTED = 79,
    INVALID_TRANSACTION_IDENTIFIER = 81,
    USER_NOT_MEMBER_OF_CUG = 87,
    INCOMPATIBLE_DESTINATION = 88,
    INVALID_TRANSIT_NW_SELECTION = 91,
    SEMANTICALLY_INCORRECT_MESSAGE = 95,
    INVALID_MANDATORY_INFORMATION = 96,
    MESSAGE_TYPE_NON_IMPLEMENTED = 97,
    MESSAGE_TYPE_NOT_COMPATIBLE_WITH_PROTOCOL_STATE = 98,
    INFORMATION_ELEMENT_NON_EXISTENT = 99,
    CONDITIONAL_IE_ERROR = 100,
    MESSAGE_NOT_COMPATIBLE_WITH_PROTOCOL_STATE = 101,
    RECOVERY_ON_TIMER_EXPIRED = 102,
    PROTOCOL_ERROR_UNSPECIFIED = 111,
    INTERWORKING_UNSPECIFIED = 127,
    CALL_BARRED = 240,
    FDN_BLOCKED = 241,
    IMSI_UNKNOWN_IN_VLR = 242,
    IMEI_NOT_ACCEPTED = 243,
    DIAL_MODIFIED_TO_USSD = 244,
    DIAL_MODIFIED_TO_SS = 245,
    DIAL_MODIFIED_TO_DIAL = 246,
    RADIO_OFF = 247,
    OUT_OF_SERVICE = 248,
    NO_VALID_SIM = 249,
    RADIO_INTERNAL_ERROR = 250,
    NETWORK_RESP_TIMEOUT = 251,
    NETWORK_REJECT = 252,
    RADIO_ACCESS_FAILURE = 253,
    RADIO_LINK_FAILURE = 254,
    RADIO_LINK_LOST = 255,
    RADIO_UPLINK_FAILURE = 256,
    RADIO_SETUP_FAILURE = 257,
    RADIO_RELEASE_NORMAL = 258,
    RADIO_RELEASE_ABNORMAL = 259,
    ACCESS_CLASS_BLOCKED = 260,
    NETWORK_DETACH = 261,
    CDMA_LOCKED_UNTIL_POWER_CYCLE = 1000,
    CDMA_DROP = 1001,
    CDMA_INTERCEPT = 1002,
    CDMA_REORDER = 1003,
    CDMA_SO_REJECT = 1004,
    CDMA_RETRY_ORDER = 1005,
    CDMA_ACCESS_FAILURE = 1006,
    CDMA_PREEMPTED = 1007,
    CDMA_NOT_EMERGENCY = 1008,
    CDMA_ACCESS_BLOCKED = 1009,
    /**
     * OEM specific error codes. Used to distinguish error from
     * CALL_FAIL_ERROR_UNSPECIFIED and help assist debugging
     */
    OEM_CAUSE_1 = 61441 /* 0xf001 */,
    OEM_CAUSE_2 = 61442 /* 0xf002 */,
    OEM_CAUSE_3 = 61443 /* 0xf003 */,
    OEM_CAUSE_4 = 61444 /* 0xf004 */,
    OEM_CAUSE_5 = 61445 /* 0xf005 */,
    OEM_CAUSE_6 = 61446 /* 0xf006 */,
    OEM_CAUSE_7 = 61447 /* 0xf007 */,
    OEM_CAUSE_8 = 61448 /* 0xf008 */,
    OEM_CAUSE_9 = 61449 /* 0xf009 */,
    OEM_CAUSE_10 = 61450 /* 0xf00a */,
    OEM_CAUSE_11 = 61451 /* 0xf00b */,
    OEM_CAUSE_12 = 61452 /* 0xf00c */,
    OEM_CAUSE_13 = 61453 /* 0xf00d */,
    OEM_CAUSE_14 = 61454 /* 0xf00e */,
    OEM_CAUSE_15 = 61455 /* 0xf00f */,
    ERROR_UNSPECIFIED = 65535 /* 0xffff */,
};

enum class DataCallFailCause : int32_t {
    NONE = 0,
    OPERATOR_BARRED = 8 /* 0x08 */,
    NAS_SIGNALLING = 14 /* 0x0E */,
    INSUFFICIENT_RESOURCES = 26 /* 0x1A */,
    MISSING_UKNOWN_APN = 27 /* 0x1B */,
    UNKNOWN_PDP_ADDRESS_TYPE = 28 /* 0x1C */,
    USER_AUTHENTICATION = 29 /* 0x1D */,
    ACTIVATION_REJECT_GGSN = 30 /* 0x1E */,
    ACTIVATION_REJECT_UNSPECIFIED = 31 /* 0x1F */,
    SERVICE_OPTION_NOT_SUPPORTED = 32 /* 0x20 */,
    SERVICE_OPTION_NOT_SUBSCRIBED = 33 /* 0x21 */,
    SERVICE_OPTION_OUT_OF_ORDER = 34 /* 0x22 */,
    NSAPI_IN_USE = 35 /* 0x23 */,
    REGULAR_DEACTIVATION = 36 /* 0x24 */,
    QOS_NOT_ACCEPTED = 37 /* 0x25 */,
    NETWORK_FAILURE = 38 /* 0x26 */,
    UMTS_REACTIVATION_REQ = 39 /* 0x27 */,
    FEATURE_NOT_SUPP = 40 /* 0x28 */,
    TFT_SEMANTIC_ERROR = 41 /* 0x29 */,
    TFT_SYTAX_ERROR = 42 /* 0x2A */,
    UNKNOWN_PDP_CONTEXT = 43 /* 0x2B */,
    FILTER_SEMANTIC_ERROR = 44 /* 0x2C */,
    FILTER_SYTAX_ERROR = 45 /* 0x2D */,
    PDP_WITHOUT_ACTIVE_TFT = 46 /* 0x2E */,
    ONLY_IPV4_ALLOWED = 50 /* 0x32 */,
    ONLY_IPV6_ALLOWED = 51 /* 0x33 */,
    ONLY_SINGLE_BEARER_ALLOWED = 52 /* 0x34 */,
    ESM_INFO_NOT_RECEIVED = 53 /* 0x35 */,
    PDN_CONN_DOES_NOT_EXIST = 54 /* 0x36 */,
    MULTI_CONN_TO_SAME_PDN_NOT_ALLOWED = 55 /* 0x37 */,
    MAX_ACTIVE_PDP_CONTEXT_REACHED = 65 /* 0x41 */,
    UNSUPPORTED_APN_IN_CURRENT_PLMN = 66 /* 0x42 */,
    INVALID_TRANSACTION_ID = 81 /* 0x51 */,
    MESSAGE_INCORRECT_SEMANTIC = 95 /* 0x5F */,
    INVALID_MANDATORY_INFO = 96 /* 0x60 */,
    MESSAGE_TYPE_UNSUPPORTED = 97 /* 0x61 */,
    MSG_TYPE_NONCOMPATIBLE_STATE = 98 /* 0x62 */,
    UNKNOWN_INFO_ELEMENT = 99 /* 0x63 */,
    CONDITIONAL_IE_ERROR = 100 /* 0x64 */,
    MSG_AND_PROTOCOL_STATE_UNCOMPATIBLE = 101 /* 0x65 */,
    PROTOCOL_ERRORS = 111 /* 0x6F */,
    APN_TYPE_CONFLICT = 112 /* 0x70 */,
    INVALID_PCSCF_ADDR = 113 /* 0x71 */,
    INTERNAL_CALL_PREEMPT_BY_HIGH_PRIO_APN = 114 /* 0x72 */,
    EMM_ACCESS_BARRED = 115 /* 0x73 */,
    EMERGENCY_IFACE_ONLY = 116 /* 0x74 */,
    IFACE_MISMATCH = 117 /* 0x75 */,
    COMPANION_IFACE_IN_USE = 118 /* 0x76 */,
    IP_ADDRESS_MISMATCH = 119 /* 0x77 */,
    IFACE_AND_POL_FAMILY_MISMATCH = 120 /* 0x78 */,
    EMM_ACCESS_BARRED_INFINITE_RETRY = 121 /* 0x79 */,
    AUTH_FAILURE_ON_EMERGENCY_CALL = 122 /* 0x7A */,
    OEM_DCFAILCAUSE_1 = 4097 /* 0x1001 */,
    OEM_DCFAILCAUSE_2 = 4098 /* 0x1002 */,
    OEM_DCFAILCAUSE_3 = 4099 /* 0x1003 */,
    OEM_DCFAILCAUSE_4 = 4100 /* 0x1004 */,
    OEM_DCFAILCAUSE_5 = 4101 /* 0x1005 */,
    OEM_DCFAILCAUSE_6 = 4102 /* 0x1006 */,
    OEM_DCFAILCAUSE_7 = 4103 /* 0x1007 */,
    OEM_DCFAILCAUSE_8 = 4104 /* 0x1008 */,
    OEM_DCFAILCAUSE_9 = 4105 /* 0x1009 */,
    OEM_DCFAILCAUSE_10 = 4106 /* 0x100A */,
    OEM_DCFAILCAUSE_11 = 4107 /* 0x100B */,
    OEM_DCFAILCAUSE_12 = 4108 /* 0x100C */,
    OEM_DCFAILCAUSE_13 = 4109 /* 0x100D */,
    OEM_DCFAILCAUSE_14 = 4110 /* 0x100E */,
    OEM_DCFAILCAUSE_15 = 4111 /* 0x100F */,
    VOICE_REGISTRATION_FAIL = -1 /* -1 */,
    DATA_REGISTRATION_FAIL = -2 /* -2 */,
    SIGNAL_LOST = -3 /* -3 */,
    PREF_RADIO_TECH_CHANGED = -4 /* -4 */,
    RADIO_POWER_OFF = -5 /* -5 */,
    TETHERED_CALL_ACTIVE = -6 /* -6 */,
    ERROR_UNSPECIFIED = 65535 /* 0xffff */,
};

/**
 * Please note that registration state UNKNOWN is
 * treated as "out of service" in the Android telephony.
 * Registration state REG_DENIED must be returned if Location Update
 * Reject (with cause 17 - Network Failure) is received
 * repeatedly from the network, to facilitate
 * "managed roaming"
 */
enum class RegState : int32_t {
    NOT_REG_MT_NOT_SEARCHING_OP = 0,
    REG_HOME = 1,
    NOT_REG_MT_SEARCHING_OP = 2,
    REG_DENIED = 3,
    UNKNOWN = 4,
    REG_ROAMING = 5,
    NOT_REG_MT_NOT_SEARCHING_OP_EM = 10,
    NOT_REG_MT_SEARCHING_OP_EM = 12,
    REG_DENIED_EM = 13,
    UNKNOWN_EM = 14,
};

enum class RadioTechnology : int32_t {
    UNKNOWN = 0,
    GPRS = 1,
    EDGE = 2,
    UMTS = 3,
    IS95A = 4,
    IS95B = 5,
    ONE_X_RTT = 6,
    EVDO_0 = 7,
    EVDO_A = 8,
    HSDPA = 9,
    HSUPA = 10,
    HSPA = 11,
    EVDO_B = 12,
    EHRPD = 13,
    LTE = 14,
    HSPAP = 15,
    GSM = 16,
    TD_SCDMA = 17,
    IWLAN = 18,
    LTE_CA = 19,
};

enum class DataProfileId : int32_t {
    DEFAULT = 0,
    TETHERED = 1,
    IMS = 2,
    FOTA = 3,
    CBS = 4,
    OEM_BASE = 1000,
    INVALID = -1 /* 0xFFFFFFFF */,
};

enum class SmsAcknowledgeFailCause : int32_t {
    MEMORY_CAPACITY_EXCEEDED = 211 /* 0xD3 */,
    UNSPECIFIED_ERROR = 255 /* 0XFF */,
};

enum class CallForwardInfoStatus : int32_t {
    DISABLE = 0,
    ENABLE = 1 /* ::android::hardware::radio::V1_0::CallForwardInfoStatus.DISABLE implicitly + 1 */,
    INTERROGATE = 2 /* ::android::hardware::radio::V1_0::CallForwardInfoStatus.ENABLE implicitly + 1 */,
    REGISTRATION = 3 /* ::android::hardware::radio::V1_0::CallForwardInfoStatus.INTERROGATE implicitly + 1 */,
    ERASURE = 4 /* ::android::hardware::radio::V1_0::CallForwardInfoStatus.REGISTRATION implicitly + 1 */,
};

enum class ClipStatus : int32_t {
    CLIP_PROVISIONED = 0,
    CLIP_UNPROVISIONED = 1 /* ::android::hardware::radio::V1_0::ClipStatus.CLIP_PROVISIONED implicitly + 1 */,
    UNKNOWN = 2 /* ::android::hardware::radio::V1_0::ClipStatus.CLIP_UNPROVISIONED implicitly + 1 */,
};

enum class SmsWriteArgsStatus : int32_t {
    REC_UNREAD = 0,
    REC_READ = 1 /* ::android::hardware::radio::V1_0::SmsWriteArgsStatus.REC_UNREAD implicitly + 1 */,
    STO_UNSENT = 2 /* ::android::hardware::radio::V1_0::SmsWriteArgsStatus.REC_READ implicitly + 1 */,
    STO_SENT = 3 /* ::android::hardware::radio::V1_0::SmsWriteArgsStatus.STO_UNSENT implicitly + 1 */,
};

enum class RadioBandMode : int32_t {
    BAND_MODE_UNSPECIFIED = 0,
    BAND_MODE_EURO = 1 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_UNSPECIFIED implicitly + 1 */,
    BAND_MODE_USA = 2 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_EURO implicitly + 1 */,
    BAND_MODE_JPN = 3 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_USA implicitly + 1 */,
    BAND_MODE_AUS = 4 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_JPN implicitly + 1 */,
    BAND_MODE_AUS_2 = 5 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_AUS implicitly + 1 */,
    BAND_MODE_CELL_800 = 6 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_AUS_2 implicitly + 1 */,
    BAND_MODE_PCS = 7 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_CELL_800 implicitly + 1 */,
    BAND_MODE_JTACS = 8 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_PCS implicitly + 1 */,
    BAND_MODE_KOREA_PCS = 9 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_JTACS implicitly + 1 */,
    BAND_MODE_5_450M = 10 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_KOREA_PCS implicitly + 1 */,
    BAND_MODE_IMT2000 = 11 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_5_450M implicitly + 1 */,
    BAND_MODE_7_700M_2 = 12 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_IMT2000 implicitly + 1 */,
    BAND_MODE_8_1800M = 13 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_7_700M_2 implicitly + 1 */,
    BAND_MODE_9_900M = 14 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_8_1800M implicitly + 1 */,
    BAND_MODE_10_800M_2 = 15 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_9_900M implicitly + 1 */,
    BAND_MODE_EURO_PAMR_400M = 16 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_10_800M_2 implicitly + 1 */,
    BAND_MODE_AWS = 17 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_EURO_PAMR_400M implicitly + 1 */,
    BAND_MODE_USA_2500M = 18 /* ::android::hardware::radio::V1_0::RadioBandMode.BAND_MODE_AWS implicitly + 1 */,
};

enum class OperatorStatus : int32_t {
    UNKNOWN = 0,
    AVAILABLE = 1 /* ::android::hardware::radio::V1_0::OperatorStatus.UNKNOWN implicitly + 1 */,
    CURRENT = 2 /* ::android::hardware::radio::V1_0::OperatorStatus.AVAILABLE implicitly + 1 */,
    FORBIDDEN = 3 /* ::android::hardware::radio::V1_0::OperatorStatus.CURRENT implicitly + 1 */,
};

enum class PreferredNetworkType : int32_t {
    GSM_WCDMA = 0,
    GSM_ONLY = 1 /* ::android::hardware::radio::V1_0::PreferredNetworkType.GSM_WCDMA implicitly + 1 */,
    WCDMA = 2 /* ::android::hardware::radio::V1_0::PreferredNetworkType.GSM_ONLY implicitly + 1 */,
    GSM_WCDMA_AUTO = 3 /* ::android::hardware::radio::V1_0::PreferredNetworkType.WCDMA implicitly + 1 */,
    CDMA_EVDO_AUTO = 4 /* ::android::hardware::radio::V1_0::PreferredNetworkType.GSM_WCDMA_AUTO implicitly + 1 */,
    CDMA_ONLY = 5 /* ::android::hardware::radio::V1_0::PreferredNetworkType.CDMA_EVDO_AUTO implicitly + 1 */,
    EVDO_ONLY = 6 /* ::android::hardware::radio::V1_0::PreferredNetworkType.CDMA_ONLY implicitly + 1 */,
    GSM_WCDMA_CDMA_EVDO_AUTO = 7 /* ::android::hardware::radio::V1_0::PreferredNetworkType.EVDO_ONLY implicitly + 1 */,
    LTE_CDMA_EVDO = 8 /* ::android::hardware::radio::V1_0::PreferredNetworkType.GSM_WCDMA_CDMA_EVDO_AUTO implicitly + 1 */,
    LTE_GSM_WCDMA = 9 /* ::android::hardware::radio::V1_0::PreferredNetworkType.LTE_CDMA_EVDO implicitly + 1 */,
    LTE_CMDA_EVDO_GSM_WCDMA = 10 /* ::android::hardware::radio::V1_0::PreferredNetworkType.LTE_GSM_WCDMA implicitly + 1 */,
    LTE_ONLY = 11 /* ::android::hardware::radio::V1_0::PreferredNetworkType.LTE_CMDA_EVDO_GSM_WCDMA implicitly + 1 */,
    LTE_WCDMA = 12 /* ::android::hardware::radio::V1_0::PreferredNetworkType.LTE_ONLY implicitly + 1 */,
    TD_SCDMA_ONLY = 13 /* ::android::hardware::radio::V1_0::PreferredNetworkType.LTE_WCDMA implicitly + 1 */,
    TD_SCDMA_WCDMA = 14 /* ::android::hardware::radio::V1_0::PreferredNetworkType.TD_SCDMA_ONLY implicitly + 1 */,
    TD_SCDMA_LTE = 15 /* ::android::hardware::radio::V1_0::PreferredNetworkType.TD_SCDMA_WCDMA implicitly + 1 */,
    TD_SCDMA_GSM = 16 /* ::android::hardware::radio::V1_0::PreferredNetworkType.TD_SCDMA_LTE implicitly + 1 */,
    TD_SCDMA_GSM_LTE = 17 /* ::android::hardware::radio::V1_0::PreferredNetworkType.TD_SCDMA_GSM implicitly + 1 */,
    TD_SCDMA_GSM_WCDMA = 18 /* ::android::hardware::radio::V1_0::PreferredNetworkType.TD_SCDMA_GSM_LTE implicitly + 1 */,
    TD_SCDMA_WCDMA_LTE = 19 /* ::android::hardware::radio::V1_0::PreferredNetworkType.TD_SCDMA_GSM_WCDMA implicitly + 1 */,
    TD_SCDMA_GSM_WCDMA_LTE = 20 /* ::android::hardware::radio::V1_0::PreferredNetworkType.TD_SCDMA_WCDMA_LTE implicitly + 1 */,
    TD_SCDMA_GSM_WCDMA_CDMA_EVDO_AUTO = 21 /* ::android::hardware::radio::V1_0::PreferredNetworkType.TD_SCDMA_GSM_WCDMA_LTE implicitly + 1 */,
    TD_SCDMA_LTE_CDMA_EVDO_GSM_WCDMA = 22 /* ::android::hardware::radio::V1_0::PreferredNetworkType.TD_SCDMA_GSM_WCDMA_CDMA_EVDO_AUTO implicitly + 1 */,
};

enum class CdmaSubscriptionSource : int32_t {
    RUIM_SIM = 0,
    NV = 1 /* ::android::hardware::radio::V1_0::CdmaSubscriptionSource.RUIM_SIM implicitly + 1 */,
};

enum class CdmaRoamingType : int32_t {
    HOME_NETWORK = 0,
    AFFILIATED_ROAM = 1 /* ::android::hardware::radio::V1_0::CdmaRoamingType.HOME_NETWORK implicitly + 1 */,
    ANY_ROAM = 2 /* ::android::hardware::radio::V1_0::CdmaRoamingType.AFFILIATED_ROAM implicitly + 1 */,
};

enum class TtyMode : int32_t {
    OFF = 0,
    FULL = 1 /* ::android::hardware::radio::V1_0::TtyMode.OFF implicitly + 1 */,
    HCO = 2 /* ::android::hardware::radio::V1_0::TtyMode.FULL implicitly + 1 */,
    VCO = 3 /* ::android::hardware::radio::V1_0::TtyMode.HCO implicitly + 1 */,
};

enum class NvItem : int32_t {
    CDMA_MEID = 1,
    CDMA_MIN = 2,
    CDMA_MDN = 3,
    CDMA_ACCOLC = 4,
    DEVICE_MSL = 11,
    RTN_RECONDITIONED_STATUS = 12,
    RTN_ACTIVATION_DATE = 13,
    RTN_LIFE_TIMER = 14,
    RTN_LIFE_CALLS = 15,
    RTN_LIFE_DATA_TX = 16,
    RTN_LIFE_DATA_RX = 17,
    OMADM_HFA_LEVEL = 18,
    MIP_PROFILE_NAI = 31,
    MIP_PROFILE_HOME_ADDRESS = 32,
    MIP_PROFILE_AAA_AUTH = 33,
    MIP_PROFILE_HA_AUTH = 34,
    MIP_PROFILE_PRI_HA_ADDR = 35,
    MIP_PROFILE_SEC_HA_ADDR = 36,
    MIP_PROFILE_REV_TUN_PREF = 37,
    MIP_PROFILE_HA_SPI = 38,
    MIP_PROFILE_AAA_SPI = 39,
    MIP_PROFILE_MN_HA_SS = 40,
    MIP_PROFILE_MN_AAA_SS = 41,
    CDMA_PRL_VERSION = 51,
    CDMA_BC10 = 52,
    CDMA_BC14 = 53,
    CDMA_SO68 = 54,
    CDMA_SO73_COP0 = 55,
    CDMA_SO73_COP1TO7 = 56,
    CDMA_1X_ADVANCED_ENABLED = 57,
    CDMA_EHRPD_ENABLED = 58,
    CDMA_EHRPD_FORCED = 59,
    LTE_BAND_ENABLE_25 = 71,
    LTE_BAND_ENABLE_26 = 72,
    LTE_BAND_ENABLE_41 = 73,
    LTE_SCAN_PRIORITY_25 = 74,
    LTE_SCAN_PRIORITY_26 = 75,
    LTE_SCAN_PRIORITY_41 = 76,
    LTE_HIDDEN_BAND_PRIORITY_25 = 77,
    LTE_HIDDEN_BAND_PRIORITY_26 = 78,
    LTE_HIDDEN_BAND_PRIORITY_41 = 79,
};

enum class ResetNvType : int32_t {
    RELOAD = 0,
    ERASE = 1 /* ::android::hardware::radio::V1_0::ResetNvType.RELOAD implicitly + 1 */,
    FACTORY_RESET = 2 /* ::android::hardware::radio::V1_0::ResetNvType.ERASE implicitly + 1 */,
};

enum class HardwareConfigType : int32_t {
    MODEM = 0,
    SIM = 1 /* ::android::hardware::radio::V1_0::HardwareConfigType.MODEM implicitly + 1 */,
};

enum class HardwareConfigState : int32_t {
    ENABLED = 0,
    STANDBY = 1 /* ::android::hardware::radio::V1_0::HardwareConfigState.ENABLED implicitly + 1 */,
    DISABLED = 2 /* ::android::hardware::radio::V1_0::HardwareConfigState.STANDBY implicitly + 1 */,
};

enum class LceStatus : int32_t {
    NOT_SUPPORTED = 0,
    STOPPED = 1 /* ::android::hardware::radio::V1_0::LceStatus.NOT_SUPPORTED implicitly + 1 */,
    ACTIVE = 2 /* ::android::hardware::radio::V1_0::LceStatus.STOPPED implicitly + 1 */,
};

enum class CarrierMatchType : int32_t {
    ALL = 0,
    SPN = 1,
    IMSI_PREFIX = 2,
    GID1 = 3,
    GID2 = 4,
};

struct NeighboringCell final {
    ::android::hardware::hidl_string cid __attribute__ ((aligned(8)));
    int32_t rssi __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::NeighboringCell, cid) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::NeighboringCell, rssi) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::NeighboringCell) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::NeighboringCell) == 8, "wrong alignment");

enum class CdmaSmsDigitMode : int32_t {
    FOUR_BIT = 0,
    EIGHT_BIT = 1 /* ::android::hardware::radio::V1_0::CdmaSmsDigitMode.FOUR_BIT implicitly + 1 */,
};

enum class CdmaSmsNumberMode : int32_t {
    NOT_DATA_NETWORK = 0,
    DATA_NETWORK = 1 /* ::android::hardware::radio::V1_0::CdmaSmsNumberMode.NOT_DATA_NETWORK implicitly + 1 */,
};

enum class CdmaSmsNumberType : int32_t {
    UNKNOWN = 0,
    INTERNATIONAL_OR_DATA_IP = 1 /* ::android::hardware::radio::V1_0::CdmaSmsNumberType.UNKNOWN implicitly + 1 */,
    NATIONAL_OR_INTERNET_MAIL = 2 /* ::android::hardware::radio::V1_0::CdmaSmsNumberType.INTERNATIONAL_OR_DATA_IP implicitly + 1 */,
    NETWORK = 3 /* ::android::hardware::radio::V1_0::CdmaSmsNumberType.NATIONAL_OR_INTERNET_MAIL implicitly + 1 */,
    SUBSCRIBER = 4 /* ::android::hardware::radio::V1_0::CdmaSmsNumberType.NETWORK implicitly + 1 */,
    ALPHANUMERIC = 5 /* ::android::hardware::radio::V1_0::CdmaSmsNumberType.SUBSCRIBER implicitly + 1 */,
    ABBREVIATED = 6 /* ::android::hardware::radio::V1_0::CdmaSmsNumberType.ALPHANUMERIC implicitly + 1 */,
    RESERVED_7 = 7 /* ::android::hardware::radio::V1_0::CdmaSmsNumberType.ABBREVIATED implicitly + 1 */,
};

enum class CdmaSmsNumberPlan : int32_t {
    UNKNOWN = 0,
    TELEPHONY = 1 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.UNKNOWN implicitly + 1 */,
    RESERVED_2 = 2 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.TELEPHONY implicitly + 1 */,
    DATA = 3 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.RESERVED_2 implicitly + 1 */,
    TELEX = 4 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.DATA implicitly + 1 */,
    RESERVED_5 = 5 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.TELEX implicitly + 1 */,
    RESERVED_6 = 6 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.RESERVED_5 implicitly + 1 */,
    RESERVED_7 = 7 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.RESERVED_6 implicitly + 1 */,
    RESERVED_8 = 8 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.RESERVED_7 implicitly + 1 */,
    PRIVATE = 9 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.RESERVED_8 implicitly + 1 */,
    RESERVED_10 = 10 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.PRIVATE implicitly + 1 */,
    RESERVED_11 = 11 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.RESERVED_10 implicitly + 1 */,
    RESERVED_12 = 12 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.RESERVED_11 implicitly + 1 */,
    RESERVED_13 = 13 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.RESERVED_12 implicitly + 1 */,
    RESERVED_14 = 14 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.RESERVED_13 implicitly + 1 */,
    RESERVED_15 = 15 /* ::android::hardware::radio::V1_0::CdmaSmsNumberPlan.RESERVED_14 implicitly + 1 */,
};

enum class CdmaSmsSubaddressType : int32_t {
    NSAP = 0,
    USER_SPECIFIED = 1 /* ::android::hardware::radio::V1_0::CdmaSmsSubaddressType.NSAP implicitly + 1 */,
};

enum class CdmaSmsErrorClass : int32_t {
    NO_ERROR = 0,
    ERROR = 1 /* ::android::hardware::radio::V1_0::CdmaSmsErrorClass.NO_ERROR implicitly + 1 */,
};

enum class CdmaSmsWriteArgsStatus : int32_t {
    REC_UNREAD = 0,
    REC_READ = 1 /* ::android::hardware::radio::V1_0::CdmaSmsWriteArgsStatus.REC_UNREAD implicitly + 1 */,
    STO_UNSENT = 2 /* ::android::hardware::radio::V1_0::CdmaSmsWriteArgsStatus.REC_READ implicitly + 1 */,
    STO_SENT = 3 /* ::android::hardware::radio::V1_0::CdmaSmsWriteArgsStatus.STO_UNSENT implicitly + 1 */,
};

enum class CellInfoType : int32_t {
    NONE = 0,
    GSM = 1,
    CDMA = 2,
    LTE = 3,
    WCDMA = 4,
    TD_SCDMA = 5,
};

enum class TimeStampType : int32_t {
    UNKNOWN = 0,
    ANTENNA = 1 /* ::android::hardware::radio::V1_0::TimeStampType.UNKNOWN implicitly + 1 */,
    MODEM = 2 /* ::android::hardware::radio::V1_0::TimeStampType.ANTENNA implicitly + 1 */,
    OEM_RIL = 3 /* ::android::hardware::radio::V1_0::TimeStampType.MODEM implicitly + 1 */,
    JAVA_RIL = 4 /* ::android::hardware::radio::V1_0::TimeStampType.OEM_RIL implicitly + 1 */,
};

enum class ApnAuthType : int32_t {
    NO_PAP_NO_CHAP = 0,
    PAP_NO_CHAP = 1 /* ::android::hardware::radio::V1_0::ApnAuthType.NO_PAP_NO_CHAP implicitly + 1 */,
    NO_PAP_CHAP = 2 /* ::android::hardware::radio::V1_0::ApnAuthType.PAP_NO_CHAP implicitly + 1 */,
    PAP_CHAP = 3 /* ::android::hardware::radio::V1_0::ApnAuthType.NO_PAP_CHAP implicitly + 1 */,
};

enum class RadioTechnologyFamily : int32_t {
    THREE_GPP = 0,
    THREE_GPP2 = 1 /* ::android::hardware::radio::V1_0::RadioTechnologyFamily.THREE_GPP implicitly + 1 */,
};

enum class RadioCapabilityPhase : int32_t {
    CONFIGURED = 0,
    START = 1,
    APPLY = 2,
    UNSOL_RSP = 3,
    FINISH = 4,
};

enum class RadioCapabilityStatus : int32_t {
    NONE = 0,
    SUCCESS = 1,
    FAIL = 2,
};

enum class RadioAccessFamily : int32_t {
    UNKNOWN = 1 /* 1 << RadioTechnology:UNKNOWN */,
    GPRS = 2 /* 1 << RadioTechnology:GPRS */,
    EDGE = 4 /* 1 << RadioTechnology:EDGE */,
    UMTS = 8 /* 1 << RadioTechnology:UMTS */,
    IS95A = 16 /* 1 << RadioTechnology:IS95A */,
    IS95B = 32 /* 1 << RadioTechnology:IS95B */,
    ONE_X_RTT = 64 /* 1 << RadioTechnology:ONE_X_RTT */,
    EVDO_0 = 128 /* 1 << RadioTechnology:EVDO_0 */,
    EVDO_A = 256 /* 1 << RadioTechnology:EVDO_A */,
    HSDPA = 512 /* 1 << RadioTechnology:HSDPA */,
    HSUPA = 1024 /* 1 << RadioTechnology:HSUPA */,
    HSPA = 2048 /* 1 << RadioTechnology:HSPA */,
    EVDO_B = 4096 /* 1 << RadioTechnology:EVDO_B */,
    EHRPD = 8192 /* 1 << RadioTechnology:EHRPD */,
    LTE = 16384 /* 1 << RadioTechnology:LTE */,
    HSPAP = 32768 /* 1 << RadioTechnology:HSPAP */,
    GSM = 65536 /* 1 << RadioTechnology:GSM */,
    TD_SCDMA = 131072 /* 1 << RadioTechnology:TD_SCDMA */,
    LTE_CA = 524288 /* 1 << RadioTechnology:LTE_CA */,
};

enum class UssdModeType : int32_t {
    NOTIFY = 0,
    REQUEST = 1 /* ::android::hardware::radio::V1_0::UssdModeType.NOTIFY implicitly + 1 */,
    NW_RELEASE = 2 /* ::android::hardware::radio::V1_0::UssdModeType.REQUEST implicitly + 1 */,
    LOCAL_CLIENT = 3 /* ::android::hardware::radio::V1_0::UssdModeType.NW_RELEASE implicitly + 1 */,
    NOT_SUPPORTED = 4 /* ::android::hardware::radio::V1_0::UssdModeType.LOCAL_CLIENT implicitly + 1 */,
    NW_TIMEOUT = 5 /* ::android::hardware::radio::V1_0::UssdModeType.NOT_SUPPORTED implicitly + 1 */,
};

enum class SimRefreshType : int32_t {
    SIM_FILE_UPDATE = 0,
    SIM_INIT = 1,
    SIM_RESET = 2,
};

enum class SrvccState : int32_t {
    HANDOVER_STARTED = 0,
    HANDOVER_COMPLETED = 1,
    HANDOVER_FAILED = 2,
    HANDOVER_CANCELED = 3,
};

enum class UiccSubActStatus : int32_t {
    DEACTIVATE = 0,
    ACTIVATE = 1 /* ::android::hardware::radio::V1_0::UiccSubActStatus.DEACTIVATE implicitly + 1 */,
};

enum class SubscriptionType : int32_t {
    SUBSCRIPTION_1 = 0,
    SUBSCRIPTION_2 = 1 /* ::android::hardware::radio::V1_0::SubscriptionType.SUBSCRIPTION_1 implicitly + 1 */,
    SUBSCRIPTION_3 = 2 /* ::android::hardware::radio::V1_0::SubscriptionType.SUBSCRIPTION_2 implicitly + 1 */,
};

enum class DataProfileInfoType : int32_t {
    COMMON = 0,
    THREE_GPP = 1 /* ::android::hardware::radio::V1_0::DataProfileInfoType.COMMON implicitly + 1 */,
    THREE_GPP2 = 2 /* ::android::hardware::radio::V1_0::DataProfileInfoType.THREE_GPP implicitly + 1 */,
};

enum class PhoneRestrictedState : int32_t {
    NONE = 0 /* 0x00 */,
    CS_EMERGENCY = 1 /* 0x01 */,
    CS_NORMAL = 2 /* 0x02 */,
    CS_ALL = 4 /* 0x04 */,
    PS_ALL = 16 /* 0x10 */,
};

enum class CdmaCallWaitingNumberPresentation : int32_t {
    ALLOWED = 0,
    RESTRICTED = 1,
    UNKNOWN = 2,
};

enum class CdmaCallWaitingNumberType : int32_t {
    UNKNOWN = 0,
    INTERNATIONAL = 1,
    NATIONAL = 2,
    NETWORK_SPECIFIC = 3,
    SUBSCRIBER = 4,
};

enum class CdmaCallWaitingNumberPlan : int32_t {
    UNKNOWN = 0,
    ISDN = 1,
    DATA = 3,
    TELEX = 4,
    NATIONAL = 8,
    PRIVATE = 9,
};

enum class CdmaOtaProvisionStatus : int32_t {
    SPL_UNLOCKED = 0,
    SPC_RETRIES_EXCEEDED = 1 /* ::android::hardware::radio::V1_0::CdmaOtaProvisionStatus.SPL_UNLOCKED implicitly + 1 */,
    A_KEY_EXCHANGED = 2 /* ::android::hardware::radio::V1_0::CdmaOtaProvisionStatus.SPC_RETRIES_EXCEEDED implicitly + 1 */,
    SSD_UPDATED = 3 /* ::android::hardware::radio::V1_0::CdmaOtaProvisionStatus.A_KEY_EXCHANGED implicitly + 1 */,
    NAM_DOWNLOADED = 4 /* ::android::hardware::radio::V1_0::CdmaOtaProvisionStatus.SSD_UPDATED implicitly + 1 */,
    MDN_DOWNLOADED = 5 /* ::android::hardware::radio::V1_0::CdmaOtaProvisionStatus.NAM_DOWNLOADED implicitly + 1 */,
    IMSI_DOWNLOADED = 6 /* ::android::hardware::radio::V1_0::CdmaOtaProvisionStatus.MDN_DOWNLOADED implicitly + 1 */,
    PRL_DOWNLOADED = 7 /* ::android::hardware::radio::V1_0::CdmaOtaProvisionStatus.IMSI_DOWNLOADED implicitly + 1 */,
    COMMITTED = 8 /* ::android::hardware::radio::V1_0::CdmaOtaProvisionStatus.PRL_DOWNLOADED implicitly + 1 */,
    OTAPA_STARTED = 9 /* ::android::hardware::radio::V1_0::CdmaOtaProvisionStatus.COMMITTED implicitly + 1 */,
    OTAPA_STOPPED = 10 /* ::android::hardware::radio::V1_0::CdmaOtaProvisionStatus.OTAPA_STARTED implicitly + 1 */,
    OTAPA_ABORTED = 11 /* ::android::hardware::radio::V1_0::CdmaOtaProvisionStatus.OTAPA_STOPPED implicitly + 1 */,
};

/**
 * Names of the CDMA info records (C.S0005 section 3.7.5)
 */
enum class CdmaInfoRecName : int32_t {
    DISPLAY = 0,
    CALLED_PARTY_NUMBER = 1 /* ::android::hardware::radio::V1_0::CdmaInfoRecName.DISPLAY implicitly + 1 */,
    CALLING_PARTY_NUMBER = 2 /* ::android::hardware::radio::V1_0::CdmaInfoRecName.CALLED_PARTY_NUMBER implicitly + 1 */,
    CONNECTED_NUMBER = 3 /* ::android::hardware::radio::V1_0::CdmaInfoRecName.CALLING_PARTY_NUMBER implicitly + 1 */,
    SIGNAL = 4 /* ::android::hardware::radio::V1_0::CdmaInfoRecName.CONNECTED_NUMBER implicitly + 1 */,
    REDIRECTING_NUMBER = 5 /* ::android::hardware::radio::V1_0::CdmaInfoRecName.SIGNAL implicitly + 1 */,
    LINE_CONTROL = 6 /* ::android::hardware::radio::V1_0::CdmaInfoRecName.REDIRECTING_NUMBER implicitly + 1 */,
    EXTENDED_DISPLAY = 7 /* ::android::hardware::radio::V1_0::CdmaInfoRecName.LINE_CONTROL implicitly + 1 */,
    T53_CLIR = 8 /* ::android::hardware::radio::V1_0::CdmaInfoRecName.EXTENDED_DISPLAY implicitly + 1 */,
    T53_RELEASE = 9 /* ::android::hardware::radio::V1_0::CdmaInfoRecName.T53_CLIR implicitly + 1 */,
    T53_AUDIO_CONTROL = 10 /* ::android::hardware::radio::V1_0::CdmaInfoRecName.T53_RELEASE implicitly + 1 */,
};

/**
 * Redirecting Number Information Record as defined in C.S0005 section 3.7.5.11
 */
enum class CdmaRedirectingReason : int32_t {
    UNKNOWN = 0,
    CALL_FORWARDING_BUSY = 1,
    CALL_FORWARDING_NO_REPLY = 2,
    CALLED_DTE_OUT_OF_ORDER = 9,
    CALL_FORWARDING_BY_THE_CALLED_DTE = 10,
    CALL_FORWARDING_UNCONDITIONAL = 15,
    RESERVED = 16 /* ::android::hardware::radio::V1_0::CdmaRedirectingReason.CALL_FORWARDING_UNCONDITIONAL implicitly + 1 */,
};

enum class SsServiceType : int32_t {
    CFU = 0,
    CF_BUSY = 1 /* ::android::hardware::radio::V1_0::SsServiceType.CFU implicitly + 1 */,
    CF_NO_REPLY = 2 /* ::android::hardware::radio::V1_0::SsServiceType.CF_BUSY implicitly + 1 */,
    CF_NOT_REACHABLE = 3 /* ::android::hardware::radio::V1_0::SsServiceType.CF_NO_REPLY implicitly + 1 */,
    CF_ALL = 4 /* ::android::hardware::radio::V1_0::SsServiceType.CF_NOT_REACHABLE implicitly + 1 */,
    CF_ALL_CONDITIONAL = 5 /* ::android::hardware::radio::V1_0::SsServiceType.CF_ALL implicitly + 1 */,
    CLIP = 6 /* ::android::hardware::radio::V1_0::SsServiceType.CF_ALL_CONDITIONAL implicitly + 1 */,
    CLIR = 7 /* ::android::hardware::radio::V1_0::SsServiceType.CLIP implicitly + 1 */,
    COLP = 8 /* ::android::hardware::radio::V1_0::SsServiceType.CLIR implicitly + 1 */,
    COLR = 9 /* ::android::hardware::radio::V1_0::SsServiceType.COLP implicitly + 1 */,
    WAIT = 10 /* ::android::hardware::radio::V1_0::SsServiceType.COLR implicitly + 1 */,
    BAOC = 11 /* ::android::hardware::radio::V1_0::SsServiceType.WAIT implicitly + 1 */,
    BAOIC = 12 /* ::android::hardware::radio::V1_0::SsServiceType.BAOC implicitly + 1 */,
    BAOIC_EXC_HOME = 13 /* ::android::hardware::radio::V1_0::SsServiceType.BAOIC implicitly + 1 */,
    BAIC = 14 /* ::android::hardware::radio::V1_0::SsServiceType.BAOIC_EXC_HOME implicitly + 1 */,
    BAIC_ROAMING = 15 /* ::android::hardware::radio::V1_0::SsServiceType.BAIC implicitly + 1 */,
    ALL_BARRING = 16 /* ::android::hardware::radio::V1_0::SsServiceType.BAIC_ROAMING implicitly + 1 */,
    OUTGOING_BARRING = 17 /* ::android::hardware::radio::V1_0::SsServiceType.ALL_BARRING implicitly + 1 */,
    INCOMING_BARRING = 18 /* ::android::hardware::radio::V1_0::SsServiceType.OUTGOING_BARRING implicitly + 1 */,
};

enum class SsRequestType : int32_t {
    ACTIVATION = 0,
    DEACTIVATION = 1 /* ::android::hardware::radio::V1_0::SsRequestType.ACTIVATION implicitly + 1 */,
    INTERROGATION = 2 /* ::android::hardware::radio::V1_0::SsRequestType.DEACTIVATION implicitly + 1 */,
    REGISTRATION = 3 /* ::android::hardware::radio::V1_0::SsRequestType.INTERROGATION implicitly + 1 */,
    ERASURE = 4 /* ::android::hardware::radio::V1_0::SsRequestType.REGISTRATION implicitly + 1 */,
};

enum class SsTeleserviceType : int32_t {
    ALL_TELE_AND_BEARER_SERVICES = 0,
    ALL_TELESEVICES = 1 /* ::android::hardware::radio::V1_0::SsTeleserviceType.ALL_TELE_AND_BEARER_SERVICES implicitly + 1 */,
    TELEPHONY = 2 /* ::android::hardware::radio::V1_0::SsTeleserviceType.ALL_TELESEVICES implicitly + 1 */,
    ALL_DATA_TELESERVICES = 3 /* ::android::hardware::radio::V1_0::SsTeleserviceType.TELEPHONY implicitly + 1 */,
    SMS_SERVICES = 4 /* ::android::hardware::radio::V1_0::SsTeleserviceType.ALL_DATA_TELESERVICES implicitly + 1 */,
    ALL_TELESERVICES_EXCEPT_SMS = 5 /* ::android::hardware::radio::V1_0::SsTeleserviceType.SMS_SERVICES implicitly + 1 */,
};

enum class SuppServiceClass : int32_t {
    NONE = 0,
    VOICE = 1 /* 1 << 0 */,
    DATA = 2 /* 1 << 1 */,
    FAX = 4 /* 1 << 2 */,
    SMS = 8 /* 1 << 3 */,
    DATA_SYNC = 16 /* 1 << 4 */,
    DATA_ASYNC = 32 /* 1 << 5 */,
    PACKET = 64 /* 1 << 6 */,
    PAD = 128 /* 1 << 7 */,
    MAX = 128 /* 1 << 7 */,
};

enum class ApnTypes : int32_t {
    NONE = 0,
    DEFAULT = 1 /* 1 << 0 */,
    MMS = 2 /* 1 << 1 */,
    SUPL = 4 /* 1 << 2 */,
    DUN = 8 /* 1 << 3 */,
    HIPRI = 16 /* 1 << 4 */,
    FOTA = 32 /* 1 << 5 */,
    IMS = 64 /* 1 << 6 */,
    CBS = 128 /* 1 << 7 */,
    IA = 256 /* 1 << 8 */,
    EMERGENCY = 512 /* 1 << 9 */,
    ALL = 1023 /* DEFAULT | MMS | SUPL | DUN | HIPRI | FOTA | IMS | CBS | IA | EMERGENCY */,
};

enum class IndicationFilter : int32_t {
    NONE = 0,
    SIGNAL_STRENGTH = 1 /* 1 << 0 */,
    FULL_NETWORK_STATE = 2 /* 1 << 1 */,
    DATA_CALL_DORMANCY_CHANGED = 4 /* 1 << 2 */,
    ALL = 7 /* SIGNAL_STRENGTH | FULL_NETWORK_STATE | DATA_CALL_DORMANCY_CHANGED */,
};

enum class MvnoType : int32_t {
    NONE = 0,
    IMSI = 1 /* ::android::hardware::radio::V1_0::MvnoType.NONE implicitly + 1 */,
    GID = 2 /* ::android::hardware::radio::V1_0::MvnoType.IMSI implicitly + 1 */,
    SPN = 3 /* ::android::hardware::radio::V1_0::MvnoType.GID implicitly + 1 */,
};

enum class DeviceStateType : int32_t {
    POWER_SAVE_MODE = 0,
    CHARGING_STATE = 1 /* ::android::hardware::radio::V1_0::DeviceStateType.POWER_SAVE_MODE implicitly + 1 */,
    LOW_DATA_EXPECTED = 2 /* ::android::hardware::radio::V1_0::DeviceStateType.CHARGING_STATE implicitly + 1 */,
};

enum class P2Constant : int32_t {
    NO_P2 = -1 /* -1 */,
};

struct RadioResponseInfo final {
    ::android::hardware::radio::V1_0::RadioResponseType type __attribute__ ((aligned(4)));
    int32_t serial __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::RadioError error __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::RadioResponseInfo, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::RadioResponseInfo, serial) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::RadioResponseInfo, error) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::RadioResponseInfo) == 12, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::RadioResponseInfo) == 4, "wrong alignment");

struct AppStatus final {
    ::android::hardware::radio::V1_0::AppType appType __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::AppState appState __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::PersoSubstate persoSubstate __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string aidPtr __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string appLabelPtr __attribute__ ((aligned(8)));
    int32_t pin1Replaced __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::PinState pin1 __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::PinState pin2 __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::AppStatus, appType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::AppStatus, appState) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::AppStatus, persoSubstate) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::AppStatus, aidPtr) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::AppStatus, appLabelPtr) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::AppStatus, pin1Replaced) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::AppStatus, pin1) == 52, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::AppStatus, pin2) == 56, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::AppStatus) == 64, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::AppStatus) == 8, "wrong alignment");

struct CardStatus final {
    ::android::hardware::radio::V1_0::CardState cardState __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::PinState universalPinState __attribute__ ((aligned(4)));
    int32_t gsmUmtsSubscriptionAppIndex __attribute__ ((aligned(4)));
    int32_t cdmaSubscriptionAppIndex __attribute__ ((aligned(4)));
    int32_t imsSubscriptionAppIndex __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::AppStatus> applications __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CardStatus, cardState) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CardStatus, universalPinState) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CardStatus, gsmUmtsSubscriptionAppIndex) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CardStatus, cdmaSubscriptionAppIndex) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CardStatus, imsSubscriptionAppIndex) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CardStatus, applications) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CardStatus) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CardStatus) == 8, "wrong alignment");

/**
 * User-to-User Signaling Information defined in 3GPP 23.087 v8.0
 */
struct UusInfo final {
    ::android::hardware::radio::V1_0::UusType uusType __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::UusDcs uusDcs __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string uusData __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::UusInfo, uusType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::UusInfo, uusDcs) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::UusInfo, uusData) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::UusInfo) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::UusInfo) == 8, "wrong alignment");

struct Call final {
    ::android::hardware::radio::V1_0::CallState state __attribute__ ((aligned(4)));
    int32_t index __attribute__ ((aligned(4)));
    int32_t toa __attribute__ ((aligned(4)));
    bool isMpty __attribute__ ((aligned(1)));
    bool isMT __attribute__ ((aligned(1)));
    uint8_t als __attribute__ ((aligned(1)));
    bool isVoice __attribute__ ((aligned(1)));
    bool isVoicePrivacy __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::CallPresentation numberPresentation __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::CallPresentation namePresentation __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::UusInfo> uusInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::Call, state) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, index) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, toa) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, isMpty) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, isMT) == 13, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, als) == 14, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, isVoice) == 15, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, isVoicePrivacy) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, number) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, numberPresentation) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, name) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, namePresentation) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Call, uusInfo) == 72, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::Call) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::Call) == 8, "wrong alignment");

struct Dial final {
    ::android::hardware::hidl_string address __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::Clir clir __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::UusInfo> uusInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::Dial, address) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Dial, clir) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Dial, uusInfo) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::Dial) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::Dial) == 8, "wrong alignment");

struct LastCallFailCauseInfo final {
    ::android::hardware::radio::V1_0::LastCallFailCause causeCode __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string vendorCause __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::LastCallFailCauseInfo, causeCode) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::LastCallFailCauseInfo, vendorCause) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::LastCallFailCauseInfo) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::LastCallFailCauseInfo) == 8, "wrong alignment");

struct GsmSignalStrength final {
    uint32_t signalStrength __attribute__ ((aligned(4)));
    uint32_t bitErrorRate __attribute__ ((aligned(4)));
    int32_t timingAdvance __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::GsmSignalStrength, signalStrength) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::GsmSignalStrength, bitErrorRate) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::GsmSignalStrength, timingAdvance) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::GsmSignalStrength) == 12, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::GsmSignalStrength) == 4, "wrong alignment");

struct WcdmaSignalStrength final {
    int32_t signalStrength __attribute__ ((aligned(4)));
    int32_t bitErrorRate __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::WcdmaSignalStrength, signalStrength) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::WcdmaSignalStrength, bitErrorRate) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::WcdmaSignalStrength) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::WcdmaSignalStrength) == 4, "wrong alignment");

struct CdmaSignalStrength final {
    uint32_t dbm __attribute__ ((aligned(4)));
    uint32_t ecio __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSignalStrength, dbm) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSignalStrength, ecio) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaSignalStrength) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaSignalStrength) == 4, "wrong alignment");

struct EvdoSignalStrength final {
    uint32_t dbm __attribute__ ((aligned(4)));
    uint32_t ecio __attribute__ ((aligned(4)));
    uint32_t signalNoiseRatio __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::EvdoSignalStrength, dbm) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::EvdoSignalStrength, ecio) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::EvdoSignalStrength, signalNoiseRatio) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::EvdoSignalStrength) == 12, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::EvdoSignalStrength) == 4, "wrong alignment");

struct LteSignalStrength final {
    uint32_t signalStrength __attribute__ ((aligned(4)));
    uint32_t rsrp __attribute__ ((aligned(4)));
    uint32_t rsrq __attribute__ ((aligned(4)));
    int32_t rssnr __attribute__ ((aligned(4)));
    uint32_t cqi __attribute__ ((aligned(4)));
    uint32_t timingAdvance __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::LteSignalStrength, signalStrength) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::LteSignalStrength, rsrp) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::LteSignalStrength, rsrq) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::LteSignalStrength, rssnr) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::LteSignalStrength, cqi) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::LteSignalStrength, timingAdvance) == 20, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::LteSignalStrength) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::LteSignalStrength) == 4, "wrong alignment");

struct TdScdmaSignalStrength final {
    uint32_t rscp __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::TdScdmaSignalStrength, rscp) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::TdScdmaSignalStrength) == 4, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::TdScdmaSignalStrength) == 4, "wrong alignment");

struct SignalStrength final {
    /**
     * If GSM measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::GsmSignalStrength gw __attribute__ ((aligned(4)));
    /**
     * If CDMA measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::CdmaSignalStrength cdma __attribute__ ((aligned(4)));
    /**
     * If EvDO measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::EvdoSignalStrength evdo __attribute__ ((aligned(4)));
    /**
     * If LTE measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::LteSignalStrength lte __attribute__ ((aligned(4)));
    /**
     * If TD-SCDMA measurements are provided, this structure must contain valid measurements;
     * otherwise all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::TdScdmaSignalStrength tdScdma __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::SignalStrength, gw) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SignalStrength, cdma) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SignalStrength, evdo) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SignalStrength, lte) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SignalStrength, tdScdma) == 56, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::SignalStrength) == 60, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::SignalStrength) == 4, "wrong alignment");

struct SendSmsResult final {
    int32_t messageRef __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string ackPDU __attribute__ ((aligned(8)));
    int32_t errorCode __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::SendSmsResult, messageRef) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SendSmsResult, ackPDU) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SendSmsResult, errorCode) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::SendSmsResult) == 32, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::SendSmsResult) == 8, "wrong alignment");

struct SetupDataCallResult final {
    ::android::hardware::radio::V1_0::DataCallFailCause status __attribute__ ((aligned(4)));
    int32_t suggestedRetryTime __attribute__ ((aligned(4)));
    int32_t cid __attribute__ ((aligned(4)));
    int32_t active __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string type __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string ifname __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string addresses __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string dnses __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string gateways __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string pcscf __attribute__ ((aligned(8)));
    int32_t mtu __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::SetupDataCallResult, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SetupDataCallResult, suggestedRetryTime) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SetupDataCallResult, cid) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SetupDataCallResult, active) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SetupDataCallResult, type) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SetupDataCallResult, ifname) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SetupDataCallResult, addresses) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SetupDataCallResult, dnses) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SetupDataCallResult, gateways) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SetupDataCallResult, pcscf) == 96, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SetupDataCallResult, mtu) == 112, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::SetupDataCallResult) == 120, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::SetupDataCallResult) == 8, "wrong alignment");

struct IccIo final {
    int32_t command __attribute__ ((aligned(4)));
    int32_t fileId __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string path __attribute__ ((aligned(8)));
    int32_t p1 __attribute__ ((aligned(4)));
    int32_t p2 __attribute__ ((aligned(4)));
    int32_t p3 __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string data __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string pin2 __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string aid __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::IccIo, command) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::IccIo, fileId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::IccIo, path) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::IccIo, p1) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::IccIo, p2) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::IccIo, p3) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::IccIo, data) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::IccIo, pin2) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::IccIo, aid) == 72, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::IccIo) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::IccIo) == 8, "wrong alignment");

struct IccIoResult final {
    int32_t sw1 __attribute__ ((aligned(4)));
    int32_t sw2 __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string simResponse __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::IccIoResult, sw1) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::IccIoResult, sw2) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::IccIoResult, simResponse) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::IccIoResult) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::IccIoResult) == 8, "wrong alignment");

struct CallForwardInfo final {
    ::android::hardware::radio::V1_0::CallForwardInfoStatus status __attribute__ ((aligned(4)));
    int32_t reason __attribute__ ((aligned(4)));
    int32_t serviceClass __attribute__ ((aligned(4)));
    int32_t toa __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    int32_t timeSeconds __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CallForwardInfo, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CallForwardInfo, reason) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CallForwardInfo, serviceClass) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CallForwardInfo, toa) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CallForwardInfo, number) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CallForwardInfo, timeSeconds) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CallForwardInfo) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CallForwardInfo) == 8, "wrong alignment");

struct OperatorInfo final {
    ::android::hardware::hidl_string alphaLong __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string alphaShort __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string operatorNumeric __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::OperatorStatus status __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::OperatorInfo, alphaLong) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::OperatorInfo, alphaShort) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::OperatorInfo, operatorNumeric) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::OperatorInfo, status) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::OperatorInfo) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::OperatorInfo) == 8, "wrong alignment");

struct SmsWriteArgs final {
    ::android::hardware::radio::V1_0::SmsWriteArgsStatus status __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string pdu __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string smsc __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::SmsWriteArgs, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SmsWriteArgs, pdu) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SmsWriteArgs, smsc) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::SmsWriteArgs) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::SmsWriteArgs) == 8, "wrong alignment");

struct CdmaSmsAddress final {
    ::android::hardware::radio::V1_0::CdmaSmsDigitMode digitMode __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::CdmaSmsNumberMode numberMode __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::CdmaSmsNumberType numberType __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::CdmaSmsNumberPlan numberPlan __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> digits __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsAddress, digitMode) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsAddress, numberMode) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsAddress, numberType) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsAddress, numberPlan) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsAddress, digits) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaSmsAddress) == 32, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaSmsAddress) == 8, "wrong alignment");

struct CdmaSmsSubaddress final {
    ::android::hardware::radio::V1_0::CdmaSmsSubaddressType subaddressType __attribute__ ((aligned(4)));
    bool odd __attribute__ ((aligned(1)));
    ::android::hardware::hidl_vec<uint8_t> digits __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsSubaddress, subaddressType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsSubaddress, odd) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsSubaddress, digits) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaSmsSubaddress) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaSmsSubaddress) == 8, "wrong alignment");

struct CdmaSmsMessage final {
    int32_t teleserviceId __attribute__ ((aligned(4)));
    bool isServicePresent __attribute__ ((aligned(1)));
    int32_t serviceCategory __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::CdmaSmsAddress address __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::CdmaSmsSubaddress subAddress __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<uint8_t> bearerData __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsMessage, teleserviceId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsMessage, isServicePresent) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsMessage, serviceCategory) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsMessage, address) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsMessage, subAddress) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsMessage, bearerData) == 72, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaSmsMessage) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaSmsMessage) == 8, "wrong alignment");

struct CdmaSmsAck final {
    ::android::hardware::radio::V1_0::CdmaSmsErrorClass errorClass __attribute__ ((aligned(4)));
    int32_t smsCauseCode __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsAck, errorClass) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsAck, smsCauseCode) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaSmsAck) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaSmsAck) == 4, "wrong alignment");

struct CdmaBroadcastSmsConfigInfo final {
    int32_t serviceCategory __attribute__ ((aligned(4)));
    int32_t language __attribute__ ((aligned(4)));
    bool selected __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaBroadcastSmsConfigInfo, serviceCategory) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaBroadcastSmsConfigInfo, language) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaBroadcastSmsConfigInfo, selected) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaBroadcastSmsConfigInfo) == 12, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaBroadcastSmsConfigInfo) == 4, "wrong alignment");

struct CdmaSmsWriteArgs final {
    ::android::hardware::radio::V1_0::CdmaSmsWriteArgsStatus status __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::CdmaSmsMessage message __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsWriteArgs, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSmsWriteArgs, message) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaSmsWriteArgs) == 96, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaSmsWriteArgs) == 8, "wrong alignment");

/**
 * Which types of Cell Broadcast Message (CBM) are to be received by the ME
 *
 * fromServiceID - uToServiceID defines a range of CBM message identifiers
 * whose value is 0x0000 - 0xFFFF as defined in TS 23.041 9.4.1.2.2 for GMS
 * and 9.4.4.2.2 for UMTS. All other values must be treated as empty
 * CBM message ID.
 *
 * fromCodeScheme - uToCodeScheme defines a range of CBM data coding schemes
 * whose value is 0x00 - 0xFF as defined in TS 23.041 9.4.1.2.3 for GMS
 * and 9.4.4.2.3 for UMTS.
 * All other values must be treated as empty CBM data coding scheme.
 *
 * selected false means message types specified in <fromServiceId, toServiceId>
 * and <fromCodeScheme, toCodeScheme>are not accepted, while true means accepted.
 */
struct GsmBroadcastSmsConfigInfo final {
    int32_t fromServiceId __attribute__ ((aligned(4)));
    int32_t toServiceId __attribute__ ((aligned(4)));
    int32_t fromCodeScheme __attribute__ ((aligned(4)));
    int32_t toCodeScheme __attribute__ ((aligned(4)));
    bool selected __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::GsmBroadcastSmsConfigInfo, fromServiceId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::GsmBroadcastSmsConfigInfo, toServiceId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::GsmBroadcastSmsConfigInfo, fromCodeScheme) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::GsmBroadcastSmsConfigInfo, toCodeScheme) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::GsmBroadcastSmsConfigInfo, selected) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::GsmBroadcastSmsConfigInfo) == 20, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::GsmBroadcastSmsConfigInfo) == 4, "wrong alignment");

struct CellIdentityGsm final {
    ::android::hardware::hidl_string mcc __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string mnc __attribute__ ((aligned(8)));
    int32_t lac __attribute__ ((aligned(4)));
    int32_t cid __attribute__ ((aligned(4)));
    int32_t arfcn __attribute__ ((aligned(4)));
    uint8_t bsic __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityGsm, mcc) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityGsm, mnc) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityGsm, lac) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityGsm, cid) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityGsm, arfcn) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityGsm, bsic) == 44, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellIdentityGsm) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellIdentityGsm) == 8, "wrong alignment");

struct CellIdentityWcdma final {
    ::android::hardware::hidl_string mcc __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string mnc __attribute__ ((aligned(8)));
    int32_t lac __attribute__ ((aligned(4)));
    int32_t cid __attribute__ ((aligned(4)));
    int32_t psc __attribute__ ((aligned(4)));
    int32_t uarfcn __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityWcdma, mcc) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityWcdma, mnc) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityWcdma, lac) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityWcdma, cid) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityWcdma, psc) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityWcdma, uarfcn) == 44, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellIdentityWcdma) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellIdentityWcdma) == 8, "wrong alignment");

struct CellIdentityCdma final {
    int32_t networkId __attribute__ ((aligned(4)));
    int32_t systemId __attribute__ ((aligned(4)));
    int32_t baseStationId __attribute__ ((aligned(4)));
    int32_t longitude __attribute__ ((aligned(4)));
    int32_t latitude __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityCdma, networkId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityCdma, systemId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityCdma, baseStationId) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityCdma, longitude) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityCdma, latitude) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellIdentityCdma) == 20, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellIdentityCdma) == 4, "wrong alignment");

struct CellIdentityLte final {
    ::android::hardware::hidl_string mcc __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string mnc __attribute__ ((aligned(8)));
    int32_t ci __attribute__ ((aligned(4)));
    int32_t pci __attribute__ ((aligned(4)));
    int32_t tac __attribute__ ((aligned(4)));
    int32_t earfcn __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityLte, mcc) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityLte, mnc) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityLte, ci) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityLte, pci) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityLte, tac) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityLte, earfcn) == 44, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellIdentityLte) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellIdentityLte) == 8, "wrong alignment");

struct CellIdentityTdscdma final {
    ::android::hardware::hidl_string mcc __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string mnc __attribute__ ((aligned(8)));
    int32_t lac __attribute__ ((aligned(4)));
    int32_t cid __attribute__ ((aligned(4)));
    int32_t cpid __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityTdscdma, mcc) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityTdscdma, mnc) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityTdscdma, lac) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityTdscdma, cid) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentityTdscdma, cpid) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellIdentityTdscdma) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellIdentityTdscdma) == 8, "wrong alignment");

struct CellInfoGsm final {
    ::android::hardware::radio::V1_0::CellIdentityGsm cellIdentityGsm __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::GsmSignalStrength signalStrengthGsm __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellInfoGsm, cellIdentityGsm) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfoGsm, signalStrengthGsm) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellInfoGsm) == 64, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellInfoGsm) == 8, "wrong alignment");

struct CellInfoWcdma final {
    ::android::hardware::radio::V1_0::CellIdentityWcdma cellIdentityWcdma __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::WcdmaSignalStrength signalStrengthWcdma __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellInfoWcdma, cellIdentityWcdma) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfoWcdma, signalStrengthWcdma) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellInfoWcdma) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellInfoWcdma) == 8, "wrong alignment");

struct CellInfoCdma final {
    ::android::hardware::radio::V1_0::CellIdentityCdma cellIdentityCdma __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::CdmaSignalStrength signalStrengthCdma __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::EvdoSignalStrength signalStrengthEvdo __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellInfoCdma, cellIdentityCdma) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfoCdma, signalStrengthCdma) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfoCdma, signalStrengthEvdo) == 28, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellInfoCdma) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellInfoCdma) == 4, "wrong alignment");

struct CellInfoLte final {
    ::android::hardware::radio::V1_0::CellIdentityLte cellIdentityLte __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::LteSignalStrength signalStrengthLte __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellInfoLte, cellIdentityLte) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfoLte, signalStrengthLte) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellInfoLte) == 72, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellInfoLte) == 8, "wrong alignment");

struct CellInfoTdscdma final {
    ::android::hardware::radio::V1_0::CellIdentityTdscdma cellIdentityTdscdma __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::TdScdmaSignalStrength signalStrengthTdscdma __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellInfoTdscdma, cellIdentityTdscdma) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfoTdscdma, signalStrengthTdscdma) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellInfoTdscdma) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellInfoTdscdma) == 8, "wrong alignment");

struct CellInfo final {
    ::android::hardware::radio::V1_0::CellInfoType cellInfoType __attribute__ ((aligned(4)));
    bool registered __attribute__ ((aligned(1)));
    ::android::hardware::radio::V1_0::TimeStampType timeStampType __attribute__ ((aligned(4)));
    uint64_t timeStamp __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CellInfoGsm> gsm __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CellInfoCdma> cdma __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CellInfoLte> lte __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CellInfoWcdma> wcdma __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CellInfoTdscdma> tdscdma __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellInfo, cellInfoType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfo, registered) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfo, timeStampType) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfo, timeStamp) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfo, gsm) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfo, cdma) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfo, lte) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfo, wcdma) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellInfo, tdscdma) == 88, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellInfo) == 104, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellInfo) == 8, "wrong alignment");

struct CellIdentity final {
    ::android::hardware::radio::V1_0::CellInfoType cellInfoType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CellIdentityGsm> cellIdentityGsm __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CellIdentityWcdma> cellIdentityWcdma __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CellIdentityCdma> cellIdentityCdma __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CellIdentityLte> cellIdentityLte __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CellIdentityTdscdma> cellIdentityTdscdma __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentity, cellInfoType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentity, cellIdentityGsm) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentity, cellIdentityWcdma) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentity, cellIdentityCdma) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentity, cellIdentityLte) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CellIdentity, cellIdentityTdscdma) == 72, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CellIdentity) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CellIdentity) == 8, "wrong alignment");

struct VoiceRegStateResult final {
    ::android::hardware::radio::V1_0::RegState regState __attribute__ ((aligned(4)));
    int32_t rat __attribute__ ((aligned(4)));
    bool cssSupported __attribute__ ((aligned(1)));
    int32_t roamingIndicator __attribute__ ((aligned(4)));
    int32_t systemIsInPrl __attribute__ ((aligned(4)));
    int32_t defaultRoamingIndicator __attribute__ ((aligned(4)));
    int32_t reasonForDenial __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::CellIdentity cellIdentity __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::VoiceRegStateResult, regState) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::VoiceRegStateResult, rat) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::VoiceRegStateResult, cssSupported) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::VoiceRegStateResult, roamingIndicator) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::VoiceRegStateResult, systemIsInPrl) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::VoiceRegStateResult, defaultRoamingIndicator) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::VoiceRegStateResult, reasonForDenial) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::VoiceRegStateResult, cellIdentity) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::VoiceRegStateResult) == 120, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::VoiceRegStateResult) == 8, "wrong alignment");

struct DataRegStateResult final {
    ::android::hardware::radio::V1_0::RegState regState __attribute__ ((aligned(4)));
    int32_t rat __attribute__ ((aligned(4)));
    int32_t reasonDataDenied __attribute__ ((aligned(4)));
    int32_t maxDataCalls __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::CellIdentity cellIdentity __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::DataRegStateResult, regState) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataRegStateResult, rat) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataRegStateResult, reasonDataDenied) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataRegStateResult, maxDataCalls) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataRegStateResult, cellIdentity) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::DataRegStateResult) == 104, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::DataRegStateResult) == 8, "wrong alignment");

struct GsmSmsMessage final {
    ::android::hardware::hidl_string smscPdu __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string pdu __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::GsmSmsMessage, smscPdu) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::GsmSmsMessage, pdu) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::GsmSmsMessage) == 32, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::GsmSmsMessage) == 8, "wrong alignment");

struct ImsSmsMessage final {
    ::android::hardware::radio::V1_0::RadioTechnologyFamily tech __attribute__ ((aligned(4)));
    bool retry __attribute__ ((aligned(1)));
    int32_t messageRef __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CdmaSmsMessage> cdmaMessage __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::GsmSmsMessage> gsmMessage __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::ImsSmsMessage, tech) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::ImsSmsMessage, retry) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::ImsSmsMessage, messageRef) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::ImsSmsMessage, cdmaMessage) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::ImsSmsMessage, gsmMessage) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::ImsSmsMessage) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::ImsSmsMessage) == 8, "wrong alignment");

struct SimApdu final {
    int32_t sessionId __attribute__ ((aligned(4)));
    int32_t cla __attribute__ ((aligned(4)));
    int32_t instruction __attribute__ ((aligned(4)));
    int32_t p1 __attribute__ ((aligned(4)));
    int32_t p2 __attribute__ ((aligned(4)));
    int32_t p3 __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string data __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::SimApdu, sessionId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SimApdu, cla) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SimApdu, instruction) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SimApdu, p1) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SimApdu, p2) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SimApdu, p3) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SimApdu, data) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::SimApdu) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::SimApdu) == 8, "wrong alignment");

struct NvWriteItem final {
    ::android::hardware::radio::V1_0::NvItem itemId __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string value __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::NvWriteItem, itemId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::NvWriteItem, value) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::NvWriteItem) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::NvWriteItem) == 8, "wrong alignment");

struct SelectUiccSub final {
    int32_t slot __attribute__ ((aligned(4)));
    int32_t appIndex __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::SubscriptionType subType __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::UiccSubActStatus actStatus __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::SelectUiccSub, slot) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SelectUiccSub, appIndex) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SelectUiccSub, subType) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SelectUiccSub, actStatus) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::SelectUiccSub) == 16, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::SelectUiccSub) == 4, "wrong alignment");

struct HardwareConfigModem final {
    int32_t rilModel __attribute__ ((aligned(4)));
    uint32_t rat __attribute__ ((aligned(4)));
    int32_t maxVoice __attribute__ ((aligned(4)));
    int32_t maxData __attribute__ ((aligned(4)));
    int32_t maxStandby __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::HardwareConfigModem, rilModel) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::HardwareConfigModem, rat) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::HardwareConfigModem, maxVoice) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::HardwareConfigModem, maxData) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::HardwareConfigModem, maxStandby) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::HardwareConfigModem) == 20, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::HardwareConfigModem) == 4, "wrong alignment");

struct HardwareConfigSim final {
    ::android::hardware::hidl_string modemUuid __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::HardwareConfigSim, modemUuid) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::HardwareConfigSim) == 16, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::HardwareConfigSim) == 8, "wrong alignment");

struct HardwareConfig final {
    ::android::hardware::radio::V1_0::HardwareConfigType type __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string uuid __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::HardwareConfigState state __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::HardwareConfigModem> modem __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::HardwareConfigSim> sim __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::HardwareConfig, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::HardwareConfig, uuid) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::HardwareConfig, state) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::HardwareConfig, modem) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::HardwareConfig, sim) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::HardwareConfig) == 64, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::HardwareConfig) == 8, "wrong alignment");

struct DataProfileInfo final {
    ::android::hardware::radio::V1_0::DataProfileId profileId __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string apn __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string protocol __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string roamingProtocol __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::ApnAuthType authType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string user __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string password __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::DataProfileInfoType type __attribute__ ((aligned(4)));
    int32_t maxConnsTime __attribute__ ((aligned(4)));
    int32_t maxConns __attribute__ ((aligned(4)));
    int32_t waitTime __attribute__ ((aligned(4)));
    bool enabled __attribute__ ((aligned(1)));
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_0::ApnTypes> supportedApnTypesBitmap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_0::RadioAccessFamily> bearerBitmap __attribute__ ((aligned(4)));
    int32_t mtu __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::MvnoType mvnoType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string mvnoMatchData __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, profileId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, apn) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, protocol) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, roamingProtocol) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, authType) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, user) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, password) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, type) == 96, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, maxConnsTime) == 100, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, maxConns) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, waitTime) == 108, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, enabled) == 112, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, supportedApnTypesBitmap) == 116, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, bearerBitmap) == 120, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, mtu) == 124, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, mvnoType) == 128, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::DataProfileInfo, mvnoMatchData) == 136, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::DataProfileInfo) == 152, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::DataProfileInfo) == 8, "wrong alignment");

struct RadioCapability final {
    int32_t session __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::RadioCapabilityPhase phase __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_0::RadioAccessFamily> raf __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string logicalModemUuid __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::RadioCapabilityStatus status __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::RadioCapability, session) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::RadioCapability, phase) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::RadioCapability, raf) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::RadioCapability, logicalModemUuid) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::RadioCapability, status) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::RadioCapability) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::RadioCapability) == 8, "wrong alignment");

struct LceStatusInfo final {
    ::android::hardware::radio::V1_0::LceStatus lceStatus __attribute__ ((aligned(4)));
    uint8_t actualIntervalMs __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::LceStatusInfo, lceStatus) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::LceStatusInfo, actualIntervalMs) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::LceStatusInfo) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::LceStatusInfo) == 4, "wrong alignment");

struct LceDataInfo final {
    uint32_t lastHopCapacityKbps __attribute__ ((aligned(4)));
    uint8_t confidenceLevel __attribute__ ((aligned(1)));
    bool lceSuspended __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::LceDataInfo, lastHopCapacityKbps) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::LceDataInfo, confidenceLevel) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::LceDataInfo, lceSuspended) == 5, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::LceDataInfo) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::LceDataInfo) == 4, "wrong alignment");

struct ActivityStatsInfo final {
    uint32_t sleepModeTimeMs __attribute__ ((aligned(4)));
    uint32_t idleModeTimeMs __attribute__ ((aligned(4)));
    ::android::hardware::hidl_array<uint32_t, 5 /* RadioConst:NUM_TX_POWER_LEVELS */> txmModetimeMs __attribute__ ((aligned(4)));
    uint32_t rxModeTimeMs __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::ActivityStatsInfo, sleepModeTimeMs) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::ActivityStatsInfo, idleModeTimeMs) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::ActivityStatsInfo, txmModetimeMs) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::ActivityStatsInfo, rxModeTimeMs) == 28, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::ActivityStatsInfo) == 32, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::ActivityStatsInfo) == 4, "wrong alignment");

struct Carrier final {
    ::android::hardware::hidl_string mcc __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string mnc __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::CarrierMatchType matchType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string matchData __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::Carrier, mcc) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Carrier, mnc) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Carrier, matchType) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::Carrier, matchData) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::Carrier) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::Carrier) == 8, "wrong alignment");

struct CarrierRestrictions final {
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::Carrier> allowedCarriers __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::Carrier> excludedCarriers __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CarrierRestrictions, allowedCarriers) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CarrierRestrictions, excludedCarriers) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CarrierRestrictions) == 32, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CarrierRestrictions) == 8, "wrong alignment");

struct SuppSvcNotification final {
    bool isMT __attribute__ ((aligned(1)));
    int32_t code __attribute__ ((aligned(4)));
    int32_t index __attribute__ ((aligned(4)));
    int32_t type __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::SuppSvcNotification, isMT) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SuppSvcNotification, code) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SuppSvcNotification, index) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SuppSvcNotification, type) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SuppSvcNotification, number) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::SuppSvcNotification) == 32, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::SuppSvcNotification) == 8, "wrong alignment");

struct SimRefreshResult final {
    ::android::hardware::radio::V1_0::SimRefreshType type __attribute__ ((aligned(4)));
    int32_t efId __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string aid __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::SimRefreshResult, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SimRefreshResult, efId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::SimRefreshResult, aid) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::SimRefreshResult) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::SimRefreshResult) == 8, "wrong alignment");

/**
 * CDMA Signal Information Record as defined in C.S0005 section 3.7.5.5
 */
struct CdmaSignalInfoRecord final {
    bool isPresent __attribute__ ((aligned(1)));
    int8_t signalType __attribute__ ((aligned(1)));
    int8_t alertPitch __attribute__ ((aligned(1)));
    int8_t signal __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSignalInfoRecord, isPresent) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSignalInfoRecord, signalType) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSignalInfoRecord, alertPitch) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaSignalInfoRecord, signal) == 3, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaSignalInfoRecord) == 4, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaSignalInfoRecord) == 1, "wrong alignment");

struct CdmaCallWaiting final {
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::CdmaCallWaitingNumberPresentation numberPresentation __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::CdmaSignalInfoRecord signalInfoRecord __attribute__ ((aligned(1)));
    ::android::hardware::radio::V1_0::CdmaCallWaitingNumberType numberType __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::CdmaCallWaitingNumberPlan numberPlan __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaCallWaiting, number) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaCallWaiting, numberPresentation) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaCallWaiting, name) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaCallWaiting, signalInfoRecord) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaCallWaiting, numberType) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaCallWaiting, numberPlan) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaCallWaiting) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaCallWaiting) == 8, "wrong alignment");

/**
 * Display Info Rec as defined in C.S0005 section 3.7.5.1
 * Extended Display Info Rec as defined in C.S0005 section 3.7.5.16
 * Note: the Extended Display info rec contains multiple records of the
 * form: display_tag, display_len, and display_len occurrences of the
 * char field if the display_tag is not 10000000 or 10000001.
 * To save space, the records are stored consecutively in a byte buffer.
 * The display_tag, display_len and chari fields are all 1 byte.
 */
struct CdmaDisplayInfoRecord final {
    ::android::hardware::hidl_string alphaBuf __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaDisplayInfoRecord, alphaBuf) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaDisplayInfoRecord) == 16, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaDisplayInfoRecord) == 8, "wrong alignment");

/**
 * Called Party Number Info Rec as defined in C.S0005 section 3.7.5.2
 * Calling Party Number Info Rec as defined in C.S0005 section 3.7.5.3
 * Connected Number Info Rec as defined in C.S0005 section 3.7.5.4
 */
struct CdmaNumberInfoRecord final {
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    uint8_t numberType __attribute__ ((aligned(1)));
    uint8_t numberPlan __attribute__ ((aligned(1)));
    uint8_t pi __attribute__ ((aligned(1)));
    uint8_t si __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaNumberInfoRecord, number) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaNumberInfoRecord, numberType) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaNumberInfoRecord, numberPlan) == 17, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaNumberInfoRecord, pi) == 18, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaNumberInfoRecord, si) == 19, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaNumberInfoRecord) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaNumberInfoRecord) == 8, "wrong alignment");

struct CdmaRedirectingNumberInfoRecord final {
    ::android::hardware::radio::V1_0::CdmaNumberInfoRecord redirectingNumber __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::CdmaRedirectingReason redirectingReason __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaRedirectingNumberInfoRecord, redirectingNumber) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaRedirectingNumberInfoRecord, redirectingReason) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaRedirectingNumberInfoRecord) == 32, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaRedirectingNumberInfoRecord) == 8, "wrong alignment");

/**
 * Line Control Information Record as defined in C.S0005 section 3.7.5.15
 */
struct CdmaLineControlInfoRecord final {
    uint8_t lineCtrlPolarityIncluded __attribute__ ((aligned(1)));
    uint8_t lineCtrlToggle __attribute__ ((aligned(1)));
    uint8_t lineCtrlReverse __attribute__ ((aligned(1)));
    uint8_t lineCtrlPowerDenial __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaLineControlInfoRecord, lineCtrlPolarityIncluded) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaLineControlInfoRecord, lineCtrlToggle) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaLineControlInfoRecord, lineCtrlReverse) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaLineControlInfoRecord, lineCtrlPowerDenial) == 3, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaLineControlInfoRecord) == 4, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaLineControlInfoRecord) == 1, "wrong alignment");

/**
 * T53 CLIR Information Record
 */
struct CdmaT53ClirInfoRecord final {
    uint8_t cause __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaT53ClirInfoRecord, cause) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaT53ClirInfoRecord) == 1, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaT53ClirInfoRecord) == 1, "wrong alignment");

/**
 * T53 Audio Control Information Record
 */
struct CdmaT53AudioControlInfoRecord final {
    uint8_t upLink __attribute__ ((aligned(1)));
    uint8_t downLink __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaT53AudioControlInfoRecord, upLink) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaT53AudioControlInfoRecord, downLink) == 1, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaT53AudioControlInfoRecord) == 2, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaT53AudioControlInfoRecord) == 1, "wrong alignment");

struct CdmaInformationRecord final {
    ::android::hardware::radio::V1_0::CdmaInfoRecName name __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CdmaDisplayInfoRecord> display __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CdmaNumberInfoRecord> number __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CdmaSignalInfoRecord> signal __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CdmaRedirectingNumberInfoRecord> redir __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CdmaLineControlInfoRecord> lineCtrl __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CdmaT53ClirInfoRecord> clir __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CdmaT53AudioControlInfoRecord> audioCtrl __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaInformationRecord, name) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaInformationRecord, display) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaInformationRecord, number) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaInformationRecord, signal) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaInformationRecord, redir) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaInformationRecord, lineCtrl) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaInformationRecord, clir) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::CdmaInformationRecord, audioCtrl) == 104, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaInformationRecord) == 120, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaInformationRecord) == 8, "wrong alignment");

struct CdmaInformationRecords final {
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CdmaInformationRecord> infoRec __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CdmaInformationRecords, infoRec) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CdmaInformationRecords) == 16, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CdmaInformationRecords) == 8, "wrong alignment");

struct CfData final {
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CallForwardInfo> cfInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::CfData, cfInfo) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::CfData) == 16, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::CfData) == 8, "wrong alignment");

struct SsInfoData final {
    ::android::hardware::hidl_vec<int32_t> ssInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::SsInfoData, ssInfo) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::SsInfoData) == 16, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::SsInfoData) == 8, "wrong alignment");

struct StkCcUnsolSsResult final {
    ::android::hardware::radio::V1_0::SsServiceType serviceType __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::SsRequestType requestType __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::SsTeleserviceType teleserviceType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_0::SuppServiceClass> serviceClass __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::RadioError result __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::SsInfoData> ssInfo __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_0::CfData> cfData __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::StkCcUnsolSsResult, serviceType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::StkCcUnsolSsResult, requestType) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::StkCcUnsolSsResult, teleserviceType) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::StkCcUnsolSsResult, serviceClass) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::StkCcUnsolSsResult, result) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::StkCcUnsolSsResult, ssInfo) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::StkCcUnsolSsResult, cfData) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::StkCcUnsolSsResult) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::StkCcUnsolSsResult) == 8, "wrong alignment");

struct PcoDataInfo final {
    int32_t cid __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string bearerProto __attribute__ ((aligned(8)));
    int32_t pcoId __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> contents __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_0::PcoDataInfo, cid) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::PcoDataInfo, bearerProto) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::PcoDataInfo, pcoId) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_0::PcoDataInfo, contents) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_0::PcoDataInfo) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_0::PcoDataInfo) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::radio::V1_0::RadioConst o);
static inline void PrintTo(::android::hardware::radio::V1_0::RadioConst o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::radio::V1_0::RadioConst lhs, const ::android::hardware::radio::V1_0::RadioConst rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::radio::V1_0::RadioConst rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::radio::V1_0::RadioConst lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
