{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_PKc",
   "name" : "const char *[1]",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIA1_PKc",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA76_PKc",
   "name" : "const char *[76]",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIA76_PKc",
   "size" : 608,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA8_j",
   "name" : "unsigned int [8]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA8_j",
   "size" : 32,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "linker_set_key" : "_ZTIA_f",
   "name" : "float []",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIA_f",
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIDs",
   "name" : "char16_t",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIDs",
   "size" : 2
  },
  {
   "alignment" : 1,
   "is_integral" : true,

   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVb",
   "name" : "volatile bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIVb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Thread.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI10_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI10_jintArray",
   "self_type" : "_ZTI10_jintArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jbyteArray",
   "self_type" : "_ZTI11_jbyteArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jcharArray",
   "self_type" : "_ZTI11_jcharArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jlongArray",
   "self_type" : "_ZTI11_jlongArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI11_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jthrowable",
   "self_type" : "_ZTI11_jthrowable",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12JavaVMOption",
   "name" : "JavaVMOption",
   "referenced_type" : "_ZTI12JavaVMOption",
   "self_type" : "_ZTI12JavaVMOption",
   "size" : 16,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12_jfloatArray",
   "self_type" : "_ZTI12_jfloatArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12_jshortArray",
   "self_type" : "_ZTI12_jshortArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13_jdoubleArray",
   "self_type" : "_ZTI13_jdoubleArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13_jobjectArray",
   "self_type" : "_ZTI13_jobjectArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "_ZTI13android_ycbcr",
   "self_type" : "_ZTI13android_ycbcr",
   "size" : 80,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12JavaVMOption"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI14JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "referenced_type" : "_ZTI14JavaVMInitArgs",
   "self_type" : "_ZTI14JavaVMInitArgs",
   "size" : 24,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI14_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI14_jbooleanArray",
   "self_type" : "_ZTI14_jbooleanArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "signature",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI15JNINativeMethod",
   "name" : "JNINativeMethod",
   "referenced_type" : "_ZTI15JNINativeMethod",
   "self_type" : "_ZTI15JNINativeMethod",
   "size" : 24,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "group",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI16JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "referenced_type" : "_ZTI16JavaVMAttachArgs",
   "self_type" : "_ZTI16JavaVMAttachArgs",
   "size" : 24,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "_ZTI16android_xy_color",
   "self_type" : "_ZTI16android_xy_color",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFiP7_JavaVMPPviE"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    }
   ],
   "linker_set_key" : "_ZTI18JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "referenced_type" : "_ZTI18JNIInvokeInterface",
   "self_type" : "_ZTI18JNIInvokeInterface",
   "size" : 64,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP7_JNIEnvE"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcP8_jobjectPKaiE"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcE"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDhE"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvS0_E"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassS2_E"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP11_jthrowableE"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPKcE"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFP11_jthrowableP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFvP7_JNIEnvPKcE"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectS2_E"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassE"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDzE"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 2496,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 2816,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 2880,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 2944,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 3008,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 3200,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 3392,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 3456,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 3520,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 3584,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 3968,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 4352,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 4416,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 4480,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 4800,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 4864,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 4928,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 4992,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 5056,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 5120,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 5184,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 5248,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 5312,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 5376,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 5440,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 5504,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 5760,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 5824,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 5888,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 5952,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 6016,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 6080,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P9_jfieldIDE"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 6144,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 6208,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 6272,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 6336,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 6400,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 6464,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 6528,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 6592,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 6656,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDS2_E"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 6720,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDhE"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 6784,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDaE"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 6848,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDtE"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 6912,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDsE"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 6976,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDiE"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 7040,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDlE"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 7104,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDfE"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 7168,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDdE"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 7232,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 7296,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 7360,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 7424,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 7488,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 7552,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 7616,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 7680,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 7744,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 7808,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 7872,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 7936,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 8000,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 8064,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 8128,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 8192,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 8256,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 8320,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 8384,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 8448,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 8512,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 8576,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 8640,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 8704,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 8768,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 8832,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 8896,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 8960,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 9024,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 9088,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 9152,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 9216,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 9280,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 9344,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 9408,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 9472,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 9536,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 9600,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 9664,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 9728,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 9792,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 9856,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDP8_jobjectE"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 9920,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 9984,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDaE"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 10048,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDtE"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 10112,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDsE"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 10176,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDiE"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 10240,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDlE"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 10304,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDfE"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 10368,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDdE"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 10432,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKtiE"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 10496,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 10560,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 10624,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 10688,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKcE"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 10752,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 10816,
     "referenced_type" : "_ZTIPFPKcP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 10880,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKcE"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 10944,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jarrayE"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 11008,
     "referenced_type" : "_ZTIPFP13_jobjectArrayP7_JNIEnviP7_jclassP8_jobjectE"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 11072,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP13_jobjectArrayiE"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 11136,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jobjectArrayiP8_jobjectE"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 11200,
     "referenced_type" : "_ZTIPFP14_jbooleanArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 11264,
     "referenced_type" : "_ZTIPFP11_jbyteArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 11328,
     "referenced_type" : "_ZTIPFP11_jcharArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 11392,
     "referenced_type" : "_ZTIPFP12_jshortArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 11456,
     "referenced_type" : "_ZTIPFP10_jintArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 11520,
     "referenced_type" : "_ZTIPFP11_jlongArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 11584,
     "referenced_type" : "_ZTIPFP12_jfloatArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 11648,
     "referenced_type" : "_ZTIPFP13_jdoubleArrayP7_JNIEnviE"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 11712,
     "referenced_type" : "_ZTIPFPhP7_JNIEnvP14_jbooleanArrayS_E"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 11776,
     "referenced_type" : "_ZTIPFPaP7_JNIEnvP11_jbyteArrayPhE"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 11840,
     "referenced_type" : "_ZTIPFPtP7_JNIEnvP11_jcharArrayPhE"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 11904,
     "referenced_type" : "_ZTIPFPsP7_JNIEnvP12_jshortArrayPhE"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 11968,
     "referenced_type" : "_ZTIPFPiP7_JNIEnvP10_jintArrayPhE"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 12032,
     "referenced_type" : "_ZTIPFPlP7_JNIEnvP11_jlongArrayPhE"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 12096,
     "referenced_type" : "_ZTIPFPfP7_JNIEnvP12_jfloatArrayPhE"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 12160,
     "referenced_type" : "_ZTIPFPdP7_JNIEnvP13_jdoubleArrayPhE"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 12224,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayPhiE"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 12288,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayPaiE"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 12352,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayPtiE"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 12416,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayPsiE"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 12480,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayPiiE"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 12544,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayPliE"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 12608,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayPfiE"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 12672,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayPdiE"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 12736,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPhE"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 12800,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPaE"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 12864,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPtE"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 12928,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPsE"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 12992,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPiE"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 13056,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPlE"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 13120,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPfE"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 13184,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPdE"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 13248,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPKhE"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 13312,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPKaE"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 13376,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPKtE"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 13440,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPKsE"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 13504,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPKiE"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 13568,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPKlE"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 13632,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPKfE"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 13696,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPKdE"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 13760,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPK15JNINativeMethodiE"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 13824,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 13888,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 13952,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 14016,
     "referenced_type" : "_ZTIPFiP7_JNIEnvPP7_JavaVME"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 14080,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPtE"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 14144,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPcE"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 14208,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP7_jarrayPhE"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 14272,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jarrayPviE"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 14336,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 14400,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 14464,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 14528,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 14592,
     "referenced_type" : "_ZTIPFhP7_JNIEnvE"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 14656,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvPvlE"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 14720,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 14784,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 14848,
     "referenced_type" : "_ZTIPF14jobjectRefTypeP7_JNIEnvP8_jobjectE"
    }
   ],
   "linker_set_key" : "_ZTI18JNINativeInterface",
   "name" : "JNINativeInterface",
   "referenced_type" : "_ZTI18JNINativeInterface",
   "self_type" : "_ZTI18JNINativeInterface",
   "size" : 1864,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "component",
     "field_offset" : 64,
     "referenced_type" : "_ZTI22android_flex_component"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "_ZTI18android_flex_plane",
   "self_type" : "_ZTI18android_flex_plane",
   "size" : 40,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19android_flex_format"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP18android_flex_plane"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "_ZTI19android_flex_layout",
   "self_type" : "_ZTI19android_flex_layout",
   "size" : 16,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "_ZTI20android_depth_points",
   "self_type" : "_ZTI20android_depth_points",
   "size" : 36,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 48,
   "source_file" : "system/logging/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "_ZTI25android_cta861_3_metadata",
   "self_type" : "_ZTI25android_cta861_3_metadata",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "_ZTI26android_smpte2086_metadata",
   "self_type" : "_ZTI26android_smpte2086_metadata",
   "size" : 40,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "b",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "c",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "i",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "j",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "d",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "l",
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI6jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6jvalue",
   "self_type" : "_ZTI6jvalue",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNINativeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JNIEnv",
   "name" : "_JNIEnv",
   "referenced_type" : "_ZTI7_JNIEnv",
   "self_type" : "_ZTI7_JNIEnv",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNIInvokeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JavaVM",
   "name" : "_JavaVM",
   "referenced_type" : "_ZTI7_JavaVM",
   "self_type" : "_ZTI7_JavaVM",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI7_jarray",
   "self_type" : "_ZTI7_jarray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "referenced_type" : "_ZTI7_jclass",
   "self_type" : "_ZTI7_jclass",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI8_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8_jobject",
   "self_type" : "_ZTI8_jobject",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI8_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8_jstring",
   "self_type" : "_ZTI8_jstring",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10IInterfaceE",
   "name" : "android::IInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10IInterfaceE",
   "self_type" : "_ZTIN7android10IInterfaceE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android10ParcelableE",
   "name" : "android::Parcelable",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10ParcelableE",
   "self_type" : "_ZTIN7android10ParcelableE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcelable.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10ParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKm"
    }
   ],
   "linker_set_key" : "_ZTIN7android10VectorImplE",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10VectorImplE",
   "self_type" : "_ZTIN7android10VectorImplE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11IDataSourceE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_11IDataSourceEEE",
   "name" : "android::BnInterface<android::IDataSource>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_11IDataSourceEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_11IDataSourceEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android11IDataSourceE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IDataSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IDataSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IDataSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IDataSourceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IDataSourceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource10getIMemoryEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource6readAtElm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource7getSizeEPl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource8toStringEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IDataSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IDataSourceEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IDataSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IDataSourceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IDataSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IDataSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IDataSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IDataSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IDataSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "name" : "android::BnInterface<android::IMemoryHeap>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android11IMemoryHeapE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12IMediaSourceE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_12IMediaSourceEEE",
   "name" : "android::BnInterface<android::IMediaSource>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_12IMediaSourceEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_12IMediaSourceEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android12IMediaSourceE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IMediaSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaSourceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_12IMediaSourceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource5startEPNS_8MetaDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource9getFormatEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource4readEPPNS_15MediaBufferBaseEPKNS_10MediaTrack11ReadOptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource12readMultipleEPNS_6VectorIPNS_15MediaBufferBaseEEEjPKNS_10MediaTrack11ReadOptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource19supportReadMultipleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource22supportNonblockingReadEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource5pauseEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IMediaSourceEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IMediaSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_12IMediaSourceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IMediaSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IMediaSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IMediaSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IMediaSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IMediaSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android15IMediaExtractorE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_15IMediaExtractorEEE",
   "name" : "android::BnInterface<android::IMediaExtractor>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_15IMediaExtractorEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_15IMediaExtractorEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android15IMediaExtractorE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IMediaExtractorEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaExtractorEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaExtractorEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaExtractorEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_15IMediaExtractorEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor11countTracksEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor8getTrackEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor16getTrackMetaDataEmj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor11getMetaDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor10getMetricsEPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaExtractor5flagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor11setMediaCasERKNSt3__16vectorIhNS1_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor4nameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor13setEntryPointENS0_10EntryPointE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor15setLogSessionIdERKNS_7String8E"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaExtractorEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IMediaExtractorEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IMediaExtractorEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_15IMediaExtractorEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IMediaExtractorEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IMediaExtractorEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IMediaExtractorEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_15IMediaExtractorEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_15IMediaExtractorEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7IMemoryE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE",
   "name" : "android::BnInterface<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "_ZTIN7android7IMemoryE" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPlPm"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11IMemoryHeapE",
   "name" : "android::IMemoryHeap",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11IMemoryHeapE",
   "self_type" : "_ZTIN7android11IMemoryHeapE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IMemoryHeapD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11IMemoryHeap22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11IMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11IMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorINS_7String8ES1_EE",
   "name" : "android::KeyedVector<android::String8, android::String8>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorINS_7String8ES1_EE",
   "self_type" : "_ZTIN7android11KeyedVectorINS_7String8ES1_EE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIN7android7String8E", "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIjjEE",
   "name" : "android::KeyedVector<unsigned int, unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIjjEE",
   "self_type" : "_ZTIN7android11KeyedVectorIjjEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12BnMemoryHeapE",
   "name" : "android::BnMemoryHeap",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12BnMemoryHeapE",
   "self_type" : "_ZTIN7android12BnMemoryHeapE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android19VirtualLightRefBaseE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHeap",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android2spINS_11IMemoryHeapEEE"
    },
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPN7android22SimpleBestFitAllocatorE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12MemoryDealerE",
   "name" : "android::MemoryDealer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12MemoryDealerE",
   "self_type" : "_ZTIN7android12MemoryDealerE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/include/binder/MemoryDealer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12MemoryDealerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12MemoryDealerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12MemoryDealerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android12MemoryDealer8allocateEm"
    },
    {
     "mangled_component_name" : "_ZN7android12MemoryDealer10deallocateEm"
    },
    {
     "mangled_component_name" : "_ZNK7android12MemoryDealer4dumpEPKc"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String8, android::String8>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE10do_compareEPKvS6_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<unsigned int, unsigned int>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIjjEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjjEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjjEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE10do_compareEPKvS5_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIjjEEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIjjEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIjjEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_7String8EEE",
   "name" : "android::trait_pointer<android::String8>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_7String8EEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIjEE",
   "name" : "android::trait_pointer<unsigned int>",
   "referenced_type" : "_ZTIN7android13trait_pointerIjEE",
   "self_type" : "_ZTIN7android13trait_pointerIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android12BnMemoryHeapE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFD",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mBase",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mDevice",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "mNeedUnmap",
     "field_offset" : 384,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mOffset",
     "field_offset" : 448,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN7android14MemoryHeapBaseE",
   "name" : "android::MemoryHeapBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14MemoryHeapBaseE",
   "self_type" : "_ZTIN7android14MemoryHeapBaseE",
   "size" : 112,
   "source_file" : "frameworks/native/libs/binder/include/binder/MemoryHeapBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 96,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 64,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase9getHeapIDEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase7getBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase7getSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase8getFlagsEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase9getOffsetEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -64,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n32_N7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n32_N7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n56_NK7android14MemoryHeapBase9getHeapIDEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n64_NK7android14MemoryHeapBase7getBaseEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n72_NK7android14MemoryHeapBase7getSizeEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n80_NK7android14MemoryHeapBase8getFlagsEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n88_NK7android14MemoryHeapBase9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTvn8_n32_N7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTvn8_n32_N7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -96,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -96,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14ReferenceMoverE",
   "self_type" : "_ZTIN7android14ReferenceMoverE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16FlattenableUtilsE",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16FlattenableUtilsE",
   "self_type" : "_ZTIN7android16FlattenableUtilsE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16ReferenceRenamerE",
   "self_type" : "_ZTIN7android16ReferenceRenamerE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16SortedVectorImplE",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16SortedVectorImplE",
   "self_type" : "_ZTIN7android16SortedVectorImplE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16aggregate_traitsINS_7String8ES1_EE",
   "name" : "android::aggregate_traits<android::String8, android::String8>",
   "referenced_type" : "_ZTIN7android16aggregate_traitsINS_7String8ES1_EE",
   "self_type" : "_ZTIN7android16aggregate_traitsINS_7String8ES1_EE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E", "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16aggregate_traitsIjjEE",
   "name" : "android::aggregate_traits<unsigned int, unsigned int>",
   "referenced_type" : "_ZTIN7android16aggregate_traitsIjjEE",
   "self_type" : "_ZTIN7android16aggregate_traitsIjjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIN7android7String8E"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android7String8E"
    }
   ],
   "linker_set_key" : "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE",
   "name" : "android::key_value_pair_t<android::String8, android::String8>",
   "referenced_type" : "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE",
   "self_type" : "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E", "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android16key_value_pair_tIjjEE",
   "name" : "android::key_value_pair_t<unsigned int, unsigned int>",
   "referenced_type" : "_ZTIN7android16key_value_pair_tIjjEE",
   "self_type" : "_ZTIN7android16key_value_pair_tIjjEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::use_trivial_move<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIjjEEEE",
   "name" : "android::use_trivial_move<android::key_value_pair_t<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIjjEEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIjjEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIjjEEEE",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIjjEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIjjEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_7String8EEE",
   "name" : "android::trait_trivial_copy<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIjjEEEE",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIjjEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIjjEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_7String8EEE",
   "name" : "android::trait_trivial_ctor<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIjjEEEE",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIjjEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIjjEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_7String8EEE",
   "name" : "android::trait_trivial_dtor<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIjjEEEE",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIjjEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIjjEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String8.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String16.h",
   "template_args" : [ "_ZTIN7android8String16E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "self_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android10DataSourceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_10DataSourceEEE",
   "name" : "android::sp<android::DataSource>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_10DataSourceEEE",
   "self_type" : "_ZTIN7android2spINS_10DataSourceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android10DataSourceE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "name" : "android::sp<android::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "self_type" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android10IInterfaceE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android10RpcSessionE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "name" : "android::sp<android::RpcSession>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "self_type" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android10RpcSessionE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android11IDataSourceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_11IDataSourceEEE",
   "name" : "android::sp<android::IDataSource>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_11IDataSourceEEE",
   "self_type" : "_ZTIN7android2spINS_11IDataSourceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android11IDataSourceE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android11IMemoryHeapE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_11IMemoryHeapEEE",
   "name" : "android::sp<android::IMemoryHeap>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_11IMemoryHeapEEE",
   "self_type" : "_ZTIN7android2spINS_11IMemoryHeapEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android11IMemoryHeapE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android16MediaHTTPServiceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_16MediaHTTPServiceEEE",
   "name" : "android::sp<android::MediaHTTPService>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_16MediaHTTPServiceEEE",
   "self_type" : "_ZTIN7android2spINS_16MediaHTTPServiceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android16MediaHTTPServiceE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android17AHandlerReflectorINS_15NuCachedSource2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_17AHandlerReflectorINS_15NuCachedSource2EEEEE",
   "name" : "android::sp<android::AHandlerReflector<android::NuCachedSource2>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_17AHandlerReflectorINS_15NuCachedSource2EEEEE",
   "self_type" : "_ZTIN7android2spINS_17AHandlerReflectorINS_15NuCachedSource2EEEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android17AHandlerReflectorINS_15NuCachedSource2EEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android17DataSourceFactoryE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_17DataSourceFactoryEEE",
   "name" : "android::sp<android::DataSourceFactory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_17DataSourceFactoryEEE",
   "self_type" : "_ZTIN7android2spINS_17DataSourceFactoryEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android17DataSourceFactoryE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android17IMediaHTTPServiceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_17IMediaHTTPServiceEEE",
   "name" : "android::sp<android::IMediaHTTPService>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_17IMediaHTTPServiceEEE",
   "self_type" : "_ZTIN7android2spINS_17IMediaHTTPServiceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android17IMediaHTTPServiceE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android6ThreadE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_6ThreadEEE",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_6ThreadEEE",
   "self_type" : "_ZTIN7android2spINS_6ThreadEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android6ThreadE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7ABufferE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7ABufferEEE",
   "name" : "android::sp<android::ABuffer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7ABufferEEE",
   "self_type" : "_ZTIN7android2spINS_7ABufferEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7ABufferE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7ALooper12LooperThreadE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7ALooper12LooperThreadEEE",
   "name" : "android::sp<android::ALooper::LooperThread>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7ALooper12LooperThreadEEE",
   "self_type" : "_ZTIN7android2spINS_7ALooper12LooperThreadEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7ALooper12LooperThreadE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7ALooperE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7ALooperEEE",
   "name" : "android::sp<android::ALooper>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7ALooperEEE",
   "self_type" : "_ZTIN7android2spINS_7ALooperEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7ALooperE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7IBinderEEE",
   "name" : "android::sp<android::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7IBinderEEE",
   "self_type" : "_ZTIN7android2spINS_7IBinderEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7IBinderE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IMemoryE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7IMemoryEEE",
   "name" : "android::sp<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7IMemoryEEE",
   "self_type" : "_ZTIN7android2spINS_7IMemoryEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7IMemoryE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7RefBaseEEE",
   "name" : "android::sp<android::RefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7RefBaseEEE",
   "self_type" : "_ZTIN7android2spINS_7RefBaseEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7RefBaseE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8AMessageE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8AMessageEEE",
   "name" : "android::sp<android::AMessage>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8AMessageEEE",
   "self_type" : "_ZTIN7android2spINS_8AMessageEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8AMessageE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7ALooperE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_7ALooperEEE",
   "name" : "android::wp<android::ALooper>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_7ALooperEEE",
   "self_type" : "_ZTIN7android2wpINS_7ALooperEEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android7ALooperE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8AHandlerE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_8AHandlerEEE",
   "name" : "android::wp<android::AHandler>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_8AHandlerEEE",
   "self_type" : "_ZTIN7android2wpINS_8AHandlerEEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android8AHandlerE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android4ListINS_7ALooper5EventEE5_NodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4ListINS_7ALooper5EventEEE",
   "name" : "android::List<android::ALooper::Event>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4ListINS_7ALooper5EventEEE",
   "self_type" : "_ZTIN7android4ListINS_7ALooper5EventEEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/List.h",
   "template_args" : [ "_ZTIN7android7ALooper5EventE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_7ALooper5EventEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7ALooper5EventEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7ALooper5EventEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android4ListINS_8HTTPBase14BandwidthEntryEE5_NodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4ListINS_8HTTPBase14BandwidthEntryEEE",
   "name" : "android::List<android::HTTPBase::BandwidthEntry>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4ListINS_8HTTPBase14BandwidthEntryEEE",
   "self_type" : "_ZTIN7android4ListINS_8HTTPBase14BandwidthEntryEEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/List.h",
   "template_args" : [ "_ZTIN7android8HTTPBase14BandwidthEntryE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_8HTTPBase14BandwidthEntryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_8HTTPBase14BandwidthEntryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_8HTTPBase14BandwidthEntryEED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base11borrowed_fdE",
   "name" : "android::base::borrowed_fd",
   "referenced_type" : "_ZTIN7android4base11borrowed_fdE",
   "self_type" : "_ZTIN7android4base11borrowed_fdE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base13DefaultCloserE",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "_ZTIN7android4base13DefaultCloserE",
   "self_type" : "_ZTIN7android4base13DefaultCloserE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h",
   "template_args" : [ "_ZTIN7android4base13DefaultCloserE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android5MutexE"
    }
   ],
   "linker_set_key" : "_ZTIN7android5Mutex8AutolockE",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5Mutex8AutolockE",
   "self_type" : "_ZTIN7android5Mutex8AutolockE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTI15pthread_mutex_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android5MutexE",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5MutexE",
   "self_type" : "_ZTIN7android5MutexE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android6Parcel4BlobE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel12ReadableBlobE",
   "name" : "android::Parcel::ReadableBlob",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel12ReadableBlobE",
   "self_type" : "_ZTIN7android6Parcel12ReadableBlobE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android6Parcel4BlobE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel12WritableBlobE",
   "name" : "android::Parcel::WritableBlob",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel12WritableBlobE",
   "self_type" : "_ZTIN7android6Parcel12WritableBlobE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNS_2spEEE",
   "name" : "android::Parcel::is_specialization<int, android::sp>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNS_2spEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNS_2spEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110shared_ptrEEE",
   "name" : "android::Parcel::is_specialization<int, std::shared_ptr>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110shared_ptrEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110shared_ptrEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110unique_ptrEEE",
   "name" : "android::Parcel::is_specialization<int, std::unique_ptr>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110unique_ptrEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__110unique_ptrEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__16vectorEEE",
   "name" : "android::Parcel::is_specialization<int, std::vector>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__16vectorEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__16vectorEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel17is_specializationIiNSt3__18optionalEEE",
   "name" : "android::Parcel::is_specialization<int, std::optional>",
   "referenced_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__18optionalEEE",
   "self_type" : "_ZTIN7android6Parcel17is_specializationIiNSt3__18optionalEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE",
   "name" : "android::Parcel::FlattenableHelperInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE",
   "self_type" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface16getFlattenedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface10getFdCountEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface7flattenEPvmPim"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Parcel26FlattenableHelperInterface9unflattenEPKvmPKim"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFd",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "protected",
     "field_name" : "mMutable",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android6Parcel4BlobE",
   "name" : "android::Parcel::Blob",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6Parcel4BlobE",
   "self_type" : "_ZTIN7android6Parcel4BlobE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mError",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPy"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSorted",
     "field_offset" : 576,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mRequestHeaderPresent",
     "field_offset" : 584,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mWorkSourceRequestHeaderPosition",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 704,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 712,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 720,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mDeallocZero",
     "field_offset" : 728,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvPN7android6ParcelEPKhmPKymE"
    },
    {
     "access" : "private",
     "field_name" : "mSession",
     "field_offset" : 832,
     "referenced_type" : "_ZTIN7android2spINS_10RpcSessionEEE"
    },
    {
     "access" : "private",
     "field_name" : "mOpenAshmemSize",
     "field_offset" : 896,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android6ParcelE",
   "name" : "android::Parcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6ParcelE",
   "self_type" : "_ZTIN7android6ParcelE",
   "size" : 120,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android6RWLockE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLock9AutoRLockE",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLock9AutoRLockE",
   "self_type" : "_ZTIN7android6RWLock9AutoRLockE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android6RWLockE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLock9AutoWLockE",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLock9AutoWLockE",
   "self_type" : "_ZTIN7android6RWLock9AutoWLockE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "_ZTI16pthread_rwlock_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLockE",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLockE",
   "self_type" : "_ZTIN7android6RWLockE",
   "size" : 56,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android5MutexE"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN7android9ConditionE"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 896,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 928,
     "referenced_type" : "_ZTIVb"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 936,
     "referenced_type" : "_ZTIVb"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 960,
     "referenced_type" : "_ZTIN7android2spINS_6ThreadEEE"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android6ThreadE",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6ThreadE",
   "self_type" : "_ZTIN7android6ThreadE",
   "size" : 152,
   "source_file" : "system/core/libutils/include/utils/Thread.h",
   "vtable_components" :
   [
    {
     "component_value" : 136,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcim"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::traits<android::key_value_pair_t<android::String8, android::String8>>",
   "referenced_type" : "_ZTIN7android6traitsINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "self_type" : "_ZTIN7android6traitsINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8ES1_EE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_16key_value_pair_tIjjEEEE",
   "name" : "android::traits<android::key_value_pair_t<unsigned int, unsigned int>>",
   "referenced_type" : "_ZTIN7android6traitsINS_16key_value_pair_tIjjEEEE",
   "self_type" : "_ZTIN7android6traitsINS_16key_value_pair_tIjjEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIjjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_7String8EEE",
   "name" : "android::traits<android::String8>",
   "referenced_type" : "_ZTIN7android6traitsINS_7String8EEE",
   "self_type" : "_ZTIN7android6traitsINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsIjEE",
   "name" : "android::traits<unsigned int>",
   "referenced_type" : "_ZTIN7android6traitsIjEE",
   "self_type" : "_ZTIN7android6traitsIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7IBinderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16atomicIPN7android7BBinder6ExtrasEEE"
    },
    {
     "access" : "private",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android7BBinderUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android7BBinderE",
   "name" : "android::BBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7BBinderE",
   "self_type" : "_ZTIN7android7BBinderE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/include/binder/Binder.h",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mStability",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mReserved0",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7BBinderUt_E",
   "name" : "android::BBinder::(anonymous union at frameworks/native/libs/binder/include/binder/Binder.h:117:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android7BBinderUt_E",
   "self_type" : "_ZTIN7android7BBinderUt_E",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/Binder.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7IBinder14DeathRecipientE",
   "name" : "android::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7IBinder14DeathRecipientE",
   "self_type" : "_ZTIN7android7IBinder14DeathRecipientE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IBinder.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipient10binderDiedERKNS_2wpIS0_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7IBinderE",
   "name" : "android::IBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7IBinderE",
   "self_type" : "_ZTIN7android7IBinderE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IBinder.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder13isBinderAliveEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder10pingBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder11linkToDeathERKNS_2spINS0_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder13unlinkToDeathERKNS_2wpINS0_14DeathRecipientEEEPvjPS3_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7IMemoryE",
   "name" : "android::IMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7IMemoryE",
   "self_type" : "_ZTIN7android7IMemoryE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IMemoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7IMemory22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPlPm"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIN7android7RefBaseE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN7android7String8E",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7String8E",
   "self_type" : "_ZTIN7android7String8E",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/String8.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8BnMemoryE",
   "name" : "android::BnMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8BnMemoryE",
   "self_type" : "_ZTIN7android8BnMemoryE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/IMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPlPm"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKDs"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String16E",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8String16E",
   "self_type" : "_ZTIN7android8String16E",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPN7android7IBinderE"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android9BpRefBaseE",
   "name" : "android::BpRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android9BpRefBaseE",
   "self_type" : "_ZTIN7android9BpRefBaseE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/Binder.h",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "_ZTI14pthread_cond_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android9ConditionE",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android9ConditionE",
   "self_type" : "_ZTIN7android9ConditionE",
   "size" : 48,
   "source_file" : "system/core/libutils/include/utils/Condition.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android2spINS_16MediaHTTPServiceEEE",
   "name" : "android::sp<android::MediaHTTPService> &&",
   "referenced_type" : "_ZTIN7android2spINS_16MediaHTTPServiceEEE",
   "self_type" : "_ZTION7android2spINS_16MediaHTTPServiceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android2spINS_17IMediaHTTPServiceEEE",
   "name" : "android::sp<android::IMediaHTTPService> &&",
   "referenced_type" : "_ZTIN7android2spINS_17IMediaHTTPServiceEEE",
   "self_type" : "_ZTION7android2spINS_17IMediaHTTPServiceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android2spINS_7ALooperEEE",
   "name" : "android::sp<android::ALooper> &&",
   "referenced_type" : "_ZTIN7android2spINS_7ALooperEEE",
   "self_type" : "_ZTION7android2spINS_7ALooperEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android2spINS_7IBinderEEE",
   "name" : "android::sp<android::IBinder> &&",
