{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_N6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "name" : "google::protobuf::internal::ArenaImpl::CleanupNode [1]",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "self_type" : "_ZTIA1_N6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,

   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf12ArenaOptionsE",
   "name" : "const google::protobuf::ArenaOptions",
   "referenced_type" : "_ZTIN6google8protobuf12ArenaOptionsE",
   "self_type" : "_ZTIKN6google8protobuf12ArenaOptionsE",
   "size" : 80,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf5ArenaE",
   "name" : "const google::protobuf::Arena",
   "referenced_type" : "_ZTIN6google8protobuf5ArenaE",
   "self_type" : "_ZTIKN6google8protobuf5ArenaE",
   "size" : 120,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf8internal12WrappedMutexE",
   "name" : "const google::protobuf::internal::WrappedMutex",
   "referenced_type" : "_ZTIN6google8protobuf8internal12WrappedMutexE",
   "self_type" : "_ZTIKN6google8protobuf8internal12WrappedMutexE",
   "size" : 40,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/mutex.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "name" : "const google::protobuf::internal::ArenaImpl::SerialArena",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "self_type" : "_ZTIKN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "size" : 72,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf8internal9ArenaImpl5BlockE",
   "name" : "const google::protobuf::internal::ArenaImpl::Block",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl5BlockE",
   "self_type" : "_ZTIKN6google8protobuf8internal9ArenaImpl5BlockE",
   "size" : 24,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf8internal9ArenaImplE",
   "name" : "const google::protobuf::internal::ArenaImpl",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImplE",
   "self_type" : "_ZTIKN6google8protobuf8internal9ArenaImplE",
   "size" : 88,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/common.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN6google8protobuf8internal12WrappedMutexE",
   "name" : "google::protobuf::internal::WrappedMutex *const",
   "referenced_type" : "_ZTIPN6google8protobuf8internal12WrappedMutexE",
   "self_type" : "_ZTIKPN6google8protobuf8internal12WrappedMutexE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/mutex.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "self_type" : "_ZTIKSt9type_info",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf11LogSilencerE",
   "name" : "google::protobuf::LogSilencer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf11LogSilencerE",
   "self_type" : "_ZTIN6google8protobuf11LogSilencerE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_block_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "max_block_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "initial_block",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "initial_block_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "block_alloc",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFPvmE"
    },
    {
     "field_name" : "block_dealloc",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFvPvmE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_init",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFPvPN6google8protobuf5ArenaEE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_reset",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvmE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_destruction",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvmE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_allocation",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFvPKSt9type_infomPvE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf12ArenaOptionsE",
   "name" : "google::protobuf::ArenaOptions",
   "referenced_type" : "_ZTIN6google8protobuf12ArenaOptionsE",
   "self_type" : "_ZTIN6google8protobuf12ArenaOptionsE",
   "size" : 80,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4BitsE",
   "name" : "google::protobuf::Bits",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf4BitsE",
   "self_type" : "_ZTIN6google8protobuf4BitsE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "impl_",
     "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImplE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_allocation_",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFvPKSt9type_infomPvE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_reset_",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvmE"
    },
    {
     "access" : "private",
     "field_name" : "on_arena_destruction_",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFvPN6google8protobuf5ArenaEPvmE"
    },
    {
     "access" : "private",
     "field_name" : "hooks_cookie_",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf5ArenaE",
   "name" : "google::protobuf::Arena",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf5ArenaE",
   "self_type" : "_ZTIN6google8protobuf5ArenaE",
   "size" : 120,
   "source_file" : "external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "level_",
     "referenced_type" : "_ZTIN6google8protobuf8LogLevelE"
    },
    {
     "access" : "private",
     "field_name" : "filename_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "line_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "message_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "name" : "google::protobuf::internal::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "self_type" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "size" : 48,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "name" : "google::protobuf::internal::LogFinisher",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "self_type" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mu_",
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal12WrappedMutexE",
   "name" : "google::protobuf::internal::WrappedMutex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal12WrappedMutexE",
   "self_type" : "_ZTIN6google8protobuf8internal12WrappedMutexE",
   "size" : 40,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/mutex.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mu_",
     "referenced_type" : "_ZTIKPN6google8protobuf8internal12WrappedMutexE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal14MutexLockMaybeE",
   "name" : "google::protobuf::internal::MutexLockMaybe",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal14MutexLockMaybeE",
   "self_type" : "_ZTIN6google8protobuf8internal14MutexLockMaybeE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "key_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal18ThreadLocalStorageINS1_9ArenaImpl11ThreadCacheEEE",
   "name" : "google::protobuf::internal::ThreadLocalStorage<google::protobuf::internal::ArenaImpl::ThreadCache>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal18ThreadLocalStorageINS1_9ArenaImpl11ThreadCacheEEE",
   "self_type" : "_ZTIN6google8protobuf8internal18ThreadLocalStorageINS1_9ArenaImpl11ThreadCacheEEE",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/mutex.h",
   "template_args" : [ "_ZTIN6google8protobuf8internal9ArenaImpl11ThreadCacheE" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "elem",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "name" : "google::protobuf::internal::ArenaImpl::CleanupNode",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11CleanupNodeE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "arena_",
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImplE"
    },
    {
     "access" : "private",
     "field_name" : "owner_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "head_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "cleanup_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl12CleanupChunkE"
    },
    {
     "access" : "private",
     "field_name" : "next_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11SerialArenaE"
    },
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "limit_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "cleanup_ptr_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11CleanupNodeE"
    },
    {
     "access" : "private",
     "field_name" : "cleanup_limit_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11CleanupNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "name" : "google::protobuf::internal::ArenaImpl::SerialArena",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11SerialArenaE",
   "size" : 72,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "last_lifecycle_id_seen",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "last_serial_arena",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl11SerialArenaE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl11ThreadCacheE",
   "name" : "google::protobuf::internal::ArenaImpl::ThreadCache",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11ThreadCacheE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl11ThreadCacheE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "next",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl12CleanupChunkE"
    },
    {
     "field_name" : "nodes",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_N6google8protobuf8internal9ArenaImpl11CleanupNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl12CleanupChunkE",
   "name" : "google::protobuf::internal::ArenaImpl::CleanupChunk",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl12CleanupChunkE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl12CleanupChunkE",
   "size" : 32,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "next_",
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "pos_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl5BlockE",
   "name" : "google::protobuf::internal::ArenaImpl::Block",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl5BlockE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl5BlockE",
   "size" : 24,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_block_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "max_block_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "initial_block",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "initial_block_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "block_alloc",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFPvmE"
    },
    {
     "field_name" : "block_dealloc",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFvPvmE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE",
   "name" : "google::protobuf::internal::ArenaImpl::Options",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE",
   "size" : 48,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "threads_",
     "referenced_type" : "_ZTINSt3__16atomicIPN6google8protobuf8internal9ArenaImpl11SerialArenaEEE"
    },
    {
     "access" : "private",
     "field_name" : "hint_",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16atomicIPN6google8protobuf8internal9ArenaImpl11SerialArenaEEE"
    },
    {
     "access" : "private",
     "field_name" : "space_allocated_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__16atomicImEE"
    },
    {
     "access" : "private",
     "field_name" : "initial_block_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPN6google8protobuf8internal9ArenaImpl5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "lifecycle_id_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "access" : "private",
     "field_name" : "options_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImpl7OptionsE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9ArenaImplE",
   "name" : "google::protobuf::internal::ArenaImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal9ArenaImplE",
   "self_type" : "_ZTIN6google8protobuf8internal9ArenaImplE",
   "size" : 88,
   "source_file" : "external/protobuf/src/google/protobuf/arena_impl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mu_",
     "referenced_type" : "_ZTIKPN6google8protobuf8internal12WrappedMutexE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal9MutexLockE",
   "name" : "google::protobuf::internal::MutexLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal9MutexLockE",
   "self_type" : "_ZTIN6google8protobuf8internal9MutexLockE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/mutex.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf9BigEndianE",
   "name" : "google::protobuf::BigEndian",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf9BigEndianE",
   "self_type" : "_ZTIN6google8protobuf9BigEndianE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  }
 ],
 "rvalue_reference_types" : []
}
