#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GNSS_VISIBILITY_CONTROL_V1_0_IGNSSVISIBILITYCONTROLCALLBACK_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GNSS_VISIBILITY_CONTROL_V1_0_IGNSSVISIBILITYCONTROLCALLBACK_H

#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace gnss {
namespace visibility_control {
namespace V1_0 {

/**
 * GNSS location reporting permissions and notification callback interface.
 */
struct IGnssVisibilityControlCallback : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.gnss.visibility_control@1.0::IGnssVisibilityControlCallback"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class NfwProtocolStack : uint8_t;
    enum class NfwRequestor : uint8_t;
    enum class NfwResponseType : uint8_t;
    struct NfwNotification;

    /**
     * Protocol stack that is requesting the non-framework location information.
     */
    enum class NfwProtocolStack : uint8_t {
        /**
         * Cellular control plane requests
         */
        CTRL_PLANE = 0,
        /**
         * All types of SUPL requests
         */
        SUPL = 1,
        /**
         * All types of requests from IMS
         */
        IMS = 10,
        /**
         * All types of requests from SIM
         */
        SIM = 11,
        /**
         * Requests from other protocol stacks
         */
        OTHER_PROTOCOL_STACK = 100,
    };

    /*
     * Entity that is requesting/receiving the location information.
     */
    enum class NfwRequestor : uint8_t {
        /**
         * Wireless service provider
         */
        CARRIER = 0,
        /**
         * Device manufacturer
         */
        OEM = 10,
        /**
         * Modem chipset vendor
         */
        MODEM_CHIPSET_VENDOR = 11,
        /**
         * GNSS chipset vendor
         */
        GNSS_CHIPSET_VENDOR = 12,
        /**
         * Other chipset vendor
         */
        OTHER_CHIPSET_VENDOR = 13,
        /**
         * Automobile client
         */
        AUTOMOBILE_CLIENT = 20,
        /**
         * Other sources
         */
        OTHER_REQUESTOR = 100,
    };

    /**
     * GNSS response type for non-framework location requests.
     */
    enum class NfwResponseType : uint8_t {
        /**
         * Request rejected because framework has not given permission for this use case
         */
        REJECTED = 0,
        /**
         * Request accepted but could not provide location because of a failure
         */
        ACCEPTED_NO_LOCATION_PROVIDED = 1,
        /**
         * Request accepted and location provided
         */
        ACCEPTED_LOCATION_PROVIDED = 2,
    };

    /**
     * Represents a non-framework location information request/response notification.
     */
    struct NfwNotification final {
        /**
         * Package name of the Android proxy application representing the non-framework
         * entity that requested location. Set to empty string if unknown.
         *
         * For user-initiated emergency use cases, this field must be set to empty string
         * and the inEmergencyMode field must be set to true.
         */
        ::android::hardware::hidl_string proxyAppPackageName __attribute__ ((aligned(8)));
        /**
         * Protocol stack that initiated the non-framework location request.
         */
        ::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwProtocolStack protocolStack __attribute__ ((aligned(1)));
        /**
         * Name of the protocol stack if protocolStack field is set to OTHER_PROTOCOL_STACK.
         * Otherwise, set to empty string.
         *
         * This field is opaque to the framework and used for logging purposes.
         */
        ::android::hardware::hidl_string otherProtocolStackName __attribute__ ((aligned(8)));
        /**
         * Source initiating/receiving the location information.
         */
        ::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwRequestor requestor __attribute__ ((aligned(1)));
        /**
         * Identity of the endpoint receiving the location information. For example, carrier
         * name, OEM name, SUPL SLP/E-SLP FQDN, chipset vendor name, etc.
         *
         * This field is opaque to the framework and used for logging purposes.
         */
        ::android::hardware::hidl_string requestorId __attribute__ ((aligned(8)));
        /**
         * Indicates whether location information was provided for this request.
         */
        ::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwResponseType responseType __attribute__ ((aligned(1)));
        /**
         * Is the device in user initiated emergency session.
         */
        bool inEmergencyMode __attribute__ ((aligned(1)));
        /**
         * Is cached location provided
         */
        bool isCachedLocation __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwNotification, proxyAppPackageName) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwNotification, protocolStack) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwNotification, otherProtocolStackName) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwNotification, requestor) == 40, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwNotification, requestorId) == 48, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwNotification, responseType) == 64, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwNotification, inEmergencyMode) == 65, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwNotification, isCachedLocation) == 66, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwNotification) == 72, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::visibility_control::V1_0::IGnssVisibilityControlCallback::NfwNotification) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Callback to report a non-framework delivered location.
     *
     * The GNSS HAL implementation must call this method to notify the framework whenever
     * a non-framework location request is made to the GNSS HAL.
     *
     * Non-framework entities like low power sensor hubs that request location from GNSS and
     * only pass location information through Android framework controls are exempt from this
     * power-spending reporting. However, low power sensor hubs or other chipsets which may send
     * the location information to anywhere other than Android framework (which provides user
