{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA11_c",
   "name" : "char [11]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA11_c",
   "size" : 11,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA128_m",
   "name" : "unsigned long [128]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA128_m",
   "size" : 512,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA13_i",
   "name" : "int [13]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA13_i",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA14_NSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "std::__1::basic_string<char> [14]",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",

   "self_type" : "_ZTIKSt16nested_exception",
   "size" : 8,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "_ZTISt9nothrow_t",
   "self_type" : "_ZTIKSt9nothrow_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "self_type" : "_ZTIKSt9type_info",
   "size" : 8,
   "source_file" : "external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKe",
   "name" : "const long double",
   "referenced_type" : "_ZTIe",
   "self_type" : "_ZTIKe",
   "size" : 8,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/cppmath.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 4,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 4,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTIVNSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_jPKvE",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvS_jPKvE",
   "self_type" : "_ZTIVPFPvS_jPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjPKvE",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjPKvE",
   "self_type" : "_ZTIVPFPvjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjjPKvE",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjjPKvE",
   "self_type" : "_ZTIVPFPvjjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "inputs",
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "outputs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "intermediates",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "temporaries",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "user_data",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "builtin_data",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "custom_initial_data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "custom_initial_data_size",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "delegate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP14TfLiteDelegate"
    }
   ],
   "linker_set_key" : "_ZTI10TfLiteNode",
   "name" : "TfLiteNode",
   "referenced_type" : "_ZTI10TfLiteNode",
   "self_type" : "_ZTI10TfLiteNode",
   "size" : 36,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cgroup",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "referenced_type" : "_ZTI10clone_args",
   "self_type" : "_ZTI10clone_args",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 84,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA2_m"
    }
   ],
   "linker_set_key" : "_ZTI10sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "_ZTI10sigset64_t",
   "self_type" : "_ZTI10sigset64_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "referenced_type" : "_ZTI11sched_param",
   "self_type" : "_ZTI11sched_param",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA8_N11user_fpregs6fp_regE"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "_ZTI11user_fpregs",
   "self_type" : "_ZTI11user_fpregs",
   "size" : 116,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI10TfLiteType"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTI14TfLitePtrUnion"
    },
    {
     "field_name" : "dims",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "params",
     "field_offset" : 96,
     "referenced_type" : "_ZTI24TfLiteQuantizationParams"
    },
    {
     "field_name" : "allocation_type",
     "field_offset" : 160,
     "referenced_type" : "_ZTI20TfLiteAllocationType"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "allocation",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "name",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "delegate",
     "field_offset" : 288,
     "referenced_type" : "_ZTIP14TfLiteDelegate"
    },
    {
     "field_name" : "buffer_handle",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data_is_stale",
     "field_offset" : 352,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "is_variable",
     "field_offset" : 360,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "quantization",
     "field_offset" : 384,
     "referenced_type" : "_ZTI18TfLiteQuantization"
    },
    {
     "field_name" : "sparsity",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP14TfLiteSparsity"
    },
    {
     "field_name" : "dims_signature",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPK14TfLiteIntArray"
    }
   ],
   "linker_set_key" : "_ZTI12TfLiteTensor",
   "name" : "TfLiteTensor",
   "referenced_type" : "_ZTI12TfLiteTensor",
   "self_type" : "_ZTI12TfLiteTensor",
   "size" : 64,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "_ZTI12user_vfp_exc",
   "self_type" : "_ZTI12user_vfp_exc",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tensors_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "GetExecutionPlan",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextPP14TfLiteIntArrayE"
    },
    {
     "field_name" : "tensors",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12TfLiteTensor"
    },
    {
     "field_name" : "impl_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ResizeTensor",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP12TfLiteTensorP14TfLiteIntArrayE"
    },
    {
     "field_name" : "ReportError",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFvP13TfLiteContextPKczE"
    },
    {
     "field_name" : "AddTensors",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextiPiE"
    },
    {
     "field_name" : "GetNodeAndRegistration",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextiPP10TfLiteNodePP18TfLiteRegistrationE"
    },
    {
     "field_name" : "ReplaceNodeSubsetsWithDelegateKernels",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContext18TfLiteRegistrationPK14TfLiteIntArrayP14TfLiteDelegateE"
    },
    {
     "field_name" : "recommended_num_threads",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "GetExternalContext",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFP21TfLiteExternalContextP13TfLiteContext25TfLiteExternalContextTypeE"
    },
    {
     "field_name" : "SetExternalContext",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFvP13TfLiteContext25TfLiteExternalContextTypeP21TfLiteExternalContextE"
    },
    {
     "field_name" : "allow_fp32_relax_to_fp16",
     "field_offset" : 384,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "profiler",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "AllocatePersistentBuffer",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFPvP13TfLiteContextjE"
    },
    {
     "field_name" : "AllocateBufferForEval",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextjPPvE"
    },
    {
     "field_name" : "RequestScratchBufferInArena",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextjPiE"
    },
    {
     "field_name" : "GetScratchBuffer",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFPvP13TfLiteContextiE"
    },
    {
     "field_name" : "ResizeTensorExplicit",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP12TfLiteTensoriPKiE"
    },
    {
     "field_name" : "PreviewDelegatePartitioning",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextPK14TfLiteIntArrayPP20TfLiteDelegateParamsPiE"
    },
    {
     "field_name" : "GetTensor",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFP12TfLiteTensorPK13TfLiteContextiE"
    },
    {
     "field_name" : "GetEvalTensor",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPFP16TfLiteEvalTensorPK13TfLiteContextiE"
    }
   ],
   "linker_set_key" : "_ZTI13TfLiteContext",
   "name" : "TfLiteContext",
   "referenced_type" : "_ZTI13TfLiteContext",
   "self_type" : "_ZTI13TfLiteContext",
   "size" : 88,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI13TfLiteFloat16",
   "name" : "TfLiteFloat16",
   "referenced_type" : "_ZTI13TfLiteFloat16",
   "self_type" : "_ZTI13TfLiteFloat16",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data_",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "Prepare",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP14TfLiteDelegateE"
    },
    {
     "field_name" : "CopyFromBufferHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP14TfLiteDelegateiP12TfLiteTensorE"
    },
    {
     "field_name" : "CopyToBufferHandle",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP14TfLiteDelegateiP12TfLiteTensorE"
    },
    {
     "field_name" : "FreeBufferHandle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvP13TfLiteContextP14TfLiteDelegatePiE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI14TfLiteDelegate",
   "name" : "TfLiteDelegate",
   "referenced_type" : "_ZTI14TfLiteDelegate",
   "self_type" : "_ZTI14TfLiteDelegate",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "then_subgraph_index",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "else_subgraph_index",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14TfLiteIfParams",
   "name" : "TfLiteIfParams",
   "referenced_type" : "_ZTI14TfLiteIfParams",
   "self_type" : "_ZTI14TfLiteIfParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA_i"
    }
   ],
   "linker_set_key" : "_ZTI14TfLiteIntArray",
   "name" : "TfLiteIntArray",
   "referenced_type" : "_ZTI14TfLiteIntArray",
   "self_type" : "_ZTI14TfLiteIntArray",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "i32",
     "referenced_type" : "_ZTIPi"
    },
    {
     "field_name" : "u32",
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "i64",
     "referenced_type" : "_ZTIPx"
    },
    {
     "field_name" : "u64",
     "referenced_type" : "_ZTIPy"
    },
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIPf"
    },
    {
     "field_name" : "f16",
     "referenced_type" : "_ZTIP13TfLiteFloat16"
    },
    {
     "field_name" : "f64",
     "referenced_type" : "_ZTIPd"
    },
    {
     "field_name" : "raw",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "raw_const",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "uint8",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "b",
     "referenced_type" : "_ZTIPb"
    },
    {
     "field_name" : "i16",
     "referenced_type" : "_ZTIPs"
    },
    {
     "field_name" : "c64",
     "referenced_type" : "_ZTIP15TfLiteComplex64"
    },
    {
     "field_name" : "c128",
     "referenced_type" : "_ZTIP16TfLiteComplex128"
    },
    {
     "field_name" : "int8",
     "referenced_type" : "_ZTIPa"
    },
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI14TfLitePtrUnion",
   "name" : "TfLitePtrUnion",
   "record_kind" : "union",
   "referenced_type" : "_ZTI14TfLitePtrUnion",
   "self_type" : "_ZTI14TfLitePtrUnion",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "traversal_order",
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "block_map",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "dim_metadata",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP23TfLiteDimensionMetadata"
    },
    {
     "field_name" : "dim_metadata_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14TfLiteSparsity",
   "name" : "TfLiteSparsity",
   "referenced_type" : "_ZTI14TfLiteSparsity",
   "self_type" : "_ZTI14TfLiteSparsity",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 24,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "pot_scale_int16",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI15TfLiteAddParams",
   "name" : "TfLiteAddParams",
   "referenced_type" : "_ZTI15TfLiteAddParams",
   "self_type" : "_ZTI15TfLiteAddParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "re",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "im",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI15TfLiteComplex64",
   "name" : "TfLiteComplex64",
   "referenced_type" : "_ZTI15TfLiteComplex64",
   "self_type" : "_ZTI15TfLiteComplex64",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    }
   ],
   "linker_set_key" : "_ZTI15TfLiteDivParams",
   "name" : "TfLiteDivParams",
   "referenced_type" : "_ZTI15TfLiteDivParams",
   "self_type" : "_ZTI15TfLiteDivParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    }
   ],
   "linker_set_key" : "_ZTI15TfLiteMulParams",
   "name" : "TfLiteMulParams",
   "referenced_type" : "_ZTI15TfLiteMulParams",
   "self_type" : "_ZTI15TfLiteMulParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "placeholder",
     "referenced_type" : "_ZTI22EmptyStructPlaceholder"
    }
   ],
   "linker_set_key" : "_ZTI15TfLitePadParams",
   "name" : "TfLitePadParams",
   "referenced_type" : "_ZTI15TfLitePadParams",
   "self_type" : "_ZTI15TfLitePadParams",
   "size" : 1,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "asymmetric_quantize_inputs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI15TfLiteRNNParams",
   "name" : "TfLiteRNNParams",
   "referenced_type" : "_ZTI15TfLiteRNNParams",
   "self_type" : "_ZTI15TfLiteRNNParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "pot_scale_int16",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI15TfLiteSubParams",
   "name" : "TfLiteSubParams",
   "referenced_type" : "_ZTI15TfLiteSubParams",
   "self_type" : "_ZTI15TfLiteSubParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "in_data_type",
     "referenced_type" : "_ZTI10TfLiteType"
    },
    {
     "field_name" : "out_data_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTI10TfLiteType"
    }
   ],
   "linker_set_key" : "_ZTI16TfLiteCastParams",
   "name" : "TfLiteCastParams",
   "referenced_type" : "_ZTI16TfLiteCastParams",
   "self_type" : "_ZTI16TfLiteCastParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "re",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "im",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTI16TfLiteComplex128",
   "name" : "TfLiteComplex128",
   "referenced_type" : "_ZTI16TfLiteComplex128",
   "self_type" : "_ZTI16TfLiteComplex128",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTI13TfLitePadding"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "activation",
     "field_offset" : 96,
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "dilation_width_factor",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dilation_height_factor",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI16TfLiteConvParams",
   "name" : "TfLiteConvParams",
   "referenced_type" : "_ZTI16TfLiteConvParams",
   "self_type" : "_ZTI16TfLiteConvParams",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTI14TfLitePtrUnion"
    },
    {
     "field_name" : "dims",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI10TfLiteType"
    }
   ],
   "linker_set_key" : "_ZTI16TfLiteEvalTensor",
   "name" : "TfLiteEvalTensor",
   "referenced_type" : "_ZTI16TfLiteEvalTensor",
   "self_type" : "_ZTI16TfLiteEvalTensor",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI16TfLiteFloatArray",
   "name" : "TfLiteFloatArray",
   "referenced_type" : "_ZTI16TfLiteFloatArray",
   "self_type" : "_ZTI16TfLiteFloatArray",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "cell_clip",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "proj_clip",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "kernel_type",
     "field_offset" : 96,
     "referenced_type" : "_ZTI20TfLiteLSTMKernelType"
    },
    {
     "field_name" : "asymmetric_quantize_inputs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI16TfLiteLSTMParams",
   "name" : "TfLiteLSTMParams",
   "referenced_type" : "_ZTI16TfLiteLSTMParams",
   "self_type" : "_ZTI16TfLiteLSTMParams",
   "size" : 20,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "values_count",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "axis",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI16TfLitePackParams",
   "name" : "TfLitePackParams",
   "referenced_type" : "_ZTI16TfLitePackParams",
   "self_type" : "_ZTI16TfLitePackParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTI13TfLitePadding"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "filter_width",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "filter_height",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "activation",
     "field_offset" : 160,
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "computed",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN16TfLitePoolParamsUt_E"
    }
   ],
   "linker_set_key" : "_ZTI16TfLitePoolParams",
   "name" : "TfLitePoolParams",
   "referenced_type" : "_ZTI16TfLitePoolParams",
   "self_type" : "_ZTI16TfLitePoolParams",
   "size" : 40,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "placeholder",
     "referenced_type" : "_ZTI22EmptyStructPlaceholder"
    }
   ],
   "linker_set_key" : "_ZTI16TfLiteRankParams",
   "name" : "TfLiteRankParams",
   "referenced_type" : "_ZTI16TfLiteRankParams",
   "self_type" : "_ZTI16TfLiteRankParams",
   "size" : 1,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rank",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "activation",
     "field_offset" : 32,
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "asymmetric_quantize_inputs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI16TfLiteSVDFParams",
   "name" : "TfLiteSVDFParams",
   "referenced_type" : "_ZTI16TfLiteSVDFParams",
   "self_type" : "_ZTI16TfLiteSVDFParams",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "placeholder",
     "referenced_type" : "_ZTI22EmptyStructPlaceholder"
    }
   ],
   "linker_set_key" : "_ZTI17TfLitePadV2Params",
   "name" : "TfLitePadV2Params",
   "referenced_type" : "_ZTI17TfLitePadV2Params",
   "self_type" : "_ZTI17TfLitePadV2Params",
   "size" : 1,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "out_type",
     "referenced_type" : "_ZTI10TfLiteType"
    }
   ],
   "linker_set_key" : "_ZTI17TfLiteShapeParams",
   "name" : "TfLiteShapeParams",
   "referenced_type" : "_ZTI17TfLiteShapeParams",
   "self_type" : "_ZTI17TfLiteShapeParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_splits",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI17TfLiteSplitParams",
   "name" : "TfLiteSplitParams",
   "referenced_type" : "_ZTI17TfLiteSplitParams",
   "self_type" : "_ZTI17TfLiteSplitParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cond_subgraph_index",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "body_subgraph_index",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI17TfLiteWhileParams",
   "name" : "TfLiteWhileParams",
   "referenced_type" : "_ZTI17TfLiteWhileParams",
   "self_type" : "_ZTI17TfLiteWhileParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA8_i"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "output_type",
     "referenced_type" : "_ZTI10TfLiteType"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteArgMaxParams",
   "name" : "TfLiteArgMaxParams",
   "referenced_type" : "_ZTI18TfLiteArgMaxParams",
   "self_type" : "_ZTI18TfLiteArgMaxParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "output_type",
     "referenced_type" : "_ZTI10TfLiteType"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteArgMinParams",
   "name" : "TfLiteArgMinParams",
   "referenced_type" : "_ZTI18TfLiteArgMinParams",
   "self_type" : "_ZTI18TfLiteArgMinParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTI13TfLitePadding"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_depth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dilation_width_factor",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dilation_height_factor",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dilation_depth_factor",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "activation",
     "field_offset" : 224,
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteConv3DParams",
   "name" : "TfLiteConv3DParams",
   "referenced_type" : "_ZTI18TfLiteConv3DParams",
   "self_type" : "_ZTI18TfLiteConv3DParams",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "exclusive",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "reverse",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteCumsumParams",
   "name" : "TfLiteCumsumParams",
   "referenced_type" : "_ZTI18TfLiteCumsumParams",
   "self_type" : "_ZTI18TfLiteCumsumParams",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "axis",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteGatherParams",
   "name" : "TfLiteGatherParams",
   "referenced_type" : "_ZTI18TfLiteGatherParams",
   "self_type" : "_ZTI18TfLiteGatherParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteL2NormParams",
   "name" : "TfLiteL2NormParams",
   "referenced_type" : "_ZTI18TfLiteL2NormParams",
   "self_type" : "_ZTI18TfLiteL2NormParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "axis",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteOneHotParams",
   "name" : "TfLiteOneHotParams",
   "referenced_type" : "_ZTI18TfLiteOneHotParams",
   "self_type" : "_ZTI18TfLiteOneHotParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI22TfLiteQuantizationType"
    },
    {
     "field_name" : "params",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteQuantization",
   "name" : "TfLiteQuantization",
   "referenced_type" : "_ZTI18TfLiteQuantization",
   "self_type" : "_ZTI18TfLiteQuantization",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "_ZTIPFPvP13TfLiteContextPKcjE"
    },
    {
     "field_name" : "free",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvP13TfLiteContextPvE"
    },
    {
     "field_name" : "prepare",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP10TfLiteNodeE"
    },
    {
     "field_name" : "invoke",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextP10TfLiteNodeE"
    },
    {
     "field_name" : "profiling_string",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFPKcPK13TfLiteContextPK10TfLiteNodeE"
    },
    {
     "field_name" : "builtin_code",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "custom_name",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "version",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteRegistration",
   "name" : "TfLiteRegistration",
   "referenced_type" : "_ZTI18TfLiteRegistration",
   "self_type" : "_ZTI18TfLiteRegistration",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_splits",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteSplitVParams",
   "name" : "TfLiteSplitVParams",
   "referenced_type" : "_ZTI18TfLiteSplitVParams",
   "self_type" : "_ZTI18TfLiteSplitVParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index_out_type",
     "referenced_type" : "_ZTI10TfLiteType"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteUniqueParams",
   "name" : "TfLiteUniqueParams",
   "referenced_type" : "_ZTI18TfLiteUniqueParams",
   "self_type" : "_ZTI18TfLiteUniqueParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "axis",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18TfLiteUnpackParams",
   "name" : "TfLiteUnpackParams",
   "referenced_type" : "_ZTI18TfLiteUnpackParams",
   "self_type" : "_ZTI18TfLiteUnpackParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "width_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height_offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI19TfLitePaddingValues",
   "name" : "TfLitePaddingValues",
   "referenced_type" : "_ZTI19TfLitePaddingValues",
   "self_type" : "_ZTI19TfLitePaddingValues",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "keep_dims",
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI19TfLiteReducerParams",
   "name" : "TfLiteReducerParams",
   "referenced_type" : "_ZTI19TfLiteReducerParams",
   "self_type" : "_ZTI19TfLiteReducerParams",
   "size" : 1,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shape",
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "num_dimensions",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI19TfLiteReshapeParams",
   "name" : "TfLiteReshapeParams",
   "referenced_type" : "_ZTI19TfLiteReshapeParams",
   "self_type" : "_ZTI19TfLiteReshapeParams",
   "size" : 36,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "beta",
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI19TfLiteSoftmaxParams",
   "name" : "TfLiteSoftmaxParams",
   "referenced_type" : "_ZTI19TfLiteSoftmaxParams",
   "self_type" : "_ZTI19TfLiteSoftmaxParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "squeeze_dims",
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "num_squeeze_dims",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI19TfLiteSqueezeParams",
   "name" : "TfLiteSqueezeParams",
   "referenced_type" : "_ZTI19TfLiteSqueezeParams",
   "self_type" : "_ZTI19TfLiteSqueezeParams",
   "size" : 36,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "_ZTI19__pthread_cleanup_t",
   "self_type" : "_ZTI19__pthread_cleanup_t",
   "size" : 12,
   "source_file" : "bionic/libc/include/pthread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init_subgraph_index",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20TfLiteCallOnceParams",
   "name" : "TfLiteCallOnceParams",
   "referenced_type" : "_ZTI20TfLiteCallOnceParams",
   "self_type" : "_ZTI20TfLiteCallOnceParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "delegate",
     "referenced_type" : "_ZTIP14TfLiteDelegate"
    },
    {
     "field_name" : "nodes_to_replace",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "input_tensors",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "output_tensors",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    }
   ],
   "linker_set_key" : "_ZTI20TfLiteDelegateParams",
   "name" : "TfLiteDelegateParams",
   "referenced_type" : "_ZTI20TfLiteDelegateParams",
   "self_type" : "_ZTI20TfLiteDelegateParams",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ngram_size",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "max_skip_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "include_all_ngrams",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI20TfLiteSkipGramParams",
   "name" : "TfLiteSkipGramParams",
   "referenced_type" : "_ZTI20TfLiteSkipGramParams",
   "self_type" : "_ZTI20TfLiteSkipGramParams",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI25TfLiteExternalContextType"
    },
    {
     "field_name" : "Refresh",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPF12TfLiteStatusP13TfLiteContextE"
    }
   ],
   "linker_set_key" : "_ZTI21TfLiteExternalContext",
   "name" : "TfLiteExternalContext",
   "referenced_type" : "_ZTI21TfLiteExternalContext",
   "self_type" : "_ZTI21TfLiteExternalContext",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "min",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "max",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "num_bits",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "narrow_range",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI21TfLiteFakeQuantParams",
   "name" : "TfLiteFakeQuantParams",
   "referenced_type" : "_ZTI21TfLiteFakeQuantParams",
   "self_type" : "_ZTI21TfLiteFakeQuantParams",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alpha",
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI21TfLiteLeakyReluParams",
   "name" : "TfLiteLeakyReluParams",
   "referenced_type" : "_ZTI21TfLiteLeakyReluParams",
   "self_type" : "_ZTI21TfLiteLeakyReluParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "placeholder",
     "referenced_type" : "_ZTI22EmptyStructPlaceholder"
    }
   ],
   "linker_set_key" : "_ZTI21TfLiteTransposeParams",
   "name" : "TfLiteTransposeParams",
   "referenced_type" : "_ZTI21TfLiteTransposeParams",
   "self_type" : "_ZTI21TfLiteTransposeParams",
   "size" : 1,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "dummy",
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI22EmptyStructPlaceholder",
   "name" : "EmptyStructPlaceholder",
   "referenced_type" : "_ZTI22EmptyStructPlaceholder",
   "self_type" : "_ZTI22EmptyStructPlaceholder",
   "size" : 1,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI22TfLiteCustomAllocation",
   "name" : "TfLiteCustomAllocation",
   "referenced_type" : "_ZTI22TfLiteCustomAllocation",
   "self_type" : "_ZTI22TfLiteCustomAllocation",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "placeholder",
     "referenced_type" : "_ZTI22EmptyStructPlaceholder"
    }
   ],
   "linker_set_key" : "_ZTI22TfLiteMatrixDiagParams",
   "name" : "TfLiteMatrixDiagParams",
   "referenced_type" : "_ZTI22TfLiteMatrixDiagParams",
   "self_type" : "_ZTI22TfLiteMatrixDiagParams",
   "size" : 1,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "adj_x",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "adj_y",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "asymmetric_quantize_inputs",
     "field_offset" : 16,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI23TfLiteBatchMatMulParams",
   "name" : "TfLiteBatchMatMulParams",
   "referenced_type" : "_ZTI23TfLiteBatchMatMulParams",
   "self_type" : "_ZTI23TfLiteBatchMatMulParams",
   "size" : 3,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19TfLiteDimensionType"
    },
    {
     "field_name" : "dense_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "array_segments",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "array_indices",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    }
   ],
   "linker_set_key" : "_ZTI23TfLiteDimensionMetadata",
   "name" : "TfLiteDimensionMetadata",
   "referenced_type" : "_ZTI23TfLiteDimensionMetadata",
   "self_type" : "_ZTI23TfLiteDimensionMetadata",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "time_major",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "activation",
     "field_offset" : 32,
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "asymmetric_quantize_inputs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI23TfLiteSequenceRNNParams",
   "name" : "TfLiteSequenceRNNParams",
   "referenced_type" : "_ZTI23TfLiteSequenceRNNParams",
   "self_type" : "_ZTI23TfLiteSequenceRNNParams",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "scale",
     "referenced_type" : "_ZTIP16TfLiteFloatArray"
    },
    {
     "field_name" : "zero_point",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP14TfLiteIntArray"
    },
    {
     "field_name" : "quantized_dimension",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI24TfLiteAffineQuantization",
   "name" : "TfLiteAffineQuantization",
   "referenced_type" : "_ZTI24TfLiteAffineQuantization",
   "self_type" : "_ZTI24TfLiteAffineQuantization",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/c/common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "block_size",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI24TfLiteDepthToSpaceParams",
   "name" : "TfLiteDepthToSpaceParams",
   "referenced_type" : "_ZTI24TfLiteDepthToSpaceParams",
   "self_type" : "_ZTI24TfLiteDepthToSpaceParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "scale",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "zero_point",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI24TfLiteQuantizationParams",
   "name" : "TfLiteQuantizationParams",
   "referenced_type" : "_ZTI24TfLiteQuantizationParams",
   "self_type" : "_ZTI24TfLiteQuantizationParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/c_api_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "block_size",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI24TfLiteSpaceToDepthParams",
   "name" : "TfLiteSpaceToDepthParams",
   "referenced_type" : "_ZTI24TfLiteSpaceToDepthParams",
   "self_type" : "_ZTI24TfLiteSpaceToDepthParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "begin_mask",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "end_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ellipsis_mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "new_axis_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shrink_axis_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI24TfLiteStridedSliceParams",
   "name" : "TfLiteStridedSliceParams",
   "referenced_type" : "_ZTI24TfLiteStridedSliceParams",
   "self_type" : "_ZTI24TfLiteStridedSliceParams",
   "size" : 20,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "axis",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "activation",
     "field_offset" : 32,
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    }
   ],
   "linker_set_key" : "_ZTI25TfLiteConcatenationParams",
   "name" : "TfLiteConcatenationParams",
   "referenced_type" : "_ZTI25TfLiteConcatenationParams",
   "self_type" : "_ZTI25TfLiteConcatenationParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTI13TfLitePadding"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "depth_multiplier",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "activation",
     "field_offset" : 128,
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "dilation_width_factor",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dilation_height_factor",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI25TfLiteDepthwiseConvParams",
   "name" : "TfLiteDepthwiseConvParams",
   "referenced_type" : "_ZTI25TfLiteDepthwiseConvParams",
   "self_type" : "_ZTI25TfLiteDepthwiseConvParams",
   "size" : 28,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI23TfLiteLSHProjectionType"
    }
   ],
   "linker_set_key" : "_ZTI25TfLiteLSHProjectionParams",
   "name" : "TfLiteLSHProjectionParams",
   "referenced_type" : "_ZTI25TfLiteLSHProjectionParams",
   "self_type" : "_ZTI25TfLiteLSHProjectionParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "placeholder",
     "referenced_type" : "_ZTI22EmptyStructPlaceholder"
    }
   ],
   "linker_set_key" : "_ZTI25TfLiteMatrixSetDiagParams",
   "name" : "TfLiteMatrixSetDiagParams",
   "referenced_type" : "_ZTI25TfLiteMatrixSetDiagParams",
   "self_type" : "_ZTI25TfLiteMatrixSetDiagParams",
   "size" : 1,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "_ZTI23TfLiteMirrorPaddingMode"
    }
   ],
   "linker_set_key" : "_ZTI25TfLiteMirrorPaddingParams",
   "name" : "TfLiteMirrorPaddingParams",
   "referenced_type" : "_ZTI25TfLiteMirrorPaddingParams",
   "self_type" : "_ZTI25TfLiteMirrorPaddingParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "validate_indices",
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI25TfLiteSparseToDenseParams",
   "name" : "TfLiteSparseToDenseParams",
   "referenced_type" : "_ZTI25TfLiteSparseToDenseParams",
   "self_type" : "_ZTI25TfLiteSparseToDenseParams",
   "size" : 1,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTI13TfLitePadding"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI25TfLiteTransposeConvParams",
   "name" : "TfLiteTransposeConvParams",
   "referenced_type" : "_ZTI25TfLiteTransposeConvParams",
   "self_type" : "_ZTI25TfLiteTransposeConvParams",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "placeholder",
     "referenced_type" : "_ZTI22EmptyStructPlaceholder"
    }
   ],
   "linker_set_key" : "_ZTI26TfLiteBatchToSpaceNDParams",
   "name" : "TfLiteBatchToSpaceNDParams",
   "referenced_type" : "_ZTI26TfLiteBatchToSpaceNDParams",
   "self_type" : "_ZTI26TfLiteBatchToSpaceNDParams",
   "size" : 1,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "weights_format",
     "field_offset" : 32,
     "referenced_type" : "_ZTI33TfLiteFullyConnectedWeightsFormat"
    },
    {
     "field_name" : "keep_num_dims",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "asymmetric_quantize_inputs",
     "field_offset" : 72,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI26TfLiteFullyConnectedParams",
   "name" : "TfLiteFullyConnectedParams",
   "referenced_type" : "_ZTI26TfLiteFullyConnectedParams",
   "self_type" : "_ZTI26TfLiteFullyConnectedParams",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "align_corners",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "half_pixel_centers",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI26TfLiteResizeBilinearParams",
   "name" : "TfLiteResizeBilinearParams",
   "referenced_type" : "_ZTI26TfLiteResizeBilinearParams",
   "self_type" : "_ZTI26TfLiteResizeBilinearParams",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "placeholder",
     "referenced_type" : "_ZTI22EmptyStructPlaceholder"
    }
   ],
   "linker_set_key" : "_ZTI26TfLiteSpaceToBatchNDParams",
   "name" : "TfLiteSpaceToBatchNDParams",
   "referenced_type" : "_ZTI26TfLiteSpaceToBatchNDParams",
   "self_type" : "_ZTI26TfLiteSpaceToBatchNDParams",
   "size" : 1,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "seq_dim",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batch_dim",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI27TfLiteReverseSequenceParams",
   "name" : "TfLiteReverseSequenceParams",
   "referenced_type" : "_ZTI27TfLiteReverseSequenceParams",
   "self_type" : "_ZTI27TfLiteReverseSequenceParams",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "radius",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bias",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "alpha",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "beta",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI29TfLiteLocalResponseNormParams",
   "name" : "TfLiteLocalResponseNormParams",
   "referenced_type" : "_ZTI29TfLiteLocalResponseNormParams",
   "self_type" : "_ZTI29TfLiteLocalResponseNormParams",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 44,
   "source_file" : "bionic/libc/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "combiner",
     "referenced_type" : "_ZTI18TfLiteCombinerType"
    }
   ],
   "linker_set_key" : "_ZTI33TfLiteEmbeddingLookupSparseParams",
   "name" : "TfLiteEmbeddingLookupSparseParams",
   "referenced_type" : "_ZTI33TfLiteEmbeddingLookupSparseParams",
   "self_type" : "_ZTI33TfLiteEmbeddingLookupSparseParams",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "align_corners",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "half_pixel_centers",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI33TfLiteResizeNearestNeighborParams",
   "name" : "TfLiteResizeNearestNeighborParams",
   "referenced_type" : "_ZTI33TfLiteResizeNearestNeighborParams",
   "self_type" : "_ZTI33TfLiteResizeNearestNeighborParams",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "time_major",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "activation",
     "field_offset" : 32,
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "merge_outputs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "asymmetric_quantize_inputs",
     "field_offset" : 72,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI36TfLiteBidirectionalSequenceRNNParams",
   "name" : "TfLiteBidirectionalSequenceRNNParams",
   "referenced_type" : "_ZTI36TfLiteBidirectionalSequenceRNNParams",
   "self_type" : "_ZTI36TfLiteBidirectionalSequenceRNNParams",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "cell_clip",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "proj_clip",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "merge_outputs",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "time_major",
     "field_offset" : 104,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "asymmetric_quantize_inputs",
     "field_offset" : 112,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI37TfLiteBidirectionalSequenceLSTMParams",
   "name" : "TfLiteBidirectionalSequenceLSTMParams",
   "referenced_type" : "_ZTI37TfLiteBidirectionalSequenceLSTMParams",
   "self_type" : "_ZTI37TfLiteBidirectionalSequenceLSTMParams",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTI21TfLiteFusedActivation"
    },
    {
     "field_name" : "cell_clip",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "proj_clip",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "time_major",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "asymmetric_quantize_inputs",
     "field_offset" : 104,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI38TfLiteUnidirectionalSequenceLSTMParams",
   "name" : "TfLiteUnidirectionalSequenceLSTMParams",
   "referenced_type" : "_ZTI38TfLiteUnidirectionalSequenceLSTMParams",
   "self_type" : "_ZTI38TfLiteUnidirectionalSequenceLSTMParams",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTI9user_regs"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP9user_regs"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI11user_fpregs"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIP11user_fpregs"
    }
   ],
   "linker_set_key" : "_ZTI4user",
   "name" : "user",
   "referenced_type" : "_ZTI4user",
   "self_type" : "_ZTI4user",
   "size" : 296,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "decimal_point",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "grouping",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_curr_symbol",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "currency_symbol",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_decimal_point",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_thousands_sep",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_grouping",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "positive_sign",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "negative_sign",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_frac_digits",
     "field_offset" : 320,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "frac_digits",
     "field_offset" : 328,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_cs_precedes",
     "field_offset" : 336,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sep_by_space",
     "field_offset" : 344,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_cs_precedes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sep_by_space",
     "field_offset" : 360,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sign_posn",
     "field_offset" : 368,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sign_posn",
     "field_offset" : 376,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_cs_precedes",
     "field_offset" : 384,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sep_by_space",
     "field_offset" : 392,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_cs_precedes",
     "field_offset" : 400,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sep_by_space",
     "field_offset" : 408,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sign_posn",
     "field_offset" : 416,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sign_posn",
     "field_offset" : 424,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI5lconv",
   "name" : "lconv",
   "referenced_type" : "_ZTI5lconv",
   "self_type" : "_ZTI5lconv",
   "size" : 56,
   "source_file" : "bionic/libc/include/locale.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 40,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10sigcontext"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIA128_m"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 744,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA32_y"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "_ZTI8user_vfp",
   "self_type" : "_ZTI8user_vfp",
   "size" : 264,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "_ZTI9cpu_set_t",
   "self_type" : "_ZTI9cpu_set_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "_ZTIA18_m"
    }
   ],
   "linker_set_key" : "_ZTI9user_regs",
   "name" : "user_regs",
   "referenced_type" : "_ZTI9user_regs",
   "self_type" : "_ZTI9user_regs",
   "size" : 72,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt0_E",
   "self_type" : "_ZTIN10__sifieldsUt0_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt1_E",
   "self_type" : "_ZTIN10__sifieldsUt1_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt2_E",
   "self_type" : "_ZTIN10__sifieldsUt2_E",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_E",
   "self_type" : "_ZTIN10__sifieldsUt3_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt4_E",
   "self_type" : "_ZTIN10__sifieldsUt4_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt5_E",
   "self_type" : "_ZTIN10__sifieldsUt5_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:100:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN11user_fpregs6fp_regE",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "_ZTIN11user_fpregs6fp_regE",
   "self_type" : "_ZTIN11user_fpregs6fp_regE",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTI19TfLitePaddingValues"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN16TfLitePoolParamsUt_E",
   "name" : "TfLitePoolParams::(anonymous struct at external/tensorflow/tensorflow/lite/c/builtin_op_data.h:108:3)",
   "referenced_type" : "_ZTIN16TfLitePoolParamsUt_E",
   "self_type" : "_ZTIN16TfLitePoolParamsUt_E",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/c/builtin_op_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN18__kernel_sigactionUt_E",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:68:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN18__kernel_sigactionUt_E",
   "self_type" : "_ZTIN18__kernel_sigactionUt_E",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding_type",
     "referenced_type" : "_ZTIN6tflite11PaddingTypeE"
    },
    {
     "field_name" : "padding_values",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN6tflite13PaddingValuesE"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 80,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 96,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "dilation_width_factor",
     "field_offset" : 112,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "dilation_height_factor",
     "field_offset" : 128,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "input_offset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "weights_offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 384,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 416,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10ConvParamsE",
   "name" : "tflite::ConvParams",
   "referenced_type" : "_ZTIN6tflite10ConvParamsE",
   "self_type" : "_ZTIN6tflite10ConvParamsE",
   "size" : 56,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "axis_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "axis",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA4_s"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10MeanParamsE",
   "name" : "tflite::MeanParams",
   "referenced_type" : "_ZTIN6tflite10MeanParamsE",
   "self_type" : "_ZTIN6tflite10MeanParamsE",
   "size" : 10,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "axis",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "input_zeropoint",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKi"
    },
    {
     "field_name" : "input_scale",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKf"
    },
    {
     "field_name" : "inputs_count",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "output_zeropoint",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_scale",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10PackParamsE",
   "name" : "tflite::PackParams",
   "referenced_type" : "_ZTIN6tflite10PackParamsE",
   "self_type" : "_ZTIN6tflite10PackParamsE",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation",
     "referenced_type" : "_ZTIN6tflite27FusedActivationFunctionTypeE"
    },
    {
     "field_name" : "padding_type",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN6tflite11PaddingTypeE"
    },
    {
     "field_name" : "padding_values",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN6tflite13PaddingValuesE"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "filter_height",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "filter_width",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 320,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10PoolParamsE",
   "name" : "tflite::PoolParams",
   "referenced_type" : "_ZTIN6tflite10PoolParamsE",
   "self_type" : "_ZTIN6tflite10PoolParamsE",
   "size" : 44,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN6tflite16ActivationParamsE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "input_offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10ReluParamsE",
   "name" : "tflite::ReluParams",
   "referenced_type" : "_ZTIN6tflite10ReluParamsE",
   "self_type" : "_ZTIN6tflite10ReluParamsE",
   "size" : 28,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_zero_point",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_range_radius",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_multiplier",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_left_shift",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite10TanhParamsE",
   "name" : "tflite::TanhParams",
   "referenced_type" : "_ZTIN6tflite10TanhParamsE",
   "self_type" : "_ZTIN6tflite10TanhParamsE",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_offset",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "alpha_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier_1",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift_1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier_2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift_2",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite11PreluParamsE",
   "name" : "tflite::PreluParams",
   "referenced_type" : "_ZTIN6tflite11PreluParamsE",
   "self_type" : "_ZTIN6tflite11PreluParamsE",
   "size" : 28,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "begin_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "begin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA5_i"
    },
    {
     "field_name" : "size_count",
     "field_offset" : 192,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "size",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA5_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite11SliceParamsE",
   "name" : "tflite::SliceParams",
   "referenced_type" : "_ZTIN6tflite11SliceParamsE",
   "self_type" : "_ZTIN6tflite11SliceParamsE",
   "size" : 48,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "num_split",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "axis",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite11SplitParamsE",
   "name" : "tflite::SplitParams",
   "referenced_type" : "_ZTIN6tflite11SplitParamsE",
   "self_type" : "_ZTIN6tflite11SplitParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding_values",
     "referenced_type" : "_ZTIN6tflite15Padding3DValuesE"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride_depth",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dilation_width",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dilation_height",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dilation_depth",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 320,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite12Conv3DParamsE",
   "name" : "tflite::Conv3DParams",
   "referenced_type" : "_ZTIN6tflite12Conv3DParamsE",
   "self_type" : "_ZTIN6tflite12Conv3DParamsE",
   "size" : 44,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "axis",
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite12GatherParamsE",
   "name" : "tflite::GatherParams",
   "referenced_type" : "_ZTIN6tflite12GatherParamsE",
   "self_type" : "_ZTIN6tflite12GatherParamsE",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "size_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN6tflite12RuntimeShapeUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite12RuntimeShapeE",
   "name" : "tflite::RuntimeShape",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6tflite12RuntimeShapeE",
   "self_type" : "_ZTIN6tflite12RuntimeShapeE",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dims_",
     "referenced_type" : "_ZTIA5_i"
    },
    {
     "field_name" : "dims_pointer_",
     "referenced_type" : "_ZTIPi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN6tflite12RuntimeShapeUt_E",
   "name" : "tflite::RuntimeShape::(anonymous union at external/tensorflow/tensorflow/lite/kernels/internal/types.h:319:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN6tflite12RuntimeShapeUt_E",
   "self_type" : "_ZTIN6tflite12RuntimeShapeUt_E",
   "size" : 20,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "num_split",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "axis",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite12UnpackParamsE",
   "name" : "tflite::UnpackParams",
   "referenced_type" : "_ZTIN6tflite12UnpackParamsE",
   "self_type" : "_ZTIN6tflite12UnpackParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "height",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "width_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "height_offset",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite13PaddingValuesE",
   "name" : "tflite::PaddingValues",
   "referenced_type" : "_ZTIN6tflite13PaddingValuesE",
   "self_type" : "_ZTIN6tflite13PaddingValuesE",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shape_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "shape",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite13ReshapeParamsE",
   "name" : "tflite::ReshapeParams",
   "referenced_type" : "_ZTIN6tflite13ReshapeParamsE",
   "self_type" : "_ZTIN6tflite13ReshapeParamsE",
   "size" : 20,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "beta",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "input_multiplier",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_left_shift",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reverse_scaling_divisor",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reverse_scaling_right_shift",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "diff_min",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "zero_point",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "scale",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "table",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPf"
    },
    {
     "field_name" : "exp_lut",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPs"
    },
    {
     "field_name" : "one_over_one_plus_x_lut",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPs"
    },
    {
     "field_name" : "uint8_table1",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "uint8_table2",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPh"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite13SoftmaxParamsE",
   "name" : "tflite::SoftmaxParams",
   "referenced_type" : "_ZTIN6tflite13SoftmaxParamsE",
   "self_type" : "_ZTIN6tflite13SoftmaxParamsE",
   "size" : 56,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "squeeze_dims_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "squeeze_dims",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite13SqueezeParamsE",
   "name" : "tflite::SqueezeParams",
   "referenced_type" : "_ZTIN6tflite13SqueezeParamsE",
   "self_type" : "_ZTIN6tflite13SqueezeParamsE",
   "size" : 20,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_zero_point",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_range_radius",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_multiplier",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input_left_shift",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite14LogisticParamsE",
   "name" : "tflite::LogisticParams",
   "referenced_type" : "_ZTIN6tflite14LogisticParamsE",
   "self_type" : "_ZTIN6tflite14LogisticParamsE",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "weights_zero_point",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "accum_multiplier",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "accum_shift",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "state_integer_bits",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite14LstmCellParamsE",
   "name" : "tflite::LstmCellParams",
   "referenced_type" : "_ZTIN6tflite14LstmCellParamsE",
   "self_type" : "_ZTIN6tflite14LstmCellParamsE",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding_type",
     "referenced_type" : "_ZTIN6tflite11PaddingTypeE"
    },
    {
     "field_name" : "padding_values",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN6tflite13PaddingValuesE"
    },
    {
     "field_name" : "stride_width",
     "field_offset" : 80,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "stride_height",
     "field_offset" : 96,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "dilation_width_factor",
     "field_offset" : 112,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "dilation_height_factor",
     "field_offset" : 128,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "depth_multiplier",
     "field_offset" : 144,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "input_offset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "weights_offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 384,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 416,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "output_multiplier_per_channel",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPKi"
    },
    {
     "field_name" : "output_shift_per_channel",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPKi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15DepthwiseParamsE",
   "name" : "tflite::DepthwiseParams",
   "referenced_type" : "_ZTIN6tflite15DepthwiseParamsE",
   "self_type" : "_ZTIN6tflite15DepthwiseParamsE",
   "size" : 64,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "minmax",
     "referenced_type" : "_ZTIN6tflite6MinMaxE"
    },
    {
     "field_name" : "num_bits",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15FakeQuantParamsE",
   "name" : "tflite::FakeQuantParams",
   "referenced_type" : "_ZTIN6tflite15FakeQuantParamsE",
   "self_type" : "_ZTIN6tflite15FakeQuantParamsE",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_zero_point",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "output_zero_point",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "reluish_multiplier_fixedpoint_int16",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "reluish_multiplier_exponent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier_fixedpoint_int16",
     "field_offset" : 96,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "output_multiplier_exponent",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15HardSwishParamsE",
   "name" : "tflite::HardSwishParams",
   "referenced_type" : "_ZTIN6tflite15HardSwishParamsE",
   "self_type" : "_ZTIN6tflite15HardSwishParamsE",
   "size" : 20,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alpha",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "input_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier_alpha",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift_alpha",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier_identity",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift_identity",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15LeakyReluParamsE",
   "name" : "tflite::LeakyReluParams",
   "referenced_type" : "_ZTIN6tflite15LeakyReluParamsE",
   "self_type" : "_ZTIN6tflite15LeakyReluParamsE",
   "size" : 28,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "height",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "depth",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "width_offset",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "height_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "depth_offset",
     "field_offset" : 80,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15Padding3DValuesE",
   "name" : "tflite::Padding3DValues",
   "referenced_type" : "_ZTIN6tflite15Padding3DValuesE",
   "self_type" : "_ZTIN6tflite15Padding3DValuesE",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "perm_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "perm",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA5_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite15TransposeParamsE",
   "name" : "tflite::TransposeParams",
   "referenced_type" : "_ZTIN6tflite15TransposeParamsE",
   "self_type" : "_ZTIN6tflite15TransposeParamsE",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "activation_type",
     "referenced_type" : "_ZTIN6tflite27FusedActivationFunctionTypeE"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite16ActivationParamsE",
   "name" : "tflite::ActivationParams",
   "referenced_type" : "_ZTIN6tflite16ActivationParamsE",
   "self_type" : "_ZTIN6tflite16ActivationParamsE",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "broadcast_category",
     "referenced_type" : "_ZTIN6tflite23BroadcastableOpCategoryE"
    },
    {
     "field_name" : "input1_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "left_shift",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input1_multiplier",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input1_shift",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_multiplier",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_shift",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 416,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 448,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "int64_activation_min",
     "field_offset" : 512,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "int64_activation_max",
     "field_offset" : 576,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "broadcast_shape",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA5_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite16ArithmeticParamsE",
   "name" : "tflite::ArithmeticParams",
   "referenced_type" : "_ZTIN6tflite16ArithmeticParamsE",
   "self_type" : "_ZTIN6tflite16ArithmeticParamsE",
   "size" : 104,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left_shift",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input1_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input1_multiplier",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input1_shift",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_multiplier",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input2_shift",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "is_broadcast",
     "field_offset" : 224,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite16ComparisonParamsE",
   "name" : "tflite::ComparisonParams",
   "referenced_type" : "_ZTIN6tflite16ComparisonParamsE",
   "self_type" : "_ZTIN6tflite16ComparisonParamsE",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "block_size",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite18DepthToSpaceParamsE",
   "name" : "tflite::DepthToSpaceParams",
   "referenced_type" : "_ZTIN6tflite18DepthToSpaceParamsE",
   "self_type" : "_ZTIN6tflite18DepthToSpaceParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "zero_point",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "scale",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite18QuantizationParamsE",
   "name" : "tflite::QuantizationParams",
   "referenced_type" : "_ZTIN6tflite18QuantizationParamsE",
   "self_type" : "_ZTIN6tflite18QuantizationParamsE",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "output_offset",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite18SpaceToBatchParamsE",
   "name" : "tflite::SpaceToBatchParams",
   "referenced_type" : "_ZTIN6tflite18SpaceToBatchParamsE",
   "self_type" : "_ZTIN6tflite18SpaceToBatchParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "block_size",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite18SpaceToDepthParamsE",
   "name" : "tflite::SpaceToDepthParams",
   "referenced_type" : "_ZTIN6tflite18SpaceToDepthParamsE",
   "self_type" : "_ZTIN6tflite18SpaceToDepthParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_indices_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "start_indices",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA5_i"
    },
    {
     "field_name" : "stop_indices_count",
     "field_offset" : 192,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "stop_indices",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA5_i"
    },
    {
     "field_name" : "strides_count",
     "field_offset" : 384,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "strides",
     "field_offset" : 416,
     "referenced_type" : "_ZTIA5_i"
    },
    {
     "field_name" : "begin_mask",
     "field_offset" : 576,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "ellipsis_mask",
     "field_offset" : 592,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "end_mask",
     "field_offset" : 608,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "new_axis_mask",
     "field_offset" : 624,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "shrink_axis_mask",
     "field_offset" : 640,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite18StridedSliceParamsE",
   "name" : "tflite::StridedSliceParams",
   "referenced_type" : "_ZTIN6tflite18StridedSliceParamsE",
   "self_type" : "_ZTIN6tflite18StridedSliceParamsE",
   "size" : 84,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "axis",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "input_zeropoint",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKi"
    },
    {
     "field_name" : "input_scale",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKf"
    },
    {
     "field_name" : "inputs_count",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "output_zeropoint",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_scale",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite19ConcatenationParamsE",
   "name" : "tflite::ConcatenationParams",
   "referenced_type" : "_ZTIN6tflite19ConcatenationParamsE",
   "self_type" : "_ZTIN6tflite19ConcatenationParamsE",
   "size" : 24,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "scale",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "zero_point",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite20DequantizationParamsE",
   "name" : "tflite::DequantizationParams",
   "referenced_type" : "_ZTIN6tflite20DequantizationParamsE",
   "self_type" : "_ZTIN6tflite20DequantizationParamsE",
   "size" : 16,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_offset",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "weights_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_multiplier",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output_shift",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_min",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "quantized_activation_max",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "float_activation_min",
     "field_offset" : 224,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "float_activation_max",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "lhs_cacheable",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "rhs_cacheable",
     "field_offset" : 296,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "weights_format",
     "field_offset" : 304,
     "referenced_type" : "_ZTIN6tflite27FullyConnectedWeightsFormatE"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite20FullyConnectedParamsE",
   "name" : "tflite::FullyConnectedParams",
   "referenced_type" : "_ZTIN6tflite20FullyConnectedParamsE",
   "self_type" : "_ZTIN6tflite20FullyConnectedParamsE",
   "size" : 40,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "align_corners",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "half_pixel_centers",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite20ResizeBilinearParamsE",
   "name" : "tflite::ResizeBilinearParams",
   "referenced_type" : "_ZTIN6tflite20ResizeBilinearParamsE",
   "self_type" : "_ZTIN6tflite20ResizeBilinearParamsE",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_zero_point",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite21L2NormalizationParamsE",
   "name" : "tflite::L2NormalizationParams",
   "referenced_type" : "_ZTIN6tflite21L2NormalizationParamsE",
   "self_type" : "_ZTIN6tflite21L2NormalizationParamsE",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "align_corners",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "half_pixel_centers",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite27ResizeNearestNeighborParamsE",
   "name" : "tflite::ResizeNearestNeighborParams",
   "referenced_type" : "_ZTIN6tflite27ResizeNearestNeighborParamsE",
   "self_type" : "_ZTIN6tflite27ResizeNearestNeighborParamsE",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "scale",
     "referenced_type" : "_ZTIPKf"
    },
    {
     "field_name" : "zero_point",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKi"
    },
    {
     "field_name" : "quantized_dimension",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite30PerChannelDequantizationParamsE",
   "name" : "tflite::PerChannelDequantizationParams",
   "referenced_type" : "_ZTIN6tflite30PerChannelDequantizationParamsE",
   "self_type" : "_ZTIN6tflite30PerChannelDequantizationParamsE",
   "size" : 12,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "range",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bias",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "alpha",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "beta",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite32LocalResponseNormalizationParamsE",
   "name" : "tflite::LocalResponseNormalizationParams",
   "referenced_type" : "_ZTIN6tflite32LocalResponseNormalizationParamsE",
   "self_type" : "_ZTIN6tflite32LocalResponseNormalizationParamsE",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sizes",
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "strides",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA4_i"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite4DimsILi4EEE",
   "name" : "tflite::Dims<4>",
   "referenced_type" : "_ZTIN6tflite4DimsILi4EEE",
   "self_type" : "_ZTIN6tflite4DimsILi4EEE",
   "size" : 32,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "min",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "max",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite6MinMaxE",
   "name" : "tflite::MinMax",
   "referenced_type" : "_ZTIN6tflite6MinMaxE",
   "self_type" : "_ZTIN6tflite6MinMaxE",
   "size" : 8,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left_padding_count",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "left_padding",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "right_padding_count",
     "field_offset" : 160,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "right_padding",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "resizing_category",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN6tflite16ResizingCategoryE"
    }
   ],
   "linker_set_key" : "_ZTIN6tflite9PadParamsE",
   "name" : "tflite::PadParams",
   "referenced_type" : "_ZTIN6tflite9PadParamsE",
   "self_type" : "_ZTIN6tflite9PadParamsE",
   "size" : 44,
   "source_file" : "external/tensorflow/tensorflow/lite/kernels/internal/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA13_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:232:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN8ucontextUt_Ut_E"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_Ut_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)::(anonymous struct at bionic/libc/include/sys/ucontext.h:91:5)",
   "referenced_type" : "_ZTIN8ucontextUt_Ut_E",
   "self_type" : "_ZTIN8ucontextUt_Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:89:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__110__function16__policy_storageE",
   "self_type" : "_ZTINSt3__110__function16__policy_storageE",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "referenced_type" : "_ZTINSt3__110__function8__policyE",
   "self_type" : "_ZTINSt3__110__function8__policyE",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj0EEE",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj1EEE",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "_ZTINSt3__110__ignore_tIhEE",
   "self_type" : "_ZTINSt3__110__ignore_tIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000000>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000000EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000000000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx3600ELx1EEEEE",
   "name" : "std::__is_ratio<std::ratio<3600, 1>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx3600ELx1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx3600ELx1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx3600ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx60ELx1EEEEE",
   "name" : "std::__is_ratio<std::ratio<60, 1>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx60ELx1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx60ELx1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx60ELx1EEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__loc_",
     "referenced_type" : "_ZTIP10__locale_t"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__time_getE",
   "name" : "std::__time_get",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110__time_getE",
   "self_type" : "_ZTINSt3__110__time_getE",
   "size" : 4,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__loc_",
     "referenced_type" : "_ZTIP10__locale_t"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__time_putE",
   "name" : "std::__time_put",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110__time_putE",
   "self_type" : "_ZTINSt3__110__time_putE",
   "size" : 4,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110ctype_baseE",
   "name" : "std::ctype_base",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110ctype_baseE",
   "self_type" : "_ZTINSt3__110ctype_baseE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__locale"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__val_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "__cat_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKNSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110error_codeE",
   "name" : "std::error_code",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110error_codeE",
   "self_type" : "_ZTINSt3__110error_codeE",
   "size" : 8,
   "source_file" : "external/libcxx/include/system_error"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "referenced_type" : "_ZTINSt3__110in_place_tE",
   "self_type" : "_ZTINSt3__110in_place_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDiEE",
   "name" : "std::is_trivial<char32_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDiEE",
   "self_type" : "_ZTINSt3__110is_trivialIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDsEE",
   "name" : "std::is_trivial<char16_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDsEE",
   "self_type" : "_ZTINSt3__110is_trivialIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "referenced_type" : "_ZTINSt3__110is_trivialIcEE",
   "self_type" : "_ZTINSt3__110is_trivialIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIwEE",
   "self_type" : "_ZTINSt3__110is_trivialIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110less_equalIvEE",
   "name" : "std::less_equal<void>",
   "referenced_type" : "_ZTINSt3__110less_equalIvEE",
   "self_type" : "_ZTINSt3__110less_equalIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110logical_orIvEE",
   "name" : "std::logical_or<void>",
   "referenced_type" : "_ZTINSt3__110logical_orIvEE",
   "self_type" : "_ZTINSt3__110logical_orIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "field",
     "referenced_type" : "_ZTIA4_c"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110money_base7patternE",
   "name" : "std::money_base::pattern",
   "referenced_type" : "_ZTINSt3__110money_base7patternE",
   "self_type" : "_ZTINSt3__110money_base7patternE",
   "size" : 4,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110money_baseE",
   "name" : "std::money_base",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110money_baseE",
   "self_type" : "_ZTINSt3__110money_baseE",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIcLb0EEE",
   "name" : "std::moneypunct<char, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIcLb0EEE",
   "self_type" : "_ZTINSt3__110moneypunctIcLb0EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIcLb0EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb0EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb0EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIcLb1EEE",
   "name" : "std::moneypunct<char, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIcLb1EEE",
   "self_type" : "_ZTINSt3__110moneypunctIcLb1EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIcLb1EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb1EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb1EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIwLb0EEE",
   "name" : "std::moneypunct<wchar_t, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIwLb0EEE",
   "self_type" : "_ZTINSt3__110moneypunctIwLb0EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIwLb0EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb0EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb0EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIwLb1EEE",
   "name" : "std::moneypunct<wchar_t, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIwLb1EEE",
   "self_type" : "_ZTINSt3__110moneypunctIwLb1EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIwLb1EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb1EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb1EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110multipliesIvEE",
   "name" : "std::multiplies<void>",
   "referenced_type" : "_ZTINSt3__110multipliesIvEE",
   "self_type" : "_ZTINSt3__110multipliesIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "referenced_type" : "_ZTINSt3__110owner_lessIvEE",
   "self_type" : "_ZTINSt3__110owner_lessIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP14TfLiteIntArrayPFvS2_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI14TfLiteIntArrayPFvPS1_EEE",
   "name" : "std::unique_ptr<TfLiteIntArray, void (*)(TfLiteIntArray *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrI14TfLiteIntArrayPFvPS1_EEE",
   "self_type" : "_ZTINSt3__110unique_ptrI14TfLiteIntArrayPFvPS1_EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTI14TfLiteIntArray", "_ZTIPFvP14TfLiteIntArrayE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPcPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIcPFvPvEEE",
   "name" : "std::unique_ptr<char, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIcPFvPvEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIcPFvPvEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIc", "_ZTIPFvPvE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPhPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIhPFvPvEEE",
   "name" : "std::unique_ptr<unsigned char, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIhPFvPvEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIhPFvPvEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIh", "_ZTIPFvPvE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPjPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIjPFvPvEEE",
   "name" : "std::unique_ptr<unsigned int, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIjPFvPvEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIjPFvPvEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIj", "_ZTIPFvPvE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_getIcEE",
   "name" : "std::__money_get<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_getIcEE",
   "self_type" : "_ZTINSt3__111__money_getIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_getIwEE",
   "name" : "std::__money_get<wchar_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_getIwEE",
   "self_type" : "_ZTINSt3__111__money_getIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_putIcEE",
   "name" : "std::__money_put<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_putIcEE",
   "self_type" : "_ZTINSt3__111__money_putIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_putIwEE",
   "name" : "std::__money_put<wchar_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_putIwEE",
   "self_type" : "_ZTINSt3__111__money_putIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEENS1_ILx1ELx1EEEEE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEENS1_ILx1ELx1EEEEE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEENS1_ILx1ELx1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILx1ELx1000000000EEE",
    "_ZTINSt3__15ratioILx1ELx1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1000000000>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILx1ELx1000000000EEE",
    "_ZTINSt3__15ratioILx1ELx1000000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000>, std::ratio<1, 1000000>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILx1ELx1000000EEE",
    "_ZTINSt3__15ratioILx1ELx1000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000>, std::ratio<1, 1000>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000EEE", "_ZTINSt3__15ratioILx1ELx1000EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1>, std::ratio<1, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1EEE", "_ZTINSt3__15ratioILx1ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx3600ELx1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<3600, 1>, std::ratio<3600, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx3600ELx1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx3600ELx1EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx3600ELx1EEE", "_ZTINSt3__15ratioILx3600ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx60ELx1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<60, 1>, std::ratio<60, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx60ELx1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx60ELx1EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx60ELx1EEE", "_ZTINSt3__15ratioILx60ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char32_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDiEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char16_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDsEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__nat>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__nat>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__i",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__wrap_iterIPKcEE",
   "name" : "std::__wrap_iter<const char *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__wrap_iterIPKcEE",
   "self_type" : "_ZTINSt3__111__wrap_iterIPKcEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14TfLiteIntArrayPFvS3_EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<TfLiteIntArray *, void (*)(TfLiteIntArray *)>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14TfLiteIntArrayPFvS3_EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14TfLiteIntArrayPFvS3_EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIP14TfLiteIntArrayPFvS2_EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<char *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPcPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<unsigned char *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPhPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<unsigned int *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPjPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<TfLiteIntArray *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<void (*)(TfLiteIntArray *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<void (*)(void *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<unsigned char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPhLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<unsigned int *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPjLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "name" : "std::add_pointer<std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<TfLiteIntArray *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<void (*)(TfLiteIntArray *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<void (*)(void *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<unsigned char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPhLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<unsigned int *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPjLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP14TfLiteIntArrayEE",
   "name" : "std::add_pointer<TfLiteIntArray *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIP14TfLiteIntArrayEE",
   "self_type" : "_ZTINSt3__111add_pointerIP14TfLiteIntArrayEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14TfLiteIntArray" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIPFvP14TfLiteIntArrayEEE",
   "name" : "std::add_pointer<void (*)(TfLiteIntArray *)>",
   "referenced_type" : "_ZTINSt3__111add_pointerIPFvP14TfLiteIntArrayEEE",
   "self_type" : "_ZTINSt3__111add_pointerIPFvP14TfLiteIntArrayEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPFvP14TfLiteIntArrayE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIeEE",
   "name" : "std::add_pointer<long double>",
   "referenced_type" : "_ZTINSt3__111add_pointerIeEE",
   "self_type" : "_ZTINSt3__111add_pointerIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIlEE",
   "name" : "std::add_pointer<long>",
   "referenced_type" : "_ZTINSt3__111add_pointerIlEE",
   "self_type" : "_ZTINSt3__111add_pointerIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIxEE",
   "name" : "std::add_pointer<long long>",
   "referenced_type" : "_ZTINSt3__111add_pointerIxEE",
   "self_type" : "_ZTINSt3__111add_pointerIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDiEE",
   "name" : "std::char_traits<char32_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDiEE",
   "self_type" : "_ZTINSt3__111char_traitsIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDsEE",
   "name" : "std::char_traits<char16_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDsEE",
   "self_type" : "_ZTINSt3__111char_traitsIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIcEE",
   "name" : "std::char_traits<char>",
   "referenced_type" : "_ZTINSt3__111char_traitsIcEE",
   "self_type" : "_ZTINSt3__111char_traitsIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIwEE",
   "name" : "std::char_traits<wchar_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIwEE",
   "self_type" : "_ZTINSt3__111char_traitsIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000000>>, duration<long double, ratio<1, 1000000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000>>, duration<long double, ratio<1, 1000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000>>, duration<long double, ratio<1, 1000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1>>, duration<long double, ratio<1, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<3600, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<3600, 1>>, duration<long double, ratio<3600, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<60, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<60, 1>>, duration<long double, ratio<60, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long, ratio<3600, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long, ratio<3600, 1>>, duration<long, ratio<3600, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long, ratio<60, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long, ratio<60, 1>>, duration<long, ratio<60, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEENS2_IxNS3_ILx1ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000000>>, duration<long long, ratio<1, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEENS2_IxNS3_ILx1ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEENS2_IxNS3_ILx1ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000000>>, duration<long long, ratio<1, 1000000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000>>, duration<long long, ratio<1, 1000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEES5_EEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000>>, duration<long long, ratio<1, 1000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1>>, duration<long long, ratio<1, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIeevEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJeeEEE",
   "name" : "std::common_type<long double, long double>",
   "referenced_type" : "_ZTINSt3__111common_typeIJeeEEE",
   "self_type" : "_ZTINSt3__111common_typeIJeeEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIllvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJllEEE",
   "name" : "std::common_type<long, long>",
   "referenced_type" : "_ZTINSt3__111common_typeIJllEEE",
   "self_type" : "_ZTINSt3__111common_typeIJllEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIxxvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJxxEEE",
   "name" : "std::common_type<long long, long long>",
   "referenced_type" : "_ZTINSt3__111common_typeIJxxEEE",
   "self_type" : "_ZTINSt3__111common_typeIJxxEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type_implINS_14__common_typesIJxxxEEEvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJxxxEEE",
   "name" : "std::common_type<long long, long long, long long>",
   "referenced_type" : "_ZTINSt3__111common_typeIJxxxEEE",
   "self_type" : "_ZTINSt3__111common_typeIJxxxEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "name" : "std::conditional<false, std::pointer_traits<char32_t *>::__nat, char32_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPDiE5__natE", "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "name" : "std::conditional<false, std::pointer_traits<char16_t *>::__nat, char16_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPDsE5__natE", "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "name" : "std::conditional<false, std::pointer_traits<const char *>::__nat, const char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPKcE5__natE", "_ZTIKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "name" : "std::conditional<false, std::pointer_traits<char *>::__nat, char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPcE5__natE", "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "name" : "std::conditional<false, std::pointer_traits<wchar_t *>::__nat, wchar_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPwE5__natE", "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "name" : "std::conditional<false, std::__bit_const_reference<std::__bitset<0, 0>>, std::__bit_reference<std::__bitset<0, 0>, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__121__bit_const_referenceINS_8__bitsetILj0ELj0EEEEE",
    "_ZTINSt3__115__bit_referenceINS_8__bitsetILj0ELj0EEELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14TfLiteIntArrayPFvS3_EEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<TfLiteIntArray *, void (*)(TfLiteIntArray *)> *, std::__compressed_pair<TfLiteIntArray *, void (*)(TfLiteIntArray *)>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14TfLiteIntArrayPFvS3_EEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14TfLiteIntArrayPFvS3_EEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP14TfLiteIntArrayPFvS2_EEE",
    "_ZTINSt3__117__compressed_pairIP14TfLiteIntArrayPFvS2_EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPcPFvPvEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<char *, void (*)(void *)> *, std::__compressed_pair<char *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPcPFvPvEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPcPFvPvEEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPcPFvPvEEE",
    "_ZTINSt3__117__compressed_pairIPcPFvPvEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPhPFvPvEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<unsigned char *, void (*)(void *)> *, std::__compressed_pair<unsigned char *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPhPFvPvEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPhPFvPvEEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPhPFvPvEEE",
    "_ZTINSt3__117__compressed_pairIPhPFvPvEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPjPFvPvEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<unsigned int *, void (*)(void *)> *, std::__compressed_pair<unsigned int *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPjPFvPvEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPjPFvPvEEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPjPFvPvEEE",
    "_ZTINSt3__117__compressed_pairIPjPFvPvEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<TfLiteIntArray *, 0, false> *, std::__compressed_pair_elem<TfLiteIntArray *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<void (*)(TfLiteIntArray *), 1, false> *, std::__compressed_pair_elem<void (*)(TfLiteIntArray *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<void (*)(void *), 1, false> *, std::__compressed_pair_elem<void (*)(void *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<char *, 0, false> *, std::__compressed_pair_elem<char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPcLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPcLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<unsigned char *, 0, false> *, std::__compressed_pair_elem<unsigned char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPhLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPhLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<unsigned int *, 0, false> *, std::__compressed_pair_elem<unsigned int *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPjLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPjLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKjPjEE",
   "name" : "std::conditional<false, const unsigned int *, unsigned int *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKjPjEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKjPjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKj", "_ZTIPj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char>> *, std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE",
    "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<TfLiteIntArray *, 0, false> *, std::__compressed_pair_elem<TfLiteIntArray *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEES6_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<void (*)(TfLiteIntArray *), 1, false> *, std::__compressed_pair_elem<void (*)(TfLiteIntArray *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEES6_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<void (*)(void *), 1, false> *, std::__compressed_pair_elem<void (*)(void *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<char *, 0, false> *, std::__compressed_pair_elem<char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPcLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPcLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<unsigned char *, 0, false> *, std::__compressed_pair_elem<unsigned char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPhLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPhLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<unsigned int *, 0, false> *, std::__compressed_pair_elem<unsigned int *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPjLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPjLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP14TfLiteIntArrayS2_EE",
   "name" : "std::conditional<false, TfLiteIntArray **, TfLiteIntArray *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPP14TfLiteIntArrayS2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPP14TfLiteIntArrayS2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPP14TfLiteIntArray", "_ZTIP14TfLiteIntArray" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPPFvP14TfLiteIntArrayES4_EE",
   "name" : "std::conditional<false, void (**)(TfLiteIntArray *), void (*)(TfLiteIntArray *)>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPPFvP14TfLiteIntArrayES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPPFvP14TfLiteIntArrayES4_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPPFvP14TfLiteIntArrayE", "_ZTIPFvP14TfLiteIntArrayE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPeeEE",
   "name" : "std::conditional<false, long double *, long double>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPeeEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPeeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPe", "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPllEE",
   "name" : "std::conditional<false, long *, long>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPllEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPllEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPl", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPxxEE",
   "name" : "std::conditional<false, long long *, long long>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPxxEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPxxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPx", "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIeevEENS_11common_typeIJeeEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<long double, long double, void>, std::common_type<long double, long double>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIeevEENS_11common_typeIJeeEEEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIeevEENS_11common_typeIJeeEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIeevEE",
    "_ZTINSt3__111common_typeIJeeEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIllvEENS_11common_typeIJllEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<long, long, void>, std::common_type<long, long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIllvEENS_11common_typeIJllEEEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIllvEENS_11common_typeIJllEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIllvEE",
    "_ZTINSt3__111common_typeIJllEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIxxvEENS_11common_typeIJxxEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<long long, long long, void>, std::common_type<long long, long long>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIxxvEENS_11common_typeIJxxEEEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIxxvEENS_11common_typeIJxxEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIxxvEE",
    "_ZTINSt3__111common_typeIJxxEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "name" : "std::conditional<true, std::__bit_const_reference<std::__bitset<0, 0>>, std::__bit_reference<std::__bitset<0, 0>, true>>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__121__bit_const_referenceINS_8__bitsetILj0ELj0EEEEE",
    "_ZTINSt3__115__bit_referenceINS_8__bitsetILj0ELj0EEELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1EPKjPjEE",
   "name" : "std::conditional<true, const unsigned int *, unsigned int *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1EPKjPjEE",
   "self_type" : "_ZTINSt3__111conditionalILb1EPKjPjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKj", "_ZTIPj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char32_t, std::char_traits<char32_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIDiNS_11char_traitsIDiEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char16_t, std::char_traits<char16_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIDsNS_11char_traitsIDsEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char, std::char_traits<char>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<wchar_t, std::char_traits<wchar_t>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIwNS_11char_traitsIwEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEE",
   "name" : "std::is_abstract<std::chrono::duration<long double, std::ratio<1, 1000000000>>>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__16chrono8durationIeNS_5ratioILx1ELx1000000000EEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDiEE",
   "name" : "std::is_abstract<const char32_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKDiEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDsEE",
   "name" : "std::is_abstract<const char16_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKDsEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKcEE",
   "name" : "std::is_abstract<const char *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKwEE",
   "name" : "std::is_abstract<const wchar_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKwEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIeEE",
   "name" : "std::is_abstract<long double>",
   "referenced_type" : "_ZTINSt3__111is_abstractIeEE",
   "self_type" : "_ZTINSt3__111is_abstractIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIlEE",
   "name" : "std::is_abstract<long>",
   "referenced_type" : "_ZTINSt3__111is_abstractIlEE",
   "self_type" : "_ZTINSt3__111is_abstractIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIxEE",
   "name" : "std::is_abstract<long long>",
   "referenced_type" : "_ZTINSt3__111is_abstractIxEE",
   "self_type" : "_ZTINSt3__111is_abstractIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIP14TfLiteIntArrayPFvS3_EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP14TfLiteIntArrayPFvS3_EEEEE",
   "name" : "std::is_function<const std::__compressed_pair<TfLiteIntArray *, void (*)(TfLiteIntArray *)>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP14TfLiteIntArrayPFvS3_EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIP14TfLiteIntArrayPFvS3_EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIP14TfLiteIntArrayPFvS2_EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIPcPFvPvEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<char *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPcPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIPhPFvPvEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<unsigned char *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPhPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIPjPFvPvEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<unsigned int *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPjPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<TfLiteIntArray *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<void (*)(TfLiteIntArray *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<void (*)(void *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<unsigned char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPhLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<unsigned int *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPjLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "name" : "std::is_function<std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char>>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<TfLiteIntArray *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIP14TfLiteIntArrayLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<void (*)(TfLiteIntArray *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPFvP14TfLiteIntArrayELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<void (*)(void *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<unsigned char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPhLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<unsigned int *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPjLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIP14TfLiteIntArrayLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIP14TfLiteIntArrayEE",
   "name" : "std::is_function<TfLiteIntArray *>",
   "referenced_type" : "_ZTINSt3__111is_functionIP14TfLiteIntArrayEE",
   "self_type" : "_ZTINSt3__111is_functionIP14TfLiteIntArrayEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIP14TfLiteIntArray" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIPFvP14TfLiteIntArrayELb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIPFvP14TfLiteIntArrayEEE",
   "name" : "std::is_function<void (*)(TfLiteIntArray *)>",
   "referenced_type" : "_ZTINSt3__111is_functionIPFvP14TfLiteIntArrayEEE",
   "self_type" : "_ZTINSt3__111is_functionIPFvP14TfLiteIntArrayEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPFvP14TfLiteIntArrayE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIeLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIeEE",
   "name" : "std::is_function<long double>",
   "referenced_type" : "_ZTINSt3__111is_functionIeEE",
   "self_type" : "_ZTINSt3__111is_functionIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIlLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIlEE",
   "name" : "std::is_function<long>",
   "referenced_type" : "_ZTINSt3__111is_functionIlEE",
   "self_type" : "_ZTINSt3__111is_functionIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIxLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIxEE",
   "name" : "std::is_function<long long>",
   "referenced_type" : "_ZTINSt3__111is_functionIxEE",
   "self_type" : "_ZTINSt3__111is_functionIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIaEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIaEE",
   "name" : "std::is_integral<signed char>",
   "referenced_type" : "_ZTINSt3__111is_integralIaEE",
   "self_type" : "_ZTINSt3__111is_integralIaEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIcEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIcEE",
   "name" : "std::is_integral<char>",
   "referenced_type" : "_ZTINSt3__111is_integralIcEE",
   "self_type" : "_ZTINSt3__111is_integralIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIdEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIdEE",
   "name" : "std::is_integral<double>",
   "referenced_type" : "_ZTINSt3__111is_integralIdEE",
   "self_type" : "_ZTINSt3__111is_integralIdEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIeEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIeEE",
   "name" : "std::is_integral<long double>",
   "referenced_type" : "_ZTINSt3__111is_integralIeEE",
   "self_type" : "_ZTINSt3__111is_integralIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIfEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIfEE",
   "name" : "std::is_integral<float>",
   "referenced_type" : "_ZTINSt3__111is_integralIfEE",
   "self_type" : "_ZTINSt3__111is_integralIfEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIhEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIhEE",
   "name" : "std::is_integral<unsigned char>",
   "referenced_type" : "_ZTINSt3__111is_integralIhEE",
   "self_type" : "_ZTINSt3__111is_integralIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIiEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIiEE",
   "name" : "std::is_integral<int>",
   "referenced_type" : "_ZTINSt3__111is_integralIiEE",
   "self_type" : "_ZTINSt3__111is_integralIiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIjEE",
   "name" : "std::is_integral<unsigned int>",
   "referenced_type" : "_ZTINSt3__111is_integralIjEE",
   "self_type" : "_ZTINSt3__111is_integralIjEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIlEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIlEE",
   "name" : "std::is_integral<long>",
   "referenced_type" : "_ZTINSt3__111is_integralIlEE",
   "self_type" : "_ZTINSt3__111is_integralIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralImEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralImEE",
   "name" : "std::is_integral<unsigned long>",
   "referenced_type" : "_ZTINSt3__111is_integralImEE",
   "self_type" : "_ZTINSt3__111is_integralImEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIsEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIsEE",
   "name" : "std::is_integral<short>",
   "referenced_type" : "_ZTINSt3__111is_integralIsEE",
   "self_type" : "_ZTINSt3__111is_integralIsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIxEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIxEE",
   "name" : "std::is_integral<long long>",
   "referenced_type" : "_ZTINSt3__111is_integralIxEE",
   "self_type" : "_ZTINSt3__111is_integralIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIyEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIyEE",
   "name" : "std::is_integral<unsigned long long>",
   "referenced_type" : "_ZTINSt3__111is_integralIyEE",
   "self_type" : "_ZTINSt3__111is_integralIyEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_andIvEE",
   "name" : "std::logical_and<void>",
   "referenced_type" : "_ZTINSt3__111logical_andIvEE",
   "self_type" : "_ZTINSt3__111logical_andIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_notIvEE",
   "name" : "std::logical_not<void>",
   "referenced_type" : "_ZTINSt3__111logical_notIvEE",
   "self_type" : "_ZTINSt3__111logical_notIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111scoped_lockIJEEE",
   "name" : "std::scoped_lock<>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111scoped_lockIJEEE",
