{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 4
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "linker_set_key" : "_ZTIs",
   "name" : "short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIs",
   "size" : 2
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIt",
   "name" : "unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIt",
   "size" : 2
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIx",
   "name" : "long long",
   "referenced_type" : "_ZTIx",

   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPN11unwindstack8RegsImplIyEE"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "function_name" : "unwindstack::RegsImpl<unsigned long long>::~RegsImpl",
   "linker_set_key" : "_ZN11unwindstack8RegsImplIyED1Ev",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPN11unwindstack8RegsImplIyEE"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "function_name" : "unwindstack::RegsImpl<unsigned long long>::~RegsImpl",
   "linker_set_key" : "_ZN11unwindstack8RegsImplIyED2Ev",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPN11unwindstack8RegsImplIyEE"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "function_name" : "unwindstack::RegsImpl<unsigned long long>::operator[]",
   "linker_set_key" : "_ZN11unwindstack8RegsImplIyEixEj",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPN11unwindstack8RegsImplIyEE"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIRy",
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  }
 ],
 "global_vars" : [],
 "lvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIRKN11unwindstack4Regs8LocationE",
   "name" : "const unwindstack::Regs::Location &",
   "referenced_type" : "_ZTIKN11unwindstack4Regs8LocationE",
   "self_type" : "_ZTIRKN11unwindstack4Regs8LocationE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIRj",
   "name" : "unsigned int &",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIRj",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIRy",
   "name" : "unsigned long long &",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIRy",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  }
 ],
 "pointer_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN11unwindstack11DwarfMemoryE",
   "name" : "unwindstack::DwarfMemory *",
   "referenced_type" : "_ZTIN11unwindstack11DwarfMemoryE",
   "self_type" : "_ZTIPN11unwindstack11DwarfMemoryE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfMemory.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN11unwindstack15MemoryCacheBaseE",
   "name" : "unwindstack::MemoryCacheBase *",
   "referenced_type" : "_ZTIN11unwindstack15MemoryCacheBaseE",
   "self_type" : "_ZTIPN11unwindstack15MemoryCacheBaseE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Memory.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN11unwindstack4Regs8LocationE",
   "name" : "unwindstack::Regs::Location *",
   "referenced_type" : "_ZTIN11unwindstack4Regs8LocationE",
   "self_type" : "_ZTIPN11unwindstack4Regs8LocationE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN11unwindstack4RegsE",
   "name" : "unwindstack::Regs *",
   "referenced_type" : "_ZTIN11unwindstack4RegsE",
   "self_type" : "_ZTIPN11unwindstack4RegsE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN11unwindstack6MemoryE",
   "name" : "unwindstack::Memory *",
   "referenced_type" : "_ZTIN11unwindstack6MemoryE",
   "self_type" : "_ZTIPN11unwindstack6MemoryE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfMemory.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN11unwindstack8RegsImplIjEE",
   "name" : "unwindstack::RegsImpl<unsigned int> *",
   "referenced_type" : "_ZTIN11unwindstack8RegsImplIjEE",
   "self_type" : "_ZTIPN11unwindstack8RegsImplIjEE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN11unwindstack8RegsImplIyEE",
   "name" : "unwindstack::RegsImpl<unsigned long long> *",
   "referenced_type" : "_ZTIN11unwindstack8RegsImplIyEE",
   "self_type" : "_ZTIPN11unwindstack8RegsImplIyEE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Memory.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Memory.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPy",
   "name" : "unsigned long long *",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIPy",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Memory.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11unwindstack4Regs8LocationE",
   "name" : "const unwindstack::Regs::Location",
   "referenced_type" : "_ZTIN11unwindstack4Regs8LocationE",
   "self_type" : "_ZTIKN11unwindstack4Regs8LocationE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "memory_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN11unwindstack6MemoryE"
    },
    {
     "access" : "private",
     "field_name" : "cur_offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "pc_offset_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "data_offset_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "func_offset_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "text_offset_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack11DwarfMemoryE",
   "name" : "unwindstack::DwarfMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack11DwarfMemoryE",
   "self_type" : "_ZTIN11unwindstack11DwarfMemoryE",
   "size" : 48,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfMemory.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack11DwarfMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11DwarfMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11DwarfMemoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "code",
     "referenced_type" : "_ZTIN11unwindstack14DwarfErrorCodeE"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack14DwarfErrorDataE",
   "name" : "unwindstack::DwarfErrorData",
   "referenced_type" : "_ZTIN11unwindstack14DwarfErrorDataE",
   "self_type" : "_ZTIN11unwindstack14DwarfErrorDataE",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfError.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN11unwindstack4Regs12LocationEnumE"
    },
    {
     "field_name" : "value",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack4Regs8LocationE",
   "name" : "unwindstack::Regs::Location",
   "referenced_type" : "_ZTIN11unwindstack4Regs8LocationE",
   "self_type" : "_ZTIN11unwindstack4Regs8LocationE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "total_regs_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "protected",
     "field_name" : "return_loc_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIN11unwindstack4Regs8LocationE"
    },
    {
     "access" : "protected",
     "field_name" : "dex_pc_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack4RegsE",
   "name" : "unwindstack::Regs",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack4RegsE",
   "self_type" : "_ZTIN11unwindstack4RegsE",
   "size" : 24,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack4RegsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack4RegsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack4RegsD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs4ArchEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs7RawDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2pcEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2spEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_pcEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs11fallback_pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs20ResetPseudoRegistersEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17SetPseudoRegisterEty"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17GetPseudoRegisterEtPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs19StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs16IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs5CloneEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN11unwindstack6MemoryE",
   "name" : "unwindstack::Memory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack6MemoryE",
   "self_type" : "_ZTIN11unwindstack6MemoryE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Memory.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack6MemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack6MemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack6MemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory17AsMemoryCacheBaseEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEj"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory6GetPtrEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack6Memory4ReadEyPvj"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory7ReadTagEy"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN11unwindstack4RegsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "regs_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIjNS_9allocatorIjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack8RegsImplIjEE",
   "name" : "unwindstack::RegsImpl<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack8RegsImplIjEE",
   "self_type" : "_ZTIN11unwindstack8RegsImplIjEE",
   "size" : 40,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h",
   "template_args" : [ "_ZTIj" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack8RegsImplIjEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs4ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjE7RawDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2pcEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2spEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_pcEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs11fallback_pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs20ResetPseudoRegistersEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17SetPseudoRegisterEty"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17GetPseudoRegisterEtPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs19StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjE16IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs5CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN11unwindstack4RegsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "regs_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIyNS_9allocatorIyEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack8RegsImplIyEE",
   "name" : "unwindstack::RegsImpl<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack8RegsImplIyEE",
   "self_type" : "_ZTIN11unwindstack8RegsImplIyEE",
   "size" : 40,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h",
   "template_args" : [ "_ZTIy" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack8RegsImplIyEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs4ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE7RawDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2pcEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2spEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_pcEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs11fallback_pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs20ResetPseudoRegistersEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17SetPseudoRegisterEty"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17GetPseudoRegisterEtPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs19StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE16IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs5CloneEv"
    }
   ]
  }
 ],
 "rvalue_reference_types" : []
}
