{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UcontextArm64.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_y",
   "name" : "unsigned long long [1]",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIA1_y",
   "size" : 8,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/RegsArm64.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA2_y",
   "name" : "unsigned long long [2]",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIA2_y",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfLocation.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA31_y",
   "name" : "unsigned long long [31]",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIA31_y",
   "size" : 248,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UserArm64.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA34_y",
   "name" : "unsigned long long [34]",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIA34_y",
   "size" : 272,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UcontextArm64.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",

   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Memory.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPy",
   "name" : "unsigned long long *",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIPy",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Memory.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11unwindstack12DwarfSection8iteratorE",
   "name" : "const unwindstack::DwarfSection::iterator",
   "referenced_type" : "_ZTIN11unwindstack12DwarfSection8iteratorE",
   "self_type" : "_ZTIKN11unwindstack12DwarfSection8iteratorE",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfSection.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11unwindstack12SharedStringE",
   "name" : "const unwindstack::SharedString",
   "referenced_type" : "_ZTIN11unwindstack12SharedStringE",
   "self_type" : "_ZTIKN11unwindstack12SharedStringE",
   "size" : 8,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/SharedString.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11unwindstack4Regs8LocationE",
   "name" : "const unwindstack::Regs::Location",
   "referenced_type" : "_ZTIN11unwindstack4Regs8LocationE",
   "self_type" : "_ZTIKN11unwindstack4Regs8LocationE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11unwindstack7MapInfoE",
   "name" : "const unwindstack::MapInfo",
   "referenced_type" : "_ZTIN11unwindstack7MapInfoE",
   "self_type" : "_ZTIKN11unwindstack7MapInfoE",
   "size" : 56,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/MapInfo.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11unwindstack8DwarfCieE",
   "name" : "const unwindstack::DwarfCie",
   "referenced_type" : "_ZTIN11unwindstack8DwarfCieE",
   "self_type" : "_ZTIKN11unwindstack8DwarfCieE",
   "size" : 72,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfLocation.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11unwindstack8DwarfFdeE",
   "name" : "const unwindstack::DwarfFde",
   "referenced_type" : "_ZTIN11unwindstack8DwarfFdeE",
   "self_type" : "_ZTIKN11unwindstack8DwarfFdeE",
   "size" : 56,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfSection.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11unwindstack9ErrorDataE",
   "name" : "const unwindstack::ErrorData",
   "referenced_type" : "_ZTIN11unwindstack9ErrorDataE",
   "self_type" : "_ZTIKN11unwindstack9ErrorDataE",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 12,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/SharedString.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__113unordered_mapIyN11unwindstack8LoadInfoENS_4hashIyEENS_8equal_toIyEENS_9allocatorINS_4pairIKyS2_EEEEEE",
   "name" : "const std::unordered_map<unsigned long long, unwindstack::LoadInfo, std::hash<unsigned long long>, std::equal_to<unsigned long long>, std::allocator<std::pair<const unsigned long long, unwindstack::LoadInfo>>>",
   "referenced_type" : "_ZTINSt3__113unordered_mapIyN11unwindstack8LoadInfoENS_4hashIyEENS_8equal_toIyEENS_9allocatorINS_4pairIKyS2_EEEEEE",
   "self_type" : "_ZTIKNSt3__113unordered_mapIyN11unwindstack8LoadInfoENS_4hashIyEENS_8equal_toIyEENS_9allocatorINS_4pairIKyS2_EEEEEE",
   "size" : 20,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/SharedString.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfStructs.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN11unwindstack10ElfTypes32E",
   "name" : "unwindstack::ElfTypes32",
   "referenced_type" : "_ZTIN11unwindstack10ElfTypes32E",
   "self_type" : "_ZTIN11unwindstack10ElfTypes32E",
   "size" : 1,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN11unwindstack10ElfTypes64E",
   "name" : "unwindstack::ElfTypes64",
   "referenced_type" : "_ZTIN11unwindstack10ElfTypes64E",
   "self_type" : "_ZTIN11unwindstack10ElfTypes64E",
   "size" : 1,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "memory_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN11unwindstack6MemoryE"
    },
    {
     "access" : "private",
     "field_name" : "cur_offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "pc_offset_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "data_offset_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "func_offset_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "text_offset_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack11DwarfMemoryE",
   "name" : "unwindstack::DwarfMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack11DwarfMemoryE",
   "self_type" : "_ZTIN11unwindstack11DwarfMemoryE",
   "size" : 48,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfMemory.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack11DwarfMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11DwarfMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11DwarfMemoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18iteratorINS_26bidirectional_iterator_tagEPN11unwindstack8DwarfFdeEiPS4_RS4_EE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fdes_",
     "referenced_type" : "_ZTINSt3__16vectorIPKN11unwindstack8DwarfFdeENS_9allocatorIS4_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "index_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack12DwarfSection8iteratorE",
   "name" : "unwindstack::DwarfSection::iterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack12DwarfSection8iteratorE",
   "self_type" : "_ZTIN11unwindstack12DwarfSection8iteratorE",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfSection.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "memory_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11unwindstack11DwarfMemoryE"
    },
    {
     "access" : "protected",
     "field_name" : "last_error_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN11unwindstack14DwarfErrorDataE"
    },
    {
     "access" : "protected",
     "field_name" : "cie32_value_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "cie64_value_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "fde_entries_",
     "field_offset" : 704,
     "referenced_type" : "_ZTINSt3__113unordered_mapIyN11unwindstack8DwarfFdeENS_4hashIyEENS_8equal_toIyEENS_9allocatorINS_4pairIKyS2_EEEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "cie_entries_",
     "field_offset" : 864,
     "referenced_type" : "_ZTINSt3__113unordered_mapIyN11unwindstack8DwarfCieENS_4hashIyEENS_8equal_toIyEENS_9allocatorINS_4pairIKyS2_EEEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "cie_loc_regs_",
     "field_offset" : 1024,
     "referenced_type" : "_ZTINSt3__113unordered_mapIyN11unwindstack14DwarfLocationsENS_4hashIyEENS_8equal_toIyEENS_9allocatorINS_4pairIKyS2_EEEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "loc_regs_",
     "field_offset" : 1184,
     "referenced_type" : "_ZTINSt3__13mapIyN11unwindstack14DwarfLocationsENS_4lessIyEENS_9allocatorINS_4pairIKyS2_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack12DwarfSectionE",
   "name" : "unwindstack::DwarfSection",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack12DwarfSectionE",
   "self_type" : "_ZTIN11unwindstack12DwarfSectionE",
   "size" : 160,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfSection.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack12DwarfSectionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12DwarfSectionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12DwarfSectionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection4InitEyyx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection4EvalEPKNS_8DwarfCieEPNS_6MemoryERKNS_14DwarfLocationsEPNS_4RegsEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection3LogEhyPKNS_8DwarfFdeENS_8ArchEnumE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection7GetFdesEPNSt3__16vectorIPKNS_8DwarfFdeENS1_9allocatorIS5_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection12GetFdeFromPcEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection18GetCfaLocationInfoEyPKNS_8DwarfFdeEPNS_14DwarfLocationsENS_8ArchEnumE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde32Ej"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde64Ey"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection15AdjustPcFromFdeEy"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "memory_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN11unwindstack6MemoryE"
    },
    {
     "access" : "protected",
     "field_name" : "pt_loads_",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__113unordered_mapIyN11unwindstack8LoadInfoENS_4hashIyEENS_8equal_toIyEENS_9allocatorINS_4pairIKyS2_EEEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "dynamic_offset_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "dynamic_vaddr_start_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "dynamic_vaddr_end_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "data_offset_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "data_vaddr_start_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "data_vaddr_end_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_hdr_offset_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_hdr_section_bias_",
     "field_offset" : 704,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_hdr_size_",
     "field_offset" : 768,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_offset_",
     "field_offset" : 832,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_section_bias_",
     "field_offset" : 896,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_size_",
     "field_offset" : 960,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "debug_frame_offset_",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "debug_frame_section_bias_",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "protected",
     "field_name" : "debug_frame_size_",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_offset_",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_size_",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_build_id_offset_",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_build_id_size_",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "text_addr_",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "text_size_",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "protected",
     "field_name" : "soname_type_",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIh"
    },
    {
     "access" : "protected",
     "field_name" : "soname_",
     "field_offset" : 1632,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "last_error_",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIN11unwindstack9ErrorDataE"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_",
     "field_offset" : 1856,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack12DwarfSectionENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "debug_frame_",
     "field_offset" : 1888,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack12DwarfSectionENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_interface_",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIPN11unwindstack12ElfInterfaceE"
    },
    {
     "access" : "protected",
     "field_name" : "symbols_",
     "field_offset" : 1952,
     "referenced_type" : "_ZTINSt3__16vectorIPN11unwindstack7SymbolsENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "strtabs_",
     "field_offset" : 2048,
     "referenced_type" : "_ZTINSt3__16vectorINS_4pairIyyEENS_9allocatorIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack12ElfInterfaceE",
   "name" : "unwindstack::ElfInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack12ElfInterfaceE",
   "self_type" : "_ZTIN11unwindstack12ElfInterfaceE",
   "size" : 272,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack12ElfInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12ElfInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12ElfInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface4InitEPx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface11InitHeadersEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface9GetSonameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface15GetFunctionNameEyPNS_12SharedStringEPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface17GetGlobalVariableERKNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface10GetBuildIDEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface4StepEyPNS_4RegsEPNS_6MemoryEPbS5_"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface9IsValidPcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface17HandleUnknownTypeEjyy"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTINSt3__110shared_ptrIKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack12SharedStringE",
   "name" : "unwindstack::SharedString",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack12SharedStringE",
   "self_type" : "_ZTIN11unwindstack12SharedStringE",
   "size" : 8,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/SharedString.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN11unwindstack17DwarfLocationEnumE"
    },
    {
     "field_name" : "values",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA2_y"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack13DwarfLocationE",
   "name" : "unwindstack::DwarfLocation",
   "referenced_type" : "_ZTIN11unwindstack13DwarfLocationE",
   "self_type" : "_ZTIN11unwindstack13DwarfLocationE",
   "size" : 24,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfLocation.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack13arm64_stack_tE",
   "name" : "unwindstack::arm64_stack_t",
   "referenced_type" : "_ZTIN11unwindstack13arm64_stack_tE",
   "self_type" : "_ZTIN11unwindstack13arm64_stack_tE",
   "size" : 24,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UcontextArm64.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "code",
     "referenced_type" : "_ZTIN11unwindstack14DwarfErrorCodeE"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack14DwarfErrorDataE",
   "name" : "unwindstack::DwarfErrorData",
   "referenced_type" : "_ZTIN11unwindstack14DwarfErrorDataE",
   "self_type" : "_ZTIN11unwindstack14DwarfErrorDataE",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfError.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__113unordered_mapIjN11unwindstack13DwarfLocationENS_4hashIjEENS_8equal_toIjEENS_9allocatorINS_4pairIKjS2_EEEEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "cie",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKN11unwindstack8DwarfCieE"
    },
    {
     "field_name" : "pc_start",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc_end",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack14DwarfLocationsE",
   "name" : "unwindstack::DwarfLocations",
   "referenced_type" : "_ZTIN11unwindstack14DwarfLocationsE",
   "self_type" : "_ZTIN11unwindstack14DwarfLocationsE",
   "size" : 40,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfLocation.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack14arm64_sigset_tE",
   "name" : "unwindstack::arm64_sigset_t",
   "referenced_type" : "_ZTIN11unwindstack14arm64_sigset_tE",
   "self_type" : "_ZTIN11unwindstack14arm64_sigset_tE",
   "size" : 8,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UcontextArm64.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTIA31_y"
    },
    {
     "field_name" : "sp",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack15arm64_user_regsE",
   "name" : "unwindstack::arm64_user_regs",
   "referenced_type" : "_ZTIN11unwindstack15arm64_user_regsE",
   "self_type" : "_ZTIN11unwindstack15arm64_user_regsE",
   "size" : 272,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UserArm64.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA34_y"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack16arm64_mcontext_tE",
   "name" : "unwindstack::arm64_mcontext_t",
   "referenced_type" : "_ZTIN11unwindstack16arm64_mcontext_tE",
   "self_type" : "_ZTIN11unwindstack16arm64_mcontext_tE",
   "size" : 288,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UcontextArm64.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN11unwindstack13arm64_stack_tE"
    },
    {
     "field_name" : "uc_sigmask",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN11unwindstack14arm64_sigset_tE"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIN11unwindstack16arm64_mcontext_tE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack16arm64_ucontext_tE",
   "name" : "unwindstack::arm64_ucontext_t",
   "referenced_type" : "_ZTIN11unwindstack16arm64_ucontext_tE",
   "self_type" : "_ZTIN11unwindstack16arm64_ucontext_tE",
   "size" : 464,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/UcontextArm64.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "valid_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "load_bias_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "protected",
     "field_name" : "interface_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack12ElfInterfaceENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "memory_",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack6MemoryENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "machine_type_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "class_type_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIh"
    },
    {
     "access" : "protected",
     "field_name" : "arch_",
     "field_offset" : 232,
     "referenced_type" : "_ZTIN11unwindstack8ArchEnumE"
    },
    {
     "access" : "protected",
     "field_name" : "lock_",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_memory_",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack6MemoryENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_interface_",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN11unwindstack12ElfInterfaceENS_14default_deleteIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack3ElfE",
   "name" : "unwindstack::Elf",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack3ElfE",
   "self_type" : "_ZTIN11unwindstack3ElfE",
   "size" : 48,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Elf.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack3ElfE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack3ElfD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack3ElfD0Ev"
    }
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN11unwindstack4Regs12LocationEnumE"
    },
    {
     "field_name" : "value",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack4Regs8LocationE",
   "name" : "unwindstack::Regs::Location",
   "referenced_type" : "_ZTIN11unwindstack4Regs8LocationE",
   "self_type" : "_ZTIN11unwindstack4Regs8LocationE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "total_regs_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "protected",
     "field_name" : "return_loc_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIN11unwindstack4Regs8LocationE"
    },
    {
     "access" : "protected",
     "field_name" : "dex_pc_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack4RegsE",
   "name" : "unwindstack::Regs",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack4RegsE",
   "self_type" : "_ZTIN11unwindstack4RegsE",
   "size" : 24,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack4RegsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack4RegsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack4RegsD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs4ArchEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs7RawDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2pcEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2spEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_pcEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs11fallback_pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs20ResetPseudoRegistersEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17SetPseudoRegisterEty"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17GetPseudoRegisterEtPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs19StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs16IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs5CloneEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN11unwindstack6MemoryE",
   "name" : "unwindstack::Memory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack6MemoryE",
   "self_type" : "_ZTIN11unwindstack6MemoryE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Memory.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack6MemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack6MemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack6MemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory17AsMemoryCacheBaseEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEj"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory6GetPtrEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack6Memory4ReadEyPvj"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory7ReadTagEy"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "elf_",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN11unwindstack3ElfEEE"
    },
    {
     "field_name" : "elf_offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "elf_start_offset_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "load_bias_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16atomicIxEE"
    },
    {
     "field_name" : "build_id_",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16atomicIPN11unwindstack12SharedStringEEE"
    },
    {
     "field_name" : "memory_backed_elf_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "elf_mutex_",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack7MapInfo9ElfFieldsE",
   "name" : "unwindstack::MapInfo::ElfFields",
   "referenced_type" : "_ZTIN11unwindstack7MapInfo9ElfFieldsE",
   "self_type" : "_ZTIN11unwindstack7MapInfo9ElfFieldsE",
   "size" : 48,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/MapInfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "start_",
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "end_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "offset_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "flags_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "name_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN11unwindstack12SharedStringE"
    },
    {
     "access" : "private",
     "field_name" : "elf_fields_",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__16atomicIPN11unwindstack7MapInfo9ElfFieldsEEE"
    },
    {
     "access" : "private",
     "field_name" : "prev_map_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPN11unwindstack7MapInfoE"
    },
    {
     "access" : "private",
     "field_name" : "prev_real_map_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPN11unwindstack7MapInfoE"
    },
    {
     "access" : "private",
     "field_name" : "next_real_map_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPN11unwindstack7MapInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack7MapInfoE",
   "name" : "unwindstack::MapInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack7MapInfoE",
   "self_type" : "_ZTIN11unwindstack7MapInfoE",
   "size" : 56,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/MapInfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "fde_address_encoding",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "lsda_encoding",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "segment_size",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "augmentation_string",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIcNS_9allocatorIcEEEE"
    },
    {
     "field_name" : "personality_handler",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cfa_instructions_offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cfa_instructions_end",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "code_alignment_factor",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "data_alignment_factor",
     "field_offset" : 384,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "return_address_register",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "is_signal_frame",
     "field_offset" : 512,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack8DwarfCieE",
   "name" : "unwindstack::DwarfCie",
   "referenced_type" : "_ZTIN11unwindstack8DwarfCieE",
   "self_type" : "_ZTIN11unwindstack8DwarfCieE",
   "size" : 72,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfStructs.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cie_offset",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cfa_instructions_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cfa_instructions_end",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc_start",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc_end",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "lsda_address",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cie",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKN11unwindstack8DwarfCieE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack8DwarfFdeE",
   "name" : "unwindstack::DwarfFde",
   "referenced_type" : "_ZTIN11unwindstack8DwarfFdeE",
   "self_type" : "_ZTIN11unwindstack8DwarfFdeE",
   "size" : 56,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/DwarfStructs.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "table_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "table_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack8LoadInfoE",
   "name" : "unwindstack::LoadInfo",
   "referenced_type" : "_ZTIN11unwindstack8LoadInfoE",
   "self_type" : "_ZTIN11unwindstack8LoadInfoE",
   "size" : 24,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/ElfInterface.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN11unwindstack4RegsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "regs_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIyNS_9allocatorIyEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack8RegsImplIyEE",
   "name" : "unwindstack::RegsImpl<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack8RegsImplIyEE",
   "self_type" : "_ZTIN11unwindstack8RegsImplIyEE",
   "size" : 40,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Regs.h",
   "template_args" : [ "_ZTIy" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack8RegsImplIyEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs4ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE7RawDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2pcEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2spEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_pcEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs11fallback_pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs20ResetPseudoRegistersEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17SetPseudoRegisterEty"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Regs17GetPseudoRegisterEtPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs19StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE16IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs5CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "code",
     "referenced_type" : "_ZTIN11unwindstack9ErrorCodeE"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack9ErrorDataE",
   "name" : "unwindstack::ErrorData",
   "referenced_type" : "_ZTIN11unwindstack9ErrorDataE",
   "self_type" : "_ZTIN11unwindstack9ErrorDataE",
   "size" : 16,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/Error.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN11unwindstack8RegsImplIyEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "pseudo_regs_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA1_y"
    },
    {
     "access" : "protected",
     "field_name" : "pac_mask_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN11unwindstack9RegsArm64E",
   "name" : "unwindstack::RegsArm64",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11unwindstack9RegsArm64E",
   "self_type" : "_ZTIN11unwindstack9RegsArm64E",
   "size" : 56,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/RegsArm64.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack9RegsArm64E"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack9RegsArm64D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack9RegsArm64D0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm644ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE7RawDataEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm642pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm642spEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm646set_pcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm646set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm6411fallback_pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm6420ResetPseudoRegistersEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm6417SetPseudoRegisterEty"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm6417GetPseudoRegisterEtPy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm6419StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm6422SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm6416IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm645CloneEv"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIONSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>> &&",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIONSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 4,
   "source_file" : "system/unwinding/libunwindstack/include/unwindstack/SharedString.h"
  }
 ]
}
