#ifndef HIDL_GENERATED_ANDROID_HARDWARE_WIFI_SUPPLICANT_V1_3_ISUPPLICANTSTAIFACECALLBACK_H
#define HIDL_GENERATED_ANDROID_HARDWARE_WIFI_SUPPLICANT_V1_3_ISUPPLICANTSTAIFACECALLBACK_H

#include <android/hardware/wifi/supplicant/1.0/ISupplicantStaIfaceCallback.h>
#include <android/hardware/wifi/supplicant/1.0/types.h>
#include <android/hardware/wifi/supplicant/1.2/ISupplicantStaIfaceCallback.h>
#include <android/hardware/wifi/supplicant/1.3/types.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace wifi {
namespace supplicant {
namespace V1_3 {

/**
 * Callback Interface exposed by the supplicant service
 * for each station mode interface (ISupplicantStaIface).
 *
 * Clients need to host an instance of this HIDL interface object and
 * pass a reference of the object to the supplicant via the
 * corresponding |ISupplicantStaIface.registerCallback_1_3| method.
 */
struct ISupplicantStaIfaceCallback : public ::android::hardware::wifi::supplicant::V1_2::ISupplicantStaIfaceCallback {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.wifi.supplicant@1.3::ISupplicantStaIfaceCallback"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class BssTmStatusCode : uint8_t;
    enum class BssTmDataFlagsMask : uint32_t;
    enum class MboTransitionReasonCode : uint8_t;
    enum class MboCellularDataConnectionPrefValue : uint8_t;
    struct BssTmData;

    /**
     * IEEE Std 802.11-2016 - Table 9-357.
     * BTM status code filled in BSS transition management response frame.
     */
    enum class BssTmStatusCode : uint8_t {
        ACCEPT = 0,
        REJECT_UNSPECIFIED = 1,
        REJECT_INSUFFICIENT_BEACON = 2,
        REJECT_INSUFFICIENT_CAPABITY = 3,
        REJECT_BSS_TERMINATION_UNDESIRED = 4,
        REJECT_BSS_TERMINATION_DELAY_REQUEST = 5,
        REJECT_STA_CANDIDATE_LIST_PROVIDED = 6,
        REJECT_NO_SUITABLE_CANDIDATES = 7,
        REJECT_LEAVING_ESS = 8,
    };

    /**
     * Bitmask of various information retrieved from BSS transition management request frame.
     */
    enum class BssTmDataFlagsMask : uint32_t {
        /**
         * Preferred candidate list included.
         */
        WNM_MODE_PREFERRED_CANDIDATE_LIST_INCLUDED = 1u /* 1 << 0 */,
        /**
         * Abridged.
         */
        WNM_MODE_ABRIDGED = 2u /* 1 << 1 */,
        /**
         * Disassociation Imminent.
         */
        WNM_MODE_DISASSOCIATION_IMMINENT = 4u /* 1 << 2 */,
        /**
         * BSS termination included.
         */
        WNM_MODE_BSS_TERMINATION_INCLUDED = 8u /* 1 << 3 */,
        /**
         * ESS Disassociation Imminent.
         */
        WNM_MODE_ESS_DISASSOCIATION_IMMINENT = 16u /* 1 << 4 */,
        /**
         * MBO transition reason code included.
         */
        MBO_TRANSITION_REASON_CODE_INCLUDED = 32u /* 1 << 5 */,
        /**
         * MBO retry delay time included.
         */
        MBO_ASSOC_RETRY_DELAY_INCLUDED = 64u /* 1 << 6 */,
        /**
         * MBO cellular data connection preference value included.
         */
        MBO_CELLULAR_DATA_CONNECTION_PREFERENCE_INCLUDED = 128u /* 1 << 7 */,
    };

    /**
     *  MBO spec v1.2, 4.2.6 Table 18: MBO transition reason code attribute
     *  values.
     */
    enum class MboTransitionReasonCode : uint8_t {
        UNSPECIFIED = 0,
        EXCESSIVE_FRAME_LOSS = 1,
        EXCESSIVE_TRAFFIC_DELAY = 2,
        INSUFFICIENT_BANDWIDTH = 3,
        LOAD_BALANCING = 4,
        LOW_RSSI = 5,
        RX_EXCESSIVE_RETRIES = 6,
        HIGH_INTERFERENCE = 7,
        GRAY_ZONE = 8,
        TRANSITION_TO_PREMIUM_AP = 9,
    };

    /**
     *  MBO spec v1.2, 4.2.5 Table 16: MBO Cellular Data connection preference
     *  attribute values. AP use this to indicate STA, its preference for the
     *  STA to move from BSS to cellular network.
     */
    enum class MboCellularDataConnectionPrefValue : uint8_t {
        EXCLUDED = 0,
        NOT_PREFERRED = 1,
        /*
         * 2-254 Reserved.
         */
        PREFERRED = 255,
    };

    /**
     * Data retrieved from received BSS transition management request frame.
     */
    struct BssTmData final {
        /*
         * Status code filled in BSS transition management response frame
         */
        ::android::hardware::wifi::supplicant::V1_3::ISupplicantStaIfaceCallback::BssTmStatusCode status __attribute__ ((aligned(1)));
        /*
         * Bitmask of BssTmDataFlagsMask
         */
        ::android::hardware::hidl_bitfield<::android::hardware::wifi::supplicant::V1_3::ISupplicantStaIfaceCallback::BssTmDataFlagsMask> flags __attribute__ ((aligned(4)));
        /*
         * Duration for which STA shouldn't try to re-associate.
         */
        uint32_t assocRetryDelayMs __attribute__ ((aligned(4)));
        /*
         * Reason for BSS transition request.
         */
        ::android::hardware::wifi::supplicant::V1_3::ISupplicantStaIfaceCallback::MboTransitionReasonCode mboTransitionReason __attribute__ ((aligned(1)));
        /*
         * Cellular Data Connection preference value.
         */
        ::android::hardware::wifi::supplicant::V1_3::ISupplicantStaIfaceCallback::MboCellularDataConnectionPrefValue mboCellPreference __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_3::ISupplicantStaIfaceCallback::BssTmData, status) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_3::ISupplicantStaIfaceCallback::BssTmData, flags) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_3::ISupplicantStaIfaceCallback::BssTmData, assocRetryDelayMs) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_3::ISupplicantStaIfaceCallback::BssTmData, mboTransitionReason) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_3::ISupplicantStaIfaceCallback::BssTmData, mboCellPreference) == 13, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::supplicant::V1_3::ISupplicantStaIfaceCallback::BssTmData) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::supplicant::V1_3::ISupplicantStaIfaceCallback::BssTmData) == 4, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Used to indicate that a new network has been added.
     *
     * @param id Network ID allocated to the corresponding network.
     */
    virtual ::android::hardware::Return<void> onNetworkAdded(uint32_t id) = 0;

    /**
     * Used to indicate that a network has been removed.
     *
     * @param id Network ID allocated to the corresponding network.
     */
    virtual ::android::hardware::Return<void> onNetworkRemoved(uint32_t id) = 0;

    /**
     * Used to indicate a state change event on this particular iface. If this
     * event is triggered by a particular network, the |SupplicantNetworkId|,
     * |ssid|, |bssid| parameters must indicate the parameters of the network/AP
