#ifndef HIDL_GENERATED_ANDROID_HARDWARE_WIFI_SUPPLICANT_V1_3_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_WIFI_SUPPLICANT_V1_3_TYPES_H

#include <android/hardware/wifi/supplicant/1.2/types.h>
#include <android/hardware/wifi/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace wifi {
namespace supplicant {
namespace V1_3 {

// Forward declaration for forward reference support:
enum class OcspType : uint32_t;
enum class WifiTechnology : uint32_t;
struct ConnectionCapabilities;
enum class WpaDriverCapabilitiesMask : uint32_t;
enum class DppProgressCode : uint32_t;
enum class DppSuccessCode : uint32_t;
enum class DppFailureCode : uint32_t;

/**
 * OcspType: The type of OCSP request.
 */
enum class OcspType : uint32_t {
    NONE = 0u,
    REQUEST_CERT_STATUS = 1u /* ::android::hardware::wifi::supplicant::V1_3::OcspType.NONE implicitly + 1 */,
    REQUIRE_CERT_STATUS = 2u /* ::android::hardware::wifi::supplicant::V1_3::OcspType.REQUEST_CERT_STATUS implicitly + 1 */,
    REQUIRE_ALL_CERTS_STATUS = 3u /* ::android::hardware::wifi::supplicant::V1_3::OcspType.REQUIRE_CERT_STATUS implicitly + 1 */,
};

/**
 * Wifi Technologies
 */
enum class WifiTechnology : uint32_t {
    UNKNOWN = 0u,
    /**
     * For 802.11a/b/g
     */
    LEGACY = 1u,
    /**
     * For 802.11n
     */
    HT = 2u,
    /**
     * For 802.11ac
     */
    VHT = 3u,
    /**
     * For 802.11ax
     */
    HE = 4u,
};

/**
 * Connection Capabilities supported by current network and device
 */
struct ConnectionCapabilities final {
    /**
     * Wifi Technology
     */
    ::android::hardware::wifi::supplicant::V1_3::WifiTechnology technology __attribute__ ((aligned(4)));
    /**
     * channel bandwidth
     */
    ::android::hardware::wifi::V1_0::WifiChannelWidthInMhz channelBandwidth __attribute__ ((aligned(4)));
    /**
     * max number of Tx spatial streams
     */
    uint32_t maxNumberTxSpatialStreams __attribute__ ((aligned(4)));
    /**
     * max number of Rx spatial streams
     */
    uint32_t maxNumberRxSpatialStreams __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::wifi::supplicant::V1_3::ConnectionCapabilities, technology) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::supplicant::V1_3::ConnectionCapabilities, channelBandwidth) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::supplicant::V1_3::ConnectionCapabilities, maxNumberTxSpatialStreams) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::wifi::supplicant::V1_3::ConnectionCapabilities, maxNumberRxSpatialStreams) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::wifi::supplicant::V1_3::ConnectionCapabilities) == 16, "wrong size");
static_assert(__alignof(::android::hardware::wifi::supplicant::V1_3::ConnectionCapabilities) == 4, "wrong alignment");

/**
 * WPA Driver capability.
 */
enum class WpaDriverCapabilitiesMask : uint32_t {
    /**
     * Multi Band Operation.
     */
    MBO = 1u /* 1 << 0 */,
    /**
     * Optimized Connectivity Experience.
     */
    OCE = 2u /* 1 << 1 */,
};

/**
 * DppProgressCode: Progress codes for DPP (Easy Connect)
 */
enum class DppProgressCode : uint32_t {
    AUTHENTICATION_SUCCESS = 0u,
    RESPONSE_PENDING = 1u /* ::android::hardware::wifi::supplicant::V1_2::DppProgressCode.AUTHENTICATION_SUCCESS implicitly + 1 */,
    CONFIGURATION_SENT_WAITING_RESPONSE = 2u /* ::android::hardware::wifi::supplicant::V1_2::DppProgressCode.RESPONSE_PENDING implicitly + 1 */,
    CONFIGURATION_ACCEPTED = 3u /* ::android::hardware::wifi::supplicant::V1_3::DppProgressCode.CONFIGURATION_SENT_WAITING_RESPONSE implicitly + 1 */,
};

/**
