{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA3_N7android7details5TVec3IfEE",
   "name" : "android::details::TVec3<float> [3]",
   "referenced_type" : "_ZTIN7android7details5TVec3IfEE",
   "self_type" : "_ZTIA3_N7android7details5TVec3IfEE",
   "size" : 36,
   "source_file" : "frameworks/native/libs/ui/include/ui/Transform.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA3_m",
   "name" : "unsigned long [3]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA3_m",
   "size" : 24,
   "source_file" : "frameworks/native/libs/math/include/math/TMatHelpers.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4_N7android7details5TVec4IfEE",
   "name" : "android::details::TVec4<float> [4]",
   "referenced_type" : "_ZTIN7android7details5TVec4IfEE",
   "self_type" : "_ZTIA4_N7android7details5TVec4IfEE",
   "size" : 64,
   "source_file" : "frameworks/native/libs/math/include/math/mat4.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA64_c",
   "name" : "char [64]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA64_c",
   "size" : 64,
   "source_file" : "frameworks/native/libs/ui/include/ui/FatVector.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,

   "name" : "const android::details::TVec4<double>",
   "referenced_type" : "_ZTIN7android7details5TVec4IdEE",
   "self_type" : "_ZTIKN7android7details5TVec4IdEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android7details5TVec4IfEE",
   "name" : "const android::details::TVec4<float>",
   "referenced_type" : "_ZTIN7android7details5TVec4IfEE",
   "self_type" : "_ZTIKN7android7details5TVec4IfEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android7details6TMat33IT_EE",
   "name" : "const TMat33<T>",
   "referenced_type" : "_ZTIN7android7details6TMat33IT_EE",
   "self_type" : "_ZTIKN7android7details6TMat33IT_EE",
   "source_file" : "frameworks/native/libs/math/include/math/mat3.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android7details6TMat44IfEE",
   "name" : "const android::details::TMat44<float>",
   "referenced_type" : "_ZTIN7android7details6TMat44IfEE",
   "self_type" : "_ZTIKN7android7details6TMat44IfEE",
   "size" : 64,
   "source_file" : "frameworks/native/libs/math/include/math/mat4.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android9FloatRectE",
   "name" : "const android::FloatRect",
   "referenced_type" : "_ZTIN7android9FloatRectE",
   "self_type" : "_ZTIKN7android9FloatRectE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/ui/include/ui/FloatRect.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__117float_round_styleE",
   "name" : "const std::float_round_style",
   "referenced_type" : "_ZTINSt3__117float_round_styleE",
   "self_type" : "_ZTIKNSt3__117float_round_styleE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/math/include/math/half.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__118float_denorm_styleE",
   "name" : "const std::float_denorm_style",
   "referenced_type" : "_ZTINSt3__118float_denorm_styleE",
   "self_type" : "_ZTIKNSt3__118float_denorm_styleE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/math/include/math/half.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14hashIN7android4RectEEE",
   "name" : "const std::hash<android::Rect>",
   "referenced_type" : "_ZTINSt3__14hashIN7android4RectEEE",
   "self_type" : "_ZTIKNSt3__14hashIN7android4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14hashIN7android6RegionEEE",
   "name" : "const std::hash<android::Region>",
   "referenced_type" : "_ZTINSt3__14hashIN7android6RegionEEE",
   "self_type" : "_ZTIKNSt3__14hashIN7android6RegionEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Region.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14hashIN7android9FloatRectEEE",
   "name" : "const std::hash<android::FloatRect>",
   "referenced_type" : "_ZTINSt3__14hashIN7android9FloatRectEEE",
   "self_type" : "_ZTIKNSt3__14hashIN7android9FloatRectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/FloatRect.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__15arrayIfLm9EEE",
   "name" : "const std::array<float, 9>",
   "referenced_type" : "_ZTINSt3__15arrayIfLm9EEE",
   "self_type" : "_ZTIKNSt3__15arrayIfLm9EEE",
   "size" : 36,
   "source_file" : "frameworks/native/libs/ui/include/ui/Transform.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18functionIFT0_S1_EEE",
   "name" : "const function<type-parameter-0-1 (type-parameter-0-1)>",
   "referenced_type" : "_ZTINSt3__18functionIFT0_S1_EEE",
   "self_type" : "_ZTIKNSt3__18functionIFT0_S1_EEE",
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKT_IT0_E",
   "name" : "const <type-parameter-0-1>",
   "referenced_type" : "_ZTIT_IT0_E",
   "self_type" : "_ZTIKT_IT0_E",
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Size.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rotation.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/ui/include/ui/Size.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "frameworks/native/libs/math/include/math/TMatHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5ARect",
   "name" : "ARect",
   "referenced_type" : "_ZTI5ARect",
   "self_type" : "_ZTI5ARect",
   "size" : 16,
   "source_file" : "frameworks/native/libs/arect/include/android/rect.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "array",
     "referenced_type" : "_ZTIA64_c"
    },
    {
     "field_name" : "inUse",
     "field_offset" : 512,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android18InlineStdAllocatorINS_4RectELm4EE10AllocationE",
   "name" : "android::InlineStdAllocator<Rect, 4>::Allocation",
   "referenced_type" : "_ZTIN7android18InlineStdAllocatorINS_4RectELm4EE10AllocationE",
   "self_type" : "_ZTIN7android18InlineStdAllocatorINS_4RectELm4EE10AllocationE",
   "size" : 65,
   "source_file" : "frameworks/native/libs/ui/include/ui/FatVector.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mAllocation",
     "referenced_type" : "_ZTIRN7android18InlineStdAllocatorINS_4RectELm4EE10AllocationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android18InlineStdAllocatorINS_4RectELm4EEE",
   "name" : "android::InlineStdAllocator<android::Rect, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android18InlineStdAllocatorINS_4RectELm4EEE",
   "self_type" : "_ZTIN7android18InlineStdAllocatorINS_4RectELm4EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/ui/include/ui/FatVector.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_4RectEEE",
   "name" : "android::trait_trivial_copy<android::Rect>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_4RectEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_5PointEEE",
   "name" : "android::trait_trivial_copy<android::Point>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_5PointEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_5PointEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "_ZTIN7android5PointE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_4RectEEE",
   "name" : "android::trait_trivial_ctor<android::Rect>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_4RectEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_5PointEEE",
   "name" : "android::trait_trivial_ctor<android::Point>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_5PointEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_5PointEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "_ZTIN7android5PointE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_4RectEEE",
   "name" : "android::trait_trivial_dtor<android::Rect>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_4RectEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_5PointEEE",
   "name" : "android::trait_trivial_dtor<android::Point>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_5PointEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_5PointEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "_ZTIN7android5PointE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_4RectEEE",
   "name" : "android::trait_trivial_move<android::Rect>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_4RectEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_5PointEEE",
   "name" : "android::trait_trivial_move<android::Point>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_5PointEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_5PointEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h",
   "template_args" : [ "_ZTIN7android5PointE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android2ui4SizeE",
   "name" : "android::ui::Size",
   "referenced_type" : "_ZTIN7android2ui4SizeE",
   "self_type" : "_ZTIN7android2ui4SizeE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/ui/include/ui/Size.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA3_N7android7details5TVec3IfEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2ui9Transform5mat33E",
   "name" : "android::ui::Transform::mat33",
   "referenced_type" : "_ZTIN7android2ui9Transform5mat33E",
   "self_type" : "_ZTIN7android2ui9Transform5mat33E",
   "size" : 36,
   "source_file" : "frameworks/native/libs/ui/include/ui/Transform.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMatrix",
     "referenced_type" : "_ZTIN7android2ui9Transform5mat33E"
    },
    {
     "access" : "private",
     "field_name" : "mType",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android2ui9TransformE",
   "name" : "android::ui::Transform",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2ui9TransformE",
   "self_type" : "_ZTIN7android2ui9TransformE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/ui/include/ui/Transform.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI5ARect"
    },
    {
     "referenced_type" : "_ZTIN7android19LightFlattenablePodINS_4RectEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4RectE",
   "name" : "android::Rect",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4RectE",
   "self_type" : "_ZTIN7android4RectE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h"
  },
  {
   "access" : "private",
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "bits",
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android4half4fp16E",
   "name" : "android::half::fp16",
   "referenced_type" : "_ZTIN7android4half4fp16E",
   "self_type" : "_ZTIN7android4half4fp16E",
   "size" : 2,
   "source_file" : "frameworks/native/libs/math/include/math/half.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android4half4fp32Ut_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android4half4fp32E",
   "name" : "android::half::fp32",
   "referenced_type" : "_ZTIN7android4half4fp32E",
   "self_type" : "_ZTIN7android4half4fp32E",
   "size" : 4,
   "source_file" : "frameworks/native/libs/math/include/math/half.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bits",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fp",
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android4half4fp32Ut_E",
   "name" : "android::half::fp32::(anonymous union at frameworks/native/libs/math/include/math/half.h:71:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android4half4fp32Ut_E",
   "self_type" : "_ZTIN7android4half4fp32Ut_E",
   "size" : 4,
   "source_file" : "frameworks/native/libs/math/include/math/half.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBits",
     "referenced_type" : "_ZTIN7android4half4fp16E"
    }
   ],
   "linker_set_key" : "_ZTIN7android4halfE",
   "name" : "android::half",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4halfE",
   "self_type" : "_ZTIN7android4halfE",
   "size" : 2,
   "source_file" : "frameworks/native/libs/math/include/math/half.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android19LightFlattenablePodINS_5PointEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android5PointE",
   "name" : "android::Point",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5PointE",
   "self_type" : "_ZTIN7android5PointE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/ui/include/ui/Point.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android16LightFlattenableINS_6RegionEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "referenced_type" : "_ZTIN7android9FatVectorINS_4RectELm4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RegionE",
   "name" : "android::Region",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RegionE",
   "self_type" : "_ZTIN7android6RegionE",
   "size" : 104,
   "source_file" : "frameworks/native/libs/ui/include/ui/Region.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details10TQuatDebugINS0_11TQuaternionEdEE",
   "name" : "android::details::TQuatDebug<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details10TQuatDebugINS0_11TQuaternionEdEE",
   "self_type" : "_ZTIN7android7details10TQuatDebugINS0_11TQuaternionEdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details10TQuatDebugINS0_11TQuaternionEfEE",
   "name" : "android::details::TQuatDebug<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details10TQuatDebugINS0_11TQuaternionEfEE",
   "self_type" : "_ZTIN7android7details10TQuatDebugINS0_11TQuaternionEfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details11TMatHelpersINS0_6TMat44EfEE",
   "name" : "android::details::TMatHelpers<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details11TMatHelpersINS0_6TMat44EfEE",
   "self_type" : "_ZTIN7android7details11TMatHelpersINS0_6TMat44EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_11TQuaternionEdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_11TQuaternionEdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_11TQuaternionEdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details21TQuatProductOperatorsINS0_11TQuaternionEdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details14TQuatFunctionsINS0_11TQuaternionEdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details10TQuatDebugINS0_11TQuaternionEdEE"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details11TQuaternionIdEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android7details11TQuaternionIdEE",
   "name" : "android::details::TQuaternion<double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details11TQuaternionIdEE",
   "self_type" : "_ZTIN7android7details11TQuaternionIdEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/math/include/math/quat.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details11TQuaternionIdEUt_Ut_E"
    },
    {
     "field_name" : "xyzw",
     "referenced_type" : "_ZTIN7android7details5TVec4IdEE"
    },
    {
     "field_name" : "xyz",
     "referenced_type" : "_ZTIN7android7details5TVec3IdEE"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "_ZTIN7android7details5TVec2IdEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details11TQuaternionIdEUt_E",
   "name" : "android::details::TQuaternion<double>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android7details11TQuaternionIdEUt_E",
   "self_type" : "_ZTIN7android7details11TQuaternionIdEUt_E",
   "size" : 32,
   "source_file" : "frameworks/native/libs/math/include/math/quat.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "y",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "z",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "w",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details11TQuaternionIdEUt_Ut_E",
   "name" : "android::details::TQuaternion<double>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5)::(anonymous struct at frameworks/native/libs/math/include/math/quat.h:66:9)",
   "referenced_type" : "_ZTIN7android7details11TQuaternionIdEUt_Ut_E",
   "self_type" : "_ZTIN7android7details11TQuaternionIdEUt_Ut_E",
   "size" : 32,
   "source_file" : "frameworks/native/libs/math/include/math/quat.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_11TQuaternionEfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_11TQuaternionEfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_11TQuaternionEfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details21TQuatProductOperatorsINS0_11TQuaternionEfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details14TQuatFunctionsINS0_11TQuaternionEfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details10TQuatDebugINS0_11TQuaternionEfEE"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details11TQuaternionIfEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android7details11TQuaternionIfEE",
   "name" : "android::details::TQuaternion<float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details11TQuaternionIfEE",
   "self_type" : "_ZTIN7android7details11TQuaternionIfEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/quat.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details11TQuaternionIfEUt_Ut_E"
    },
    {
     "field_name" : "xyzw",
     "referenced_type" : "_ZTIN7android7details5TVec4IfEE"
    },
    {
     "field_name" : "xyz",
     "referenced_type" : "_ZTIN7android7details5TVec3IfEE"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "_ZTIN7android7details5TVec2IfEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details11TQuaternionIfEUt_E",
   "name" : "android::details::TQuaternion<float>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android7details11TQuaternionIfEUt_E",
   "self_type" : "_ZTIN7android7details11TQuaternionIfEUt_E",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/quat.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "w",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details11TQuaternionIfEUt_Ut_E",
   "name" : "android::details::TQuaternion<float>::(anonymous union at frameworks/native/libs/math/include/math/quat.h:65:5)::(anonymous struct at frameworks/native/libs/math/include/math/quat.h:66:9)",
   "referenced_type" : "_ZTIN7android7details11TQuaternionIfEUt_Ut_E",
   "self_type" : "_ZTIN7android7details11TQuaternionIfEUt_Ut_E",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/quat.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details13TMatTransformINS0_6TMat44EfEE",
   "name" : "android::details::TMatTransform<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details13TMatTransformINS0_6TMat44EfEE",
   "self_type" : "_ZTIN7android7details13TMatTransformINS0_6TMat44EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec2EdEE",
   "name" : "android::details::TVecFunctions<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec2EdEE",
   "self_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec2EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec2EfEE",
   "name" : "android::details::TVecFunctions<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec2EfEE",
   "self_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec2EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec3EdEE",
   "name" : "android::details::TVecFunctions<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec3EdEE",
   "self_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec3EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec3EfEE",
   "name" : "android::details::TVecFunctions<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec3EfEE",
   "self_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec3EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec4EdEE",
   "name" : "android::details::TVecFunctions<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec4EdEE",
   "self_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec4EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec4EfEE",
   "name" : "android::details::TVecFunctions<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec4EfEE",
   "self_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec4EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details14TQuatFunctionsINS0_11TQuaternionEdEE",
   "name" : "android::details::TQuatFunctions<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details14TQuatFunctionsINS0_11TQuaternionEdEE",
   "self_type" : "_ZTIN7android7details14TQuatFunctionsINS0_11TQuaternionEdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details14TQuatFunctionsINS0_11TQuaternionEfEE",
   "name" : "android::details::TQuatFunctions<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details14TQuatFunctionsINS0_11TQuaternionEfEE",
   "self_type" : "_ZTIN7android7details14TQuatFunctionsINS0_11TQuaternionEfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details16TVecAddOperatorsINS0_11TQuaternionEdEE",
   "name" : "android::details::TVecAddOperators<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_11TQuaternionEdEE",
   "self_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_11TQuaternionEdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details16TVecAddOperatorsINS0_11TQuaternionEfEE",
   "name" : "android::details::TVecAddOperators<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_11TQuaternionEfEE",
   "self_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_11TQuaternionEfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec2EdEE",
   "name" : "android::details::TVecAddOperators<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec2EdEE",
   "self_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec2EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec2EfEE",
   "name" : "android::details::TVecAddOperators<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec2EfEE",
   "self_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec2EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec3EdEE",
   "name" : "android::details::TVecAddOperators<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec3EdEE",
   "self_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec3EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec3EfEE",
   "name" : "android::details::TVecAddOperators<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec3EfEE",
   "self_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec3EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec4EdEE",
   "name" : "android::details::TVecAddOperators<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec4EdEE",
   "self_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec4EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec4EfEE",
   "name" : "android::details::TVecAddOperators<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec4EfEE",
   "self_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec4EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details16TVecAddOperatorsINS0_6TMat44EfEE",
   "name" : "android::details::TVecAddOperators<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_6TMat44EfEE",
   "self_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_6TMat44EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_11TQuaternionEdEE",
   "name" : "android::details::TVecUnaryOperators<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_11TQuaternionEdEE",
   "self_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_11TQuaternionEdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_11TQuaternionEfEE",
   "name" : "android::details::TVecUnaryOperators<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_11TQuaternionEfEE",
   "self_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_11TQuaternionEfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec2EdEE",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec2EdEE",
   "self_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec2EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec2EfEE",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec2EfEE",
   "self_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec2EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec3EdEE",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec3EdEE",
   "self_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec3EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec3EfEE",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec3EfEE",
   "self_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec3EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec4EdEE",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec4EdEE",
   "self_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec4EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec4EfEE",
   "name" : "android::details::TVecUnaryOperators<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec4EfEE",
   "self_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec4EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_6TMat44EfEE",
   "name" : "android::details::TVecUnaryOperators<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_6TMat44EfEE",
   "self_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_6TMat44EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details19TMatSquareFunctionsINS0_6TMat44EfEE",
   "name" : "android::details::TMatSquareFunctions<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details19TMatSquareFunctionsINS0_6TMat44EfEE",
   "self_type" : "_ZTIN7android7details19TMatSquareFunctionsINS0_6TMat44EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details20TMatProductOperatorsINS0_6TMat44EfEE",
   "name" : "android::details::TMatProductOperators<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details20TMatProductOperatorsINS0_6TMat44EfEE",
   "self_type" : "_ZTIN7android7details20TMatProductOperatorsINS0_6TMat44EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec2EdEE",
   "name" : "android::details::TVecProductOperators<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec2EdEE",
   "self_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec2EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec2EfEE",
   "name" : "android::details::TVecProductOperators<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec2EfEE",
   "self_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec2EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec3EdEE",
   "name" : "android::details::TVecProductOperators<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec3EdEE",
   "self_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec3EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec3EfEE",
   "name" : "android::details::TVecProductOperators<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec3EfEE",
   "self_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec3EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec4EdEE",
   "name" : "android::details::TVecProductOperators<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec4EdEE",
   "self_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec4EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec4EfEE",
   "name" : "android::details::TVecProductOperators<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec4EfEE",
   "self_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec4EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details21TQuatProductOperatorsINS0_11TQuaternionEdEE",
   "name" : "android::details::TQuatProductOperators<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details21TQuatProductOperatorsINS0_11TQuaternionEdEE",
   "self_type" : "_ZTIN7android7details21TQuatProductOperatorsINS0_11TQuaternionEdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details21TQuatProductOperatorsINS0_11TQuaternionEfEE",
   "name" : "android::details::TQuatProductOperators<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details21TQuatProductOperatorsINS0_11TQuaternionEfEE",
   "self_type" : "_ZTIN7android7details21TQuatProductOperatorsINS0_11TQuaternionEfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TQuatHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_11TQuaternionEdEE",
   "name" : "android::details::TVecComparisonOperators<android::details::TQuaternion, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_11TQuaternionEdEE",
   "self_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_11TQuaternionEdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_11TQuaternionEfEE",
   "name" : "android::details::TVecComparisonOperators<android::details::TQuaternion, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_11TQuaternionEfEE",
   "self_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_11TQuaternionEfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec2EdEE",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec2EdEE",
   "self_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec2EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec2EfEE",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec2EfEE",
   "self_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec2EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec3EdEE",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec3EdEE",
   "self_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec3EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec3EfEE",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec3EfEE",
   "self_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec3EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec4EdEE",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec4EdEE",
   "self_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec4EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec4EfEE",
   "name" : "android::details::TVecComparisonOperators<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec4EfEE",
   "self_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec4EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_6TMat44EfEE",
   "name" : "android::details::TVecComparisonOperators<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_6TMat44EfEE",
   "self_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_6TMat44EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec2EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec2EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec2EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec2EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec2EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec2EdEE"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec2IdEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android7details5TVec2IdEE",
   "name" : "android::details::TVec2<double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details5TVec2IdEE",
   "self_type" : "_ZTIN7android7details5TVec2IdEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec2IdEUt_Ut_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec2IdEUt_Ut0_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec2IdEUt_Ut1_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec2IdEUt_E",
   "name" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android7details5TVec2IdEUt_E",
   "self_type" : "_ZTIN7android7details5TVec2IdEUt_E",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec2IdEUt_Ut0_E",
   "name" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:51:9)",
   "referenced_type" : "_ZTIN7android7details5TVec2IdEUt_Ut0_E",
   "self_type" : "_ZTIN7android7details5TVec2IdEUt_Ut0_E",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "g",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec2IdEUt_Ut1_E",
   "name" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:52:9)",
   "referenced_type" : "_ZTIN7android7details5TVec2IdEUt_Ut1_E",
   "self_type" : "_ZTIN7android7details5TVec2IdEUt_Ut1_E",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "y",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec2IdEUt_Ut_E",
   "name" : "android::details::TVec2<double>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:50:9)",
   "referenced_type" : "_ZTIN7android7details5TVec2IdEUt_Ut_E",
   "self_type" : "_ZTIN7android7details5TVec2IdEUt_Ut_E",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec2EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec2EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec2EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec2EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec2EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec2EfEE"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec2IfEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android7details5TVec2IfEE",
   "name" : "android::details::TVec2<float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details5TVec2IfEE",
   "self_type" : "_ZTIN7android7details5TVec2IfEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec2IfEUt_Ut_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec2IfEUt_Ut0_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec2IfEUt_Ut1_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec2IfEUt_E",
   "name" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android7details5TVec2IfEUt_E",
   "self_type" : "_ZTIN7android7details5TVec2IfEUt_E",
   "size" : 8,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec2IfEUt_Ut0_E",
   "name" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:51:9)",
   "referenced_type" : "_ZTIN7android7details5TVec2IfEUt_Ut0_E",
   "self_type" : "_ZTIN7android7details5TVec2IfEUt_Ut0_E",
   "size" : 8,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "g",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec2IfEUt_Ut1_E",
   "name" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:52:9)",
   "referenced_type" : "_ZTIN7android7details5TVec2IfEUt_Ut1_E",
   "self_type" : "_ZTIN7android7details5TVec2IfEUt_Ut1_E",
   "size" : 8,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec2IfEUt_Ut_E",
   "name" : "android::details::TVec2<float>::(anonymous union at frameworks/native/libs/math/include/math/vec2.h:49:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec2.h:50:9)",
   "referenced_type" : "_ZTIN7android7details5TVec2IfEUt_Ut_E",
   "self_type" : "_ZTIN7android7details5TVec2IfEUt_Ut_E",
   "size" : 8,
   "source_file" : "frameworks/native/libs/math/include/math/vec2.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec3EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec3EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec3EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec3EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec3EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec3EdEE"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec3IdEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android7details5TVec3IdEE",
   "name" : "android::details::TVec3<double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details5TVec3IdEE",
   "self_type" : "_ZTIN7android7details5TVec3IdEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/math/include/math/vec3.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec3IdEUt_Ut_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec3IdEUt_Ut0_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec3IdEUt_Ut1_E"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "_ZTIN7android7details5TVec2IdEE"
    },
    {
     "field_name" : "st",
     "referenced_type" : "_ZTIN7android7details5TVec2IdEE"
    },
    {
     "field_name" : "rg",
     "referenced_type" : "_ZTIN7android7details5TVec2IdEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec3IdEUt_E",
   "name" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android7details5TVec3IdEUt_E",
   "self_type" : "_ZTIN7android7details5TVec3IdEUt_E",
   "size" : 24,
   "source_file" : "frameworks/native/libs/math/include/math/vec3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "p",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec3IdEUt_Ut0_E",
   "name" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:49:9)",
   "referenced_type" : "_ZTIN7android7details5TVec3IdEUt_Ut0_E",
   "self_type" : "_ZTIN7android7details5TVec3IdEUt_Ut0_E",
   "size" : 24,
   "source_file" : "frameworks/native/libs/math/include/math/vec3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "g",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "b",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec3IdEUt_Ut1_E",
   "name" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:50:9)",
   "referenced_type" : "_ZTIN7android7details5TVec3IdEUt_Ut1_E",
   "self_type" : "_ZTIN7android7details5TVec3IdEUt_Ut1_E",
   "size" : 24,
   "source_file" : "frameworks/native/libs/math/include/math/vec3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "y",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "z",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec3IdEUt_Ut_E",
   "name" : "android::details::TVec3<double>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:48:9)",
   "referenced_type" : "_ZTIN7android7details5TVec3IdEUt_Ut_E",
   "self_type" : "_ZTIN7android7details5TVec3IdEUt_Ut_E",
   "size" : 24,
   "source_file" : "frameworks/native/libs/math/include/math/vec3.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec3EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec3EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec3EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec3EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec3EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec3EfEE"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec3IfEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android7details5TVec3IfEE",
   "name" : "android::details::TVec3<float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details5TVec3IfEE",
   "self_type" : "_ZTIN7android7details5TVec3IfEE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/math/include/math/vec3.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec3IfEUt_Ut_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec3IfEUt_Ut0_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec3IfEUt_Ut1_E"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "_ZTIN7android7details5TVec2IfEE"
    },
    {
     "field_name" : "st",
     "referenced_type" : "_ZTIN7android7details5TVec2IfEE"
    },
    {
     "field_name" : "rg",
     "referenced_type" : "_ZTIN7android7details5TVec2IfEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec3IfEUt_E",
   "name" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android7details5TVec3IfEUt_E",
   "self_type" : "_ZTIN7android7details5TVec3IfEUt_E",
   "size" : 12,
   "source_file" : "frameworks/native/libs/math/include/math/vec3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "p",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec3IfEUt_Ut0_E",
   "name" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:49:9)",
   "referenced_type" : "_ZTIN7android7details5TVec3IfEUt_Ut0_E",
   "self_type" : "_ZTIN7android7details5TVec3IfEUt_Ut0_E",
   "size" : 12,
   "source_file" : "frameworks/native/libs/math/include/math/vec3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "g",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec3IfEUt_Ut1_E",
   "name" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:50:9)",
   "referenced_type" : "_ZTIN7android7details5TVec3IfEUt_Ut1_E",
   "self_type" : "_ZTIN7android7details5TVec3IfEUt_Ut1_E",
   "size" : 12,
   "source_file" : "frameworks/native/libs/math/include/math/vec3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec3IfEUt_Ut_E",
   "name" : "android::details::TVec3<float>::(anonymous union at frameworks/native/libs/math/include/math/vec3.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec3.h:48:9)",
   "referenced_type" : "_ZTIN7android7details5TVec3IfEUt_Ut_E",
   "self_type" : "_ZTIN7android7details5TVec3IfEUt_Ut_E",
   "size" : 12,
   "source_file" : "frameworks/native/libs/math/include/math/vec3.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec4EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec4EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec4EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec4EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec4EdEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec4EdEE"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec4IdEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android7details5TVec4IdEE",
   "name" : "android::details::TVec4<double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details5TVec4IdEE",
   "self_type" : "_ZTIN7android7details5TVec4IdEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec4IdEUt_Ut_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec4IdEUt_Ut0_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec4IdEUt_Ut1_E"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "_ZTIN7android7details5TVec2IdEE"
    },
    {
     "field_name" : "st",
     "referenced_type" : "_ZTIN7android7details5TVec2IdEE"
    },
    {
     "field_name" : "rg",
     "referenced_type" : "_ZTIN7android7details5TVec2IdEE"
    },
    {
     "field_name" : "xyz",
     "referenced_type" : "_ZTIN7android7details5TVec3IdEE"
    },
    {
     "field_name" : "stp",
     "referenced_type" : "_ZTIN7android7details5TVec3IdEE"
    },
    {
     "field_name" : "rgb",
     "referenced_type" : "_ZTIN7android7details5TVec3IdEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec4IdEUt_E",
   "name" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android7details5TVec4IdEUt_E",
   "self_type" : "_ZTIN7android7details5TVec4IdEUt_E",
   "size" : 32,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "t",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "p",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "q",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec4IdEUt_Ut0_E",
   "name" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:49:9)",
   "referenced_type" : "_ZTIN7android7details5TVec4IdEUt_Ut0_E",
   "self_type" : "_ZTIN7android7details5TVec4IdEUt_Ut0_E",
   "size" : 32,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "g",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "b",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "a",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec4IdEUt_Ut1_E",
   "name" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:50:9)",
   "referenced_type" : "_ZTIN7android7details5TVec4IdEUt_Ut1_E",
   "self_type" : "_ZTIN7android7details5TVec4IdEUt_Ut1_E",
   "size" : 32,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "y",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "z",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "w",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec4IdEUt_Ut_E",
   "name" : "android::details::TVec4<double>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:48:9)",
   "referenced_type" : "_ZTIN7android7details5TVec4IdEUt_Ut_E",
   "self_type" : "_ZTIN7android7details5TVec4IdEUt_Ut_E",
   "size" : 32,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7details20TVecProductOperatorsINS0_5TVec4EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_5TVec4EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_5TVec4EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_5TVec4EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details13TVecFunctionsINS0_5TVec4EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec4EfEE"
    }
   ],
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec4IfEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android7details5TVec4IfEE",
   "name" : "android::details::TVec4<float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details5TVec4IfEE",
   "self_type" : "_ZTIN7android7details5TVec4IfEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7android7details5TVec4IfEUt_Ut_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec4IfEUt_Ut0_E"
    },
    {
     "referenced_type" : "_ZTIN7android7details5TVec4IfEUt_Ut1_E"
    },
    {
     "field_name" : "xy",
     "referenced_type" : "_ZTIN7android7details5TVec2IfEE"
    },
    {
     "field_name" : "st",
     "referenced_type" : "_ZTIN7android7details5TVec2IfEE"
    },
    {
     "field_name" : "rg",
     "referenced_type" : "_ZTIN7android7details5TVec2IfEE"
    },
    {
     "field_name" : "xyz",
     "referenced_type" : "_ZTIN7android7details5TVec3IfEE"
    },
    {
     "field_name" : "stp",
     "referenced_type" : "_ZTIN7android7details5TVec3IfEE"
    },
    {
     "field_name" : "rgb",
     "referenced_type" : "_ZTIN7android7details5TVec3IfEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec4IfEUt_E",
   "name" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android7details5TVec4IfEUt_E",
   "self_type" : "_ZTIN7android7details5TVec4IfEUt_E",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "t",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "p",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "q",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec4IfEUt_Ut0_E",
   "name" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:49:9)",
   "referenced_type" : "_ZTIN7android7details5TVec4IfEUt_Ut0_E",
   "self_type" : "_ZTIN7android7details5TVec4IfEUt_Ut0_E",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "g",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "a",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec4IfEUt_Ut1_E",
   "name" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:50:9)",
   "referenced_type" : "_ZTIN7android7details5TVec4IfEUt_Ut1_E",
   "self_type" : "_ZTIN7android7details5TVec4IfEUt_Ut1_E",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "w",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android7details5TVec4IfEUt_Ut_E",
   "name" : "android::details::TVec4<float>::(anonymous union at frameworks/native/libs/math/include/math/vec4.h:47:5)::(anonymous struct at frameworks/native/libs/math/include/math/vec4.h:48:9)",
   "referenced_type" : "_ZTIN7android7details5TVec4IfEUt_Ut_E",
   "self_type" : "_ZTIN7android7details5TVec4IfEUt_Ut_E",
   "size" : 16,
   "source_file" : "frameworks/native/libs/math/include/math/vec4.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7details18TVecUnaryOperatorsINS0_6TMat44EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details23TVecComparisonOperatorsINS0_6TMat44EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details16TVecAddOperatorsINS0_6TMat44EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details20TMatProductOperatorsINS0_6TMat44EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details19TMatSquareFunctionsINS0_6TMat44EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details13TMatTransformINS0_6TMat44EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details11TMatHelpersINS0_6TMat44EfEE"
    },
    {
     "referenced_type" : "_ZTIN7android7details9TMatDebugINS0_6TMat44EfEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_value",
     "referenced_type" : "_ZTIA4_N7android7details5TVec4IfEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7details6TMat44IfEE",
   "name" : "android::details::TMat44<float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details6TMat44IfEE",
   "self_type" : "_ZTIN7android7details6TMat44IfEE",
   "size" : 64,
   "source_file" : "frameworks/native/libs/math/include/math/mat4.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details9TMatDebugINS0_6TMat44EfEE",
   "name" : "android::details::TMatDebug<android::details::TMat44, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details9TMatDebugINS0_6TMat44EfEE",
   "self_type" : "_ZTIN7android7details9TMatDebugINS0_6TMat44EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TMatHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details9TVecDebugINS0_5TVec2EdEE",
   "name" : "android::details::TVecDebug<android::details::TVec2, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec2EdEE",
   "self_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec2EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details9TVecDebugINS0_5TVec2EfEE",
   "name" : "android::details::TVecDebug<android::details::TVec2, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec2EfEE",
   "self_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec2EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details9TVecDebugINS0_5TVec3EdEE",
   "name" : "android::details::TVecDebug<android::details::TVec3, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec3EdEE",
   "self_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec3EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details9TVecDebugINS0_5TVec3EfEE",
   "name" : "android::details::TVecDebug<android::details::TVec3, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec3EfEE",
   "self_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec3EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details9TVecDebugINS0_5TVec4EdEE",
   "name" : "android::details::TVecDebug<android::details::TVec4, double>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec4EdEE",
   "self_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec4EdEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7details9TVecDebugINS0_5TVec4EfEE",
   "name" : "android::details::TVecDebug<android::details::TVec4, float>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec4EfEE",
   "self_type" : "_ZTIN7android7details9TVecDebugINS0_5TVec4EfEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/TVecHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16vectorIN7android4RectENS1_18InlineStdAllocatorIS2_Lm4EEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAllocation",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN7android18InlineStdAllocatorINS_4RectELm4EE10AllocationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android9FatVectorINS_4RectELm4EEE",
   "name" : "android::FatVector<android::Rect, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android9FatVectorINS_4RectELm4EEE",
   "self_type" : "_ZTIN7android9FatVectorINS_4RectELm4EEE",
   "size" : 104,
   "source_file" : "frameworks/native/libs/ui/include/ui/FatVector.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN7android9FloatRectE",
   "name" : "android::FloatRect",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android9FloatRectE",
   "self_type" : "_ZTIN7android9FloatRectE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/ui/include/ui/FloatRect.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIN7android4halfEEE",
   "name" : "std::numeric_limits<android::half>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__114numeric_limitsIN7android4halfEEE",
   "self_type" : "_ZTINSt3__114numeric_limitsIN7android4halfEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/half.h",
   "template_args" : [ "_ZTIN7android4halfE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__117is_floating_pointIN7android4halfEEE",
   "name" : "std::is_floating_point<android::half>",
   "referenced_type" : "_ZTINSt3__117is_floating_pointIN7android4halfEEE",
   "self_type" : "_ZTINSt3__117is_floating_pointIN7android4halfEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/half.h",
   "template_args" : [ "_ZTIN7android4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN7android4RectEEE",
   "name" : "std::hash<android::Rect>",
   "referenced_type" : "_ZTINSt3__14hashIN7android4RectEEE",
   "self_type" : "_ZTINSt3__14hashIN7android4RectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Rect.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN7android4halfEEE",
   "name" : "std::hash<android::half>",
   "referenced_type" : "_ZTINSt3__14hashIN7android4halfEEE",
   "self_type" : "_ZTINSt3__14hashIN7android4halfEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/math/include/math/half.h",
   "template_args" : [ "_ZTIN7android4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN7android6RegionEEE",
   "name" : "std::hash<android::Region>",
   "referenced_type" : "_ZTINSt3__14hashIN7android6RegionEEE",
   "self_type" : "_ZTINSt3__14hashIN7android6RegionEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/Region.h",
   "template_args" : [ "_ZTIN7android6RegionE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN7android9FloatRectEEE",
   "name" : "std::hash<android::FloatRect>",
   "referenced_type" : "_ZTINSt3__14hashIN7android9FloatRectEEE",
   "self_type" : "_ZTINSt3__14hashIN7android9FloatRectEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/ui/include/ui/FloatRect.h",
   "template_args" : [ "_ZTIN7android9FloatRectE" ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIOi",
   "name" : "int &&",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIOi",
   "size" : 8,
   "source_file" : "frameworks/native/libs/ui/include/ui/Size.h"
  }
 ]
}
