<abi-corpus version='2.0' path='tests/data/test-read-dwarf/libtest24-drop-fns.so'>
  <elf-needed>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_Z3barRKSs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z3fooRKSs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNSt11char_traitsIcE6lengthEPKc' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZStplIcSt11char_traitsIcESaIcEESbIT_T0_T1_EPKS3_RKS6_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='test24-drop-fns.cc' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-6'/>
    <type-decl name='float' size-in-bits='32' id='type-id-7'/>
    <type-decl name='int' size-in-bits='32' id='type-id-8'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-9'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-10'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-11'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-12'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-13'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-4'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-14'/>
    <type-decl name='void' id='type-id-15'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-16'/>
    <typedef-decl name='_Atomic_word' type-id='type-id-8' filepath='/usr/include/c++/5.3.1/x86_64-redhat-linux/bits/atomic_word.h' line='32' column='1' id='type-id-17'/>
    <typedef-decl name='wint_t' type-id='type-id-4' filepath='/usr/lib/gcc/x86_64-redhat-linux/5.3.1/include/stddef.h' line='357' column='1' id='type-id-18'/>
    <typedef-decl name='__FILE' type-id='type-id-19' filepath='/usr/include/stdio.h' line='64' column='1' id='type-id-20'/>
    <typedef-decl name='size_t' type-id='type-id-14' filepath='/usr/lib/gcc/x86_64-redhat-linux/5.3.1/include/stddef.h' line='216' column='1' id='type-id-21'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/wchar.h' line='83' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-8' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-22' filepath='/usr/include/wchar.h' line='94' column='1' id='type-id-23'/>
    <typedef-decl name='mbstate_t' type-id='type-id-23' filepath='/usr/include/wchar.h' line='106' column='1' id='type-id-24'/>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='133' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-10' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-26' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='53' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-28' visibility='default' filepath='/usr/include/locale.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-28' visibility='default' filepath='/usr/include/locale.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-28' visibility='default' filepath='/usr/include/locale.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-28' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-28' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-28' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-28' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-28' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-28' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-28' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wctype_t' type-id='type-id-14' filepath='/usr/include/wctype.h' line='52' column='1' id='type-id-29'/>
    <typedef-decl name='__int32_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-30'/>
    <typedef-decl name='wctrans_t' type-id='type-id-31' filepath='/usr/include/wctype.h' line='186' column='1' id='type-id-32'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-35'/>
    <reference-type-def kind='lvalue' type-id='type-id-2' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-28'/>
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-37'/>
    <reference-type-def kind='lvalue' type-id='type-id-37' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-39'/>
    <qualified-type-def type-id='type-id-30' const='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-31'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-41'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-42'/>
    <reference-type-def kind='lvalue' type-id='type-id-42' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-44'/>
    <qualified-type-def type-id='type-id-8' const='yes' id='type-id-45'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-46'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-49'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-51'/>
    <reference-type-def kind='lvalue' type-id='type-id-51' size-in-bits='64' id='type-id-52'/>
    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-54'/>
    <reference-type-def kind='lvalue' type-id='type-id-54' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-56'/>
    <qualified-type-def type-id='type-id-57' const='yes' id='type-id-58'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-59'/>
    <qualified-type-def type-id='type-id-60' const='yes' id='type-id-61'/>
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-63'/>
    <reference-type-def kind='lvalue' type-id='type-id-63' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-65'/>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-67'/>
    <reference-type-def kind='lvalue' type-id='type-id-67' size-in-bits='64' id='type-id-68'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-70'/>
    <qualified-type-def type-id='type-id-71' id='type-id-72'/>
    <reference-type-def kind='lvalue' type-id='type-id-70' size-in-bits='64' id='type-id-71'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-73'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-74'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-75'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-76'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-81'/>
    <reference-type-def kind='lvalue' type-id='type-id-53' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-85'/>
    <reference-type-def kind='lvalue' type-id='type-id-57' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-87'/>
    <reference-type-def kind='lvalue' type-id='type-id-62' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <namespace-decl name='__gnu_cxx'>
      <class-decl name='new_allocator&lt;char&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='58' column='1' id='type-id-34'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-96' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='61' column='1' id='type-id-95'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-28' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='63' column='1' id='type-id-97'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-26' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='64' column='1' id='type-id-98'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-36' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='65' column='1' id='type-id-99'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-43' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='66' column='1' id='type-id-100'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='new_allocator' mangled-name='_ZN9__gnu_cxx13new_allocatorIcEC4Ev' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-35' is-artificial='yes'/>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='new_allocator' mangled-name='_ZN9__gnu_cxx13new_allocatorIcEC4ERKS1_' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-35' is-artificial='yes'/>
            <parameter type-id='type-id-38'/>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~new_allocator' mangled-name='_ZN9__gnu_cxx13new_allocatorIcED4Ev' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-35' is-artificial='yes'/>
            <parameter type-id='type-id-8' is-artificial='yes'/>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='address' mangled-name='_ZNK9__gnu_cxx13new_allocatorIcE7addressERc' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-39' is-artificial='yes'/>
            <parameter type-id='type-id-99'/>
            <return type-id='type-id-97'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='address' mangled-name='_ZNK9__gnu_cxx13new_allocatorIcE7addressERKc' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-39' is-artificial='yes'/>
            <parameter type-id='type-id-100'/>
            <return type-id='type-id-98'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='allocate' mangled-name='_ZN9__gnu_cxx13new_allocatorIcE8allocateEmPKv' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-35' is-artificial='yes'/>
            <parameter type-id='type-id-95'/>
            <parameter type-id='type-id-5'/>
            <return type-id='type-id-97'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='deallocate' mangled-name='_ZN9__gnu_cxx13new_allocatorIcE10deallocateEPcm' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-35' is-artificial='yes'/>
            <parameter type-id='type-id-97'/>
            <parameter type-id='type-id-95'/>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='max_size' mangled-name='_ZNK9__gnu_cxx13new_allocatorIcE8max_sizeEv' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-39' is-artificial='yes'/>
            <return type-id='type-id-95'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='construct' mangled-name='_ZN9__gnu_cxx13new_allocatorIcE9constructEPcRKc' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-35' is-artificial='yes'/>
            <parameter type-id='type-id-97'/>
            <parameter type-id='type-id-43'/>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='destroy' mangled-name='_ZN9__gnu_cxx13new_allocatorIcE7destroyEPc' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-35' is-artificial='yes'/>
            <parameter type-id='type-id-97'/>
            <return type-id='type-id-15'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='55' column='1' id='type-id-101'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-45' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIiE5__minE' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-45' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIiE5__maxE' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-41' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-45' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='55' column='1' id='type-id-102'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-75' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-75' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-41' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-45' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerImE8__digitsE' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='55' column='1' id='type-id-103'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-42' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-42' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIcE5__maxE' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-41' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-45' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;short int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='55' column='1' id='type-id-104'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-49' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIsE5__minE' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-49' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIsE5__maxE' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-41' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-45' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__numeric_traits_integer&lt;long int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='55' column='1' id='type-id-105'>
        <data-member access='public' static='yes'>
          <var-decl name='__min' type-id='type-id-46' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIlE5__minE' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__max' type-id='type-id-46' mangled-name='_ZN9__gnu_cxx24__numeric_traits_integerIlE5__maxE' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__is_signed' type-id='type-id-41' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='__digits' type-id='type-id-45' visibility='default' filepath='/usr/include/c++/5.3.1/ext/numeric_traits.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__normal_iterator&lt;char*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-106'/>
      <class-decl name='__normal_iterator&lt;char const*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-107'/>
    </namespace-decl>
    <namespace-decl name='std'>
      <typedef-decl name='ostream' type-id='type-id-108' filepath='/usr/include/c++/5.3.1/iosfwd' line='141' column='1' id='type-id-90'/>
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2510' column='1' id='type-id-53'>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2670' column='1' id='type-id-84'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-50'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='type-id-28' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2675' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-109' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2519' column='1' id='type-id-60'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-50' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2518' column='1' id='type-id-110'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-112' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2521' column='1' id='type-id-111'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-114' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2522' column='1' id='type-id-113'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-106' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2525' column='1' id='type-id-115'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-107' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2527' column='1' id='type-id-116'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-118' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2528' column='1' id='type-id-117'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-120' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2529' column='1' id='type-id-119'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep_base' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2546' column='1' id='type-id-121'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_length' type-id='type-id-60' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2548' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_capacity' type-id='type-id-60' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2549' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_refcount' type-id='type-id-17' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2550' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2553' column='1' id='type-id-57'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-121'/>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='type-id-61' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.tcc' line='494' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='type-id-42' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.tcc' line='499' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='type-id-61' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2683' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='type-id-84' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2687' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='allocator&lt;char&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='92' column='1' id='type-id-50'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-34'/>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-96' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='95' column='1' id='type-id-109'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-36' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='99' column='1' id='type-id-112'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-43' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='100' column='1' id='type-id-114'/>
        </member-type>
      </class-decl>
      <typedef-decl name='size_t' type-id='type-id-14' filepath='/usr/include/c++/5.3.1/x86_64-redhat-linux/bits/c++config.h' line='1969' column='1' id='type-id-96'/>
      <class-decl name='char_traits&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='233' column='1' id='type-id-122'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='type-id-2' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='235' column='1' id='type-id-62'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-8' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='236' column='1' id='type-id-66'/>
        </member-type>
      </class-decl>
      <typedef-decl name='string' type-id='type-id-53' filepath='/usr/include/c++/5.3.1/bits/stringfwd.h' line='74' column='1' id='type-id-69'/>
      <class-decl name='basic_ostream&lt;char, std::char_traits&lt;char&gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-108'/>
      <var-decl name='cout' type-id='type-id-90' mangled-name='_ZSt4cout' visibility='default' filepath='/usr/include/c++/5.3.1/iostream' line='61' column='1'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char const*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-118'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    </namespace-decl>
    <var-decl name='__dso_handle' type-id='type-id-5' visibility='default'/>
    <function-decl name='btowc' filepath='/usr/include/wchar.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fgetwc' filepath='/usr/include/wchar.h' line='745' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fgetws' filepath='/usr/include/wchar.h' line='774' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-93'/>
    </function-decl>
    <function-decl name='fputwc' filepath='/usr/include/wchar.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fputws' filepath='/usr/include/wchar.h' line='781' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-8'/>
    </function-decl>
