{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA2_j",
   "name" : "unsigned int [2]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA2_j",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA56_h",
   "name" : "unsigned char [56]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA56_h",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {

   "name" : "int (*)(rsa_st *)",
   "referenced_type" : "_ZTIFiP6rsa_stE",
   "self_type" : "_ZTIPFiP6rsa_stE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiP6rsa_stPhPKhjE",
   "name" : "int (*)(rsa_st *, unsigned char *, const unsigned char *, unsigned int)",
   "referenced_type" : "_ZTIFiP6rsa_stPhPKhjE",
   "self_type" : "_ZTIPFiP6rsa_stPhPKhjE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiP6rsa_stPjPhjPKhjiE",
   "name" : "int (*)(rsa_st *, unsigned int *, unsigned char *, unsigned int, const unsigned char *, unsigned int, int)",
   "referenced_type" : "_ZTIFiP6rsa_stPjPhjPKhjiE",
   "self_type" : "_ZTIPFiP6rsa_stPjPhjPKhjiE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiPPKvS1_E",
   "name" : "int (*)(const void **, const void **)",
   "referenced_type" : "_ZTIFiPPKvS1_E",
   "self_type" : "_ZTIPFiPPKvS1_E",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiiPKhjPhPjPK6rsa_stE",
   "name" : "int (*)(int, const unsigned char *, unsigned int, unsigned char *, unsigned int *, const rsa_st *)",
   "referenced_type" : "_ZTIFiiPKhjPhPjPK6rsa_stE",
   "self_type" : "_ZTIPFiiPKhjPhPjPK6rsa_stE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiiiP11bn_gencb_stE",
   "name" : "int (*)(int, int, bn_gencb_st *)",
   "referenced_type" : "_ZTIFiiiP11bn_gencb_stE",
   "self_type" : "_ZTIPFiiiP11bn_gencb_stE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFjPK6rsa_stE",
   "name" : "unsigned int (*)(const rsa_st *)",
   "referenced_type" : "_ZTIFjPK6rsa_stE",
   "self_type" : "_ZTIPFjPK6rsa_stE",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK6rsa_st",
   "name" : "const rsa_st *",
   "referenced_type" : "_ZTIK6rsa_st",
   "self_type" : "_ZTIPK6rsa_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP14bn_blinding_st",
   "name" : "bn_blinding_st **",
   "referenced_type" : "_ZTIP14bn_blinding_st",
   "self_type" : "_ZTIPP14bn_blinding_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP6rsa_st",
   "name" : "rsa_st **",
   "referenced_type" : "_ZTIP6rsa_st",
   "self_type" : "_ZTIPP6rsa_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPKh",
   "name" : "const unsigned char **",
   "referenced_type" : "_ZTIPKh",
   "self_type" : "_ZTIPPKh",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPKv",
   "name" : "const void **",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIPPKv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPh",
   "name" : "unsigned char **",
   "referenced_type" : "_ZTIPh",
   "self_type" : "_ZTIPPh",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK6rsa_st",
   "name" : "const rsa_st",
   "referenced_type" : "_ZTI6rsa_st",
   "self_type" : "_ZTIK6rsa_st",
   "size" : 160,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arg",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "callback",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiiiP11bn_gencb_stE"
    }
   ],
   "linker_set_key" : "_ZTI11bn_gencb_st",
   "name" : "bn_gencb_st",
   "referenced_type" : "_ZTI11bn_gencb_st",
   "self_type" : "_ZTI11bn_gencb_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI24openssl_method_common_st"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "init",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP6rsa_stE"
    },
    {
     "field_name" : "finish",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP6rsa_stE"
    },
    {
     "field_name" : "size",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPK6rsa_stE"
    },
    {
     "field_name" : "sign",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiiPKhjPhPjPK6rsa_stE"
    },
    {
     "field_name" : "sign_raw",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP6rsa_stPjPhjPKhjiE"
    },
    {
     "field_name" : "decrypt",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP6rsa_stPjPhjPKhjiE"
    },
    {
     "field_name" : "private_transform",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFiP6rsa_stPhPKhjE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11rsa_meth_st",
   "name" : "rsa_meth_st",
   "referenced_type" : "_ZTI11rsa_meth_st",
   "self_type" : "_ZTI11rsa_meth_st",
   "size" : 44,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cap",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "can_resize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "error",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI13cbb_buffer_st",
   "name" : "cbb_buffer_st",
   "referenced_type" : "_ZTI13cbb_buffer_st",
   "self_type" : "_ZTI13cbb_buffer_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
    }
   ],
   "linker_set_key" : "_ZTI14CRYPTO_dynlock",
   "name" : "CRYPTO_dynlock",
   "referenced_type" : "_ZTI14CRYPTO_dynlock",
   "self_type" : "_ZTI14CRYPTO_dynlock",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "RR",
     "referenced_type" : "_ZTI9bignum_st"
    },
    {
     "field_name" : "N",
     "field_offset" : 160,
     "referenced_type" : "_ZTI9bignum_st"
    },
    {
     "field_name" : "n0",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA2_j"
    }
   ],
   "linker_set_key" : "_ZTI14bn_mont_ctx_st",
   "name" : "bn_mont_ctx_st",
   "referenced_type" : "_ZTI14bn_mont_ctx_st",
   "self_type" : "_ZTI14bn_mont_ctx_st",
   "size" : 48,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTIA56_h"
    }
   ],
   "linker_set_key" : "_ZTI15crypto_mutex_st",
   "name" : "crypto_mutex_st",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15crypto_mutex_st",
   "self_type" : "_ZTI15crypto_mutex_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sk",
     "referenced_type" : "_ZTIP13stack_st_void"
    }
   ],
   "linker_set_key" : "_ZTI17crypto_ex_data_st",
   "name" : "crypto_ex_data_st",
   "referenced_type" : "_ZTI17crypto_ex_data_st",
   "self_type" : "_ZTI17crypto_ex_data_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "is_static",
     "field_offset" : 32,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI24openssl_method_common_st",
   "name" : "openssl_method_common_st",
   "referenced_type" : "_ZTI24openssl_method_common_st",
   "self_type" : "_ZTI24openssl_method_common_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/engine.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIP13cbb_buffer_st"
    },
    {
     "field_name" : "child",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP6cbb_st"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pending_len_len",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pending_is_asn1",
     "field_offset" : 104,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "is_child",
     "field_offset" : 112,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI6cbb_st",
   "name" : "cbb_st",
   "referenced_type" : "_ZTI6cbb_st",
   "self_type" : "_ZTI6cbb_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6cbs_st",
   "name" : "cbs_st",
   "referenced_type" : "_ZTI6cbs_st",
   "self_type" : "_ZTI6cbs_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "meth",
     "referenced_type" : "_ZTIP11rsa_meth_st"
    },
    {
     "field_name" : "n",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "e",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "d",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "p",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "q",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmp1",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmq1",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "iqmp",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "ex_data",
     "field_offset" : 288,
     "referenced_type" : "_ZTI17crypto_ex_data_st"
    },
    {
     "field_name" : "references",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lock",
     "field_offset" : 384,
     "referenced_type" : "_ZTI15crypto_mutex_st"
    },
    {
     "field_name" : "mont_n",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "mont_p",
     "field_offset" : 864,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "mont_q",
     "field_offset" : 896,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "d_fixed",
     "field_offset" : 928,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmp1_fixed",
     "field_offset" : 960,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmq1_fixed",
     "field_offset" : 992,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "inv_small_mod_large_mont",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "num_blindings",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "blindings",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPP14bn_blinding_st"
    },
    {
     "field_name" : "blindings_inuse",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "blinding_fork_generation",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "private_key_frozen",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6rsa_st",
   "name" : "rsa_st",
   "referenced_type" : "_ZTI6rsa_st",
   "self_type" : "_ZTI6rsa_st",
   "size" : 160,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPv"
    },
    {
     "field_name" : "sorted",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_alloc",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "comp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPPKvS1_E"
    }
   ],
   "linker_set_key" : "_ZTI8stack_st",
   "name" : "stack_st",
   "referenced_type" : "_ZTI8stack_st",
   "self_type" : "_ZTI8stack_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d",
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dmax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "neg",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI9bignum_st",
   "name" : "bignum_st",
   "referenced_type" : "_ZTI9bignum_st",
   "self_type" : "_ZTI9bignum_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  }
 ],
 "rvalue_reference_types" : []
}
