{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA10_d",
   "name" : "double [10]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA10_d",
   "size" : 80,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA11_d",
   "name" : "double [11]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA11_d",
   "size" : 88,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA128_N12pow_log_dataUt_E",
   "name" : "pow_log_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:434:3) [128]",
   "referenced_type" : "_ZTIN12pow_log_dataUt_E",
   "self_type" : "_ZTIA128_N12pow_log_dataUt_E",
   "size" : 4096,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA128_N8log_dataUt_E",
   "name" : "log_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:405:3) [128]",
   "referenced_type" : "_ZTIN8log_dataUt_E",
   "self_type" : "_ZTIA128_N8log_dataUt_E",
   "size" : 2048,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA14_d",
   "name" : "double [14]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA14_d",
   "size" : 112,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA16_N10log2f_dataUt_E",
   "name" : "log2f_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:349:3) [16]",
   "referenced_type" : "_ZTIN10log2f_dataUt_E",
   "self_type" : "_ZTIA16_N10log2f_dataUt_E",
   "size" : 256,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA16_N14powf_log2_dataUt_E",
   "name" : "powf_log2_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:366:3) [16]",
   "referenced_type" : "_ZTIN14powf_log2_dataUt_E",
   "self_type" : "_ZTIA16_N14powf_log2_dataUt_E",
   "size" : 256,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA16_N9logf_dataUt_E",
   "name" : "logf_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:337:3) [16]",
   "referenced_type" : "_ZTIN9logf_dataUt_E",
   "self_type" : "_ZTIA16_N9logf_dataUt_E",
   "size" : 256,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA16_d",
   "name" : "double [16]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA16_d",
   "size" : 128,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA17_d",
   "name" : "double [17]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA17_d",
   "size" : 136,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA18_d",
   "name" : "double [18]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA18_d",
   "size" : 144,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA256_y",
   "name" : "unsigned long long [256]",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIA256_y",
   "size" : 2048,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA32_y",
   "name" : "unsigned long long [32]",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIA32_y",
   "size" : 256,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA3_d",
   "name" : "double [3]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA3_d",
   "size" : 24,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA4_d",
   "name" : "double [4]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA4_d",
   "size" : 32,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA5_d",
   "name" : "double [5]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA5_d",
   "size" : 40,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA64_N9log2_dataUt_E",
   "name" : "log2_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:420:3) [64]",
   "referenced_type" : "_ZTIN9log2_dataUt_E",
   "self_type" : "_ZTIA64_N9log2_dataUt_E",
   "size" : 1024,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA6_d",
   "name" : "double [6]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA6_d",
   "size" : 48,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA6_f",
   "name" : "float [6]",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIA6_f",
   "size" : 24,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA7_d",
   "name" : "double [7]",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIA7_d",
   "size" : 56,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA7_f",
   "name" : "float [7]",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIA7_f",
   "size" : 28,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIe",
   "name" : "long double",
   "referenced_type" : "_ZTIe",
   "self_type" : "_ZTIe",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIy",
   "name" : "unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIy",
   "size" : 8
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" : [],
 "functions" :
 [
  {
   "function_name" : "__ieee754_pow",
   "linker_set_key" : "__ieee754_pow",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTId"
    },
    {
     "referenced_type" : "_ZTId"
    }
   ],
   "return_type" : "_ZTId",
   "source_file" : "external/arm-optimized-routines/math/pow.c"
  },
  {
   "function_name" : "__pow_finite",
   "linker_set_key" : "__pow_finite",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTId"
    },
    {
     "referenced_type" : "_ZTId"
    }
   ],
   "return_type" : "_ZTId",
   "source_file" : "external/arm-optimized-routines/math/pow.c"
  },
  {
   "function_name" : "pow",
   "linker_set_key" : "pow",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTId"
    },
    {
     "referenced_type" : "_ZTId"
    }
   ],
   "return_type" : "_ZTId",
   "source_file" : "bionic/libc/include/math.h"
  },
  {
   "function_name" : "powl",
   "linker_set_key" : "powl",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIe"
    },
    {
     "referenced_type" : "_ZTIe"
    }
   ],
   "return_type" : "_ZTIe",
   "source_file" : "bionic/libc/include/math.h"
  }
 ],
 "global_vars" :
 [
  {
   "linker_set_key" : "__erf_data",
   "name" : "__erf_data",
   "referenced_type" : "_ZTIK8erf_data",
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "linker_set_key" : "__erff_data",
   "name" : "__erff_data",
   "referenced_type" : "_ZTIK9erff_data",
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "linker_set_key" : "__exp2f_data",
   "name" : "__exp2f_data",
   "referenced_type" : "_ZTIK10exp2f_data",
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "linker_set_key" : "__exp_data",
   "name" : "__exp_data",
   "referenced_type" : "_ZTIK8exp_data",
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "linker_set_key" : "__log2_data",
   "name" : "__log2_data",
   "referenced_type" : "_ZTIK9log2_data",
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "linker_set_key" : "__log2f_data",
   "name" : "__log2f_data",
   "referenced_type" : "_ZTIK10log2f_data",
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "linker_set_key" : "__log_data",
   "name" : "__log_data",
   "referenced_type" : "_ZTIK8log_data",
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "linker_set_key" : "__logf_data",
   "name" : "__logf_data",
   "referenced_type" : "_ZTIK9logf_data",
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "linker_set_key" : "__pow_log_data",
   "name" : "__pow_log_data",
   "referenced_type" : "_ZTIK12pow_log_data",
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "linker_set_key" : "__powf_log2_data",
   "name" : "__powf_log2_data",
   "referenced_type" : "_ZTIK14powf_log2_data",
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "linker_set_key" : "signgam",
   "name" : "signgam",
   "referenced_type" : "_ZTIi",
   "source_file" : "bionic/libc/include/math.h"
  }
 ],
 "lvalue_reference_types" : [],
 "pointer_types" : [],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10exp2f_data",
   "name" : "const exp2f_data",
   "referenced_type" : "_ZTI10exp2f_data",
   "self_type" : "_ZTIK10exp2f_data",
   "size" : 328,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10log2f_data",
   "name" : "const log2f_data",
   "referenced_type" : "_ZTI10log2f_data",
   "self_type" : "_ZTIK10log2f_data",
   "size" : 288,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12pow_log_data",
   "name" : "const pow_log_data",
   "referenced_type" : "_ZTI12pow_log_data",
   "self_type" : "_ZTIK12pow_log_data",
   "size" : 4168,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK14powf_log2_data",
   "name" : "const powf_log2_data",
   "referenced_type" : "_ZTI14powf_log2_data",
   "self_type" : "_ZTIK14powf_log2_data",
   "size" : 296,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8erf_data",
   "name" : "const erf_data",
   "referenced_type" : "_ZTI8erf_data",
   "self_type" : "_ZTIK8erf_data",
   "size" : 784,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8exp_data",
   "name" : "const exp_data",
   "referenced_type" : "_ZTI8exp_data",
   "self_type" : "_ZTIK8exp_data",
   "size" : 2160,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8log_data",
   "name" : "const log_data",
   "referenced_type" : "_ZTI8log_data",
   "self_type" : "_ZTIK8log_data",
   "size" : 4240,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9erff_data",
   "name" : "const erff_data",
   "referenced_type" : "_ZTI9erff_data",
   "self_type" : "_ZTIK9erff_data",
   "size" : 52,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9log2_data",
   "name" : "const log2_data",
   "referenced_type" : "_ZTI9log2_data",
   "self_type" : "_ZTIK9log2_data",
   "size" : 2192,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9logf_data",
   "name" : "const logf_data",
   "referenced_type" : "_ZTI9logf_data",
   "self_type" : "_ZTIK9logf_data",
   "size" : 288,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "_ZTIA32_y"
    },
    {
     "field_name" : "shift_scaled",
     "field_offset" : 2048,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIA3_d"
    },
    {
     "field_name" : "shift",
     "field_offset" : 2304,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "invln2_scaled",
     "field_offset" : 2368,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "poly_scaled",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIA3_d"
    }
   ],
   "linker_set_key" : "_ZTI10exp2f_data",
   "name" : "exp2f_data",
   "referenced_type" : "_ZTI10exp2f_data",
   "self_type" : "_ZTI10exp2f_data",
   "size" : 328,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "_ZTIA16_N10log2f_dataUt_E"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIA4_d"
    }
   ],
   "linker_set_key" : "_ZTI10log2f_data",
   "name" : "log2f_data",
   "referenced_type" : "_ZTI10log2f_data",
   "self_type" : "_ZTI10log2f_data",
   "size" : 288,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ln2hi",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "ln2lo",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA7_d"
    },
    {
     "field_name" : "tab",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA128_N12pow_log_dataUt_E"
    }
   ],
   "linker_set_key" : "_ZTI12pow_log_data",
   "name" : "pow_log_data",
   "referenced_type" : "_ZTI12pow_log_data",
   "self_type" : "_ZTI12pow_log_data",
   "size" : 4168,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "_ZTIA16_N14powf_log2_dataUt_E"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIA5_d"
    }
   ],
   "linker_set_key" : "_ZTI14powf_log2_data",
   "name" : "powf_log2_data",
   "referenced_type" : "_ZTI14powf_log2_data",
   "self_type" : "_ZTI14powf_log2_data",
   "size" : 296,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "erf_poly_A",
     "referenced_type" : "_ZTIA10_d"
    },
    {
     "field_name" : "erf_ratio_N_A",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA5_d"
    },
    {
     "field_name" : "erf_ratio_D_A",
     "field_offset" : 960,
     "referenced_type" : "_ZTIA5_d"
    },
    {
     "field_name" : "erf_ratio_N_B",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIA7_d"
    },
    {
     "field_name" : "erf_ratio_D_B",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIA6_d"
    },
    {
     "field_name" : "erfc_poly_C",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIA16_d"
    },
    {
     "field_name" : "erfc_poly_D",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIA18_d"
    },
    {
     "field_name" : "erfc_poly_E",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIA14_d"
    },
    {
     "field_name" : "erfc_poly_F",
     "field_offset" : 5184,
     "referenced_type" : "_ZTIA17_d"
    }
   ],
   "linker_set_key" : "_ZTI8erf_data",
   "name" : "erf_data",
   "referenced_type" : "_ZTI8erf_data",
   "self_type" : "_ZTI8erf_data",
   "size" : 784,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invln2N",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "shift",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "negln2hiN",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "negln2loN",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "poly",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA4_d"
    },
    {
     "field_name" : "exp2_shift",
     "field_offset" : 512,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "exp2_poly",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA5_d"
    },
    {
     "field_name" : "tab",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA256_y"
    }
   ],
   "linker_set_key" : "_ZTI8exp_data",
   "name" : "exp_data",
   "referenced_type" : "_ZTI8exp_data",
   "self_type" : "_ZTI8exp_data",
   "size" : 2160,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ln2hi",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "ln2lo",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA5_d"
    },
    {
     "field_name" : "poly1",
     "field_offset" : 448,
     "referenced_type" : "_ZTIA11_d"
    },
    {
     "field_name" : "tab",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA128_N8log_dataUt_E"
    },
    {
     "field_name" : "tab2",
     "field_offset" : 17536,
     "referenced_type" : "_ZTIA128_N8log_dataUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8log_data",
   "name" : "log_data",
   "referenced_type" : "_ZTI8log_data",
   "self_type" : "_ZTI8log_data",
   "size" : 4240,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "erff_poly_A",
     "referenced_type" : "_ZTIA6_f"
    },
    {
     "field_name" : "erff_poly_B",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA7_f"
    }
   ],
   "linker_set_key" : "_ZTI9erff_data",
   "name" : "erff_data",
   "referenced_type" : "_ZTI9erff_data",
   "self_type" : "_ZTI9erff_data",
   "size" : 52,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invln2hi",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "invln2lo",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA6_d"
    },
    {
     "field_name" : "poly1",
     "field_offset" : 512,
     "referenced_type" : "_ZTIA10_d"
    },
    {
     "field_name" : "tab",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA64_N9log2_dataUt_E"
    },
    {
     "field_name" : "tab2",
     "field_offset" : 9344,
     "referenced_type" : "_ZTIA64_N9log2_dataUt_E"
    }
   ],
   "linker_set_key" : "_ZTI9log2_data",
   "name" : "log2_data",
   "referenced_type" : "_ZTI9log2_data",
   "self_type" : "_ZTI9log2_data",
   "size" : 2192,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "_ZTIA16_N9logf_dataUt_E"
    },
    {
     "field_name" : "ln2",
     "field_offset" : 2048,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIA3_d"
    }
   ],
   "linker_set_key" : "_ZTI9logf_data",
   "name" : "logf_data",
   "referenced_type" : "_ZTI9logf_data",
   "self_type" : "_ZTI9logf_data",
   "size" : 288,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10log2f_dataUt_E",
   "name" : "log2f_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:349:3)",
   "referenced_type" : "_ZTIN10log2f_dataUt_E",
   "self_type" : "_ZTIN10log2f_dataUt_E",
   "size" : 16,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "pad",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "logc",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "logctail",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12pow_log_dataUt_E",
   "name" : "pow_log_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:434:3)",
   "referenced_type" : "_ZTIN12pow_log_dataUt_E",
   "self_type" : "_ZTIN12pow_log_dataUt_E",
   "size" : 32,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN14powf_log2_dataUt_E",
   "name" : "powf_log2_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:366:3)",
   "referenced_type" : "_ZTIN14powf_log2_dataUt_E",
   "self_type" : "_ZTIN14powf_log2_dataUt_E",
   "size" : 16,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8log_dataUt_E",
   "name" : "log_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:405:3)",
   "referenced_type" : "_ZTIN8log_dataUt_E",
   "self_type" : "_ZTIN8log_dataUt_E",
   "size" : 16,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9log2_dataUt_E",
   "name" : "log2_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:420:3)",
   "referenced_type" : "_ZTIN9log2_dataUt_E",
   "self_type" : "_ZTIN9log2_dataUt_E",
   "size" : 16,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9logf_dataUt_E",
   "name" : "logf_data::(anonymous struct at external/arm-optimized-routines/math/math_config.h:337:3)",
   "referenced_type" : "_ZTIN9logf_dataUt_E",
   "self_type" : "_ZTIN9logf_dataUt_E",
   "size" : 16,
   "source_file" : "external/arm-optimized-routines/math/math_config.h"
  }
 ],
 "rvalue_reference_types" : []
}
