#ifndef HIDL_GENERATED_ANDROID_HARDWARE_MEDIA_C2_V1_0_ICOMPONENTSTORE_H
#define HIDL_GENERATED_ANDROID_HARDWARE_MEDIA_C2_V1_0_ICOMPONENTSTORE_H

#include <android/hardware/media/bufferpool/2.0/IClientManager.h>
#include <android/hardware/media/c2/1.0/IComponent.h>
#include <android/hardware/media/c2/1.0/IComponentInterface.h>
#include <android/hardware/media/c2/1.0/IComponentListener.h>
#include <android/hardware/media/c2/1.0/IConfigurable.h>
#include <android/hardware/media/c2/1.0/IInputSurface.h>
#include <android/hardware/media/c2/1.0/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace media {
namespace c2 {
namespace V1_0 {

/**
 * Entry point for Codec2 HAL.
 *
 * All methods in `IComponentStore` must not block. If a method call cannot be
 * completed in a timely manner, it must return `TIMED_OUT` in the return
 * status. The only exceptions are getPoolClientManager() and getConfigurable(),
 * which must always return immediately.
 */
struct IComponentStore : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.media.c2@1.0::IComponentStore"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    struct ComponentTraits;

    /**
     * Component traits.
     */
    struct ComponentTraits final {
        // Forward declaration for forward reference support:
        enum class Domain : uint32_t;
        enum class Kind : uint32_t;

        enum class Domain : uint32_t {
            OTHER = 0u,
            VIDEO = 1u /* ::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits::Domain.OTHER implicitly + 1 */,
            AUDIO = 2u /* ::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits::Domain.VIDEO implicitly + 1 */,
            IMAGE = 3u /* ::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits::Domain.AUDIO implicitly + 1 */,
        };

        enum class Kind : uint32_t {
            OTHER = 0u,
            DECODER = 1u /* ::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits::Kind.OTHER implicitly + 1 */,
            ENCODER = 2u /* ::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits::Kind.DECODER implicitly + 1 */,
        };

        /**
         * Name of the component. This must be unique for each component.
         *
         * This name is use to identify the component to create in
         * createComponent() and createComponentInterface().
         */
        ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
        /**
         * Component domain.
         */
        ::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits::Domain domain __attribute__ ((aligned(4)));
        /**
         * Component kind.
         */
        ::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits::Kind kind __attribute__ ((aligned(4)));
        /**
         * Rank used by `MediaCodecList` to determine component ordering. Lower
         * value means higher priority.
         */
        uint32_t rank __attribute__ ((aligned(4)));
        /**
         * MIME type.
         */
        ::android::hardware::hidl_string mediaType __attribute__ ((aligned(8)));
        /**
         * Aliases for component name for backward compatibility.
         *
         * Multiple components can have the same alias (but not the same
         * component name) as long as their media types differ.
         */
        ::android::hardware::hidl_vec<::android::hardware::hidl_string> aliases __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits, name) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits, domain) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits, kind) == 20, "wrong offset");
    static_assert(offsetof(::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits, rank) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits, mediaType) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits, aliases) == 48, "wrong offset");
    static_assert(sizeof(::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits) == 64, "wrong size");
    static_assert(__alignof(::android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Return callback for createComponent
     */
    using createComponent_cb = std::function<void(::android::hardware::media::c2::V1_0::Status status, const ::android::sp<::android::hardware::media::c2::V1_0::IComponent>& comp)>;
    /**
     * Creates a component by name.
     *
     * @param name Name of the component to create. This must match one of the
     *     names returned by listComponents().
     * @param listener Callback receiver.
     * @param pool `IClientManager` object of the BufferPool in the client
     *     process. This may be null if the client does not own a BufferPool.
     * @return status Status of the call, which may be
