#ifndef HIDL_GENERATED_ANDROID_FRAMEWORKS_CAMERASERVICE_COMMON_V2_0_TYPES_H
#define HIDL_GENERATED_ANDROID_FRAMEWORKS_CAMERASERVICE_COMMON_V2_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace frameworks {
namespace cameraservice {
namespace common {
namespace V2_0 {

// Forward declaration for forward reference support:
enum class Status : int32_t;
enum class CameraMetadataType : uint32_t;
enum class TagBoundaryId : uint32_t;
struct VendorTag;
struct VendorTagSection;
struct ProviderIdAndVendorTagSections;

/**
 * All camera service and device HIDL calls may return the following
 * status codes
 */
enum class Status : int32_t {
    /**
     * Call succeeded.
     */
    NO_ERROR = 0,
    /**
     * Call failed due to inadequete permissions.
     */
    PERMISSION_DENIED = 1,
    /**
     * Call tried added something that already existed, eg: add a duplicate
     * listener.
     */
    ALREADY_EXISTS = 2,
    /**
     * Call received illegal argument.
     */
    ILLEGAL_ARGUMENT = 3,
    /**
     * The camera device is no longer connected.
     */
    DISCONNECTED = 4,
    /**
     * Request timed out.
     */
    TIMED_OUT = 5,
    /**
     * The device has been disabled by policy.
     */
    DISABLED = 6,
    /**
     * The camera device is currently in use.
     */
    CAMERA_IN_USE = 7,
    /**
     * Too many cameras are connected, more cameras cannot be opened.
     */
    MAX_CAMERAS_IN_USE = 8,
    /**
     * Camera server is using a camera HAL version that does not support
     * android.frameworks.hardware.interfaces.cameraservice.ICameraService@2.0
     * and android.frameworks.hardware.interfaces.cameraservice.device.ICameraDeviceUser@2.0.
     */
    DEPRECATED_HAL = 9,
    /**
     * An invalid operation was attempted by the client. Eg: a waitUntilIdle()
     * call was made, with active repeating requests.
     */
    INVALID_OPERATION = 10,
    /**
     * An unknown error was encountered by the camera subsystem.
     */
    UNKNOWN_ERROR = 11,
};

/**
 * Camera metadata type.
 */
enum class CameraMetadataType : uint32_t {
    /**
     * Unsigned 8-bit integer (uint8_t)
     */
    BYTE = 0u,
    /**
     * Signed 32-bit integer (int32_t)
     */
    INT32 = 1u,
    /**
     * 32-bit float (float)
     */
    FLOAT = 2u,
    /**
     * Signed 64-bit integer (int64_t)
     */
    INT64 = 3u,
    /**
     * 64-bit float (double)
     */
    DOUBLE = 4u,
    /**
     * A 64-bit fraction (camera_metadata_rational_t)
     */
    RATIONAL = 5u,
};

/**
 * Boundaries for VendorTag tagIds.
 */
enum class TagBoundaryId : uint32_t {
    /**
     * First valid tag id for android-defined tags.
     */
    AOSP = 0u /* 0x0 */,
    /**
     * First valid tag id for vendor extension tags.
     */
    VENDOR = 2147483648u /* 0x80000000u */,
};

/**
 * A single vendor-unique metadata tag.
 * The full name of the tag is <sectionName>.<tagName>
 */
struct VendorTag final {
    /**
     * Tag identifier, must be >= TagBoundaryId::VENDOR.
     */
    uint32_t tagId __attribute__ ((aligned(4)));
    /**
     * Name of tag, not including section name.
     */
    ::android::hardware::hidl_string tagName __attribute__ ((aligned(8)));
    ::android::frameworks::cameraservice::common::V2_0::CameraMetadataType tagType __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::frameworks::cameraservice::common::V2_0::VendorTag, tagId) == 0, "wrong offset");
static_assert(offsetof(::android::frameworks::cameraservice::common::V2_0::VendorTag, tagName) == 8, "wrong offset");
static_assert(offsetof(::android::frameworks::cameraservice::common::V2_0::VendorTag, tagType) == 24, "wrong offset");
static_assert(sizeof(::android::frameworks::cameraservice::common::V2_0::VendorTag) == 32, "wrong size");
static_assert(__alignof(::android::frameworks::cameraservice::common::V2_0::VendorTag) == 8, "wrong alignment");

/**
 * A set of related vendor tags.
 */
struct VendorTagSection final {
    /**
     * Section name; must be namespaced within vendor's name.
     */
    ::android::hardware::hidl_string sectionName __attribute__ ((aligned(8)));
    /**
     * List of tags in this section
     */
    ::android::hardware::hidl_vec<::android::frameworks::cameraservice::common::V2_0::VendorTag> tags __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::frameworks::cameraservice::common::V2_0::VendorTagSection, sectionName) == 0, "wrong offset");
static_assert(offsetof(::android::frameworks::cameraservice::common::V2_0::VendorTagSection, tags) == 16, "wrong offset");
static_assert(sizeof(::android::frameworks::cameraservice::common::V2_0::VendorTagSection) == 32, "wrong size");
static_assert(__alignof(::android::frameworks::cameraservice::common::V2_0::VendorTagSection) == 8, "wrong alignment");

struct ProviderIdAndVendorTagSections final {
    /**
     * provider id
     */
    uint64_t providerId __attribute__ ((aligned(8)));
    /**
     * List of VendorTagSections provided by this provider
     */
    ::android::hardware::hidl_vec<::android::frameworks::cameraservice::common::V2_0::VendorTagSection> vendorTagSections __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::frameworks::cameraservice::common::V2_0::ProviderIdAndVendorTagSections, providerId) == 0, "wrong offset");
static_assert(offsetof(::android::frameworks::cameraservice::common::V2_0::ProviderIdAndVendorTagSections, vendorTagSections) == 8, "wrong offset");
static_assert(sizeof(::android::frameworks::cameraservice::common::V2_0::ProviderIdAndVendorTagSections) == 24, "wrong size");
static_assert(__alignof(::android::frameworks::cameraservice::common::V2_0::ProviderIdAndVendorTagSections) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::frameworks::cameraservice::common::V2_0::Status o);
static inline void PrintTo(::android::frameworks::cameraservice::common::V2_0::Status o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::frameworks::cameraservice::common::V2_0::Status lhs, const ::android::frameworks::cameraservice::common::V2_0::Status rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::frameworks::cameraservice::common::V2_0::Status rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
