{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA32_c",
   "name" : "char [32]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA32_c",
   "size" : 32,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/strutil.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",

   "linker_set_key" : "_ZTIKN6google8protobuf4hashINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "const google::protobuf::hash<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN6google8protobuf4hashINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIKN6google8protobuf4hashINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf4hashIPKcEE",
   "name" : "const google::protobuf::hash<const char *>",
   "referenced_type" : "_ZTIN6google8protobuf4hashIPKcEE",
   "self_type" : "_ZTIKN6google8protobuf4hashIPKcEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf4hashIbEE",
   "name" : "const google::protobuf::hash<bool>",
   "referenced_type" : "_ZTIN6google8protobuf4hashIbEE",
   "self_type" : "_ZTIKN6google8protobuf4hashIbEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf5streqE",
   "name" : "const google::protobuf::streq",
   "referenced_type" : "_ZTIN6google8protobuf5streqE",
   "self_type" : "_ZTIKN6google8protobuf5streqE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf7strings8AlphaNumE",
   "name" : "const google::protobuf::strings::AlphaNum",
   "referenced_type" : "_ZTIN6google8protobuf7strings8AlphaNumE",
   "self_type" : "_ZTIKN6google8protobuf7strings8AlphaNumE",
   "size" : 40,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/strutil.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6google8protobuf8internal14StringPiecePodE",
   "name" : "const google::protobuf::internal::StringPiecePod",
   "referenced_type" : "_ZTIN6google8protobuf8internal14StringPiecePodE",
   "self_type" : "_ZTIKN6google8protobuf8internal14StringPiecePodE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/stringpiece.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/common.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE",
   "name" : "const std::vector<std::basic_string<char, std::char_traits<char>, std::allocator<char>>, std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>>",
   "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE",
   "size" : 12,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/strutil.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/strutil.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf11LogSilencerE",
   "name" : "google::protobuf::LogSilencer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf11LogSilencerE",
   "self_type" : "_ZTIN6google8protobuf11LogSilencerE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "length_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf11StringPieceE",
   "name" : "google::protobuf::StringPiece",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf11StringPieceE",
   "self_type" : "_ZTIN6google8protobuf11StringPieceE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/stringpiece.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4BitsE",
   "name" : "google::protobuf::Bits",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf4BitsE",
   "self_type" : "_ZTIN6google8protobuf4BitsE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4hashINS0_11StringPieceEEE",
   "name" : "google::protobuf::hash<google::protobuf::StringPiece>",
   "referenced_type" : "_ZTIN6google8protobuf4hashINS0_11StringPieceEEE",
   "self_type" : "_ZTIN6google8protobuf4hashINS0_11StringPieceEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/stringpiece.h",
   "template_args" : [ "_ZTIN6google8protobuf11StringPieceE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4hashINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "google::protobuf::hash<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN6google8protobuf4hashINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN6google8protobuf4hashINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4hashIPKcEE",
   "name" : "google::protobuf::hash<const char *>",
   "referenced_type" : "_ZTIN6google8protobuf4hashIPKcEE",
   "self_type" : "_ZTIN6google8protobuf4hashIPKcEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf4hashIbEE",
   "name" : "google::protobuf::hash<bool>",
   "referenced_type" : "_ZTIN6google8protobuf4hashIbEE",
   "self_type" : "_ZTIN6google8protobuf4hashIbEE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf5streqE",
   "name" : "google::protobuf::streq",
   "referenced_type" : "_ZTIN6google8protobuf5streqE",
   "self_type" : "_ZTIN6google8protobuf5streqE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/hash.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "spec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN6google8protobuf7strings7PadSpecE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf7strings3HexE",
   "name" : "google::protobuf::strings::Hex",
   "referenced_type" : "_ZTIN6google8protobuf7strings3HexE",
   "self_type" : "_ZTIN6google8protobuf7strings3HexE",
   "size" : 16,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/strutil.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "piece_data_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "piece_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "digits",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA32_c"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf7strings8AlphaNumE",
   "name" : "google::protobuf::strings::AlphaNum",
   "referenced_type" : "_ZTIN6google8protobuf7strings8AlphaNumE",
   "self_type" : "_ZTIN6google8protobuf7strings8AlphaNumE",
   "size" : 40,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/strutil.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "level_",
     "referenced_type" : "_ZTIN6google8protobuf8LogLevelE"
    },
    {
     "access" : "private",
     "field_name" : "filename_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "line_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "message_",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "name" : "google::protobuf::internal::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "self_type" : "_ZTIN6google8protobuf8internal10LogMessageE",
   "size" : 24,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "name" : "google::protobuf::internal::LogFinisher",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "self_type" : "_ZTIN6google8protobuf8internal11LogFinisherE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6google8protobuf8internal14StringPiecePodE",
   "name" : "google::protobuf::internal::StringPiecePod",
   "referenced_type" : "_ZTIN6google8protobuf8internal14StringPiecePodE",
   "self_type" : "_ZTIN6google8protobuf8internal14StringPiecePodE",
   "size" : 8,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/stringpiece.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN6google8protobuf9BigEndianE",
   "name" : "google::protobuf::BigEndian",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6google8protobuf9BigEndianE",
   "self_type" : "_ZTIN6google8protobuf9BigEndianE",
   "size" : 1,
   "source_file" : "external/protobuf/src/google/protobuf/stubs/port.h"
  }
 ],
 "rvalue_reference_types" : []
}
