{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA0_c",
   "name" : "char [0]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA0_c",
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_j",
   "name" : "unsigned int [0]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA0_j",
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA11_PFiP6nl_msgPvE",
   "name" : "int (*[11])(nl_msg *, void *)",
   "referenced_type" : "_ZTIPFiP6nl_msgPvE",
   "self_type" : "_ZTIA11_PFiP6nl_msgPvE",
   "size" : 44,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA11_Pv",
   "name" : "void *[11]",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIA11_Pv",
   "size" : 44,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_c",
   "name" : "char [16]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA16_c",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",
   "name" : "unsigned char [16]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA16_h",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 2,

   "name" : "unsigned char **",
   "referenced_type" : "_ZTIPh",
   "self_type" : "_ZTIPPh",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink/types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink/addr.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink-private/object-api.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPs",
   "name" : "short *",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIPs",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink/types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPy",
   "name" : "unsigned long long *",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIPy",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink/utils.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10genlmsghdr",
   "name" : "const genlmsghdr",
   "referenced_type" : "_ZTI10genlmsghdr",
   "self_type" : "_ZTIK10genlmsghdr",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink/genl/genl.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10nla_policy",
   "name" : "const nla_policy",
   "referenced_type" : "_ZTI10nla_policy",
   "self_type" : "_ZTIK10nla_policy",
   "size" : 6,
   "source_file" : "external/libnl/include/netlink/attr.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK6nl_msg",
   "name" : "const nl_msg",
   "referenced_type" : "_ZTI6nl_msg",
   "self_type" : "_ZTIK6nl_msg",
   "size" : 56,
   "source_file" : "external/libnl/include/netlink/attr.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIK6nlattr",
   "name" : "const nlattr",
   "referenced_type" : "_ZTI6nlattr",
   "self_type" : "_ZTIK6nlattr",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink/addr.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7nl_addr",
   "name" : "const nl_addr",
   "referenced_type" : "_ZTI7nl_addr",
   "self_type" : "_ZTIK7nl_addr",
   "size" : 20,
   "source_file" : "external/libnl/include/netlink/addr.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7nl_data",
   "name" : "const nl_data",
   "referenced_type" : "_ZTI7nl_data",
   "self_type" : "_ZTIK7nl_data",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink/attr.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7nl_sock",
   "name" : "const nl_sock",
   "referenced_type" : "_ZTI7nl_sock",
   "self_type" : "_ZTIK7nl_sock",
   "size" : 52,
   "source_file" : "external/libnl/include/netlink/socket.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8nlmsghdr",
   "name" : "const nlmsghdr",
   "referenced_type" : "_ZTI8nlmsghdr",
   "self_type" : "_ZTIK8nlmsghdr",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink/msg.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9nl_object",
   "name" : "const nl_object",
   "referenced_type" : "_ZTI9nl_object",
   "self_type" : "_ZTIK9nl_object",
   "size" : 40,
   "source_file" : "external/libnl/include/netlink/object.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9trans_tbl",
   "name" : "const trans_tbl",
   "referenced_type" : "_ZTI9trans_tbl",
   "self_type" : "_ZTIK9trans_tbl",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/netlink.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libnl/include/netlink/addr.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink/version.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink-private/socket.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/libnl/include/netlink/addr.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "entry",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10mpls_label",
   "name" : "mpls_label",
   "referenced_type" : "_ZTI10mpls_label",
   "self_type" : "_ZTI10mpls_label",
   "size" : 4,
   "source_file" : "external/libnl/include/linux-private/linux/mpls.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "queue_group",
     "field_offset" : 320,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "queue_maxlen",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queue_copy_range",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queue_copy_mode",
     "field_offset" : 416,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI10nfnl_queue",
   "name" : "nfnl_queue",
   "referenced_type" : "_ZTI10nfnl_queue",
   "self_type" : "_ZTI10nfnl_queue",
   "size" : 56,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mt_id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mt_act",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mt_name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI10nl_msgtype",
   "name" : "nl_msgtype",
   "referenced_type" : "_ZTI10nl_msgtype",
   "self_type" : "_ZTI10nl_msgtype",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink-private/cache-api.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "api",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "max_tx_rate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "min_tx_rate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10nl_vf_rate",
   "name" : "nl_vf_rate",
   "referenced_type" : "_ZTI10nl_vf_rate",
   "self_type" : "_ZTI10nl_vf_rate",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink/route/link/sriov.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "minlen",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "maxlen",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI10nla_policy",
   "name" : "nla_policy",
   "referenced_type" : "_ZTI10nla_policy",
   "self_type" : "_ZTI10nla_policy",
   "size" : 6,
   "source_file" : "external/libnl/include/netlink/attr.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "c_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_ifindex",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_handle",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_parent",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_info",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_mtu",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_mpu",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_overhead",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_linktype",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_kind",
     "field_offset" : 608,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "c_opts",
     "field_offset" : 864,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "c_stats",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA9_y"
    },
    {
     "field_name" : "c_xstats",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "c_subdata",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "c_link",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIP9rtnl_link"
    },
    {
     "field_name" : "c_ops",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIP11rtnl_tc_ops"
    },
    {
     "field_name" : "c_type",
     "field_offset" : 1600,
     "referenced_type" : "_ZTI12rtnl_tc_type"
    },
    {
     "field_name" : "c_chain",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10rtnl_class",
   "name" : "rtnl_class",
   "referenced_type" : "_ZTI10rtnl_class",
   "self_type" : "_ZTI10rtnl_class",
   "size" : 208,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "n_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_ifindex",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_state",
     "field_offset" : 384,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "n_flags",
     "field_offset" : 400,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 408,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "n_lladdr",
     "field_offset" : 416,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "n_dst",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "n_probes",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_cacheinfo",
     "field_offset" : 512,
     "referenced_type" : "_ZTI15rtnl_ncacheinfo"
    },
    {
     "field_name" : "n_state_mask",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_flag_mask",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_master",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_vlan",
     "field_offset" : 736,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI10rtnl_neigh",
   "name" : "rtnl_neigh",
   "referenced_type" : "_ZTI10rtnl_neigh",
   "self_type" : "_ZTI10rtnl_neigh",
   "size" : 96,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "qnm_latency",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qnm_limit",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qnm_loss",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qnm_gap",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qnm_duplicate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qnm_jitter",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qnm_mask",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qnm_corr",
     "field_offset" : 224,
     "referenced_type" : "_ZTI15rtnl_netem_corr"
    },
    {
     "field_name" : "qnm_ro",
     "field_offset" : 320,
     "referenced_type" : "_ZTI14rtnl_netem_reo"
    },
    {
     "field_name" : "qnm_crpt",
     "field_offset" : 384,
     "referenced_type" : "_ZTI15rtnl_netem_crpt"
    },
    {
     "field_name" : "qnm_dist",
     "field_offset" : 448,
     "referenced_type" : "_ZTI15rtnl_netem_dist"
    }
   ],
   "linker_set_key" : "_ZTI10rtnl_netem",
   "name" : "rtnl_netem",
   "referenced_type" : "_ZTI10rtnl_netem",
   "self_type" : "_ZTI10rtnl_netem",
   "size" : 64,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "q_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "q_ifindex",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "q_handle",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "q_parent",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "q_info",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "q_mtu",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "q_mpu",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "q_overhead",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "q_linktype",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "q_kind",
     "field_offset" : 608,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "q_opts",
     "field_offset" : 864,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "q_stats",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA9_y"
    },
    {
     "field_name" : "q_xstats",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "q_subdata",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "q_link",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIP9rtnl_link"
    },
    {
     "field_name" : "q_ops",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIP11rtnl_tc_ops"
    },
    {
     "field_name" : "q_type",
     "field_offset" : 1600,
     "referenced_type" : "_ZTI12rtnl_tc_type"
    },
    {
     "field_name" : "q_chain",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10rtnl_qdisc",
   "name" : "rtnl_qdisc",
   "referenced_type" : "_ZTI10rtnl_qdisc",
   "self_type" : "_ZTI10rtnl_qdisc",
   "size" : 208,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rt_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rt_dst_len",
     "field_offset" : 328,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rt_src_len",
     "field_offset" : 336,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rt_tos",
     "field_offset" : 344,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rt_protocol",
     "field_offset" : 352,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rt_scope",
     "field_offset" : 360,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rt_type",
     "field_offset" : 368,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rt_nmetrics",
     "field_offset" : 376,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rt_ttl_propagate",
     "field_offset" : 384,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rt_flags",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rt_dst",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "rt_src",
     "field_offset" : 480,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "rt_table",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rt_iif",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rt_prio",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rt_metrics",
     "field_offset" : 608,
     "referenced_type" : "_ZTIA17_j"
    },
    {
     "field_name" : "rt_metrics_mask",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rt_nr_nh",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rt_pref_src",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "rt_nexthops",
     "field_offset" : 1248,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "rt_cacheinfo",
     "field_offset" : 1312,
     "referenced_type" : "_ZTI16rtnl_rtcacheinfo"
    },
    {
     "field_name" : "rt_flag_mask",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10rtnl_route",
   "name" : "rtnl_route",
   "referenced_type" : "_ZTI10rtnl_route",
   "self_type" : "_ZTI10rtnl_route",
   "size" : 200,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "i",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "a",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "list",
     "field_offset" : 64,
     "referenced_type" : "_ZTI12nl_list_head"
    }
   ],
   "linker_set_key" : "_ZTI10trans_list",
   "name" : "trans_list",
   "referenced_type" : "_ZTI10trans_list",
   "self_type" : "_ZTI10trans_list",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/netlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "refcnt",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "daddr",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "saddr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "dport",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "dport_mask",
     "field_offset" : 112,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sport",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sport_mask",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "family",
     "field_offset" : 160,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "prefixlen_d",
     "field_offset" : 176,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "prefixlen_s",
     "field_offset" : 184,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "proto",
     "field_offset" : 192,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ifindex",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "user",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10xfrmnl_sel",
   "name" : "xfrmnl_sel",
   "referenced_type" : "_ZTI10xfrmnl_sel",
   "self_type" : "_ZTI10xfrmnl_sel",
   "size" : 36,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "fr_req",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP12flnl_request"
    },
    {
     "field_name" : "fr_table_id",
     "field_offset" : 352,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "fr_prefixlen",
     "field_offset" : 360,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "fr_nh_sel",
     "field_offset" : 368,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "fr_type",
     "field_offset" : 376,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "fr_scope",
     "field_offset" : 384,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "fr_error",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11flnl_result",
   "name" : "flnl_result",
   "referenced_type" : "_ZTI11flnl_result",
   "self_type" : "_ZTI11flnl_result",
   "size" : 56,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "gf_id",
     "field_offset" : 320,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "gf_name",
     "field_offset" : 336,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "gf_version",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gf_hdrsize",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gf_maxattr",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gf_ops",
     "field_offset" : 576,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "gf_mc_grps",
     "field_offset" : 640,
     "referenced_type" : "_ZTI12nl_list_head"
    }
   ],
   "linker_set_key" : "_ZTI11genl_family",
   "name" : "genl_family",
   "referenced_type" : "_ZTI11genl_family",
   "self_type" : "_ZTI11genl_family",
   "size" : 88,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "idiag_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "idiag_state",
     "field_offset" : 328,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "idiag_timer",
     "field_offset" : 336,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "idiag_retrans",
     "field_offset" : 344,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "idiag_sport",
     "field_offset" : 352,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "idiag_dport",
     "field_offset" : 368,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "idiag_src",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "idiag_dst",
     "field_offset" : 416,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "idiag_ifindex",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idiag_expires",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idiag_rqueue",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idiag_wqueue",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idiag_uid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idiag_inode",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idiag_tos",
     "field_offset" : 640,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "idiag_tclass",
     "field_offset" : 648,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "idiag_shutdown",
     "field_offset" : 656,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "idiag_cong",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "idiag_meminfo",
     "field_offset" : 704,
     "referenced_type" : "_ZTIP15idiagnl_meminfo"
    },
    {
     "field_name" : "idiag_vegasinfo",
     "field_offset" : 736,
     "referenced_type" : "_ZTIP17idiagnl_vegasinfo"
    },
    {
     "field_name" : "idiag_tcpinfo",
     "field_offset" : 768,
     "referenced_type" : "_ZTI8tcp_info"
    },
    {
     "field_name" : "idiag_skmeminfo",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIA9_j"
    }
   ],
   "linker_set_key" : "_ZTI11idiagnl_msg",
   "name" : "idiagnl_msg",
   "referenced_type" : "_ZTI11idiagnl_msg",
   "self_type" : "_ZTI11idiagnl_msg",
   "size" : 368,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "idiag_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "idiag_ext",
     "field_offset" : 328,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "idiag_src",
     "field_offset" : 352,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "idiag_dst",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "idiag_ifindex",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idiag_states",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idiag_dbs",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11idiagnl_req",
   "name" : "idiagnl_req",
   "referenced_type" : "_ZTI11idiagnl_req",
   "self_type" : "_ZTI11idiagnl_req",
   "size" : 64,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "src",
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "dst",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "proto",
     "field_offset" : 64,
     "referenced_type" : "_ZTI13nfnl_ct_proto"
    },
    {
     "field_name" : "packets",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI11nfnl_ct_dir",
   "name" : "nfnl_ct_dir",
   "referenced_type" : "_ZTI11nfnl_ct_dir",
   "self_type" : "_ZTI11nfnl_ct_dir",
   "size" : 32,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ag_family",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ag_group",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11nl_af_group",
   "name" : "nl_af_group",
   "referenced_type" : "_ZTI11nl_af_group",
   "self_type" : "_ZTI11nl_af_group",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/cache-api.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "vlans",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15nl_vf_vlan_info"
    }
   ],
   "linker_set_key" : "_ZTI11nl_vf_vlans",
   "name" : "nl_vf_vlans",
   "referenced_type" : "_ZTI11nl_vf_vlans",
   "self_type" : "_ZTI11nl_vf_vlans",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink/route/link/sriov.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cg_ematch",
     "referenced_type" : "_ZTIP16rtnl_ematch_tree"
    },
    {
     "field_name" : "cg_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11rtnl_cgroup",
   "name" : "rtnl_cgroup",
   "referenced_type" : "_ZTI11rtnl_cgroup",
   "self_type" : "_ZTI11rtnl_cgroup",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "e_id",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "e_kind",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "e_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "e_index",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "e_datalen",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "e_childs",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "e_list",
     "field_offset" : 160,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "e_ops",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP15rtnl_ematch_ops"
    },
    {
     "field_name" : "e_data",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI11rtnl_ematch",
   "name" : "rtnl_ematch",
   "referenced_type" : "_ZTI11rtnl_ematch",
   "self_type" : "_ZTI11rtnl_ematch",
   "size" : 36,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m_parm",
     "referenced_type" : "_ZTI9tc_mirred"
    }
   ],
   "linker_set_key" : "_ZTI11rtnl_mirred",
   "name" : "rtnl_mirred",
   "referenced_type" : "_ZTI11rtnl_mirred",
   "self_type" : "_ZTI11rtnl_mirred",
   "size" : 28,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "qm_num_tc",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "qm_prio_map",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "qm_hw",
     "field_offset" : 136,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "qm_count",
     "field_offset" : 144,
     "referenced_type" : "_ZTIA16_t"
    },
    {
     "field_name" : "qm_offset",
     "field_offset" : 400,
     "referenced_type" : "_ZTIA16_t"
    },
    {
     "field_name" : "qm_mode",
     "field_offset" : 656,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "qm_shaper",
     "field_offset" : 672,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "qm_min_rate",
     "field_offset" : 704,
     "referenced_type" : "_ZTIA16_y"
    },
    {
     "field_name" : "qm_max_rate",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIA16_y"
    },
    {
     "field_name" : "qm_mask",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11rtnl_mqprio",
   "name" : "rtnl_mqprio",
   "referenced_type" : "_ZTI11rtnl_mqprio",
   "self_type" : "_ZTI11rtnl_mqprio",
   "size" : 352,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "to_kind",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "to_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTI12rtnl_tc_type"
    },
    {
     "field_name" : "to_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "to_dump",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA3_PFvP7rtnl_tcPvP14nl_dump_paramsE"
    },
    {
     "field_name" : "to_msg_fill",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP7rtnl_tcPvP6nl_msgE"
    },
    {
     "field_name" : "to_msg_fill_raw",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP7rtnl_tcPvP6nl_msgE"
    },
    {
     "field_name" : "to_msg_parser",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP7rtnl_tcPvE"
    },
    {
     "field_name" : "to_free_data",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFvP7rtnl_tcPvE"
    },
    {
     "field_name" : "to_clone",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiPvS_E"
    },
    {
     "field_name" : "to_list",
     "field_offset" : 352,
     "referenced_type" : "_ZTI12nl_list_head"
    }
   ],
   "linker_set_key" : "_ZTI11rtnl_tc_ops",
   "name" : "rtnl_tc_ops",
   "referenced_type" : "_ZTI11rtnl_tc_ops",
   "self_type" : "_ZTI11rtnl_tc_ops",
   "size" : 52,
   "source_file" : "external/libnl/include/netlink-private/route/tc-api.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tcs_basic",
     "referenced_type" : "_ZTIN11rtnl_tstatsUt_E"
    },
    {
     "field_name" : "tcs_rate_est",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN11rtnl_tstatsUt_E"
    },
    {
     "field_name" : "tcs_queue",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN11rtnl_tstatsUt_E"
    }
   ],
   "linker_set_key" : "_ZTI11rtnl_tstats",
   "name" : "rtnl_tstats",
   "referenced_type" : "_ZTI11rtnl_tstats",
   "self_type" : "_ZTI11rtnl_tstats",
   "size" : 48,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alg_name",
     "referenced_type" : "_ZTIA64_c"
    },
    {
     "field_name" : "alg_key_len",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alg_key",
     "field_offset" : 544,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI11xfrmnl_algo",
   "name" : "xfrmnl_algo",
   "referenced_type" : "_ZTI11xfrmnl_algo",
   "self_type" : "_ZTI11xfrmnl_algo",
   "size" : 68,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "m",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11xfrmnl_mark",
   "name" : "xfrmnl_mark",
   "referenced_type" : "_ZTI11xfrmnl_mark",
   "self_type" : "_ZTI11xfrmnl_mark",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "lr_addr",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "lr_fwmark",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lr_tos",
     "field_offset" : 384,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "lr_scope",
     "field_offset" : 392,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "lr_table",
     "field_offset" : 400,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI12flnl_request",
   "name" : "flnl_request",
   "referenced_type" : "_ZTI12flnl_request",
   "self_type" : "_ZTI12flnl_request",
   "size" : 56,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "src",
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "dst",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "proto",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14nfnl_exp_proto"
    }
   ],
   "linker_set_key" : "_ZTI12nfnl_exp_dir",
   "name" : "nfnl_exp_dir",
   "referenced_type" : "_ZTI12nfnl_exp_dir",
   "self_type" : "_ZTI12nfnl_exp_dir",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "log_msg_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "log_msg_hook",
     "field_offset" : 328,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "log_msg_hwproto",
     "field_offset" : 336,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "log_msg_mark",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_msg_timestamp",
     "field_offset" : 384,
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "log_msg_indev",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_msg_outdev",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_msg_physindev",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_msg_physoutdev",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_msg_hwaddr",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "log_msg_hwaddr_len",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "log_msg_payload",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "log_msg_payload_len",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "log_msg_prefix",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "log_msg_uid",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_msg_gid",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_msg_seq",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_msg_seq_global",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12nfnl_log_msg",
   "name" : "nfnl_log_msg",
   "referenced_type" : "_ZTI12nfnl_log_msg",
   "self_type" : "_ZTI12nfnl_log_msg",
   "size" : 112,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encap_type",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "build_msg",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiP6nl_msgPvE"
    },
    {
     "field_name" : "parse_msg",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiP6nlattrP12rtnl_nexthopE"
    },
    {
     "field_name" : "compare",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiPvS_E"
    },
    {
     "field_name" : "dump",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvPvP14nl_dump_paramsE"
    },
    {
     "field_name" : "destructor",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFvPvE"
    }
   ],
   "linker_set_key" : "_ZTI12nh_encap_ops",
   "name" : "nh_encap_ops",
   "referenced_type" : "_ZTI12nh_encap_ops",
   "self_type" : "_ZTI12nh_encap_ops",
   "size" : 24,
   "source_file" : "external/libnl/include/netlink-private/route/nexthop-encap.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "co_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "co_hdrsize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "co_protocol",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "co_hash_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "co_flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "co_refcnt",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "co_groups",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP11nl_af_group"
    },
    {
     "field_name" : "co_request_update",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP8nl_cacheP7nl_sockE"
    },
    {
     "field_name" : "co_msg_parser",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP12nl_cache_opsP11sockaddr_nlP8nlmsghdrP15nl_parser_paramE"
    },
    {
     "field_name" : "co_event_filter",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFiP8nl_cacheP9nl_objectE"
    },
    {
     "field_name" : "co_include_event",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP8nl_cacheP9nl_objectPFvS0_S2_iPvEPFvS0_S2_S2_yiS3_ES3_E"
    },
    {
     "field_name" : "reserved_1",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "reserved_2",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "reserved_3",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "reserved_4",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "reserved_5",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "reserved_6",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "reserved_7",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "reserved_8",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "co_obj_ops",
     "field_offset" : 608,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "co_next",
     "field_offset" : 640,
     "referenced_type" : "_ZTIP12nl_cache_ops"
    },
    {
     "field_name" : "co_major_cache",
     "field_offset" : 672,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "co_genl",
     "field_offset" : 704,
     "referenced_type" : "_ZTIP8genl_ops"
    },
    {
     "field_name" : "co_msgtypes",
     "field_offset" : 736,
     "referenced_type" : "_ZTIA_10nl_msgtype"
    }
   ],
   "linker_set_key" : "_ZTI12nl_cache_ops",
   "name" : "nl_cache_ops",
   "referenced_type" : "_ZTI12nl_cache_ops",
   "self_type" : "_ZTI12nl_cache_ops",
   "size" : 92,
   "source_file" : "external/libnl/include/netlink-private/cache-api.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "key_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "obj",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9nl_object"
    },
    {
     "field_name" : "next",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP12nl_hash_node"
    }
   ],
   "linker_set_key" : "_ZTI12nl_hash_node",
   "name" : "nl_hash_node",
   "referenced_type" : "_ZTI12nl_hash_node",
   "self_type" : "_ZTI12nl_hash_node",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink/hashtable.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP12nl_list_head"
    },
    {
     "field_name" : "prev",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP12nl_list_head"
    }
   ],
   "linker_set_key" : "_ZTI12nl_list_head",
   "name" : "nl_list_head",
   "referenced_type" : "_ZTI12nl_list_head",
   "self_type" : "_ZTI12nl_list_head",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink/list.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vf_list",
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_refcnt",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vf_index",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vf_guid_node",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "vf_guid_port",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "vf_linkstate",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vf_lladdr",
     "field_offset" : 352,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "vf_max_tx_rate",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vf_min_tx_rate",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vf_rate",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vf_rss_query_en",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vf_spoofchk",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vf_stats",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA6_y"
    },
    {
     "field_name" : "vf_trust",
     "field_offset" : 960,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vf_vlans",
     "field_offset" : 992,
     "referenced_type" : "_ZTIP11nl_vf_vlans"
    }
   ],
   "linker_set_key" : "_ZTI12rtnl_link_vf",
   "name" : "rtnl_link_vf",
   "referenced_type" : "_ZTI12rtnl_link_vf",
   "self_type" : "_ZTI12rtnl_link_vf",
   "size" : 128,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rtnh_flags",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rtnh_flag_mask",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rtnh_weight",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rtnh_ifindex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rtnh_gateway",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rtnh_list",
     "field_offset" : 128,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "rtnh_realms",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rtnh_newdst",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "rtnh_via",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "rtnh_encap",
     "field_offset" : 288,
     "referenced_type" : "_ZTIP13rtnl_nh_encap"
    }
   ],
   "linker_set_key" : "_ZTI12rtnl_nexthop",
   "name" : "rtnl_nexthop",
   "referenced_type" : "_ZTI12rtnl_nexthop",
   "self_type" : "_ZTI12rtnl_nexthop",
   "size" : 40,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s_parm",
     "referenced_type" : "_ZTI10tc_skbedit"
    },
    {
     "field_name" : "s_flags",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "s_mark",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "s_prio",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "s_queue_mapping",
     "field_offset" : 256,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI12rtnl_skbedit",
   "name" : "rtnl_skbedit",
   "referenced_type" : "_ZTI12rtnl_skbedit",
   "self_type" : "_ZTI12rtnl_skbedit",
   "size" : 36,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "daddr",
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "spi",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "family",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "proto",
     "field_offset" : 80,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI12xfrmnl_sa_id",
   "name" : "xfrmnl_sa_id",
   "referenced_type" : "_ZTI12xfrmnl_sa_id",
   "self_type" : "_ZTI12xfrmnl_sa_id",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "replay_window",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "replay",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "integrity_failed",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12xfrmnl_stats",
   "name" : "xfrmnl_stats",
   "referenced_type" : "_ZTI12xfrmnl_stats",
   "self_type" : "_ZTI12xfrmnl_stats",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "index",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI13ematch_quoted",
   "name" : "ematch_quoted",
   "referenced_type" : "_ZTI13ematch_quoted",
   "self_type" : "_ZTI13ematch_quoted",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "port",
     "referenced_type" : "_ZTIN13nfnl_ct_protoUt_E"
    },
    {
     "field_name" : "icmp",
     "referenced_type" : "_ZTIN13nfnl_ct_protoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI13nfnl_ct_proto",
   "name" : "nfnl_ct_proto",
   "record_kind" : "union",
   "referenced_type" : "_ZTI13nfnl_ct_proto",
   "self_type" : "_ZTI13nfnl_ct_proto",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cm_protocol",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cm_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cm_nassocs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cm_sock",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP7nl_sock"
    },
    {
     "field_name" : "cm_sync_sock",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP7nl_sock"
    },
    {
     "field_name" : "cm_assocs",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP14nl_cache_assoc"
    }
   ],
   "linker_set_key" : "_ZTI13nl_cache_mngr",
   "name" : "nl_cache_mngr",
   "referenced_type" : "_ZTI13nl_cache_mngr",
   "self_type" : "_ZTI13nl_cache_mngr",
   "size" : 24,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nodes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPP12nl_hash_node"
    }
   ],
   "linker_set_key" : "_ZTI13nl_hash_table",
   "name" : "nl_hash_table",
   "referenced_type" : "_ZTI13nl_hash_table",
   "self_type" : "_ZTI13nl_hash_table",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink/hashtable.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "oo_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "oo_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "oo_id_attrs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "oo_constructor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvP9nl_objectE"
    },
    {
     "field_name" : "oo_free_data",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvP9nl_objectE"
    },
    {
     "field_name" : "oo_clone",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiP9nl_objectS0_E"
    },
    {
     "field_name" : "oo_dump",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA3_PFvP9nl_objectP14nl_dump_paramsE"
    },
    {
     "field_name" : "oo_compare",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFyP9nl_objectS0_yiE"
    },
    {
     "field_name" : "oo_update",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP9nl_objectS0_E"
    },
    {
     "field_name" : "oo_keygen",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFvP9nl_objectPjjE"
    },
    {
     "field_name" : "oo_attrs2str",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFPciS_jE"
    },
    {
     "field_name" : "oo_id_attrs_get",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFjP9nl_objectE"
    }
   ],
   "linker_set_key" : "_ZTI13nl_object_ops",
   "name" : "nl_object_ops",
   "referenced_type" : "_ZTI13nl_object_ops",
   "self_type" : "_ZTI13nl_object_ops",
   "size" : 56,
   "source_file" : "external/libnl/include/netlink-private/object-api.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fq_limit",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fq_target",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fq_interval",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fq_flows",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fq_quantum",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fq_ecn",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fq_mask",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13rtnl_fq_codel",
   "name" : "rtnl_fq_codel",
   "referenced_type" : "_ZTI13rtnl_fq_codel",
   "self_type" : "_ZTI13rtnl_fq_codel",
   "size" : 28,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lm_mem_start",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "lm_mem_end",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "lm_base_addr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "lm_irq",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "lm_dma",
     "field_offset" : 208,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "lm_port",
     "field_offset" : 216,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI13rtnl_link_map",
   "name" : "rtnl_link_map",
   "referenced_type" : "_ZTI13rtnl_link_map",
   "self_type" : "_ZTI13rtnl_link_map",
   "size" : 32,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "nt_name",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "nt_family",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nt_gc_thresh1",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nt_gc_thresh2",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nt_gc_thresh3",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nt_gc_interval",
     "field_offset" : 704,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "nt_config",
     "field_offset" : 768,
     "referenced_type" : "_ZTI10ndt_config"
    },
    {
     "field_name" : "nt_parms",
     "field_offset" : 1024,
     "referenced_type" : "_ZTI19rtnl_neightbl_parms"
    },
    {
     "field_name" : "nt_stats",
     "field_offset" : 1792,
     "referenced_type" : "_ZTI9ndt_stats"
    }
   ],
   "linker_set_key" : "_ZTI13rtnl_neightbl",
   "name" : "rtnl_neightbl",
   "referenced_type" : "_ZTI13rtnl_neightbl",
   "self_type" : "_ZTI13rtnl_neightbl",
   "size" : 312,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ops",
     "referenced_type" : "_ZTIP12nh_encap_ops"
    },
    {
     "field_name" : "priv",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI13rtnl_nh_encap",
   "name" : "rtnl_nh_encap",
   "referenced_type" : "_ZTI13rtnl_nh_encap",
   "self_type" : "_ZTI13rtnl_nh_encap",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "rs_rate64",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rs_overhead",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rs_cell_align",
     "field_offset" : 80,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "rs_mpu",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rs_cell_log",
     "field_offset" : 112,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI13rtnl_ratespec",
   "name" : "rtnl_ratespec",
   "referenced_type" : "_ZTI13rtnl_ratespec",
   "self_type" : "_ZTI13rtnl_ratespec",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "o_id",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "o_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "o_list",
     "field_offset" : 64,
     "referenced_type" : "_ZTI12nl_list_head"
    }
   ],
   "linker_set_key" : "_ZTI14genl_family_op",
   "name" : "genl_family_op",
   "referenced_type" : "_ZTI14genl_family_op",
   "self_type" : "_ZTI14genl_family_op",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "l4protonum",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "l4protodata",
     "field_offset" : 16,
     "referenced_type" : "_ZTI18nfnl_exp_protodata"
    }
   ],
   "linker_set_key" : "_ZTI14nfnl_exp_proto",
   "name" : "nfnl_exp_proto",
   "referenced_type" : "_ZTI14nfnl_exp_proto",
   "self_type" : "_ZTI14nfnl_exp_proto",
   "size" : 6,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "queue_msg_group",
     "field_offset" : 320,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "queue_msg_family",
     "field_offset" : 336,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "queue_msg_hook",
     "field_offset" : 344,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "queue_msg_hwproto",
     "field_offset" : 352,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "queue_msg_packetid",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queue_msg_mark",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queue_msg_timestamp",
     "field_offset" : 448,
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "queue_msg_indev",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queue_msg_outdev",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queue_msg_physindev",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queue_msg_physoutdev",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queue_msg_hwaddr",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "queue_msg_hwaddr_len",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "queue_msg_payload",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "queue_msg_payload_len",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "queue_msg_verdict",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14nfnl_queue_msg",
   "name" : "nfnl_queue_msg",
   "referenced_type" : "_ZTI14nfnl_queue_msg",
   "self_type" : "_ZTI14nfnl_queue_msg",
   "size" : 104,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ca_cache",
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ca_change",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvP8nl_cacheP9nl_objectiPvE"
    },
    {
     "field_name" : "ca_change_v2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvP8nl_cacheP9nl_objectS2_yiPvE"
    },
    {
     "field_name" : "ca_change_data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI14nl_cache_assoc",
   "name" : "nl_cache_assoc",
   "referenced_type" : "_ZTI14nl_cache_assoc",
   "self_type" : "_ZTI14nl_cache_assoc",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dp_type",
     "referenced_type" : "_ZTI12nl_dump_type"
    },
    {
     "field_name" : "dp_prefix",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dp_print_index",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dp_dump_msgtype",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dp_cb",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvP14nl_dump_paramsPcE"
    },
    {
     "field_name" : "dp_nl_cb",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFvP14nl_dump_paramsiE"
    },
    {
     "field_name" : "dp_data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "dp_fd",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP7__sFILE"
    },
    {
     "field_name" : "dp_buf",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "dp_buflen",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dp_pre_dump",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dp_ivar",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dp_line",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14nl_dump_params",
   "name" : "nl_dump_params",
   "referenced_type" : "_ZTI14nl_dump_params",
   "self_type" : "_ZTI14nl_dump_params",
   "size" : 52,
   "source_file" : "external/libnl/include/netlink/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ch_prio",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_rate",
     "field_offset" : 64,
     "referenced_type" : "_ZTI13rtnl_ratespec"
    },
    {
     "field_name" : "ch_ceil",
     "field_offset" : 192,
     "referenced_type" : "_ZTI13rtnl_ratespec"
    },
    {
     "field_name" : "ch_rbuffer",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_cbuffer",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_quantum",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_mask",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_level",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14rtnl_htb_class",
   "name" : "rtnl_htb_class",
   "referenced_type" : "_ZTI14rtnl_htb_class",
   "self_type" : "_ZTI14rtnl_htb_class",
   "size" : 64,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "qh_rate2quantum",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qh_defcls",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qh_mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qh_direct_pkts",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14rtnl_htb_qdisc",
   "name" : "rtnl_htb_qdisc",
   "referenced_type" : "_ZTI14rtnl_htb_qdisc",
   "self_type" : "_ZTI14rtnl_htb_qdisc",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nmro_probability",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nmro_correlation",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14rtnl_netem_reo",
   "name" : "rtnl_netem_reo",
   "referenced_type" : "_ZTI14rtnl_netem_reo",
   "self_type" : "_ZTI14rtnl_netem_reo",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "family",
     "referenced_type" : "_ZTIP11genl_family"
    },
    {
     "field_name" : "list",
     "field_offset" : 32,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "id",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15genl_family_grp",
   "name" : "genl_family_grp",
   "referenced_type" : "_ZTI15genl_family_grp",
   "self_type" : "_ZTI15genl_family_grp",
   "size" : 32,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "idiag_rmem",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idiag_wmem",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idiag_fmem",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "idiag_tmem",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15idiagnl_meminfo",
   "name" : "idiagnl_meminfo",
   "referenced_type" : "_ZTI15idiagnl_meminfo",
   "self_type" : "_ZTI15idiagnl_meminfo",
   "size" : 56,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "rx_packets",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_packets",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_bytes",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_bytes",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_errors",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_errors",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_dropped",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_dropped",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_noroute",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI15mpls_link_stats",
   "name" : "mpls_link_stats",
   "referenced_type" : "_ZTI15mpls_link_stats",
   "self_type" : "_ZTI15mpls_link_stats",
   "size" : 72,
   "source_file" : "external/libnl/include/linux-private/linux/mpls.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pp_cb",
     "referenced_type" : "_ZTIPFiP9nl_objectP15nl_parser_paramE"
    },
    {
     "field_name" : "pp_arg",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI15nl_parser_param",
   "name" : "nl_parser_param",
   "referenced_type" : "_ZTI15nl_parser_param",
   "self_type" : "_ZTI15nl_parser_param",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/cache-api.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vf_vlan",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vf_vlan_qos",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vf_vlan_proto",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI15nl_vf_vlan_info",
   "name" : "nl_vf_vlan_info",
   "referenced_type" : "_ZTI15nl_vf_vlan_info",
   "self_type" : "_ZTI15nl_vf_vlan_info",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink/route/link/sriov.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ch_rsc",
     "referenced_type" : "_ZTI16tc_service_curve"
    },
    {
     "field_name" : "ch_fsc",
     "field_offset" : 96,
     "referenced_type" : "_ZTI16tc_service_curve"
    },
    {
     "field_name" : "ch_usc",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16tc_service_curve"
    },
    {
     "field_name" : "ch_mask",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15rtnl_hfsc_class",
   "name" : "rtnl_hfsc_class",
   "referenced_type" : "_ZTI15rtnl_hfsc_class",
   "self_type" : "_ZTI15rtnl_hfsc_class",
   "size" : 40,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "qh_defcls",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qh_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15rtnl_hfsc_qdisc",
   "name" : "rtnl_hfsc_qdisc",
   "referenced_type" : "_ZTI15rtnl_hfsc_qdisc",
   "self_type" : "_ZTI15rtnl_hfsc_qdisc",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nci_confirmed",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nci_used",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nci_updated",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nci_refcnt",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15rtnl_ncacheinfo",
   "name" : "rtnl_ncacheinfo",
   "referenced_type" : "_ZTI15rtnl_ncacheinfo",
   "self_type" : "_ZTI15rtnl_ncacheinfo",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nmc_delay",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nmc_loss",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nmc_duplicate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15rtnl_netem_corr",
   "name" : "rtnl_netem_corr",
   "referenced_type" : "_ZTI15rtnl_netem_corr",
   "self_type" : "_ZTI15rtnl_netem_corr",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nmcr_probability",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nmcr_correlation",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15rtnl_netem_crpt",
   "name" : "rtnl_netem_crpt",
   "referenced_type" : "_ZTI15rtnl_netem_crpt",
   "self_type" : "_ZTI15rtnl_netem_crpt",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dist_data",
     "referenced_type" : "_ZTIPs"
    },
    {
     "field_name" : "dist_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15rtnl_netem_dist",
   "name" : "rtnl_netem_dist",
   "referenced_type" : "_ZTI15rtnl_netem_dist",
   "self_type" : "_ZTI15rtnl_netem_dist",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "et_progid",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "et_list",
     "field_offset" : 32,
     "referenced_type" : "_ZTI12nl_list_head"
    }
   ],
   "linker_set_key" : "_ZTI16rtnl_ematch_tree",
   "name" : "rtnl_ematch_tree",
   "referenced_type" : "_ZTI16rtnl_ematch_tree",
   "self_type" : "_ZTI16rtnl_ematch_tree",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rtci_clntref",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rtci_last_use",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rtci_expires",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rtci_error",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rtci_used",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rtci_id",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rtci_ts",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rtci_tsage",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16rtnl_rtcacheinfo",
   "name" : "rtnl_rtcacheinfo",
   "referenced_type" : "_ZTI16rtnl_rtcacheinfo",
   "self_type" : "_ZTI16rtnl_rtcacheinfo",
   "size" : 32,
   "source_file" : "external/libnl/include/netlink/route/route.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tt_type",
     "referenced_type" : "_ZTI12rtnl_tc_type"
    },
    {
     "field_name" : "tt_dump_prefix",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "tt_dump",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA3_PFvP7rtnl_tcP14nl_dump_paramsE"
    }
   ],
   "linker_set_key" : "_ZTI16rtnl_tc_type_ops",
   "name" : "rtnl_tc_type_ops",
   "referenced_type" : "_ZTI16rtnl_tc_type_ops",
   "self_type" : "_ZTI16rtnl_tc_type_ops",
   "size" : 20,
   "source_file" : "external/libnl/include/netlink-private/route/tc-api.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alg_name",
     "referenced_type" : "_ZTIA64_c"
    },
    {
     "field_name" : "alg_key_len",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alg_icv_len",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alg_key",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI16xfrmnl_algo_aead",
   "name" : "xfrmnl_algo_aead",
   "referenced_type" : "_ZTI16xfrmnl_algo_aead",
   "self_type" : "_ZTI16xfrmnl_algo_aead",
   "size" : 72,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alg_name",
     "referenced_type" : "_ZTIA64_c"
    },
    {
     "field_name" : "alg_key_len",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alg_trunc_len",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alg_key",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI16xfrmnl_algo_auth",
   "name" : "xfrmnl_algo_auth",
   "referenced_type" : "_ZTI16xfrmnl_algo_auth",
   "self_type" : "_ZTI16xfrmnl_algo_auth",
   "size" : 72,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "refcnt",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "soft_byte_limit",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "hard_byte_limit",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "soft_packet_limit",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "hard_packet_limit",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "soft_add_expires_seconds",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "hard_add_expires_seconds",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "soft_use_expires_seconds",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "hard_use_expires_seconds",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI16xfrmnl_ltime_cfg",
   "name" : "xfrmnl_ltime_cfg",
   "referenced_type" : "_ZTI16xfrmnl_ltime_cfg",
   "self_type" : "_ZTI16xfrmnl_ltime_cfg",
   "size" : 72,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTI9xfrmnl_id"
    },
    {
     "field_name" : "family",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "saddr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "reqid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mode",
     "field_offset" : 192,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "share",
     "field_offset" : 200,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "optional",
     "field_offset" : 208,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "aalgos",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ealgos",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "calgos",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "utmpl_list",
     "field_offset" : 320,
     "referenced_type" : "_ZTI12nl_list_head"
    }
   ],
   "linker_set_key" : "_ZTI16xfrmnl_user_tmpl",
   "name" : "xfrmnl_user_tmpl",
   "referenced_type" : "_ZTI16xfrmnl_user_tmpl",
   "self_type" : "_ZTI16xfrmnl_user_tmpl",
   "size" : 48,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tcpv_enabled",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tcpv_rttcnt",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tcpv_rtt",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tcpv_minrtt",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17idiagnl_vegasinfo",
   "name" : "idiagnl_vegasinfo",
   "referenced_type" : "_ZTI17idiagnl_vegasinfo",
   "self_type" : "_ZTI17idiagnl_vegasinfo",
   "size" : 56,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tcp",
     "referenced_type" : "_ZTIN17nfnl_ct_protoinfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI17nfnl_ct_protoinfo",
   "name" : "nfnl_ct_protoinfo",
   "record_kind" : "union",
   "referenced_type" : "_ZTI17nfnl_ct_protoinfo",
   "self_type" : "_ZTI17nfnl_ct_protoinfo",
   "size" : 1,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stop",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI17nfnl_ct_timestamp",
   "name" : "nfnl_ct_timestamp",
   "referenced_type" : "_ZTI17nfnl_ct_timestamp",
   "self_type" : "_ZTI17nfnl_ct_timestamp",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink/netfilter/ct.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cdm_bmask",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "cdm_value",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "cdm_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17rtnl_dsmark_class",
   "name" : "rtnl_dsmark_class",
   "referenced_type" : "_ZTI17rtnl_dsmark_class",
   "self_type" : "_ZTI17rtnl_dsmark_class",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "qdm_indices",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "qdm_default_index",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "qdm_set_tc_index",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qdm_mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17rtnl_dsmark_qdisc",
   "name" : "rtnl_dsmark_qdisc",
   "referenced_type" : "_ZTI17rtnl_dsmark_qdisc",
   "self_type" : "_ZTI17rtnl_dsmark_qdisc",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encap_type",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "encap_sport",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "encap_dport",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "encap_oa",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP7nl_addr"
    }
   ],
   "linker_set_key" : "_ZTI17xfrmnl_encap_tmpl",
   "name" : "xfrmnl_encap_tmpl",
   "referenced_type" : "_ZTI17xfrmnl_encap_tmpl",
   "self_type" : "_ZTI17xfrmnl_encap_tmpl",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "port",
     "referenced_type" : "_ZTIN18nfnl_exp_protodataUt_E"
    },
    {
     "field_name" : "icmp",
     "referenced_type" : "_ZTIN18nfnl_exp_protodataUt_E"
    }
   ],
   "linker_set_key" : "_ZTI18nfnl_exp_protodata",
   "name" : "nfnl_exp_protodata",
   "record_kind" : "union",
   "referenced_type" : "_ZTI18nfnl_exp_protodata",
   "self_type" : "_ZTI18nfnl_exp_protodata",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "aci_prefered",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "aci_valid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "aci_cstamp",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "aci_tstamp",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19rtnl_addr_cacheinfo",
   "name" : "rtnl_addr_cacheinfo",
   "referenced_type" : "_ZTI19rtnl_addr_cacheinfo",
   "self_type" : "_ZTI19rtnl_addr_cacheinfo",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ntp_ifindex",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ntp_refcnt",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ntp_queue_len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ntp_app_probes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ntp_ucast_probes",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ntp_mcast_probes",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ntp_base_reachable_time",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ntp_reachable_time",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ntp_retrans_time",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ntp_gc_stale_time",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ntp_probe_delay",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ntp_anycast_delay",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ntp_locktime",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ntp_proxy_delay",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ntp_proxy_qlen",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ntp_mask",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19rtnl_neightbl_parms",
   "name" : "rtnl_neightbl_parms",
   "referenced_type" : "_ZTI19rtnl_neightbl_parms",
   "self_type" : "_ZTI19rtnl_neightbl_parms",
   "size" : 96,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bytes",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "packets",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "add_time",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "use_time",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI19xfrmnl_lifetime_cur",
   "name" : "xfrmnl_lifetime_cur",
   "referenced_type" : "_ZTI19xfrmnl_lifetime_cur",
   "self_type" : "_ZTI19xfrmnl_lifetime_cur",
   "size" : 32,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "oseq",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "seq",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bitmap",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19xfrmnl_replay_state",
   "name" : "xfrmnl_replay_state",
   "referenced_type" : "_ZTI19xfrmnl_replay_state",
   "self_type" : "_ZTI19xfrmnl_replay_state",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "exttype",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ctx_alg",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ctx_doi",
     "field_offset" : 40,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ctx_len",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ctx",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI19xfrmnl_user_sec_ctx",
   "name" : "xfrmnl_user_sec_ctx",
   "referenced_type" : "_ZTI19xfrmnl_user_sec_ctx",
   "self_type" : "_ZTI19xfrmnl_user_sec_ctx",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "proto",
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI19xfrmnl_usersa_flush",
   "name" : "xfrmnl_usersa_flush",
   "referenced_type" : "_ZTI19xfrmnl_usersa_flush",
   "self_type" : "_ZTI19xfrmnl_usersa_flush",
   "size" : 1,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sel",
     "referenced_type" : "_ZTI10xfrmnl_sel"
    },
    {
     "field_name" : "index",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dir",
     "field_offset" : 320,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI20xfrmnl_userpolicy_id",
   "name" : "xfrmnl_userpolicy_id",
   "referenced_type" : "_ZTI20xfrmnl_userpolicy_id",
   "self_type" : "_ZTI20xfrmnl_userpolicy_id",
   "size" : 44,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI22xfrmnl_userpolicy_type",
   "name" : "xfrmnl_userpolicy_type",
   "referenced_type" : "_ZTI22xfrmnl_userpolicy_type",
   "self_type" : "_ZTI22xfrmnl_userpolicy_type",
   "size" : 6,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bmp_len",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "oseq",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "seq",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "oseq_hi",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "seq_hi",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "replay_window",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bmp",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA0_j"
    }
   ],
   "linker_set_key" : "_ZTI23xfrmnl_replay_state_esn",
   "name" : "xfrmnl_replay_state_esn",
   "referenced_type" : "_ZTI23xfrmnl_replay_state_esn",
   "self_type" : "_ZTI23xfrmnl_replay_state_esn",
   "size" : 24,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cb_set",
     "referenced_type" : "_ZTIA11_PFiP6nl_msgPvE"
    },
    {
     "field_name" : "cb_args",
     "field_offset" : 352,
     "referenced_type" : "_ZTIA11_Pv"
    },
    {
     "field_name" : "cb_err",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFiP11sockaddr_nlP8nlmsgerrPvE"
    },
    {
     "field_name" : "cb_err_arg",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb_recvmsgs_ow",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFiP7nl_sockP5nl_cbE"
    },
    {
     "field_name" : "cb_recv_ow",
     "field_offset" : 800,
     "referenced_type" : "_ZTIPFiP7nl_sockP11sockaddr_nlPPhPP5ucredE"
    },
    {
     "field_name" : "cb_send_ow",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiP7nl_sockP6nl_msgE"
    },
    {
     "field_name" : "cb_refcnt",
     "field_offset" : 864,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cb_active",
     "field_offset" : 896,
     "referenced_type" : "_ZTI10nl_cb_type"
    }
   ],
   "linker_set_key" : "_ZTI5nl_cb",
   "name" : "nl_cb",
   "referenced_type" : "_ZTI5nl_cb",
   "self_type" : "_ZTI5nl_cb",
   "size" : 116,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nm_protocol",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nm_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nm_src",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11sockaddr_nl"
    },
    {
     "field_name" : "nm_dst",
     "field_offset" : 160,
     "referenced_type" : "_ZTI11sockaddr_nl"
    },
    {
     "field_name" : "nm_creds",
     "field_offset" : 256,
     "referenced_type" : "_ZTI5ucred"
    },
    {
     "field_name" : "nm_nlh",
     "field_offset" : 352,
     "referenced_type" : "_ZTIP8nlmsghdr"
    },
    {
     "field_name" : "nm_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nm_refcnt",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6nl_msg",
   "name" : "nl_msg",
   "referenced_type" : "_ZTI6nl_msg",
   "self_type" : "_ZTI6nl_msg",
   "size" : 56,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ct_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ct_proto",
     "field_offset" : 328,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ct_protoinfo",
     "field_offset" : 336,
     "referenced_type" : "_ZTI17nfnl_ct_protoinfo"
    },
    {
     "field_name" : "ct_status",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ct_status_mask",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ct_timeout",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ct_mark",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ct_use",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ct_id",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ct_zone",
     "field_offset" : 544,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ct_orig",
     "field_offset" : 576,
     "referenced_type" : "_ZTI11nfnl_ct_dir"
    },
    {
     "field_name" : "ct_repl",
     "field_offset" : 832,
     "referenced_type" : "_ZTI11nfnl_ct_dir"
    },
    {
     "field_name" : "ct_tstamp",
     "field_offset" : 1088,
     "referenced_type" : "_ZTI17nfnl_ct_timestamp"
    }
   ],
   "linker_set_key" : "_ZTI7nfnl_ct",
   "name" : "nfnl_ct",
   "referenced_type" : "_ZTI7nfnl_ct",
   "self_type" : "_ZTI7nfnl_ct",
   "size" : 152,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_family",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "a_maxsize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "a_len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "a_prefixlen",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "a_refcnt",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "a_addr",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI7nl_addr",
   "name" : "nl_addr",
   "referenced_type" : "_ZTI7nl_addr",
   "self_type" : "_ZTI7nl_addr",
   "size" : 20,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "d_data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI7nl_data",
   "name" : "nl_data",
   "referenced_type" : "_ZTI7nl_data",
   "self_type" : "_ZTI7nl_data",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s_local",
     "referenced_type" : "_ZTI11sockaddr_nl"
    },
    {
     "field_name" : "s_peer",
     "field_offset" : 96,
     "referenced_type" : "_ZTI11sockaddr_nl"
    },
    {
     "field_name" : "s_fd",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "s_proto",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "s_seq_next",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "s_seq_expect",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "s_flags",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "s_cb",
     "field_offset" : 352,
     "referenced_type" : "_ZTIP5nl_cb"
    },
    {
     "field_name" : "s_bufsize",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7nl_sock",
   "name" : "nl_sock",
   "referenced_type" : "_ZTI7nl_sock",
   "self_type" : "_ZTI7nl_sock",
   "size" : 52,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cf_classid",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cf_act",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "cf_police",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "cf_indev",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "cf_fwmask",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cf_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7rtnl_fw",
   "name" : "rtnl_fw",
   "referenced_type" : "_ZTI7rtnl_fw",
   "self_type" : "_ZTI7rtnl_fw",
   "size" : 36,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tc_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tc_ifindex",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tc_handle",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tc_parent",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tc_info",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tc_mtu",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tc_mpu",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tc_overhead",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tc_linktype",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tc_kind",
     "field_offset" : 608,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "tc_opts",
     "field_offset" : 864,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "tc_stats",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA9_y"
    },
    {
     "field_name" : "tc_xstats",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "tc_subdata",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "tc_link",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIP9rtnl_link"
    },
    {
     "field_name" : "tc_ops",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIP11rtnl_tc_ops"
    },
    {
     "field_name" : "tc_type",
     "field_offset" : 1600,
     "referenced_type" : "_ZTI12rtnl_tc_type"
    },
    {
     "field_name" : "tc_chain",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7rtnl_tc",
   "name" : "rtnl_tc",
   "referenced_type" : "_ZTI7rtnl_tc",
   "self_type" : "_ZTI7rtnl_tc",
   "size" : 208,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "c_id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "c_name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "c_maxattr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "c_msg_parser",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP12nl_cache_opsP8genl_cmdP9genl_infoPvE"
    },
    {
     "field_name" : "c_attr_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP10nla_policy"
    }
   ],
   "linker_set_key" : "_ZTI8genl_cmd",
   "name" : "genl_cmd",
   "referenced_type" : "_ZTI8genl_cmd",
   "self_type" : "_ZTI8genl_cmd",
   "size" : 20,
   "source_file" : "external/libnl/include/netlink/genl/mngt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "o_hdrsize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "o_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "o_name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "o_cache_ops",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP12nl_cache_ops"
    },
    {
     "field_name" : "o_cmds",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP8genl_cmd"
    },
    {
     "field_name" : "o_ncmds",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "o_list",
     "field_offset" : 192,
     "referenced_type" : "_ZTI12nl_list_head"
    }
   ],
   "linker_set_key" : "_ZTI8genl_ops",
   "name" : "genl_ops",
   "referenced_type" : "_ZTI8genl_ops",
   "self_type" : "_ZTI8genl_ops",
   "size" : 32,
   "source_file" : "external/libnl/include/netlink/genl/mngt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exp_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "exp_timeout",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exp_id",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exp_zone",
     "field_offset" : 416,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "exp_class",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exp_flags",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exp_helper_name",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "exp_fn",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "exp_nat_dir",
     "field_offset" : 576,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "exp_expect",
     "field_offset" : 608,
     "referenced_type" : "_ZTI12nfnl_exp_dir"
    },
    {
     "field_name" : "exp_master",
     "field_offset" : 736,
     "referenced_type" : "_ZTI12nfnl_exp_dir"
    },
    {
     "field_name" : "exp_mask",
     "field_offset" : 864,
     "referenced_type" : "_ZTI12nfnl_exp_dir"
    },
    {
     "field_name" : "exp_nat",
     "field_offset" : 992,
     "referenced_type" : "_ZTI12nfnl_exp_dir"
    }
   ],
   "linker_set_key" : "_ZTI8nfnl_exp",
   "name" : "nfnl_exp",
   "referenced_type" : "_ZTI8nfnl_exp",
   "self_type" : "_ZTI8nfnl_exp",
   "size" : 144,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "log_group",
     "field_offset" : 320,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "log_copy_mode",
     "field_offset" : 336,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "log_copy_range",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_flush_timeout",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_alloc_size",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_queue_threshold",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_flags",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "log_flag_mask",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8nfnl_log",
   "name" : "nfnl_log",
   "referenced_type" : "_ZTI8nfnl_log",
   "self_type" : "_ZTI8nfnl_log",
   "size" : 72,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "c_items",
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "c_nitems",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "c_iarg1",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "c_iarg2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "c_refcnt",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "c_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hashtable",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP13nl_hash_table"
    },
    {
     "field_name" : "c_ops",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP12nl_cache_ops"
    }
   ],
   "linker_set_key" : "_ZTI8nl_cache",
   "name" : "nl_cache",
   "referenced_type" : "_ZTI8nl_cache",
   "self_type" : "_ZTI8nl_cache",
   "size" : 36,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "c_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_ifindex",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_handle",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_parent",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_info",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_mtu",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_mpu",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_overhead",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_linktype",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_kind",
     "field_offset" : 608,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "c_opts",
     "field_offset" : 864,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "c_stats",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA9_y"
    },
    {
     "field_name" : "c_xstats",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "c_subdata",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "c_link",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIP9rtnl_link"
    },
    {
     "field_name" : "c_ops",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIP11rtnl_tc_ops"
    },
    {
     "field_name" : "c_type",
     "field_offset" : 1600,
     "referenced_type" : "_ZTI12rtnl_tc_type"
    },
    {
     "field_name" : "c_chain",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "a_next",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIP8rtnl_act"
    }
   ],
   "linker_set_key" : "_ZTI8rtnl_act",
   "name" : "rtnl_act",
   "referenced_type" : "_ZTI8rtnl_act",
   "self_type" : "_ZTI8rtnl_act",
   "size" : 216,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cbq_lss",
     "referenced_type" : "_ZTI13tc_cbq_lssopt"
    },
    {
     "field_name" : "cbq_rate",
     "field_offset" : 160,
     "referenced_type" : "_ZTI11tc_ratespec"
    },
    {
     "field_name" : "cbq_wrr",
     "field_offset" : 256,
     "referenced_type" : "_ZTI13tc_cbq_wrropt"
    },
    {
     "field_name" : "cbq_ovl",
     "field_offset" : 352,
     "referenced_type" : "_ZTI10tc_cbq_ovl"
    },
    {
     "field_name" : "cbq_fopt",
     "field_offset" : 416,
     "referenced_type" : "_ZTI11tc_cbq_fopt"
    },
    {
     "field_name" : "cbq_police",
     "field_offset" : 512,
     "referenced_type" : "_ZTI13tc_cbq_police"
    }
   ],
   "linker_set_key" : "_ZTI8rtnl_cbq",
   "name" : "rtnl_cbq",
   "referenced_type" : "_ZTI8rtnl_cbq",
   "self_type" : "_ZTI8rtnl_cbq",
   "size" : 68,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "c_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_ifindex",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_handle",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_parent",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_info",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_mtu",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_mpu",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_overhead",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_linktype",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_kind",
     "field_offset" : 608,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "c_opts",
     "field_offset" : 864,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "c_stats",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA9_y"
    },
    {
     "field_name" : "c_xstats",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "c_subdata",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "c_link",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIP9rtnl_link"
    },
    {
     "field_name" : "c_ops",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIP11rtnl_tc_ops"
    },
    {
     "field_name" : "c_type",
     "field_offset" : 1600,
     "referenced_type" : "_ZTI12rtnl_tc_type"
    },
    {
     "field_name" : "c_chain",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c_prio",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "c_protocol",
     "field_offset" : 1680,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI8rtnl_cls",
   "name" : "rtnl_cls",
   "referenced_type" : "_ZTI8rtnl_cls",
   "self_type" : "_ZTI8rtnl_cls",
   "size" : 216,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "qr_limit",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qr_qth_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qr_qth_max",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qr_flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "qr_wlog",
     "field_offset" : 104,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "qr_plog",
     "field_offset" : 112,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "qr_scell_log",
     "field_offset" : 120,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "qr_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8rtnl_red",
   "name" : "rtnl_red",
   "referenced_type" : "_ZTI8rtnl_red",
   "self_type" : "_ZTI8rtnl_red",
   "size" : 20,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "qs_quantum",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qs_perturb",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qs_limit",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qs_divisor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qs_flows",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qs_mask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8rtnl_sfq",
   "name" : "rtnl_sfq",
   "referenced_type" : "_ZTI8rtnl_sfq",
   "self_type" : "_ZTI8rtnl_sfq",
   "size" : 24,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "qt_limit",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qt_rate",
     "field_offset" : 64,
     "referenced_type" : "_ZTI13rtnl_ratespec"
    },
    {
     "field_name" : "qt_rate_bucket",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qt_rate_txtime",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qt_peakrate",
     "field_offset" : 256,
     "referenced_type" : "_ZTI13rtnl_ratespec"
    },
    {
     "field_name" : "qt_peakrate_bucket",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qt_peakrate_txtime",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qt_mask",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8rtnl_tbf",
   "name" : "rtnl_tbf",
   "referenced_type" : "_ZTI8rtnl_tbf",
   "self_type" : "_ZTI8rtnl_tbf",
   "size" : 64,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cu_divisor",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cu_hash",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cu_classid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cu_link",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cu_pcnt",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "cu_selector",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "cu_mark",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "cu_act",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP8rtnl_act"
    },
    {
     "field_name" : "cu_police",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "cu_indev",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "cu_mask",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8rtnl_u32",
   "name" : "rtnl_u32",
   "referenced_type" : "_ZTI8rtnl_u32",
   "self_type" : "_ZTI8rtnl_u32",
   "size" : 56,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "who",
     "referenced_type" : "_ZTIP11sockaddr_nl"
    },
    {
     "field_name" : "nlh",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP8nlmsghdr"
    },
    {
     "field_name" : "genlhdr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP10genlmsghdr"
    },
    {
     "field_name" : "userhdr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "attrs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPP6nlattr"
    }
   ],
   "linker_set_key" : "_ZTI9genl_info",
   "name" : "genl_info",
   "referenced_type" : "_ZTI9genl_info",
   "self_type" : "_ZTI9genl_info",
   "size" : 20,
   "source_file" : "external/libnl/include/netlink/genl/mngt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI9nl_object",
   "name" : "nl_object",
   "referenced_type" : "_ZTI9nl_object",
   "self_type" : "_ZTI9nl_object",
   "size" : 40,
   "source_file" : "external/libnl/include/netlink-private/object-api.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "a_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "a_prefixlen",
     "field_offset" : 328,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "a_scope",
     "field_offset" : 336,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "a_flags",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "a_ifindex",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "a_peer",
     "field_offset" : 416,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "a_local",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "a_bcast",
     "field_offset" : 480,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "a_anycast",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "a_multicast",
     "field_offset" : 544,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "a_cacheinfo",
     "field_offset" : 576,
     "referenced_type" : "_ZTI19rtnl_addr_cacheinfo"
    },
    {
     "field_name" : "a_label",
     "field_offset" : 704,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "a_flag_mask",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "a_link",
     "field_offset" : 864,
     "referenced_type" : "_ZTIP9rtnl_link"
    }
   ],
   "linker_set_key" : "_ZTI9rtnl_addr",
   "name" : "rtnl_addr",
   "referenced_type" : "_ZTI9rtnl_addr",
   "self_type" : "_ZTI9rtnl_addr",
   "size" : 112,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "qf_limit",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qf_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI9rtnl_fifo",
   "name" : "rtnl_fifo",
   "referenced_type" : "_ZTI9rtnl_fifo",
   "self_type" : "_ZTI9rtnl_fifo",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "g_parm",
     "referenced_type" : "_ZTI7tc_gact"
    }
   ],
   "linker_set_key" : "_ZTI9rtnl_gact",
   "name" : "rtnl_gact",
   "referenced_type" : "_ZTI9rtnl_gact",
   "self_type" : "_ZTI9rtnl_gact",
   "size" : 20,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "l_name",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "l_family",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_arptype",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_index",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_change",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_mtu",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_link",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_link_netnsid",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l_txqlen",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_weight",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_master",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_addr",
     "field_offset" : 800,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "l_bcast",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "l_qdisc",
     "field_offset" : 864,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "l_map",
     "field_offset" : 1152,
     "referenced_type" : "_ZTI13rtnl_link_map"
    },
    {
     "field_name" : "l_stats",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIA64_y"
    },
    {
     "field_name" : "l_flag_mask",
     "field_offset" : 5504,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_num_vf",
     "field_offset" : 5536,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_operstate",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "l_linkmode",
     "field_offset" : 5576,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "l_info_kind",
     "field_offset" : 5600,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "l_info_slave_kind",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "l_info_ops",
     "field_offset" : 5664,
     "referenced_type" : "_ZTIP18rtnl_link_info_ops"
    },
    {
     "field_name" : "l_af_data",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIA43_Pv"
    },
    {
     "field_name" : "l_info",
     "field_offset" : 7072,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "l_ifalias",
     "field_offset" : 7104,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "l_promiscuity",
     "field_offset" : 7136,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_num_tx_queues",
     "field_offset" : 7168,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_num_rx_queues",
     "field_offset" : 7200,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_gso_max_segs",
     "field_offset" : 7232,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_gso_max_size",
     "field_offset" : 7264,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_group",
     "field_offset" : 7296,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_carrier",
     "field_offset" : 7328,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "l_carrier_changes",
     "field_offset" : 7360,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_af_ops",
     "field_offset" : 7392,
     "referenced_type" : "_ZTIP16rtnl_link_af_ops"
    },
    {
     "field_name" : "l_phys_port_id",
     "field_offset" : 7424,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "l_phys_port_name",
     "field_offset" : 7456,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "l_phys_switch_id",
     "field_offset" : 7584,
     "referenced_type" : "_ZTIP7nl_data"
    },
    {
     "field_name" : "l_ns_fd",
     "field_offset" : 7616,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l_ns_pid",
     "field_offset" : 7648,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l_vf_list",
     "field_offset" : 7680,
     "referenced_type" : "_ZTIP12rtnl_link_vf"
    }
   ],
   "linker_set_key" : "_ZTI9rtnl_link",
   "name" : "rtnl_link",
   "referenced_type" : "_ZTI9rtnl_link",
   "self_type" : "_ZTI9rtnl_link",
   "size" : 968,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m_classid",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "m_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "m_act",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8rtnl_act"
    },
    {
     "field_name" : "m_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI9rtnl_mall",
   "name" : "rtnl_mall",
   "referenced_type" : "_ZTI9rtnl_mall",
   "self_type" : "_ZTI9rtnl_mall",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "action",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "limit",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI9rtnl_plug",
   "name" : "rtnl_plug",
   "referenced_type" : "_ZTI9rtnl_plug",
   "self_type" : "_ZTI9rtnl_plug",
   "size" : 8,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "qp_bands",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qp_priomap",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "qp_mask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI9rtnl_prio",
   "name" : "rtnl_prio",
   "referenced_type" : "_ZTI9rtnl_prio",
   "self_type" : "_ZTI9rtnl_prio",
   "size" : 24,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "r_family",
     "field_offset" : 320,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "r_action",
     "field_offset" : 328,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "r_dsfield",
     "field_offset" : 336,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "r_l3mdev",
     "field_offset" : 344,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "r_protocol",
     "field_offset" : 352,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "r_ip_proto",
     "field_offset" : 360,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "r_table",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "r_flags",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "r_prio",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "r_mark",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "r_mask",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "r_goto",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "r_flow",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "r_src",
     "field_offset" : 608,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "r_dst",
     "field_offset" : 640,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "r_iifname",
     "field_offset" : 672,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "r_oifname",
     "field_offset" : 800,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "r_sport",
     "field_offset" : 928,
     "referenced_type" : "_ZTI19fib_rule_port_range"
    },
    {
     "field_name" : "r_dport",
     "field_offset" : 960,
     "referenced_type" : "_ZTI19fib_rule_port_range"
    }
   ],
   "linker_set_key" : "_ZTI9rtnl_rule",
   "name" : "rtnl_rule",
   "referenced_type" : "_ZTI9rtnl_rule",
   "self_type" : "_ZTI9rtnl_rule",
   "size" : 128,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v_parm",
     "referenced_type" : "_ZTI7tc_vlan"
    },
    {
     "field_name" : "v_vid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "v_proto",
     "field_offset" : 208,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "v_prio",
     "field_offset" : 224,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "v_flags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI9rtnl_vlan",
   "name" : "rtnl_vlan",
   "referenced_type" : "_ZTI9rtnl_vlan",
   "self_type" : "_ZTI9rtnl_vlan",
   "size" : 36,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "i",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "a",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI9trans_tbl",
   "name" : "trans_tbl",
   "referenced_type" : "_ZTI9trans_tbl",
   "self_type" : "_ZTI9trans_tbl",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/netlink.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sa_id",
     "field_offset" : 320,
     "referenced_type" : "_ZTI12xfrmnl_sa_id"
    },
    {
     "field_name" : "saddr",
     "field_offset" : 416,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "flags",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reqid",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mark",
     "field_offset" : 512,
     "referenced_type" : "_ZTI11xfrmnl_mark"
    },
    {
     "field_name" : "lifetime_cur",
     "field_offset" : 576,
     "referenced_type" : "_ZTI19xfrmnl_lifetime_cur"
    },
    {
     "field_name" : "replay_maxage",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "replay_maxdiff",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "replay_state",
     "field_offset" : 896,
     "referenced_type" : "_ZTI19xfrmnl_replay_state"
    },
    {
     "field_name" : "replay_state_esn",
     "field_offset" : 992,
     "referenced_type" : "_ZTIP23xfrmnl_replay_state_esn"
    }
   ],
   "linker_set_key" : "_ZTI9xfrmnl_ae",
   "name" : "xfrmnl_ae",
   "referenced_type" : "_ZTI9xfrmnl_ae",
   "self_type" : "_ZTI9xfrmnl_ae",
   "size" : 128,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "daddr",
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "spi",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "proto",
     "field_offset" : 64,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI9xfrmnl_id",
   "name" : "xfrmnl_id",
   "referenced_type" : "_ZTI9xfrmnl_id",
   "self_type" : "_ZTI9xfrmnl_id",
   "size" : 12,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sel",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP10xfrmnl_sel"
    },
    {
     "field_name" : "id",
     "field_offset" : 352,
     "referenced_type" : "_ZTI9xfrmnl_id"
    },
    {
     "field_name" : "saddr",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "lft",
     "field_offset" : 480,
     "referenced_type" : "_ZTIP16xfrmnl_ltime_cfg"
    },
    {
     "field_name" : "curlft",
     "field_offset" : 512,
     "referenced_type" : "_ZTI19xfrmnl_lifetime_cur"
    },
    {
     "field_name" : "stats",
     "field_offset" : 768,
     "referenced_type" : "_ZTI12xfrmnl_stats"
    },
    {
     "field_name" : "seq",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reqid",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "family",
     "field_offset" : 928,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "mode",
     "field_offset" : 944,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "replay_window",
     "field_offset" : 952,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "flags",
     "field_offset" : 960,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "aead",
     "field_offset" : 992,
     "referenced_type" : "_ZTIP16xfrmnl_algo_aead"
    },
    {
     "field_name" : "auth",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIP16xfrmnl_algo_auth"
    },
    {
     "field_name" : "crypt",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIP11xfrmnl_algo"
    },
    {
     "field_name" : "comp",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIP11xfrmnl_algo"
    },
    {
     "field_name" : "encap",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIP17xfrmnl_encap_tmpl"
    },
    {
     "field_name" : "tfcpad",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "coaddr",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIP7nl_addr"
    },
    {
     "field_name" : "mark",
     "field_offset" : 1216,
     "referenced_type" : "_ZTI11xfrmnl_mark"
    },
    {
     "field_name" : "sec_ctx",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIP19xfrmnl_user_sec_ctx"
    },
    {
     "field_name" : "replay_maxage",
     "field_offset" : 1312,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "replay_maxdiff",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "replay_state",
     "field_offset" : 1376,
     "referenced_type" : "_ZTI19xfrmnl_replay_state"
    },
    {
     "field_name" : "replay_state_esn",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIP23xfrmnl_replay_state_esn"
    },
    {
     "field_name" : "hard",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI9xfrmnl_sa",
   "name" : "xfrmnl_sa",
   "referenced_type" : "_ZTI9xfrmnl_sa",
   "self_type" : "_ZTI9xfrmnl_sa",
   "size" : 192,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ce_refcnt",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_ops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13nl_object_ops"
    },
    {
     "field_name" : "ce_cache",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8nl_cache"
    },
    {
     "field_name" : "ce_list",
     "field_offset" : 96,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "ce_msgtype",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ce_mask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sel",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP10xfrmnl_sel"
    },
    {
     "field_name" : "lft",
     "field_offset" : 352,
     "referenced_type" : "_ZTIP16xfrmnl_ltime_cfg"
    },
    {
     "field_name" : "curlft",
     "field_offset" : 384,
     "referenced_type" : "_ZTI19xfrmnl_lifetime_cur"
    },
    {
     "field_name" : "priority",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "index",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dir",
     "field_offset" : 704,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "action",
     "field_offset" : 712,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "flags",
     "field_offset" : 720,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "share",
     "field_offset" : 728,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "sec_ctx",
     "field_offset" : 736,
     "referenced_type" : "_ZTIP19xfrmnl_user_sec_ctx"
    },
    {
     "field_name" : "uptype",
     "field_offset" : 768,
     "referenced_type" : "_ZTI22xfrmnl_userpolicy_type"
    },
    {
     "field_name" : "nr_user_tmpl",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usertmpl_list",
     "field_offset" : 864,
     "referenced_type" : "_ZTI12nl_list_head"
    },
    {
     "field_name" : "mark",
     "field_offset" : 928,
     "referenced_type" : "_ZTI11xfrmnl_mark"
    }
   ],
   "linker_set_key" : "_ZTI9xfrmnl_sp",
   "name" : "xfrmnl_sp",
   "referenced_type" : "_ZTI9xfrmnl_sp",
   "self_type" : "_ZTI9xfrmnl_sp",
   "size" : 128,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bytes",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "packets",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11rtnl_tstatsUt_E",
   "name" : "rtnl_tstats::(anonymous struct at external/libnl/include/netlink-private/types.h:507:2)",
   "referenced_type" : "_ZTIN11rtnl_tstatsUt_E",
   "self_type" : "_ZTIN11rtnl_tstatsUt_E",
   "size" : 16,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "src",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "dst",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN13nfnl_ct_protoUt_E",
   "name" : "nfnl_ct_proto::(anonymous struct at external/libnl/include/netlink-private/types.h:894:2)",
   "referenced_type" : "_ZTIN13nfnl_ct_protoUt_E",
   "self_type" : "_ZTIN13nfnl_ct_protoUt_E",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "_ZTIh"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN17nfnl_ct_protoinfoUt_E",
   "name" : "nfnl_ct_protoinfo::(anonymous struct at external/libnl/include/netlink-private/types.h:914:2)",
   "referenced_type" : "_ZTIN17nfnl_ct_protoinfoUt_E",
   "self_type" : "_ZTIN17nfnl_ct_protoinfoUt_E",
   "size" : 1,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "src",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "dst",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN18nfnl_exp_protodataUt_E",
   "name" : "nfnl_exp_protodata::(anonymous struct at external/libnl/include/netlink-private/types.h:941:2)",
   "referenced_type" : "_ZTIN18nfnl_exp_protodataUt_E",
   "self_type" : "_ZTIN18nfnl_exp_protodataUt_E",
   "size" : 4,
   "source_file" : "external/libnl/include/netlink-private/types.h"
  }
 ],
 "rvalue_reference_types" : []
}
