{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_h",
   "name" : "unsigned char [128]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA128_h",
   "size" : 128,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA16_A2_j",
   "name" : "unsigned int [16][2]",
   "referenced_type" : "_ZTIA2_j",
   "self_type" : "_ZTIA16_A2_j",
   "size" : 128,
   "source_file" : "external/boringssl/src/include/openssl/des.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",
   "name" : "unsigned char [16]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA16_h",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA2_j",
   "name" : "unsigned int [2]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA2_j",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA32_h",
   "name" : "unsigned char [32]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA32_h",
   "size" : 32,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4_j",
   "name" : "unsigned int [4]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA4_j",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/md4.h"
  },
  {

   "name" : "const ecdsa_sig_st",
   "referenced_type" : "_ZTI12ecdsa_sig_st",
   "self_type" : "_ZTIK12ecdsa_sig_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/ecdsa.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13DES_cblock_st",
   "name" : "const DES_cblock_st",
   "referenced_type" : "_ZTI13DES_cblock_st",
   "self_type" : "_ZTIK13DES_cblock_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/des.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13env_md_ctx_st",
   "name" : "const env_md_ctx_st",
   "referenced_type" : "_ZTI13env_md_ctx_st",
   "self_type" : "_ZTIK13env_md_ctx_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13evp_cipher_st",
   "name" : "const evp_cipher_st",
   "referenced_type" : "_ZTI13evp_cipher_st",
   "self_type" : "_ZTIK13evp_cipher_st",
   "size" : 44,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK14bn_mont_ctx_st",
   "name" : "const bn_mont_ctx_st",
   "referenced_type" : "_ZTI14bn_mont_ctx_st",
   "self_type" : "_ZTIK14bn_mont_ctx_st",
   "size" : 48,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK15evp_aead_ctx_st",
   "name" : "const evp_aead_ctx_st",
   "referenced_type" : "_ZTI15evp_aead_ctx_st",
   "self_type" : "_ZTIK15evp_aead_ctx_st",
   "size" : 600,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK15evp_md_pctx_ops",
   "name" : "const evp_md_pctx_ops",
   "referenced_type" : "_ZTI15evp_md_pctx_ops",
   "self_type" : "_ZTIK15evp_md_pctx_ops",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK17crypto_ex_data_st",
   "name" : "const crypto_ex_data_st",
   "referenced_type" : "_ZTI17crypto_ex_data_st",
   "self_type" : "_ZTIK17crypto_ex_data_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/ec_key.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK17evp_cipher_ctx_st",
   "name" : "const evp_cipher_ctx_st",
   "referenced_type" : "_ZTI17evp_cipher_ctx_st",
   "self_type" : "_ZTIK17evp_cipher_ctx_st",
   "size" : 136,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK5dh_st",
   "name" : "const dh_st",
   "referenced_type" : "_ZTI5dh_st",
   "self_type" : "_ZTIK5dh_st",
   "size" : 112,
   "source_file" : "external/boringssl/src/include/openssl/dh.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK6DES_ks",
   "name" : "const DES_ks",
   "referenced_type" : "_ZTI6DES_ks",
   "self_type" : "_ZTIK6DES_ks",
   "size" : 128,
   "source_file" : "external/boringssl/src/include/openssl/des.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK6rsa_st",
   "name" : "const rsa_st",
   "referenced_type" : "_ZTI6rsa_st",
   "self_type" : "_ZTIK6rsa_st",
   "size" : 160,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9bignum_st",
   "name" : "const bignum_st",
   "referenced_type" : "_ZTI9bignum_st",
   "self_type" : "_ZTIK9bignum_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9ec_key_st",
   "name" : "const ec_key_st",
   "referenced_type" : "_ZTI9ec_key_st",
   "self_type" : "_ZTIK9ec_key_st",
   "size" : 36,
   "source_file" : "external/boringssl/src/include/openssl/ec_key.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK9engine_st",
   "name" : "const engine_st",
   "referenced_type" : "_ZTI9engine_st",
   "self_type" : "_ZTIK9engine_st",
   "source_file" : "external/boringssl/src/include/openssl/ec_key.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9env_md_st",
   "name" : "const env_md_st",
   "referenced_type" : "_ZTI9env_md_st",
   "self_type" : "_ZTIK9env_md_st",
   "size" : 32,
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/aes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rd_key",
     "referenced_type" : "_ZTIA60_j"
    },
    {
     "field_name" : "rounds",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10aes_key_st",
   "name" : "aes_key_st",
   "referenced_type" : "_ZTI10aes_key_st",
   "self_type" : "_ZTI10aes_key_st",
   "size" : 244,
   "source_file" : "external/boringssl/src/include/openssl/aes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arg",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "callback",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiiiP11bn_gencb_stE"
    }
   ],
   "linker_set_key" : "_ZTI11bn_gencb_st",
   "name" : "bn_gencb_st",
   "referenced_type" : "_ZTI11bn_gencb_st",
   "self_type" : "_ZTI11bn_gencb_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "md",
     "referenced_type" : "_ZTIPK9env_md_st"
    },
    {
     "field_name" : "md_ctx",
     "field_offset" : 32,
     "referenced_type" : "_ZTI13env_md_ctx_st"
    },
    {
     "field_name" : "i_ctx",
     "field_offset" : 160,
     "referenced_type" : "_ZTI13env_md_ctx_st"
    },
    {
     "field_name" : "o_ctx",
     "field_offset" : 288,
     "referenced_type" : "_ZTI13env_md_ctx_st"
    }
   ],
   "linker_set_key" : "_ZTI11hmac_ctx_st",
   "name" : "hmac_ctx_st",
   "referenced_type" : "_ZTI11hmac_ctx_st",
   "self_type" : "_ZTI11hmac_ctx_st",
   "size" : 52,
   "source_file" : "external/boringssl/src/include/openssl/hmac.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI24openssl_method_common_st"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "init",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP6rsa_stE"
    },
    {
     "field_name" : "finish",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP6rsa_stE"
    },
    {
     "field_name" : "size",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPK6rsa_stE"
    },
    {
     "field_name" : "sign",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiiPKhjPhPjPK6rsa_stE"
    },
    {
     "field_name" : "sign_raw",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP6rsa_stPjPhjPKhjiE"
    },
    {
     "field_name" : "decrypt",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP6rsa_stPjPhjPKhjiE"
    },
    {
     "field_name" : "private_transform",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFiP6rsa_stPhPKhjE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11rsa_meth_st",
   "name" : "rsa_meth_st",
   "referenced_type" : "_ZTI11rsa_meth_st",
   "self_type" : "_ZTI11rsa_meth_st",
   "size" : 44,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "s",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9bignum_st"
    }
   ],
   "linker_set_key" : "_ZTI12ecdsa_sig_st",
   "name" : "ecdsa_sig_st",
   "referenced_type" : "_ZTI12ecdsa_sig_st",
   "self_type" : "_ZTI12ecdsa_sig_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/ecdsa.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h",
     "referenced_type" : "_ZTIA4_j"
    },
    {
     "field_name" : "Nl",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Nh",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA64_h"
    },
    {
     "field_name" : "num",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12md4_state_st",
   "name" : "md4_state_st",
   "referenced_type" : "_ZTI12md4_state_st",
   "self_type" : "_ZTI12md4_state_st",
   "size" : 92,
   "source_file" : "external/boringssl/src/include/openssl/md4.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h",
     "referenced_type" : "_ZTIA4_j"
    },
    {
     "field_name" : "Nl",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Nh",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA64_h"
    },
    {
     "field_name" : "num",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12md5_state_st",
   "name" : "md5_state_st",
   "referenced_type" : "_ZTI12md5_state_st",
   "self_type" : "_ZTI12md5_state_st",
   "size" : 92,
   "source_file" : "external/boringssl/src/include/openssl/md5.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "seed",
     "referenced_type" : "_ZTIPFvPKviE"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiPhjE"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "add",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvPKvidE"
    },
    {
     "field_name" : "pseudorand",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPhjE"
    },
    {
     "field_name" : "status",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFivE"
    }
   ],
   "linker_set_key" : "_ZTI12rand_meth_st",
   "name" : "rand_meth_st",
   "referenced_type" : "_ZTI12rand_meth_st",
   "self_type" : "_ZTI12rand_meth_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN12sha_state_stUt_E"
    },
    {
     "field_name" : "Nl",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Nh",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA64_h"
    },
    {
     "field_name" : "num",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12sha_state_st",
   "name" : "sha_state_st",
   "referenced_type" : "_ZTI12sha_state_st",
   "self_type" : "_ZTI12sha_state_st",
   "size" : 96,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "bytes",
     "referenced_type" : "_ZTIA8_h"
    }
   ],
   "linker_set_key" : "_ZTI13DES_cblock_st",
   "name" : "DES_cblock_st",
   "referenced_type" : "_ZTI13DES_cblock_st",
   "self_type" : "_ZTI13DES_cblock_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/des.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "digest",
     "referenced_type" : "_ZTIPK9env_md_st"
    },
    {
     "field_name" : "md_data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pctx",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15evp_pkey_ctx_st"
    },
    {
     "field_name" : "pctx_ops",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK15evp_md_pctx_ops"
    }
   ],
   "linker_set_key" : "_ZTI13env_md_ctx_st",
   "name" : "env_md_ctx_st",
   "referenced_type" : "_ZTI13env_md_ctx_st",
   "self_type" : "_ZTI13env_md_ctx_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "block_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "key_len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "iv_len",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ctx_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "init",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP17evp_cipher_ctx_stPKhS2_iE"
    },
    {
     "field_name" : "cipher",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP17evp_cipher_ctx_stPhPKhjE"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFvP17evp_cipher_ctx_stE"
    },
    {
     "field_name" : "ctrl",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP17evp_cipher_ctx_stiiPvE"
    }
   ],
   "linker_set_key" : "_ZTI13evp_cipher_st",
   "name" : "evp_cipher_st",
   "referenced_type" : "_ZTI13evp_cipher_st",
   "self_type" : "_ZTI13evp_cipher_st",
   "size" : 44,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
    }
   ],
   "linker_set_key" : "_ZTI14CRYPTO_dynlock",
   "name" : "CRYPTO_dynlock",
   "referenced_type" : "_ZTI14CRYPTO_dynlock",
   "self_type" : "_ZTI14CRYPTO_dynlock",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "RR",
     "referenced_type" : "_ZTI9bignum_st"
    },
    {
     "field_name" : "N",
     "field_offset" : 160,
     "referenced_type" : "_ZTI9bignum_st"
    },
    {
     "field_name" : "n0",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA2_j"
    }
   ],
   "linker_set_key" : "_ZTI14bn_mont_ctx_st",
   "name" : "bn_mont_ctx_st",
   "referenced_type" : "_ZTI14bn_mont_ctx_st",
   "self_type" : "_ZTI14bn_mont_ctx_st",
   "size" : 48,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTIA56_h"
    }
   ],
   "linker_set_key" : "_ZTI15crypto_mutex_st",
   "name" : "crypto_mutex_st",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15crypto_mutex_st",
   "self_type" : "_ZTI15crypto_mutex_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI24openssl_method_common_st"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "init",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP9ec_key_stE"
    },
    {
     "field_name" : "finish",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP9ec_key_stE"
    },
    {
     "field_name" : "group_order_size",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPK9ec_key_stE"
    },
    {
     "field_name" : "sign",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPKhjPhPjP9ec_key_stE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI15ecdsa_method_st",
   "name" : "ecdsa_method_st",
   "referenced_type" : "_ZTI15ecdsa_method_st",
   "self_type" : "_ZTI15ecdsa_method_st",
   "size" : 32,
   "source_file" : "external/boringssl/src/include/openssl/ec_key.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "aead",
     "referenced_type" : "_ZTIPK11evp_aead_st"
    },
    {
     "field_name" : "state",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21evp_aead_ctx_st_state"
    },
    {
     "field_name" : "tag_len",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI15evp_aead_ctx_st",
   "name" : "evp_aead_ctx_st",
   "referenced_type" : "_ZTI15evp_aead_ctx_st",
   "self_type" : "_ZTI15evp_aead_ctx_st",
   "size" : 600,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h",
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "Nl",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Nh",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA64_h"
    },
    {
     "field_name" : "num",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "md_len",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15sha256_state_st",
   "name" : "sha256_state_st",
   "referenced_type" : "_ZTI15sha256_state_st",
   "self_type" : "_ZTI15sha256_state_st",
   "size" : 112,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "h",
     "referenced_type" : "_ZTIA8_y"
    },
    {
     "field_name" : "Nl",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "Nh",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "p",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "num",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "md_len",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15sha512_state_st",
   "name" : "sha512_state_st",
   "referenced_type" : "_ZTI15sha512_state_st",
   "self_type" : "_ZTI15sha512_state_st",
   "size" : 216,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "comment",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI16EC_builtin_curve",
   "name" : "EC_builtin_curve",
   "referenced_type" : "_ZTI16EC_builtin_curve",
   "self_type" : "_ZTI16EC_builtin_curve",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/ec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sk",
     "referenced_type" : "_ZTIP13stack_st_void"
    }
   ],
   "linker_set_key" : "_ZTI17crypto_ex_data_st",
   "name" : "crypto_ex_data_st",
   "referenced_type" : "_ZTI17crypto_ex_data_st",
   "self_type" : "_ZTI17crypto_ex_data_st",
   "size" : 4,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cipher",
     "referenced_type" : "_ZTIPK13evp_cipher_st"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cipher_data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "key_len",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "encrypt",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "oiv",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "iv",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "buf",
     "field_offset" : 448,
     "referenced_type" : "_ZTIA32_h"
    },
    {
     "field_name" : "buf_len",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "final_used",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "block_mask",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "final",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA32_h"
    }
   ],
   "linker_set_key" : "_ZTI17evp_cipher_ctx_st",
   "name" : "evp_cipher_ctx_st",
   "referenced_type" : "_ZTI17evp_cipher_ctx_st",
   "self_type" : "_ZTI17evp_cipher_ctx_st",
   "size" : 136,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cipher",
     "referenced_type" : "_ZTIPK13evp_cipher_st"
    },
    {
     "field_name" : "iv",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA16_h"
    }
   ],
   "linker_set_key" : "_ZTI18evp_cipher_info_st",
   "name" : "evp_cipher_info_st",
   "referenced_type" : "_ZTI18evp_cipher_info_st",
   "self_type" : "_ZTI18evp_cipher_info_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "opaque",
     "referenced_type" : "_ZTIA580_h"
    },
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI21evp_aead_ctx_st_state",
   "name" : "evp_aead_ctx_st_state",
   "record_kind" : "union",
   "referenced_type" : "_ZTI21evp_aead_ctx_st_state",
   "self_type" : "_ZTI21evp_aead_ctx_st_state",
   "size" : 584,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "is_static",
     "field_offset" : 32,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI24openssl_method_common_st",
   "name" : "openssl_method_common_st",
   "referenced_type" : "_ZTI24openssl_method_common_st",
   "self_type" : "_ZTI24openssl_method_common_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/engine.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "g",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "pub_key",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "priv_key",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "priv_length",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "method_mont_p_lock",
     "field_offset" : 192,
     "referenced_type" : "_ZTI15crypto_mutex_st"
    },
    {
     "field_name" : "method_mont_p",
     "field_offset" : 640,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "q",
     "field_offset" : 672,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "j",
     "field_offset" : 704,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "seed",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "seedlen",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "counter",
     "field_offset" : 800,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "flags",
     "field_offset" : 832,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "references",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI5dh_st",
   "name" : "dh_st",
   "referenced_type" : "_ZTI5dh_st",
   "self_type" : "_ZTI5dh_st",
   "size" : 112,
   "source_file" : "external/boringssl/src/include/openssl/dh.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "subkeys",
     "referenced_type" : "_ZTIA16_A2_j"
    }
   ],
   "linker_set_key" : "_ZTI6DES_ks",
   "name" : "DES_ks",
   "referenced_type" : "_ZTI6DES_ks",
   "self_type" : "_ZTI6DES_ks",
   "size" : 128,
   "source_file" : "external/boringssl/src/include/openssl/des.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "meth",
     "referenced_type" : "_ZTIP11rsa_meth_st"
    },
    {
     "field_name" : "n",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "e",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "d",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "p",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "q",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmp1",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmq1",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "iqmp",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "ex_data",
     "field_offset" : 288,
     "referenced_type" : "_ZTI17crypto_ex_data_st"
    },
    {
     "field_name" : "references",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lock",
     "field_offset" : 384,
     "referenced_type" : "_ZTI15crypto_mutex_st"
    },
    {
     "field_name" : "mont_n",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "mont_p",
     "field_offset" : 864,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "mont_q",
     "field_offset" : 896,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "d_fixed",
     "field_offset" : 928,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmp1_fixed",
     "field_offset" : 960,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmq1_fixed",
     "field_offset" : 992,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "inv_small_mod_large_mont",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "num_blindings",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "blindings",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPP14bn_blinding_st"
    },
    {
     "field_name" : "blindings_inuse",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "blinding_fork_generation",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "private_key_frozen",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6rsa_st",
   "name" : "rsa_st",
   "referenced_type" : "_ZTI6rsa_st",
   "self_type" : "_ZTI6rsa_st",
   "size" : 160,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPv"
    },
    {
     "field_name" : "sorted",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_alloc",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "comp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPPKvS1_E"
    }
   ],
   "linker_set_key" : "_ZTI8stack_st",
   "name" : "stack_st",
   "referenced_type" : "_ZTI8stack_st",
   "self_type" : "_ZTI8stack_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d",
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dmax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "neg",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI9bignum_st",
   "name" : "bignum_st",
   "referenced_type" : "_ZTI9bignum_st",
   "self_type" : "_ZTI9bignum_st",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h",
     "referenced_type" : "_ZTIA5_j"
    },
    {
     "referenced_type" : "_ZTIN12sha_state_stUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12sha_state_stUt_E",
   "name" : "sha_state_st::(anonymous union at external/boringssl/src/include/openssl/sha.h:105:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN12sha_state_stUt_E",
   "self_type" : "_ZTIN12sha_state_stUt_E",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h0",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h3",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "h4",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12sha_state_stUt_Ut_E",
   "name" : "sha_state_st::(anonymous union at external/boringssl/src/include/openssl/sha.h:105:3)::(anonymous struct at external/boringssl/src/include/openssl/sha.h:107:5)",
   "referenced_type" : "_ZTIN12sha_state_stUt_Ut_E",
   "self_type" : "_ZTIN12sha_state_stUt_Ut_E",
   "size" : 20,
   "source_file" : "external/boringssl/src/include/openssl/sha.h"
  }
 ],
 "rvalue_reference_types" : []
}
