#ifndef HIDL_GENERATED_ANDROID_HARDWARE_BLUETOOTH_AUDIO_V2_1_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_BLUETOOTH_AUDIO_V2_1_TYPES_H

#include <android/hardware/bluetooth/audio/2.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace bluetooth {
namespace audio {
namespace V2_1 {

// Forward declaration for forward reference support:
enum class SessionType : uint8_t;
enum class CodecType : uint32_t;
enum class SampleRate : uint32_t;
struct PcmParameters;
enum class Lc3FrameDuration : uint8_t;
struct Lc3Parameters;
struct Lc3CodecCapabilities;
struct AudioCapabilities;
struct Lc3CodecConfiguration;
struct AudioConfiguration;

enum class SessionType : uint8_t {
    UNKNOWN = 0,
    /**
     * A2DP legacy that AVDTP media is encoded by Bluetooth Stack
     */
    A2DP_SOFTWARE_ENCODING_DATAPATH = 1 /* ::android::hardware::bluetooth::audio::V2_0::SessionType.UNKNOWN implicitly + 1 */,
    /**
     * The encoding of AVDTP media is done by HW and there is control only
     */
    A2DP_HARDWARE_OFFLOAD_DATAPATH = 2 /* ::android::hardware::bluetooth::audio::V2_0::SessionType.A2DP_SOFTWARE_ENCODING_DATAPATH implicitly + 1 */,
    /**
     * Used when encoded by Bluetooth Stack and streaming to Hearing Aid
     */
    HEARING_AID_SOFTWARE_ENCODING_DATAPATH = 3 /* ::android::hardware::bluetooth::audio::V2_0::SessionType.A2DP_HARDWARE_OFFLOAD_DATAPATH implicitly + 1 */,
    /**
     * Used when encoded by Bluetooth Stack and streaming to LE Audio device
     */
    LE_AUDIO_SOFTWARE_ENCODING_DATAPATH = 4 /* ::android::hardware::bluetooth::audio::V2_0::SessionType.HEARING_AID_SOFTWARE_ENCODING_DATAPATH implicitly + 1 */,
    /**
     * Used when decoded by Bluetooth Stack and streaming to audio framework
     */
    LE_AUDIO_SOFTWARE_DECODED_DATAPATH = 5 /* ::android::hardware::bluetooth::audio::V2_1::SessionType.LE_AUDIO_SOFTWARE_ENCODING_DATAPATH implicitly + 1 */,
    /**
     * Encoding is done by HW an there is control only
     */
    LE_AUDIO_HARDWARE_OFFLOAD_ENCODING_DATAPATH = 6 /* ::android::hardware::bluetooth::audio::V2_1::SessionType.LE_AUDIO_SOFTWARE_DECODED_DATAPATH implicitly + 1 */,
    /**
     * Decoding is done by HW an there is control only
     */
    LE_AUDIO_HARDWARE_OFFLOAD_DECODING_DATAPATH = 7 /* ::android::hardware::bluetooth::audio::V2_1::SessionType.LE_AUDIO_HARDWARE_OFFLOAD_ENCODING_DATAPATH implicitly + 1 */,
};

enum class CodecType : uint32_t {
    UNKNOWN = 0u /* 0x00 */,
    SBC = 1u /* 0x01 */,
    AAC = 2u /* 0x02 */,
    APTX = 4u /* 0x04 */,
    APTX_HD = 8u /* 0x08 */,
    LDAC = 16u /* 0x10 */,
    LC3 = 32u /* 0x20 */,
};

enum class SampleRate : uint32_t {
    RATE_UNKNOWN = 0u /* 0x00 */,
    RATE_44100 = 1u /* 0x01 */,
    RATE_48000 = 2u /* 0x02 */,
    RATE_88200 = 4u /* 0x04 */,
    RATE_96000 = 8u /* 0x08 */,
    RATE_176400 = 16u /* 0x10 */,
    RATE_192000 = 32u /* 0x20 */,
    RATE_16000 = 64u /* 0x40 */,
    RATE_24000 = 128u /* 0x80 */,
    RATE_8000 = 256u /* 0x100 */,
    RATE_32000 = 512u /* 0x200 */,
};

/**
 * Used for Software Encoding audio feed parameters
 */
struct PcmParameters final {
    ::android::hardware::bluetooth::audio::V2_1::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::android::hardware::bluetooth::audio::V2_0::ChannelMode channelMode __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
    /**
     * Data interval for data transfer
     */
    uint32_t dataIntervalUs __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::PcmParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::PcmParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::PcmParameters, bitsPerSample) == 5, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::PcmParameters, dataIntervalUs) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_1::PcmParameters) == 12, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_1::PcmParameters) == 4, "wrong alignment");

enum class Lc3FrameDuration : uint8_t {
    DURATION_10000US = 0 /* 0x00 */,
    DURATION_7500US = 1 /* 0x01 */,
};

/**
 * Used for Hardware Encoding/Decoding LC3 codec parameters.
 */
struct Lc3Parameters final {
    /*
     * PCM is Input for encoder, Output for decoder
     */
    ::android::hardware::bluetooth::audio::V2_0::BitsPerSample pcmBitDepth __attribute__ ((aligned(1)));
    /*
     * codec-specific parameters
     */
    ::android::hardware::bluetooth::audio::V2_1::SampleRate samplingFrequency __attribute__ ((aligned(4)));
    ::android::hardware::bluetooth::audio::V2_1::Lc3FrameDuration frameDuration __attribute__ ((aligned(1)));
    /*
     * length in octets of a codec frame
     */
    uint32_t octetsPerFrame __attribute__ ((aligned(4)));
    /*
     * Number of blocks of codec frames per single SDU (Service Data Unit)
     */
    uint8_t blocksPerSdu __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::Lc3Parameters, pcmBitDepth) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::Lc3Parameters, samplingFrequency) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::Lc3Parameters, frameDuration) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::Lc3Parameters, octetsPerFrame) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::Lc3Parameters, blocksPerSdu) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_1::Lc3Parameters) == 20, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_1::Lc3Parameters) == 4, "wrong alignment");

/**
 * Used to specify the capabilities of the LC3 codecs supported by Hardware Encoding.
 */
struct Lc3CodecCapabilities final {
    /*
     * This is bitfield, if bit N is set, HW Offloader supports N+1 channels at the same time.
     * Example: 0x27 = 0b00100111: One, two, three or six channels supported.
     */
    uint8_t supportedChannelCounts __attribute__ ((aligned(1)));
    ::android::hardware::bluetooth::audio::V2_1::Lc3Parameters lc3Capabilities __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::Lc3CodecCapabilities, supportedChannelCounts) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::Lc3CodecCapabilities, lc3Capabilities) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_1::Lc3CodecCapabilities) == 24, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_1::Lc3CodecCapabilities) == 4, "wrong alignment");

/**
 * Used to specify the capabilities of the different session types
 */
struct AudioCapabilities final {
    enum class hidl_discriminator : uint8_t {
        pcmCapabilities = 0,  // ::android::hardware::bluetooth::audio::V2_1::PcmParameters
        codecCapabilities = 1,  // ::android::hardware::bluetooth::audio::V2_0::CodecCapabilities
        leAudioCapabilities = 2,  // ::android::hardware::bluetooth::audio::V2_1::Lc3CodecCapabilities
    };

    AudioCapabilities();
    ~AudioCapabilities();
    AudioCapabilities(AudioCapabilities&&);
    AudioCapabilities(const AudioCapabilities&);
    AudioCapabilities& operator=(AudioCapabilities&&);
    AudioCapabilities& operator=(const AudioCapabilities&);

    void pcmCapabilities(const ::android::hardware::bluetooth::audio::V2_1::PcmParameters&);
    void pcmCapabilities(::android::hardware::bluetooth::audio::V2_1::PcmParameters&&);
    ::android::hardware::bluetooth::audio::V2_1::PcmParameters& pcmCapabilities();
    const ::android::hardware::bluetooth::audio::V2_1::PcmParameters& pcmCapabilities() const;

    void codecCapabilities(const ::android::hardware::bluetooth::audio::V2_0::CodecCapabilities&);
    void codecCapabilities(::android::hardware::bluetooth::audio::V2_0::CodecCapabilities&&);
    ::android::hardware::bluetooth::audio::V2_0::CodecCapabilities& codecCapabilities();
    const ::android::hardware::bluetooth::audio::V2_0::CodecCapabilities& codecCapabilities() const;

    void leAudioCapabilities(const ::android::hardware::bluetooth::audio::V2_1::Lc3CodecCapabilities&);
    void leAudioCapabilities(::android::hardware::bluetooth::audio::V2_1::Lc3CodecCapabilities&&);
    ::android::hardware::bluetooth::audio::V2_1::Lc3CodecCapabilities& leAudioCapabilities();
    const ::android::hardware::bluetooth::audio::V2_1::Lc3CodecCapabilities& leAudioCapabilities() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::bluetooth::audio::V2_1::AudioCapabilities, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hardware::bluetooth::audio::V2_1::PcmParameters pcmCapabilities __attribute__ ((aligned(4)));
        ::android::hardware::bluetooth::audio::V2_0::CodecCapabilities codecCapabilities __attribute__ ((aligned(4)));
        ::android::hardware::bluetooth::audio::V2_1::Lc3CodecCapabilities leAudioCapabilities __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::bluetooth::audio::V2_1::AudioCapabilities::hidl_union) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::bluetooth::audio::V2_1::AudioCapabilities::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::android::hardware::bluetooth::audio::V2_1::AudioCapabilities::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::bluetooth::audio::V2_1::AudioCapabilities::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::bluetooth::audio::V2_1::AudioCapabilities) == 28, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_1::AudioCapabilities) == 4, "wrong alignment");

/**
 * Used to configure a LC3 Hardware Encoding session.
 */
struct Lc3CodecConfiguration final {
    /*
     * This is also bitfield, specifying how the channels are ordered in the outgoing media packet.
     * Bit meaning is defined in Bluetooth Assigned Numbers.
     */
    uint32_t audioChannelAllocation __attribute__ ((aligned(4)));
    ::android::hardware::bluetooth::audio::V2_1::Lc3Parameters lc3Config __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::Lc3CodecConfiguration, audioChannelAllocation) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::audio::V2_1::Lc3CodecConfiguration, lc3Config) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::audio::V2_1::Lc3CodecConfiguration) == 24, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_1::Lc3CodecConfiguration) == 4, "wrong alignment");

/**
 * Used to configure either a Hardware or Software Encoding session based on session type
 */
struct AudioConfiguration final {
    enum class hidl_discriminator : uint8_t {
        pcmConfig = 0,  // ::android::hardware::bluetooth::audio::V2_1::PcmParameters
        codecConfig = 1,  // ::android::hardware::bluetooth::audio::V2_0::CodecConfiguration
        leAudioCodecConfig = 2,  // ::android::hardware::bluetooth::audio::V2_1::Lc3CodecConfiguration
    };

    AudioConfiguration();
    ~AudioConfiguration();
    AudioConfiguration(AudioConfiguration&&);
    AudioConfiguration(const AudioConfiguration&);
    AudioConfiguration& operator=(AudioConfiguration&&);
    AudioConfiguration& operator=(const AudioConfiguration&);

    void pcmConfig(const ::android::hardware::bluetooth::audio::V2_1::PcmParameters&);
    void pcmConfig(::android::hardware::bluetooth::audio::V2_1::PcmParameters&&);
    ::android::hardware::bluetooth::audio::V2_1::PcmParameters& pcmConfig();
    const ::android::hardware::bluetooth::audio::V2_1::PcmParameters& pcmConfig() const;

    void codecConfig(const ::android::hardware::bluetooth::audio::V2_0::CodecConfiguration&);
    void codecConfig(::android::hardware::bluetooth::audio::V2_0::CodecConfiguration&&);
    ::android::hardware::bluetooth::audio::V2_0::CodecConfiguration& codecConfig();
    const ::android::hardware::bluetooth::audio::V2_0::CodecConfiguration& codecConfig() const;

    void leAudioCodecConfig(const ::android::hardware::bluetooth::audio::V2_1::Lc3CodecConfiguration&);
    void leAudioCodecConfig(::android::hardware::bluetooth::audio::V2_1::Lc3CodecConfiguration&&);
    ::android::hardware::bluetooth::audio::V2_1::Lc3CodecConfiguration& leAudioCodecConfig();
    const ::android::hardware::bluetooth::audio::V2_1::Lc3CodecConfiguration& leAudioCodecConfig() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::bluetooth::audio::V2_1::AudioConfiguration, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hardware::bluetooth::audio::V2_1::PcmParameters pcmConfig __attribute__ ((aligned(4)));
        ::android::hardware::bluetooth::audio::V2_0::CodecConfiguration codecConfig __attribute__ ((aligned(4)));
        ::android::hardware::bluetooth::audio::V2_1::Lc3CodecConfiguration leAudioCodecConfig __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::bluetooth::audio::V2_1::AudioConfiguration::hidl_union) == 28, "wrong size");
    static_assert(__alignof(::android::hardware::bluetooth::audio::V2_1::AudioConfiguration::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::android::hardware::bluetooth::audio::V2_1::AudioConfiguration::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::bluetooth::audio::V2_1::AudioConfiguration::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::bluetooth::audio::V2_1::AudioConfiguration) == 32, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::audio::V2_1::AudioConfiguration) == 4, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint8_t o);
static inline std::string toString(::android::hardware::bluetooth::audio::V2_1::SessionType o);
static inline void PrintTo(::android::hardware::bluetooth::audio::V2_1::SessionType o, ::std::ostream* os);
constexpr uint8_t operator|(const ::android::hardware::bluetooth::audio::V2_1::SessionType lhs, const ::android::hardware::bluetooth::audio::V2_1::SessionType rhs) {
    return static_cast<uint8_t>(static_cast<uint8_t>(lhs) | static_cast<uint8_t>(rhs));
}
constexpr uint8_t operator|(const uint8_t lhs, const ::android::hardware::bluetooth::audio::V2_1::SessionType rhs) {
    return static_cast<uint8_t>(lhs | static_cast<uint8_t>(rhs));
}
constexpr uint8_t operator|(const ::android::hardware::bluetooth::audio::V2_1::SessionType lhs, const uint8_t rhs) {
