#ifndef HIDL_GENERATED_ANDROID_HARDWARE_POWER_STATS_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_POWER_STATS_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace power {
namespace stats {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class Status : uint32_t;
struct RailInfo;
struct EnergyData;
enum class PowerEntityType : uint32_t;
struct PowerEntityInfo;
struct PowerEntityStateInfo;
struct PowerEntityStateSpace;
struct PowerEntityStateResidencyData;
struct PowerEntityStateResidencyResult;

enum class Status : uint32_t {
    SUCCESS = 0u,
    NOT_SUPPORTED = 1u,
    INVALID_INPUT = 2u,
    FILESYSTEM_ERROR = 3u,
    INSUFFICIENT_RESOURCES = 4u,
};

struct RailInfo final {
    /**
     * Index corresponding to the rail
     */
    uint32_t index __attribute__ ((aligned(4)));
    /**
     * Name of the rail (opaque to the framework)
     */
    ::android::hardware::hidl_string railName __attribute__ ((aligned(8)));
    /**
     * Name of the subsystem to which this rail belongs (opaque to the framework)
     */
    ::android::hardware::hidl_string subsysName __attribute__ ((aligned(8)));
    /**
     * Hardware sampling rate
     */
    uint32_t samplingRate __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::power::stats::V1_0::RailInfo, index) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::RailInfo, railName) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::RailInfo, subsysName) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::RailInfo, samplingRate) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::power::stats::V1_0::RailInfo) == 48, "wrong size");
static_assert(__alignof(::android::hardware::power::stats::V1_0::RailInfo) == 8, "wrong alignment");

struct EnergyData final {
    /**
     * Index corresponding to the rail. This index matches
     * the index returned in RailInfo
     */
    uint32_t index __attribute__ ((aligned(4)));
    /**
     * Time since device boot(CLOCK_BOOTTIME) in milli-seconds
     */
    uint64_t timestamp __attribute__ ((aligned(8)));
    /**
     * Accumulated energy since device boot in microwatt-seconds (uWs)
     */
    uint64_t energy __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::power::stats::V1_0::EnergyData, index) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::EnergyData, timestamp) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::EnergyData, energy) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::power::stats::V1_0::EnergyData) == 24, "wrong size");
static_assert(__alignof(::android::hardware::power::stats::V1_0::EnergyData) == 8, "wrong alignment");

enum class PowerEntityType : uint32_t {
    /**
     * A subsystem is a self-contained compute unit. Some examples include
     * application processor, DSP, GPU.
     */
    SUBSYSTEM = 0u,
    /**
     * A peripheral is an auxiliary device that connects to and works with a
     * compute unit. Some examples include simple sensors, camera, display.
     */
    PERIPHERAL = 1u,
    /**
     * A power domain is a single subsystem or a collection of subsystems
     * that is controlled by a single voltage rail.
     */
    POWER_DOMAIN = 2u,
};

/**
 * PowerEntityInfo contains information, such as the ID, name, and type of a
 * given PowerEntity.
 */
struct PowerEntityInfo final {
    /**
     * Unique ID corresponding to the PowerEntity
     */
    uint32_t powerEntityId __attribute__ ((aligned(4)));
    /**
     * Name of the PowerEntity (opaque to the framework)
     */
    ::android::hardware::hidl_string powerEntityName __attribute__ ((aligned(8)));
    /**
     * Type of the PowerEntity
     */
    ::android::hardware::power::stats::V1_0::PowerEntityType type __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityInfo, powerEntityId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityInfo, powerEntityName) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityInfo, type) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::power::stats::V1_0::PowerEntityInfo) == 32, "wrong size");
static_assert(__alignof(::android::hardware::power::stats::V1_0::PowerEntityInfo) == 8, "wrong alignment");

struct PowerEntityStateInfo final {
    /**
     * ID corresponding to the state. Unique for a given PowerEntityStateSpace
     */
    uint32_t powerEntityStateId __attribute__ ((aligned(4)));
    /**
     * Name of the state (opaque to the framework)
     */
    ::android::hardware::hidl_string powerEntityStateName __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityStateInfo, powerEntityStateId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityStateInfo, powerEntityStateName) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::power::stats::V1_0::PowerEntityStateInfo) == 24, "wrong size");
static_assert(__alignof(::android::hardware::power::stats::V1_0::PowerEntityStateInfo) == 8, "wrong alignment");

/**
 * PowerEntityStateSpace contains the state space information of a given
 * PowerEntity. The state space, is the set of possible states that a given
 * PowerEntity provides residency data for.
 */
struct PowerEntityStateSpace final {
    /**
     * Unique ID of the corresponding PowerEntity
     */
    uint32_t powerEntityId __attribute__ ((aligned(4)));
    /**
     * List of states that the PowerEntity may reside in
     */
    ::android::hardware::hidl_vec<::android::hardware::power::stats::V1_0::PowerEntityStateInfo> states __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityStateSpace, powerEntityId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityStateSpace, states) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::power::stats::V1_0::PowerEntityStateSpace) == 24, "wrong size");
static_assert(__alignof(::android::hardware::power::stats::V1_0::PowerEntityStateSpace) == 8, "wrong alignment");

/**
 * Contains residency data for a single state
 */
struct PowerEntityStateResidencyData final {
    /**
     * Unique ID of the corresponding PowerEntityStateInfo
     */
    uint32_t powerEntityStateId __attribute__ ((aligned(4)));
    /**
     * Total time in milliseconds that the corresponding PowerEntity resided
     * in this state since the PowerEntity was reset
     */
    uint64_t totalTimeInStateMs __attribute__ ((aligned(8)));
    /**
     * Total number of times that the state was entered since the corresponding
     * PowerEntity was reset
     */
    uint64_t totalStateEntryCount __attribute__ ((aligned(8)));
    /**
     * Last time this state was entered. Time in milliseconds since the
     * corresponding PowerEntity was reset
     */
    uint64_t lastEntryTimestampMs __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityStateResidencyData, powerEntityStateId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityStateResidencyData, totalTimeInStateMs) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityStateResidencyData, totalStateEntryCount) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityStateResidencyData, lastEntryTimestampMs) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::power::stats::V1_0::PowerEntityStateResidencyData) == 32, "wrong size");
static_assert(__alignof(::android::hardware::power::stats::V1_0::PowerEntityStateResidencyData) == 8, "wrong alignment");

struct PowerEntityStateResidencyResult final {
    /**
     * Unique ID of the corresponding PowerEntity
     */
    uint32_t powerEntityId __attribute__ ((aligned(4)));
    /**
     * Residency data for each state the PowerEntity's state space
     */
    ::android::hardware::hidl_vec<::android::hardware::power::stats::V1_0::PowerEntityStateResidencyData> stateResidencyData __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityStateResidencyResult, powerEntityId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::power::stats::V1_0::PowerEntityStateResidencyResult, stateResidencyData) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::power::stats::V1_0::PowerEntityStateResidencyResult) == 24, "wrong size");
static_assert(__alignof(::android::hardware::power::stats::V1_0::PowerEntityStateResidencyResult) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint32_t o);
static inline std::string toString(::android::hardware::power::stats::V1_0::Status o);
static inline void PrintTo(::android::hardware::power::stats::V1_0::Status o, ::std::ostream* os);
constexpr uint32_t operator|(const ::android::hardware::power::stats::V1_0::Status lhs, const ::android::hardware::power::stats::V1_0::Status rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const uint32_t lhs, const ::android::hardware::power::stats::V1_0::Status rhs) {
    return static_cast<uint32_t>(lhs | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const ::android::hardware::power::stats::V1_0::Status lhs, const uint32_t rhs) {
