#ifndef HIDL_GENERATED_ANDROID_HARDWARE_HEALTH_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_HEALTH_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace health {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class Result : int32_t;
enum class BatteryStatus : int32_t;
enum class BatteryHealth : int32_t;
struct HealthConfig;
struct HealthInfo;

/**
 * Possible return values for optional HAL method(s) like
 * IHealth::energyCounter()
 */
enum class Result : int32_t {
    SUCCESS = 0,
    NOT_SUPPORTED = 1 /* ::android::hardware::health::V1_0::Result.SUCCESS implicitly + 1 */,
    UNKNOWN = 2 /* ::android::hardware::health::V1_0::Result.NOT_SUPPORTED implicitly + 1 */,
};

/**
 * Possible values for Battery Status.
 * Note: These are currently in sync with BatteryManager and must not
 * be extended / altered.
 */
enum class BatteryStatus : int32_t {
    UNKNOWN = 1,
    CHARGING = 2,
    DISCHARGING = 3,
    /**
     * Battery is *not* charging - special case when charger is present
     * but battery isn't charging
     */
    NOT_CHARGING = 4,
    FULL = 5,
};

/**
 * Possible values for Battery Health.
 * Note: These are currently in sync with BatteryManager and must not
 * be extended / altered.
 */
enum class BatteryHealth : int32_t {
    UNKNOWN = 1,
    GOOD = 2,
    OVERHEAT = 3,
    DEAD = 4,
    OVER_VOLTAGE = 5,
    /**
     * Battery experienced an unknown/unspecifid failure.
     */
    UNSPECIFIED_FAILURE = 6,
    COLD = 7,
};

struct HealthConfig final {
    /**
     * periodicChoresIntervalFast is used while the device is not in
     * suspend, or in suspend and connected to a charger (to watch for battery
     * overheat due to charging)
     */
    int32_t periodicChoresIntervalFast __attribute__ ((aligned(4)));
    /**
     * periodicChoresIntervalSlow is used when the device is in suspend and
     * not connected to a charger (to watch for a battery drained to zero
     * remaining capacity).
     */
    int32_t periodicChoresIntervalSlow __attribute__ ((aligned(4)));
    /**
     * power_supply sysfs attribute file paths. Set these to specific paths
     * to use for the associated battery parameters. Clients must search
     * for appropriate power_supply attribute files to use, for any paths
     * left empty after the HAL is initialized.
     *
     *
     * batteryStatusPath - file path to read battery charging status.
     * (POWER_SUPPLY_PROP_STATUS)
     */
    ::android::hardware::hidl_string batteryStatusPath __attribute__ ((aligned(8)));
    /**
     * batteryHealthPath - file path to read battery health.
     * (POWER_SUPPLY_PROP_HEALTH)
     */
    ::android::hardware::hidl_string batteryHealthPath __attribute__ ((aligned(8)));
    /**
     * batteryPresentPath - file path to read battery present status.
     * (POWER_SUPPLY_PROP_PRESENT)
     */
    ::android::hardware::hidl_string batteryPresentPath __attribute__ ((aligned(8)));
    /**
     * batteryCapacityPath - file path to read remaining battery capacity.
     * (POWER_SUPPLY_PROP_CAPACITY)
     */
    ::android::hardware::hidl_string batteryCapacityPath __attribute__ ((aligned(8)));
    /**
     * batteryVoltagePath - file path to read battery voltage.
     * (POWER_SUPPLY_PROP_VOLTAGE_NOW)
     */
    ::android::hardware::hidl_string batteryVoltagePath __attribute__ ((aligned(8)));
    /**
     * batteryTemperaturePath - file path to read battery temperature in tenths
     * of degree celcius. (POWER_SUPPLY_PROP_TEMP)
     */
    ::android::hardware::hidl_string batteryTemperaturePath __attribute__ ((aligned(8)));
    /**
     * batteryTechnologyPath - file path to read battery technology.
     * (POWER_SUPPLY_PROP_TECHNOLOGY)
     */
    ::android::hardware::hidl_string batteryTechnologyPath __attribute__ ((aligned(8)));
    /**
     * batteryCurrentNowPath - file path to read battery instantaneous current.
     * (POWER_SUPPLY_PROP_CURRENT_NOW)
     */
    ::android::hardware::hidl_string batteryCurrentNowPath __attribute__ ((aligned(8)));
    /**
     * batteryCurrentAvgPath - file path to read battery average current.
     * (POWER_SUPPLY_PROP_CURRENT_AVG)
     */
    ::android::hardware::hidl_string batteryCurrentAvgPath __attribute__ ((aligned(8)));
    /**
     * batteryChargeCounterPath - file path to read battery accumulated charge.
     * (POWER_SUPPLY_PROP_CHARGE_COUNTER)
     */
    ::android::hardware::hidl_string batteryChargeCounterPath __attribute__ ((aligned(8)));
    /**
     * batteryFullChargerPath - file path to read battery charge value when it
     * is considered to be full. (POWER_SUPPLY_PROP_CHARGE_FULL)
     */
    ::android::hardware::hidl_string batteryFullChargePath __attribute__ ((aligned(8)));
    /**
     * batteryCycleCountPath - file path to read battery charge cycle count.
     * (POWER_SUPPLY_PROP_CYCLE_COUNT)
     */
    ::android::hardware::hidl_string batteryCycleCountPath __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, periodicChoresIntervalFast) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, periodicChoresIntervalSlow) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryStatusPath) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryHealthPath) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryPresentPath) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryCapacityPath) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryVoltagePath) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryTemperaturePath) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryTechnologyPath) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryCurrentNowPath) == 120, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryCurrentAvgPath) == 136, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryChargeCounterPath) == 152, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryFullChargePath) == 168, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthConfig, batteryCycleCountPath) == 184, "wrong offset");
static_assert(sizeof(::android::hardware::health::V1_0::HealthConfig) == 200, "wrong size");
static_assert(__alignof(::android::hardware::health::V1_0::HealthConfig) == 8, "wrong alignment");

/**
 * The parameter to healthd mainloop update calls
 */
struct HealthInfo final {
    /**
     * AC charger state - 'true' if online
     */
    bool chargerAcOnline __attribute__ ((aligned(1)));
    /**
     * USB charger state - 'true' if online
     */
    bool chargerUsbOnline __attribute__ ((aligned(1)));
    /**
     * Wireless charger state - 'true' if online
     */
    bool chargerWirelessOnline __attribute__ ((aligned(1)));
    /**
     * Maximum charging current supported by charger in uA
     */
    int32_t maxChargingCurrent __attribute__ ((aligned(4)));
    /**
     * Maximum charging voltage supported by charger in uV
     */
    int32_t maxChargingVoltage __attribute__ ((aligned(4)));
    ::android::hardware::health::V1_0::BatteryStatus batteryStatus __attribute__ ((aligned(4)));
    ::android::hardware::health::V1_0::BatteryHealth batteryHealth __attribute__ ((aligned(4)));
    /**
     * 'true' if battery is present
     */
    bool batteryPresent __attribute__ ((aligned(1)));
    /**
     * Remaining battery capacity in percent
     */
    int32_t batteryLevel __attribute__ ((aligned(4)));
    /**
     * Instantaneous battery voltage in millivolts (mV).
     *
     * Historically, the unit of this field is microvolts (uV), but all
     * clients and implementations uses millivolts in practice, making it
     * the de-facto standard.
     */
    int32_t batteryVoltage __attribute__ ((aligned(4)));
    /**
     * Instantaneous battery temperature in tenths of degree celcius
     */
    int32_t batteryTemperature __attribute__ ((aligned(4)));
    /**
     * Instantaneous battery current in uA
     */
    int32_t batteryCurrent __attribute__ ((aligned(4)));
    /**
     * Battery charge cycle count
     */
    int32_t batteryCycleCount __attribute__ ((aligned(4)));
    /**
     * Battery charge value when it is considered to be "full" in uA-h
     */
    int32_t batteryFullCharge __attribute__ ((aligned(4)));
    /**
     * Instantaneous battery capacity in uA-h
     */
    int32_t batteryChargeCounter __attribute__ ((aligned(4)));
    /**
     * Battery technology, e.g. "Li-ion, Li-Poly" etc.
     */
    ::android::hardware::hidl_string batteryTechnology __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, chargerAcOnline) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, chargerUsbOnline) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, chargerWirelessOnline) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, maxChargingCurrent) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, maxChargingVoltage) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, batteryStatus) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, batteryHealth) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, batteryPresent) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, batteryLevel) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, batteryVoltage) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, batteryTemperature) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, batteryCurrent) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, batteryCycleCount) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, batteryFullCharge) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, batteryChargeCounter) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::health::V1_0::HealthInfo, batteryTechnology) == 56, "wrong offset");
static_assert(sizeof(::android::hardware::health::V1_0::HealthInfo) == 72, "wrong size");
static_assert(__alignof(::android::hardware::health::V1_0::HealthInfo) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::health::V1_0::Result o);
static inline void PrintTo(::android::hardware::health::V1_0::Result o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::health::V1_0::Result lhs, const ::android::hardware::health::V1_0::Result rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::health::V1_0::Result rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::health::V1_0::Result lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
