{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA11_c",
   "name" : "char [11]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA11_c",
   "size" : 11,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA128_m",
   "name" : "unsigned long [128]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA128_m",
   "size" : 512,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA13_i",
   "name" : "int [13]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA13_i",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA14_NSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "std::__1::basic_string<char> [14]",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",

   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKe",
   "name" : "const long double",
   "referenced_type" : "_ZTIe",
   "self_type" : "_ZTIKe",
   "size" : 8,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/libcxx/include/algorithm"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 4,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 4,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/core/lib/bfloat16/bfloat16.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTIVNSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_jPKvE",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvS_jPKvE",
   "self_type" : "_ZTIVPFPvS_jPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjPKvE",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjPKvE",
   "self_type" : "_ZTIVPFPvjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjjPKvE",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjjPKvE",
   "self_type" : "_ZTIVPFPvjjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cgroup",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "referenced_type" : "_ZTI10clone_args",
   "self_type" : "_ZTI10clone_args",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_15__simd64_int8_t"
    }
   ],
   "linker_set_key" : "_ZTI10int8x8x2_t",
   "name" : "int8x8x2_t",
   "referenced_type" : "_ZTI10int8x8x2_t",
   "self_type" : "_ZTI10int8x8x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_15__simd64_int8_t"
    }
   ],
   "linker_set_key" : "_ZTI10int8x8x3_t",
   "name" : "int8x8x3_t",
   "referenced_type" : "_ZTI10int8x8x3_t",
   "self_type" : "_ZTI10int8x8x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_15__simd64_int8_t"
    }
   ],
   "linker_set_key" : "_ZTI10int8x8x4_t",
   "name" : "int8x8x4_t",
   "referenced_type" : "_ZTI10int8x8x4_t",
   "self_type" : "_ZTI10int8x8x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 84,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA2_m"
    }
   ],
   "linker_set_key" : "_ZTI10sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "_ZTI10sigset64_t",
   "self_type" : "_ZTI10sigset64_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_16__simd64_int16_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x4x2_t",
   "name" : "int16x4x2_t",
   "referenced_type" : "_ZTI11int16x4x2_t",
   "self_type" : "_ZTI11int16x4x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_16__simd64_int16_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x4x3_t",
   "name" : "int16x4x3_t",
   "referenced_type" : "_ZTI11int16x4x3_t",
   "self_type" : "_ZTI11int16x4x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_16__simd64_int16_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x4x4_t",
   "name" : "int16x4x4_t",
   "referenced_type" : "_ZTI11int16x4x4_t",
   "self_type" : "_ZTI11int16x4x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_17__simd128_int16_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x8x2_t",
   "name" : "int16x8x2_t",
   "referenced_type" : "_ZTI11int16x8x2_t",
   "self_type" : "_ZTI11int16x8x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_17__simd128_int16_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x8x3_t",
   "name" : "int16x8x3_t",
   "referenced_type" : "_ZTI11int16x8x3_t",
   "self_type" : "_ZTI11int16x8x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_17__simd128_int16_t"
    }
   ],
   "linker_set_key" : "_ZTI11int16x8x4_t",
   "name" : "int16x8x4_t",
   "referenced_type" : "_ZTI11int16x8x4_t",
   "self_type" : "_ZTI11int16x8x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_16__simd64_int32_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x2x2_t",
   "name" : "int32x2x2_t",
   "referenced_type" : "_ZTI11int32x2x2_t",
   "self_type" : "_ZTI11int32x2x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_16__simd64_int32_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x2x3_t",
   "name" : "int32x2x3_t",
   "referenced_type" : "_ZTI11int32x2x3_t",
   "self_type" : "_ZTI11int32x2x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_16__simd64_int32_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x2x4_t",
   "name" : "int32x2x4_t",
   "referenced_type" : "_ZTI11int32x2x4_t",
   "self_type" : "_ZTI11int32x2x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_17__simd128_int32_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x4x2_t",
   "name" : "int32x4x2_t",
   "referenced_type" : "_ZTI11int32x4x2_t",
   "self_type" : "_ZTI11int32x4x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_17__simd128_int32_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x4x3_t",
   "name" : "int32x4x3_t",
   "referenced_type" : "_ZTI11int32x4x3_t",
   "self_type" : "_ZTI11int32x4x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_17__simd128_int32_t"
    }
   ],
   "linker_set_key" : "_ZTI11int32x4x4_t",
   "name" : "int32x4x4_t",
   "referenced_type" : "_ZTI11int32x4x4_t",
   "self_type" : "_ZTI11int32x4x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_16__simd64_int64_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x1x2_t",
   "name" : "int64x1x2_t",
   "referenced_type" : "_ZTI11int64x1x2_t",
   "self_type" : "_ZTI11int64x1x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_16__simd64_int64_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x1x3_t",
   "name" : "int64x1x3_t",
   "referenced_type" : "_ZTI11int64x1x3_t",
   "self_type" : "_ZTI11int64x1x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_16__simd64_int64_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x1x4_t",
   "name" : "int64x1x4_t",
   "referenced_type" : "_ZTI11int64x1x4_t",
   "self_type" : "_ZTI11int64x1x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_17__simd128_int64_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x2x2_t",
   "name" : "int64x2x2_t",
   "referenced_type" : "_ZTI11int64x2x2_t",
   "self_type" : "_ZTI11int64x2x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_17__simd128_int64_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x2x3_t",
   "name" : "int64x2x3_t",
   "referenced_type" : "_ZTI11int64x2x3_t",
   "self_type" : "_ZTI11int64x2x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_17__simd128_int64_t"
    }
   ],
   "linker_set_key" : "_ZTI11int64x2x4_t",
   "name" : "int64x2x4_t",
   "referenced_type" : "_ZTI11int64x2x4_t",
   "self_type" : "_ZTI11int64x2x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_16__simd128_int8_t"
    }
   ],
   "linker_set_key" : "_ZTI11int8x16x2_t",
   "name" : "int8x16x2_t",
   "referenced_type" : "_ZTI11int8x16x2_t",
   "self_type" : "_ZTI11int8x16x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_16__simd128_int8_t"
    }
   ],
   "linker_set_key" : "_ZTI11int8x16x3_t",
   "name" : "int8x16x3_t",
   "referenced_type" : "_ZTI11int8x16x3_t",
   "self_type" : "_ZTI11int8x16x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_16__simd128_int8_t"
    }
   ],
   "linker_set_key" : "_ZTI11int8x16x4_t",
   "name" : "int8x16x4_t",
   "referenced_type" : "_ZTI11int8x16x4_t",
   "self_type" : "_ZTI11int8x16x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_16__simd64_poly8_t"
    }
   ],
   "linker_set_key" : "_ZTI11poly8x8x2_t",
   "name" : "poly8x8x2_t",
   "referenced_type" : "_ZTI11poly8x8x2_t",
   "self_type" : "_ZTI11poly8x8x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_16__simd64_poly8_t"
    }
   ],
   "linker_set_key" : "_ZTI11poly8x8x3_t",
   "name" : "poly8x8x3_t",
   "referenced_type" : "_ZTI11poly8x8x3_t",
   "self_type" : "_ZTI11poly8x8x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_16__simd64_poly8_t"
    }
   ],
   "linker_set_key" : "_ZTI11poly8x8x4_t",
   "name" : "poly8x8x4_t",
   "referenced_type" : "_ZTI11poly8x8x4_t",
   "self_type" : "_ZTI11poly8x8x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "referenced_type" : "_ZTI11sched_param",
   "self_type" : "_ZTI11sched_param",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_16__simd64_uint8_t"
    }
   ],
   "linker_set_key" : "_ZTI11uint8x8x2_t",
   "name" : "uint8x8x2_t",
   "referenced_type" : "_ZTI11uint8x8x2_t",
   "self_type" : "_ZTI11uint8x8x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_16__simd64_uint8_t"
    }
   ],
   "linker_set_key" : "_ZTI11uint8x8x3_t",
   "name" : "uint8x8x3_t",
   "referenced_type" : "_ZTI11uint8x8x3_t",
   "self_type" : "_ZTI11uint8x8x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_16__simd64_uint8_t"
    }
   ],
   "linker_set_key" : "_ZTI11uint8x8x4_t",
   "name" : "uint8x8x4_t",
   "referenced_type" : "_ZTI11uint8x8x4_t",
   "self_type" : "_ZTI11uint8x8x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA8_N11user_fpregs6fp_regE"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "_ZTI11user_fpregs",
   "self_type" : "_ZTI11user_fpregs",
   "size" : 116,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_17__simd64_poly16_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x4x2_t",
   "name" : "poly16x4x2_t",
   "referenced_type" : "_ZTI12poly16x4x2_t",
   "self_type" : "_ZTI12poly16x4x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_17__simd64_poly16_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x4x3_t",
   "name" : "poly16x4x3_t",
   "referenced_type" : "_ZTI12poly16x4x3_t",
   "self_type" : "_ZTI12poly16x4x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_17__simd64_poly16_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x4x4_t",
   "name" : "poly16x4x4_t",
   "referenced_type" : "_ZTI12poly16x4x4_t",
   "self_type" : "_ZTI12poly16x4x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_18__simd128_poly16_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x8x2_t",
   "name" : "poly16x8x2_t",
   "referenced_type" : "_ZTI12poly16x8x2_t",
   "self_type" : "_ZTI12poly16x8x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_18__simd128_poly16_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x8x3_t",
   "name" : "poly16x8x3_t",
   "referenced_type" : "_ZTI12poly16x8x3_t",
   "self_type" : "_ZTI12poly16x8x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_18__simd128_poly16_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly16x8x4_t",
   "name" : "poly16x8x4_t",
   "referenced_type" : "_ZTI12poly16x8x4_t",
   "self_type" : "_ZTI12poly16x8x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_17__simd64_poly64_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x1x2_t",
   "name" : "poly64x1x2_t",
   "referenced_type" : "_ZTI12poly64x1x2_t",
   "self_type" : "_ZTI12poly64x1x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_17__simd64_poly64_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x1x3_t",
   "name" : "poly64x1x3_t",
   "referenced_type" : "_ZTI12poly64x1x3_t",
   "self_type" : "_ZTI12poly64x1x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_17__simd64_poly64_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x1x4_t",
   "name" : "poly64x1x4_t",
   "referenced_type" : "_ZTI12poly64x1x4_t",
   "self_type" : "_ZTI12poly64x1x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_18__simd128_poly64_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x2x2_t",
   "name" : "poly64x2x2_t",
   "referenced_type" : "_ZTI12poly64x2x2_t",
   "self_type" : "_ZTI12poly64x2x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_18__simd128_poly64_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x2x3_t",
   "name" : "poly64x2x3_t",
   "referenced_type" : "_ZTI12poly64x2x3_t",
   "self_type" : "_ZTI12poly64x2x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_18__simd128_poly64_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly64x2x4_t",
   "name" : "poly64x2x4_t",
   "referenced_type" : "_ZTI12poly64x2x4_t",
   "self_type" : "_ZTI12poly64x2x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_17__simd128_poly8_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly8x16x2_t",
   "name" : "poly8x16x2_t",
   "referenced_type" : "_ZTI12poly8x16x2_t",
   "self_type" : "_ZTI12poly8x16x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_17__simd128_poly8_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly8x16x3_t",
   "name" : "poly8x16x3_t",
   "referenced_type" : "_ZTI12poly8x16x3_t",
   "self_type" : "_ZTI12poly8x16x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_17__simd128_poly8_t"
    }
   ],
   "linker_set_key" : "_ZTI12poly8x16x4_t",
   "name" : "poly8x16x4_t",
   "referenced_type" : "_ZTI12poly8x16x4_t",
   "self_type" : "_ZTI12poly8x16x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_17__simd64_uint16_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x4x2_t",
   "name" : "uint16x4x2_t",
   "referenced_type" : "_ZTI12uint16x4x2_t",
   "self_type" : "_ZTI12uint16x4x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_17__simd64_uint16_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x4x3_t",
   "name" : "uint16x4x3_t",
   "referenced_type" : "_ZTI12uint16x4x3_t",
   "self_type" : "_ZTI12uint16x4x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_17__simd64_uint16_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x4x4_t",
   "name" : "uint16x4x4_t",
   "referenced_type" : "_ZTI12uint16x4x4_t",
   "self_type" : "_ZTI12uint16x4x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_18__simd128_uint16_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x8x2_t",
   "name" : "uint16x8x2_t",
   "referenced_type" : "_ZTI12uint16x8x2_t",
   "self_type" : "_ZTI12uint16x8x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_18__simd128_uint16_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x8x3_t",
   "name" : "uint16x8x3_t",
   "referenced_type" : "_ZTI12uint16x8x3_t",
   "self_type" : "_ZTI12uint16x8x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_18__simd128_uint16_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint16x8x4_t",
   "name" : "uint16x8x4_t",
   "referenced_type" : "_ZTI12uint16x8x4_t",
   "self_type" : "_ZTI12uint16x8x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_17__simd64_uint32_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x2x2_t",
   "name" : "uint32x2x2_t",
   "referenced_type" : "_ZTI12uint32x2x2_t",
   "self_type" : "_ZTI12uint32x2x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_17__simd64_uint32_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x2x3_t",
   "name" : "uint32x2x3_t",
   "referenced_type" : "_ZTI12uint32x2x3_t",
   "self_type" : "_ZTI12uint32x2x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_17__simd64_uint32_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x2x4_t",
   "name" : "uint32x2x4_t",
   "referenced_type" : "_ZTI12uint32x2x4_t",
   "self_type" : "_ZTI12uint32x2x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_18__simd128_uint32_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x4x2_t",
   "name" : "uint32x4x2_t",
   "referenced_type" : "_ZTI12uint32x4x2_t",
   "self_type" : "_ZTI12uint32x4x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_18__simd128_uint32_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x4x3_t",
   "name" : "uint32x4x3_t",
   "referenced_type" : "_ZTI12uint32x4x3_t",
   "self_type" : "_ZTI12uint32x4x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_18__simd128_uint32_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint32x4x4_t",
   "name" : "uint32x4x4_t",
   "referenced_type" : "_ZTI12uint32x4x4_t",
   "self_type" : "_ZTI12uint32x4x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_17__simd64_uint64_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x1x2_t",
   "name" : "uint64x1x2_t",
   "referenced_type" : "_ZTI12uint64x1x2_t",
   "self_type" : "_ZTI12uint64x1x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_17__simd64_uint64_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x1x3_t",
   "name" : "uint64x1x3_t",
   "referenced_type" : "_ZTI12uint64x1x3_t",
   "self_type" : "_ZTI12uint64x1x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_17__simd64_uint64_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x1x4_t",
   "name" : "uint64x1x4_t",
   "referenced_type" : "_ZTI12uint64x1x4_t",
   "self_type" : "_ZTI12uint64x1x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_18__simd128_uint64_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x2x2_t",
   "name" : "uint64x2x2_t",
   "referenced_type" : "_ZTI12uint64x2x2_t",
   "self_type" : "_ZTI12uint64x2x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_18__simd128_uint64_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x2x3_t",
   "name" : "uint64x2x3_t",
   "referenced_type" : "_ZTI12uint64x2x3_t",
   "self_type" : "_ZTI12uint64x2x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_18__simd128_uint64_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint64x2x4_t",
   "name" : "uint64x2x4_t",
   "referenced_type" : "_ZTI12uint64x2x4_t",
   "self_type" : "_ZTI12uint64x2x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_17__simd128_uint8_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint8x16x2_t",
   "name" : "uint8x16x2_t",
   "referenced_type" : "_ZTI12uint8x16x2_t",
   "self_type" : "_ZTI12uint8x16x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_17__simd128_uint8_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint8x16x3_t",
   "name" : "uint8x16x3_t",
   "referenced_type" : "_ZTI12uint8x16x3_t",
   "self_type" : "_ZTI12uint8x16x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_17__simd128_uint8_t"
    }
   ],
   "linker_set_key" : "_ZTI12uint8x16x4_t",
   "name" : "uint8x16x4_t",
   "referenced_type" : "_ZTI12uint8x16x4_t",
   "self_type" : "_ZTI12uint8x16x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "_ZTI12user_vfp_exc",
   "self_type" : "_ZTI12user_vfp_exc",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_18__simd64_float16_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x4x2_t",
   "name" : "float16x4x2_t",
   "referenced_type" : "_ZTI13float16x4x2_t",
   "self_type" : "_ZTI13float16x4x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_18__simd64_float16_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x4x3_t",
   "name" : "float16x4x3_t",
   "referenced_type" : "_ZTI13float16x4x3_t",
   "self_type" : "_ZTI13float16x4x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_18__simd64_float16_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x4x4_t",
   "name" : "float16x4x4_t",
   "referenced_type" : "_ZTI13float16x4x4_t",
   "self_type" : "_ZTI13float16x4x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_19__simd128_float16_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x8x2_t",
   "name" : "float16x8x2_t",
   "referenced_type" : "_ZTI13float16x8x2_t",
   "self_type" : "_ZTI13float16x8x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_19__simd128_float16_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x8x3_t",
   "name" : "float16x8x3_t",
   "referenced_type" : "_ZTI13float16x8x3_t",
   "self_type" : "_ZTI13float16x8x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_19__simd128_float16_t"
    }
   ],
   "linker_set_key" : "_ZTI13float16x8x4_t",
   "name" : "float16x8x4_t",
   "referenced_type" : "_ZTI13float16x8x4_t",
   "self_type" : "_ZTI13float16x8x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_18__simd64_float32_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x2x2_t",
   "name" : "float32x2x2_t",
   "referenced_type" : "_ZTI13float32x2x2_t",
   "self_type" : "_ZTI13float32x2x2_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_18__simd64_float32_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x2x3_t",
   "name" : "float32x2x3_t",
   "referenced_type" : "_ZTI13float32x2x3_t",
   "self_type" : "_ZTI13float32x2x3_t",
   "size" : 24,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_18__simd64_float32_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x2x4_t",
   "name" : "float32x2x4_t",
   "referenced_type" : "_ZTI13float32x2x4_t",
   "self_type" : "_ZTI13float32x2x4_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_19__simd128_float32_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x4x2_t",
   "name" : "float32x4x2_t",
   "referenced_type" : "_ZTI13float32x4x2_t",
   "self_type" : "_ZTI13float32x4x2_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA3_19__simd128_float32_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x4x3_t",
   "name" : "float32x4x3_t",
   "referenced_type" : "_ZTI13float32x4x3_t",
   "self_type" : "_ZTI13float32x4x3_t",
   "size" : 48,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA4_19__simd128_float32_t"
    }
   ],
   "linker_set_key" : "_ZTI13float32x4x4_t",
   "name" : "float32x4x4_t",
   "referenced_type" : "_ZTI13float32x4x4_t",
   "self_type" : "_ZTI13float32x4x4_t",
   "size" : 64,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/arm_neon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 24,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA8_i"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "_ZTI19__pthread_cleanup_t",
   "self_type" : "_ZTI19__pthread_cleanup_t",
   "size" : 12,
   "source_file" : "bionic/libc/include/pthread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 44,
   "source_file" : "bionic/libc/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTI9user_regs"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP9user_regs"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI11user_fpregs"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIP11user_fpregs"
    }
   ],
   "linker_set_key" : "_ZTI4user",
   "name" : "user",
   "referenced_type" : "_ZTI4user",
   "self_type" : "_ZTI4user",
   "size" : 296,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "decimal_point",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "grouping",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_curr_symbol",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "currency_symbol",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_decimal_point",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_thousands_sep",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_grouping",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "positive_sign",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "negative_sign",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_frac_digits",
     "field_offset" : 320,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "frac_digits",
     "field_offset" : 328,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_cs_precedes",
     "field_offset" : 336,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sep_by_space",
     "field_offset" : 344,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_cs_precedes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sep_by_space",
     "field_offset" : 360,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sign_posn",
     "field_offset" : 368,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sign_posn",
     "field_offset" : 376,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_cs_precedes",
     "field_offset" : 384,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sep_by_space",
     "field_offset" : 392,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_cs_precedes",
     "field_offset" : 400,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sep_by_space",
     "field_offset" : 408,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sign_posn",
     "field_offset" : 416,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sign_posn",
     "field_offset" : 424,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI5lconv",
   "name" : "lconv",
   "referenced_type" : "_ZTI5lconv",
   "self_type" : "_ZTI5lconv",
   "size" : 56,
   "source_file" : "bionic/libc/include/locale.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 40,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10sigcontext"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIA128_m"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 744,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA32_y"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "_ZTI8user_vfp",
   "self_type" : "_ZTI8user_vfp",
   "size" : 264,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "_ZTI9cpu_set_t",
   "self_type" : "_ZTI9cpu_set_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "_ZTIA18_m"
    }
   ],
   "linker_set_key" : "_ZTI9user_regs",
   "name" : "user_regs",
   "referenced_type" : "_ZTI9user_regs",
   "self_type" : "_ZTI9user_regs",
   "size" : 72,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt0_E",
   "self_type" : "_ZTIN10__sifieldsUt0_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt1_E",
   "self_type" : "_ZTIN10__sifieldsUt1_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt2_E",
   "self_type" : "_ZTIN10__sifieldsUt2_E",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_E",
   "self_type" : "_ZTIN10__sifieldsUt3_E",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt4_E",
   "self_type" : "_ZTIN10__sifieldsUt4_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt5_E",
   "self_type" : "_ZTIN10__sifieldsUt5_E",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "counter_",
     "referenced_type" : "_ZTIN10tensorflow6random5ArrayIjLi4EEE"
    },
    {
     "access" : "private",
     "field_name" : "key_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN10tensorflow6random5ArrayIjLi2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN10tensorflow6random12PhiloxRandomE",
   "name" : "tensorflow::random::PhiloxRandom",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN10tensorflow6random12PhiloxRandomE",
   "self_type" : "_ZTIN10tensorflow6random12PhiloxRandomE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/random/philox_random.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "single_",
     "referenced_type" : "_ZTIN10tensorflow6random19SingleSampleAdapterINS0_12PhiloxRandomEEE"
    }
   ],
   "linker_set_key" : "_ZTIN10tensorflow6random12SimplePhiloxE",
   "name" : "tensorflow::random::SimplePhilox",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN10tensorflow6random12SimplePhiloxE",
   "self_type" : "_ZTIN10tensorflow6random12SimplePhiloxE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/random/simple_philox.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "generator_",
     "referenced_type" : "_ZTIPN10tensorflow6random12PhiloxRandomE"
    },
    {
     "access" : "private",
     "field_name" : "unused_results_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN10tensorflow6random5ArrayIjLi4EEE"
    },
    {
     "access" : "private",
     "field_name" : "used_result_index_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN10tensorflow6random19SingleSampleAdapterINS0_12PhiloxRandomEEE",
   "name" : "tensorflow::random::SingleSampleAdapter<tensorflow::random::PhiloxRandom>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN10tensorflow6random19SingleSampleAdapterINS0_12PhiloxRandomEEE",
   "self_type" : "_ZTIN10tensorflow6random19SingleSampleAdapterINS0_12PhiloxRandomEEE",
   "size" : 24,
   "source_file" : "packages/modules/NeuralNetworks/common/random/random_distributions.h",
   "template_args" : [ "_ZTIN10tensorflow6random12PhiloxRandomE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIA2_j"
    }
   ],
   "linker_set_key" : "_ZTIN10tensorflow6random5ArrayIjLi2EEE",
   "name" : "tensorflow::random::Array<unsigned int, 2>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN10tensorflow6random5ArrayIjLi2EEE",
   "self_type" : "_ZTIN10tensorflow6random5ArrayIjLi2EEE",
   "size" : 8,
   "source_file" : "packages/modules/NeuralNetworks/common/random/philox_random.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIA4_j"
    }
   ],
   "linker_set_key" : "_ZTIN10tensorflow6random5ArrayIjLi4EEE",
   "name" : "tensorflow::random::Array<unsigned int, 4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN10tensorflow6random5ArrayIjLi4EEE",
   "self_type" : "_ZTIN10tensorflow6random5ArrayIjLi4EEE",
   "size" : 16,
   "source_file" : "packages/modules/NeuralNetworks/common/random/philox_random.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "u",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN10tensorflow8bfloat164FP32E",
   "name" : "tensorflow::bfloat16::FP32",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10tensorflow8bfloat164FP32E",
   "self_type" : "_ZTIN10tensorflow8bfloat164FP32E",
   "size" : 4,
   "source_file" : "external/tensorflow/tensorflow/core/lib/bfloat16/bfloat16.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN10tensorflow8bfloat16E",
   "name" : "tensorflow::bfloat16",
   "referenced_type" : "_ZTIN10tensorflow8bfloat16E",
   "self_type" : "_ZTIN10tensorflow8bfloat16E",
   "size" : 2,
   "source_file" : "external/tensorflow/tensorflow/core/lib/bfloat16/bfloat16.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:100:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN11user_fpregs6fp_regE",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "_ZTIN11user_fpregs6fp_regE",
   "self_type" : "_ZTIN11user_fpregs6fp_regE",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN18__kernel_sigactionUt_E",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:68:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN18__kernel_sigactionUt_E",
   "self_type" : "_ZTIN18__kernel_sigactionUt_E",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen10DenseShapeE",
   "name" : "Eigen::DenseShape",
   "referenced_type" : "_ZTIN5Eigen10DenseShapeE",
   "self_type" : "_ZTIN5Eigen10DenseShapeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen11MakeComplexILb0EEE",
   "name" : "Eigen::MakeComplex<false>",
   "referenced_type" : "_ZTIN5Eigen11MakeComplexILb0EEE",
   "self_type" : "_ZTIN5Eigen11MakeComplexILb0EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorFFT.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen11MakeComplexILb1EEE",
   "name" : "Eigen::MakeComplex<true>",
   "referenced_type" : "_ZTIN5Eigen11MakeComplexILb1EEE",
   "self_type" : "_ZTIN5Eigen11MakeComplexILb1EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorFFT.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen11SolverShapeE",
   "name" : "Eigen::SolverShape",
   "referenced_type" : "_ZTIN5Eigen11SolverShapeE",
   "self_type" : "_ZTIN5Eigen11SolverShapeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen11SparseShapeE",
   "name" : "Eigen::SparseShape",
   "referenced_type" : "_ZTIN5Eigen11SparseShapeE",
   "self_type" : "_ZTIN5Eigen11SparseShapeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "bytes_loaded_",
     "referenced_type" : "_ZTId"
    },
    {
     "access" : "private",
     "field_name" : "bytes_stored_",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "access" : "private",
     "field_name" : "compute_cycles_",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen12TensorOpCostE",
   "name" : "Eigen::TensorOpCost",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN5Eigen12TensorOpCostE",
   "self_type" : "_ZTIN5Eigen12TensorOpCostE",
   "size" : 24,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorCostModel.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen13DefaultDeviceE",
   "name" : "Eigen::DefaultDevice",
   "referenced_type" : "_ZTIN5Eigen13DefaultDeviceE",
   "self_type" : "_ZTIN5Eigen13DefaultDeviceE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorDeviceDefault.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen13DiagonalShapeE",
   "name" : "Eigen::DiagonalShape",
   "referenced_type" : "_ZTIN5Eigen13DiagonalShapeE",
   "self_type" : "_ZTIN5Eigen13DiagonalShapeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen13SolverStorageE",
   "name" : "Eigen::SolverStorage",
   "referenced_type" : "_ZTIN5Eigen13SolverStorageE",
   "self_type" : "_ZTIN5Eigen13SolverStorageE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen15TriangularShapeE",
   "name" : "Eigen::TriangularShape",
   "referenced_type" : "_ZTIN5Eigen15TriangularShapeE",
   "self_type" : "_ZTIN5Eigen15TriangularShapeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen16GenericNumTraitsINS_4halfEEE",
   "name" : "Eigen::GenericNumTraits<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen16GenericNumTraitsINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen16GenericNumTraitsINSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEEE",
   "name" : "Eigen::GenericNumTraits<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsINSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN5Eigen16GenericNumTraitsINSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen16GenericNumTraitsIbEE",
   "name" : "Eigen::GenericNumTraits<bool>",
   "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsIbEE",
   "self_type" : "_ZTIN5Eigen16GenericNumTraitsIbEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen16GenericNumTraitsIdEE",
   "name" : "Eigen::GenericNumTraits<double>",
   "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsIdEE",
   "self_type" : "_ZTIN5Eigen16GenericNumTraitsIdEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen16GenericNumTraitsIeEE",
   "name" : "Eigen::GenericNumTraits<long double>",
   "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsIeEE",
   "self_type" : "_ZTIN5Eigen16GenericNumTraitsIeEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen16GenericNumTraitsIfEE",
   "name" : "Eigen::GenericNumTraits<float>",
   "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsIfEE",
   "self_type" : "_ZTIN5Eigen16GenericNumTraitsIfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen16GenericNumTraitsIiEE",
   "name" : "Eigen::GenericNumTraits<int>",
   "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsIiEE",
   "self_type" : "_ZTIN5Eigen16GenericNumTraitsIiEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen16HomogeneousShapeE",
   "name" : "Eigen::HomogeneousShape",
   "referenced_type" : "_ZTIN5Eigen16HomogeneousShapeE",
   "self_type" : "_ZTIN5Eigen16HomogeneousShapeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen16PermutationShapeE",
   "name" : "Eigen::PermutationShape",
   "referenced_type" : "_ZTIN5Eigen16PermutationShapeE",
   "self_type" : "_ZTIN5Eigen16PermutationShapeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen16SelfAdjointShapeE",
   "name" : "Eigen::SelfAdjointShape",
   "referenced_type" : "_ZTIN5Eigen16SelfAdjointShapeE",
   "self_type" : "_ZTIN5Eigen16SelfAdjointShapeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen18PermutationStorageE",
   "name" : "Eigen::PermutationStorage",
   "referenced_type" : "_ZTIN5Eigen18PermutationStorageE",
   "self_type" : "_ZTIN5Eigen18PermutationStorageE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen19TranspositionsShapeE",
   "name" : "Eigen::TranspositionsShape",
   "referenced_type" : "_ZTIN5Eigen19TranspositionsShapeE",
   "self_type" : "_ZTIN5Eigen19TranspositionsShapeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen20ScalarBinaryOpTraitsIddNS_8internal13scalar_pow_opIddEEEE",
   "name" : "Eigen::ScalarBinaryOpTraits<double, double, Eigen::internal::scalar_pow_op<double, double>>",
   "referenced_type" : "_ZTIN5Eigen20ScalarBinaryOpTraitsIddNS_8internal13scalar_pow_opIddEEEE",
   "self_type" : "_ZTIN5Eigen20ScalarBinaryOpTraitsIddNS_8internal13scalar_pow_opIddEEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/XprHelper.h",
   "template_args" : [ "_ZTId", "_ZTId", "_ZTIN5Eigen8internal13scalar_pow_opIddEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen20ScalarBinaryOpTraitsIffNS_8internal13scalar_pow_opIffEEEE",
   "name" : "Eigen::ScalarBinaryOpTraits<float, float, Eigen::internal::scalar_pow_op<float, float>>",
   "referenced_type" : "_ZTIN5Eigen20ScalarBinaryOpTraitsIffNS_8internal13scalar_pow_opIffEEEE",
   "self_type" : "_ZTIN5Eigen20ScalarBinaryOpTraitsIffNS_8internal13scalar_pow_opIffEEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/XprHelper.h",
   "template_args" : [ "_ZTIf", "_ZTIf", "_ZTIN5Eigen8internal13scalar_pow_opIffEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen20ScalarBinaryOpTraitsIiiNS_8internal13scalar_sum_opIiiEEEE",
   "name" : "Eigen::ScalarBinaryOpTraits<int, int, Eigen::internal::scalar_sum_op<int, int>>",
   "referenced_type" : "_ZTIN5Eigen20ScalarBinaryOpTraitsIiiNS_8internal13scalar_sum_opIiiEEEE",
   "self_type" : "_ZTIN5Eigen20ScalarBinaryOpTraitsIiiNS_8internal13scalar_sum_opIiiEEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/XprHelper.h",
   "template_args" : [ "_ZTIi", "_ZTIi", "_ZTIN5Eigen8internal13scalar_sum_opIiiEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen21TranspositionsStorageE",
   "name" : "Eigen::TranspositionsStorage",
   "referenced_type" : "_ZTIN5Eigen21TranspositionsStorageE",
   "self_type" : "_ZTIN5Eigen21TranspositionsStorageE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen4CondILb0EEE",
   "name" : "Eigen::Cond<false>",
   "referenced_type" : "_ZTIN5Eigen4CondILb0EEE",
   "self_type" : "_ZTIN5Eigen4CondILb0EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorMeta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen4CondILb1EEE",
   "name" : "Eigen::Cond<true>",
   "referenced_type" : "_ZTIN5Eigen4CondILb1EEE",
   "self_type" : "_ZTIN5Eigen4CondILb1EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorMeta.h"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen9half_impl9half_baseE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen4halfE",
   "name" : "Eigen::half",
   "referenced_type" : "_ZTIN5Eigen4halfE",
   "self_type" : "_ZTIN5Eigen4halfE",
   "size" : 2,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/Half.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen5DenseE",
   "name" : "Eigen::Dense",
   "referenced_type" : "_ZTIN5Eigen5DenseE",
   "self_type" : "_ZTIN5Eigen5DenseE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen6PartOfILi0EEE",
   "name" : "Eigen::PartOf<RealPart>",
   "referenced_type" : "_ZTIN5Eigen6PartOfILi0EEE",
   "self_type" : "_ZTIN5Eigen6PartOfILi0EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorFFT.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen6PartOfILi1EEE",
   "name" : "Eigen::PartOf<ImagPart>",
   "referenced_type" : "_ZTIN5Eigen6PartOfILi1EEE",
   "self_type" : "_ZTIN5Eigen6PartOfILi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorFFT.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen6SparseE",
   "name" : "Eigen::Sparse",
   "referenced_type" : "_ZTIN5Eigen6SparseE",
   "self_type" : "_ZTIN5Eigen6SparseE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen7max_n_1ILj0EEE",
   "name" : "Eigen::max_n_1<0>",
   "referenced_type" : "_ZTIN5Eigen7max_n_1ILj0EEE",
   "self_type" : "_ZTIN5Eigen7max_n_1ILj0EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorMeta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8ArrayXprE",
   "name" : "Eigen::ArrayXpr",
   "referenced_type" : "_ZTIN5Eigen8ArrayXprE",
   "self_type" : "_ZTIN5Eigen8ArrayXprE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "matPrefix",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "matSuffix",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "rowPrefix",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "rowSuffix",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "rowSeparator",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "rowSpacer",
     "field_offset" : 480,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "coeffSeparator",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "precision",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8IOFormatE",
   "name" : "Eigen::IOFormat",
   "referenced_type" : "_ZTIN5Eigen8IOFormatE",
   "self_type" : "_ZTIN5Eigen8IOFormatE",
   "size" : 92,
   "source_file" : "external/eigen/Eigen/src/Core/IO.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal10AndReducerE",
   "name" : "Eigen::internal::AndReducer",
   "referenced_type" : "_ZTIN5Eigen8internal10AndReducerE",
   "self_type" : "_ZTIN5Eigen8internal10AndReducerE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorFunctors.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m_l1",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "m_l2",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "m_l3",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal10CacheSizesE",
   "name" : "Eigen::internal::CacheSizes",
   "referenced_type" : "_ZTIN5Eigen8internal10CacheSizesE",
   "self_type" : "_ZTIN5Eigen8internal10CacheSizesE",
   "size" : 12,
   "source_file" : "external/eigen/Eigen/src/Core/products/GeneralBlockPanelKernel.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal10IndexBasedE",
   "name" : "Eigen::internal::IndexBased",
   "referenced_type" : "_ZTIN5Eigen8internal10IndexBasedE",
   "self_type" : "_ZTIN5Eigen8internal10IndexBasedE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal10erf_retvalINS_4halfEEE",
   "name" : "Eigen::internal::erf_retval<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal10erf_retvalINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal10erf_retvalINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal10erf_retvalIfEE",
   "name" : "Eigen::internal::erf_retval<float>",
   "referenced_type" : "_ZTIN5Eigen8internal10erf_retvalIfEE",
   "self_type" : "_ZTIN5Eigen8internal10erf_retvalIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal10false_typeE",
   "name" : "Eigen::internal::false_type",
   "referenced_type" : "_ZTIN5Eigen8internal10false_typeE",
   "self_type" : "_ZTIN5Eigen8internal10false_typeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal10greater_opE",
   "name" : "Eigen::internal::greater_op",
   "referenced_type" : "_ZTIN5Eigen8internal10greater_opE",
   "self_type" : "_ZTIN5Eigen8internal10greater_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal10log1p_implIfEE",
   "name" : "Eigen::internal::log1p_impl<float>",
   "referenced_type" : "_ZTIN5Eigen8internal10log1p_implIfEE",
   "self_type" : "_ZTIN5Eigen8internal10log1p_implIfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal10product_opE",
   "name" : "Eigen::internal::product_op",
   "referenced_type" : "_ZTIN5Eigen8internal10product_opE",
   "self_type" : "_ZTIN5Eigen8internal10product_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal10static_valILy0EEE",
   "name" : "Eigen::internal::static_val<0>",
   "referenced_type" : "_ZTIN5Eigen8internal10static_valILy0EEE",
   "self_type" : "_ZTIN5Eigen8internal10static_valILy0EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorUInt128.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal10static_valILy1EEE",
   "name" : "Eigen::internal::static_val<1>",
   "referenced_type" : "_ZTIN5Eigen8internal10static_valILy1EEE",
   "self_type" : "_ZTIN5Eigen8internal10static_valILy1EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorUInt128.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11Dense2DenseE",
   "name" : "Eigen::internal::Dense2Dense",
   "referenced_type" : "_ZTIN5Eigen8internal11Dense2DenseE",
   "self_type" : "_ZTIN5Eigen8internal11Dense2DenseE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/AssignEvaluator.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "actual_dim",
     "referenced_type" : "_ZTIKi"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal11DimensionIdILin1EEE",
   "name" : "Eigen::internal::DimensionId<Dynamic>",
   "referenced_type" : "_ZTIN5Eigen8internal11DimensionIdILin1EEE",
   "self_type" : "_ZTIN5Eigen8internal11DimensionIdILin1EEE",
   "size" : 4,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorChipping.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "packet",
     "referenced_type" : "_ZTIA4_17__simd128_int32_t"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal11PacketBlockI17__simd128_int32_tLi4EEE",
   "name" : "Eigen::internal::PacketBlock<__attribute__((neon_vector_type(4))) int, 4>",
   "referenced_type" : "_ZTIN5Eigen8internal11PacketBlockI17__simd128_int32_tLi4EEE",
   "self_type" : "_ZTIN5Eigen8internal11PacketBlockI17__simd128_int32_tLi4EEE",
   "size" : 64,
   "source_file" : "external/eigen/Eigen/src/Core/GenericPacketMath.h",
   "template_args" : [ "_ZTI17__simd128_int32_t" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "packet",
     "referenced_type" : "_ZTIA4_19__simd128_float32_t"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal11PacketBlockI19__simd128_float32_tLi4EEE",
   "name" : "Eigen::internal::PacketBlock<__attribute__((neon_vector_type(4))) float, 4>",
   "referenced_type" : "_ZTIN5Eigen8internal11PacketBlockI19__simd128_float32_tLi4EEE",
   "self_type" : "_ZTIN5Eigen8internal11PacketBlockI19__simd128_float32_tLi4EEE",
   "size" : 64,
   "source_file" : "external/eigen/Eigen/src/Core/GenericPacketMath.h",
   "template_args" : [ "_ZTI19__simd128_float32_t" ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "packet",
     "referenced_type" : "_ZTIA2_N5Eigen8internal9Packet2cfE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal11PacketBlockINS0_9Packet2cfELi2EEE",
   "name" : "Eigen::internal::PacketBlock<Eigen::internal::Packet2cf, 2>",
   "referenced_type" : "_ZTIN5Eigen8internal11PacketBlockINS0_9Packet2cfELi2EEE",
   "self_type" : "_ZTIN5Eigen8internal11PacketBlockINS0_9Packet2cfELi2EEE",
   "size" : 32,
   "source_file" : "external/eigen/Eigen/src/Core/GenericPacketMath.h",
   "template_args" : [ "_ZTIN5Eigen8internal9Packet2cfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conditionalILb0EdNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "Eigen::internal::conditional<false, double, std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN5Eigen8internal11conditionalILb0EdNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN5Eigen8internal11conditionalILb0EdNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conditionalILb0EddEE",
   "name" : "Eigen::internal::conditional<false, double, double>",
   "referenced_type" : "_ZTIN5Eigen8internal11conditionalILb0EddEE",
   "self_type" : "_ZTIN5Eigen8internal11conditionalILb0EddEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTId", "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conditionalILb0EdeEE",
   "name" : "Eigen::internal::conditional<false, double, long double>",
   "referenced_type" : "_ZTIN5Eigen8internal11conditionalILb0EdeEE",
   "self_type" : "_ZTIN5Eigen8internal11conditionalILb0EdeEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTId", "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conditionalILb0EdfEE",
   "name" : "Eigen::internal::conditional<false, double, float>",
   "referenced_type" : "_ZTIN5Eigen8internal11conditionalILb0EdfEE",
   "self_type" : "_ZTIN5Eigen8internal11conditionalILb0EdfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTId", "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conditionalILb0EfNS_4halfEEE",
   "name" : "Eigen::internal::conditional<false, float, Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal11conditionalILb0EfNS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal11conditionalILb0EfNS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIf", "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conditionalILb0EfdEE",
   "name" : "Eigen::internal::conditional<false, float, double>",
   "referenced_type" : "_ZTIN5Eigen8internal11conditionalILb0EfdEE",
   "self_type" : "_ZTIN5Eigen8internal11conditionalILb0EfdEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIf", "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conditionalILb0EvNS0_10false_typeEEE",
   "name" : "Eigen::internal::conditional<false, void, Eigen::internal::false_type>",
   "referenced_type" : "_ZTIN5Eigen8internal11conditionalILb0EvNS0_10false_typeEEE",
   "self_type" : "_ZTIN5Eigen8internal11conditionalILb0EvNS0_10false_typeEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIv", "_ZTIN5Eigen8internal10false_typeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conditionalILb1EdiEE",
   "name" : "Eigen::internal::conditional<true, double, int>",
   "referenced_type" : "_ZTIN5Eigen8internal11conditionalILb1EdiEE",
   "self_type" : "_ZTIN5Eigen8internal11conditionalILb1EdiEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTId", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conditionalILb1EfbEE",
   "name" : "Eigen::internal::conditional<true, float, bool>",
   "referenced_type" : "_ZTIN5Eigen8internal11conditionalILb1EfbEE",
   "self_type" : "_ZTIN5Eigen8internal11conditionalILb1EfbEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIf", "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conditionalILb1EfdEE",
   "name" : "Eigen::internal::conditional<true, float, double>",
   "referenced_type" : "_ZTIN5Eigen8internal11conditionalILb1EfdEE",
   "self_type" : "_ZTIN5Eigen8internal11conditionalILb1EfdEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIf", "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conditionalILb1EijEE",
   "name" : "Eigen::internal::conditional<true, int, unsigned int>",
   "referenced_type" : "_ZTIN5Eigen8internal11conditionalILb1EijEE",
   "self_type" : "_ZTIN5Eigen8internal11conditionalILb1EijEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIi", "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conj_helperINS0_9Packet2cfES2_Lb0ELb1EEE",
   "name" : "Eigen::internal::conj_helper<Eigen::internal::Packet2cf, Eigen::internal::Packet2cf, false, true>",
   "referenced_type" : "_ZTIN5Eigen8internal11conj_helperINS0_9Packet2cfES2_Lb0ELb1EEE",
   "self_type" : "_ZTIN5Eigen8internal11conj_helperINS0_9Packet2cfES2_Lb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/Complex.h",
   "template_args" : [ "_ZTIN5Eigen8internal9Packet2cfE", "_ZTIN5Eigen8internal9Packet2cfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conj_helperINS0_9Packet2cfES2_Lb1ELb0EEE",
   "name" : "Eigen::internal::conj_helper<Eigen::internal::Packet2cf, Eigen::internal::Packet2cf, true, false>",
   "referenced_type" : "_ZTIN5Eigen8internal11conj_helperINS0_9Packet2cfES2_Lb1ELb0EEE",
   "self_type" : "_ZTIN5Eigen8internal11conj_helperINS0_9Packet2cfES2_Lb1ELb0EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/Complex.h",
   "template_args" : [ "_ZTIN5Eigen8internal9Packet2cfE", "_ZTIN5Eigen8internal9Packet2cfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11conj_helperINS0_9Packet2cfES2_Lb1ELb1EEE",
   "name" : "Eigen::internal::conj_helper<Eigen::internal::Packet2cf, Eigen::internal::Packet2cf, true, true>",
   "referenced_type" : "_ZTIN5Eigen8internal11conj_helperINS0_9Packet2cfES2_Lb1ELb1EEE",
   "self_type" : "_ZTIN5Eigen8internal11conj_helperINS0_9Packet2cfES2_Lb1ELb1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/Complex.h",
   "template_args" : [ "_ZTIN5Eigen8internal9Packet2cfE", "_ZTIN5Eigen8internal9Packet2cfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11erfc_retvalINS_4halfEEE",
   "name" : "Eigen::internal::erfc_retval<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal11erfc_retvalINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal11erfc_retvalINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11erfc_retvalIfEE",
   "name" : "Eigen::internal::erfc_retval<float>",
   "referenced_type" : "_ZTIN5Eigen8internal11erfc_retvalIfEE",
   "self_type" : "_ZTIN5Eigen8internal11erfc_retvalIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11glue_shapesINS_10DenseShapeENS_15TriangularShapeEEE",
   "name" : "Eigen::internal::glue_shapes<Eigen::DenseShape, Eigen::TriangularShape>",
   "referenced_type" : "_ZTIN5Eigen8internal11glue_shapesINS_10DenseShapeENS_15TriangularShapeEEE",
   "self_type" : "_ZTIN5Eigen8internal11glue_shapesINS_10DenseShapeENS_15TriangularShapeEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/XprHelper.h",
   "template_args" : [ "_ZTIN5Eigen10DenseShapeE", "_ZTIN5Eigen15TriangularShapeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11igamma_implIfEE",
   "name" : "Eigen::internal::igamma_impl<float>",
   "referenced_type" : "_ZTIN5Eigen8internal11igamma_implIfEE",
   "self_type" : "_ZTIN5Eigen8internal11igamma_implIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11incbeta_cfeIdEE",
   "name" : "Eigen::internal::incbeta_cfe<double>",
   "referenced_type" : "_ZTIN5Eigen8internal11incbeta_cfeIdEE",
   "self_type" : "_ZTIN5Eigen8internal11incbeta_cfeIdEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11incbeta_cfeIfEE",
   "name" : "Eigen::internal::incbeta_cfe<float>",
   "referenced_type" : "_ZTIN5Eigen8internal11incbeta_cfeIfEE",
   "self_type" : "_ZTIN5Eigen8internal11incbeta_cfeIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11is_integralIaEE",
   "name" : "Eigen::internal::is_integral<signed char>",
   "referenced_type" : "_ZTIN5Eigen8internal11is_integralIaEE",
   "self_type" : "_ZTIN5Eigen8internal11is_integralIaEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11is_integralIbEE",
   "name" : "Eigen::internal::is_integral<bool>",
   "referenced_type" : "_ZTIN5Eigen8internal11is_integralIbEE",
   "self_type" : "_ZTIN5Eigen8internal11is_integralIbEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11is_integralIcEE",
   "name" : "Eigen::internal::is_integral<char>",
   "referenced_type" : "_ZTIN5Eigen8internal11is_integralIcEE",
   "self_type" : "_ZTIN5Eigen8internal11is_integralIcEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11is_integralIhEE",
   "name" : "Eigen::internal::is_integral<unsigned char>",
   "referenced_type" : "_ZTIN5Eigen8internal11is_integralIhEE",
   "self_type" : "_ZTIN5Eigen8internal11is_integralIhEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11is_integralIiEE",
   "name" : "Eigen::internal::is_integral<int>",
   "referenced_type" : "_ZTIN5Eigen8internal11is_integralIiEE",
   "self_type" : "_ZTIN5Eigen8internal11is_integralIiEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11is_integralIjEE",
   "name" : "Eigen::internal::is_integral<unsigned int>",
   "referenced_type" : "_ZTIN5Eigen8internal11is_integralIjEE",
   "self_type" : "_ZTIN5Eigen8internal11is_integralIjEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11is_integralIlEE",
   "name" : "Eigen::internal::is_integral<long>",
   "referenced_type" : "_ZTIN5Eigen8internal11is_integralIlEE",
   "self_type" : "_ZTIN5Eigen8internal11is_integralIlEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11is_integralImEE",
   "name" : "Eigen::internal::is_integral<unsigned long>",
   "referenced_type" : "_ZTIN5Eigen8internal11is_integralImEE",
   "self_type" : "_ZTIN5Eigen8internal11is_integralImEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11is_integralIsEE",
   "name" : "Eigen::internal::is_integral<short>",
   "referenced_type" : "_ZTIN5Eigen8internal11is_integralIsEE",
   "self_type" : "_ZTIN5Eigen8internal11is_integralIsEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11is_integralItEE",
   "name" : "Eigen::internal::is_integral<unsigned short>",
   "referenced_type" : "_ZTIN5Eigen8internal11is_integralItEE",
   "self_type" : "_ZTIN5Eigen8internal11is_integralItEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11lgamma_implIdEE",
   "name" : "Eigen::internal::lgamma_impl<double>",
   "referenced_type" : "_ZTIN5Eigen8internal11lgamma_implIdEE",
   "self_type" : "_ZTIN5Eigen8internal11lgamma_implIdEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11lgamma_implIfEE",
   "name" : "Eigen::internal::lgamma_impl<float>",
   "referenced_type" : "_ZTIN5Eigen8internal11lgamma_implIfEE",
   "self_type" : "_ZTIN5Eigen8internal11lgamma_implIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11negation_opE",
   "name" : "Eigen::internal::negation_op",
   "referenced_type" : "_ZTIN5Eigen8internal11negation_opE",
   "self_type" : "_ZTIN5Eigen8internal11negation_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11noncopyableE",
   "name" : "Eigen::internal::noncopyable",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN5Eigen8internal11noncopyableE",
   "self_type" : "_ZTIN5Eigen8internal11noncopyableE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11palign_implILi0E17__simd128_int32_tEE",
   "name" : "Eigen::internal::palign_impl<0, Packet4i>",
   "referenced_type" : "_ZTIN5Eigen8internal11palign_implILi0E17__simd128_int32_tEE",
   "self_type" : "_ZTIN5Eigen8internal11palign_implILi0E17__simd128_int32_tEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTI17__simd128_int32_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11palign_implILi0E19__simd128_float32_tEE",
   "name" : "Eigen::internal::palign_impl<0, Packet4f>",
   "referenced_type" : "_ZTIN5Eigen8internal11palign_implILi0E19__simd128_float32_tEE",
   "self_type" : "_ZTIN5Eigen8internal11palign_implILi0E19__simd128_float32_tEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTI19__simd128_float32_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11palign_implILi1E17__simd128_int32_tEE",
   "name" : "Eigen::internal::palign_impl<1, Packet4i>",
   "referenced_type" : "_ZTIN5Eigen8internal11palign_implILi1E17__simd128_int32_tEE",
   "self_type" : "_ZTIN5Eigen8internal11palign_implILi1E17__simd128_int32_tEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTI17__simd128_int32_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11palign_implILi1E19__simd128_float32_tEE",
   "name" : "Eigen::internal::palign_impl<1, Packet4f>",
   "referenced_type" : "_ZTIN5Eigen8internal11palign_implILi1E19__simd128_float32_tEE",
   "self_type" : "_ZTIN5Eigen8internal11palign_implILi1E19__simd128_float32_tEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTI19__simd128_float32_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11palign_implILi2E17__simd128_int32_tEE",
   "name" : "Eigen::internal::palign_impl<2, Packet4i>",
   "referenced_type" : "_ZTIN5Eigen8internal11palign_implILi2E17__simd128_int32_tEE",
   "self_type" : "_ZTIN5Eigen8internal11palign_implILi2E17__simd128_int32_tEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTI17__simd128_int32_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11palign_implILi2E19__simd128_float32_tEE",
   "name" : "Eigen::internal::palign_impl<2, Packet4f>",
   "referenced_type" : "_ZTIN5Eigen8internal11palign_implILi2E19__simd128_float32_tEE",
   "self_type" : "_ZTIN5Eigen8internal11palign_implILi2E19__simd128_float32_tEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTI19__simd128_float32_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11palign_implILi3E17__simd128_int32_tEE",
   "name" : "Eigen::internal::palign_impl<3, Packet4i>",
   "referenced_type" : "_ZTIN5Eigen8internal11palign_implILi3E17__simd128_int32_tEE",
   "self_type" : "_ZTIN5Eigen8internal11palign_implILi3E17__simd128_int32_tEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTI17__simd128_int32_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11palign_implILi3E19__simd128_float32_tEE",
   "name" : "Eigen::internal::palign_impl<3, Packet4f>",
   "referenced_type" : "_ZTIN5Eigen8internal11palign_implILi3E19__simd128_float32_tEE",
   "self_type" : "_ZTIN5Eigen8internal11palign_implILi3E19__simd128_float32_tEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTI19__simd128_float32_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11random_implIbEE",
   "name" : "Eigen::internal::random_impl<bool>",
   "referenced_type" : "_ZTIN5Eigen8internal11random_implIbEE",
   "self_type" : "_ZTIN5Eigen8internal11random_implIbEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen8internal19random_default_implIiLb0ELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal11random_implIiEE",
   "name" : "Eigen::internal::random_impl<int>",
   "referenced_type" : "_ZTIN5Eigen8internal11random_implIiEE",
   "self_type" : "_ZTIN5Eigen8internal11random_implIiEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11zeta_retvalINS_4halfEEE",
   "name" : "Eigen::internal::zeta_retval<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal11zeta_retvalINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal11zeta_retvalINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal11zeta_retvalIfEE",
   "name" : "Eigen::internal::zeta_retval<float>",
   "referenced_type" : "_ZTIN5Eigen8internal11zeta_retvalIfEE",
   "self_type" : "_ZTIN5Eigen8internal11zeta_retvalIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal12betainc_implIdEE",
   "name" : "Eigen::internal::betainc_impl<double>",
   "referenced_type" : "_ZTIN5Eigen8internal12betainc_implIdEE",
   "self_type" : "_ZTIN5Eigen8internal12betainc_implIdEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal12betainc_implIfEE",
   "name" : "Eigen::internal::betainc_impl<float>",
   "referenced_type" : "_ZTIN5Eigen8internal12betainc_implIfEE",
   "self_type" : "_ZTIN5Eigen8internal12betainc_implIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal12digamma_implIfEE",
   "name" : "Eigen::internal::digamma_impl<float>",
   "referenced_type" : "_ZTIN5Eigen8internal12digamma_implIfEE",
   "self_type" : "_ZTIN5Eigen8internal12digamma_implIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal12igammac_implIfEE",
   "name" : "Eigen::internal::igammac_impl<float>",
   "referenced_type" : "_ZTIN5Eigen8internal12igammac_implIfEE",
   "self_type" : "_ZTIN5Eigen8internal12igammac_implIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal12log1p_retvalIfEE",
   "name" : "Eigen::internal::log1p_retval<float>",
   "referenced_type" : "_ZTIN5Eigen8internal12log1p_retvalIfEE",
   "self_type" : "_ZTIN5Eigen8internal12log1p_retvalIfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal12not_equal_opE",
   "name" : "Eigen::internal::not_equal_op",
   "referenced_type" : "_ZTIN5Eigen8internal12not_equal_opE",
   "self_type" : "_ZTIN5Eigen8internal12not_equal_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13IteratorBasedE",
   "name" : "Eigen::internal::IteratorBased",
   "referenced_type" : "_ZTIN5Eigen8internal13IteratorBasedE",
   "self_type" : "_ZTIN5Eigen8internal13IteratorBasedE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "high",
     "referenced_type" : "_ZTIN5Eigen8internal10static_valILy0EEE"
    },
    {
     "field_name" : "low",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN5Eigen8internal10static_valILy1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy0EEENS2_ILy1EEEEE",
   "name" : "Eigen::internal::TensorUInt128<Eigen::internal::static_val<0>, Eigen::internal::static_val<1>>",
   "referenced_type" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy0EEENS2_ILy1EEEEE",
   "self_type" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy0EEENS2_ILy1EEEEE",
   "size" : 2,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorUInt128.h",
   "template_args" :
   [
    "_ZTIN5Eigen8internal10static_valILy0EEE",
    "_ZTIN5Eigen8internal10static_valILy1EEE"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "high",
     "referenced_type" : "_ZTIN5Eigen8internal10static_valILy0EEE"
    },
    {
     "field_name" : "low",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN5Eigen8internal10static_valILy0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy0EEES3_EE",
   "name" : "Eigen::internal::TensorUInt128<Eigen::internal::static_val<0>, Eigen::internal::static_val<0>>",
   "referenced_type" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy0EEES3_EE",
   "self_type" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy0EEES3_EE",
   "size" : 2,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorUInt128.h",
   "template_args" :
   [
    "_ZTIN5Eigen8internal10static_valILy0EEE",
    "_ZTIN5Eigen8internal10static_valILy0EEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "high",
     "referenced_type" : "_ZTIN5Eigen8internal10static_valILy0EEE"
    },
    {
     "field_name" : "low",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy0EEEyEE",
   "name" : "Eigen::internal::TensorUInt128<Eigen::internal::static_val<0>, unsigned long long>",
   "referenced_type" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy0EEEyEE",
   "self_type" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy0EEEyEE",
   "size" : 16,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorUInt128.h",
   "template_args" : [ "_ZTIN5Eigen8internal10static_valILy0EEE", "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "high",
     "referenced_type" : "_ZTIN5Eigen8internal10static_valILy1EEE"
    },
    {
     "field_name" : "low",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN5Eigen8internal10static_valILy0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy1EEENS2_ILy0EEEEE",
   "name" : "Eigen::internal::TensorUInt128<Eigen::internal::static_val<1>, Eigen::internal::static_val<0>>",
   "referenced_type" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy1EEENS2_ILy0EEEEE",
   "self_type" : "_ZTIN5Eigen8internal13TensorUInt128INS0_10static_valILy1EEENS2_ILy0EEEEE",
   "size" : 2,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorUInt128.h",
   "template_args" :
   [
    "_ZTIN5Eigen8internal10static_valILy1EEE",
    "_ZTIN5Eigen8internal10static_valILy0EEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "high",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "low",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN5Eigen8internal10static_valILy0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal13TensorUInt128IyNS0_10static_valILy0EEEEE",
   "name" : "Eigen::internal::TensorUInt128<unsigned long long, Eigen::internal::static_val<0>>",
   "referenced_type" : "_ZTIN5Eigen8internal13TensorUInt128IyNS0_10static_valILy0EEEEE",
   "self_type" : "_ZTIN5Eigen8internal13TensorUInt128IyNS0_10static_valILy0EEEEE",
   "size" : 16,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorUInt128.h",
   "template_args" : [ "_ZTIy", "_ZTIN5Eigen8internal10static_valILy0EEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "high",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "low",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal13TensorUInt128IyyEE",
   "name" : "Eigen::internal::TensorUInt128<unsigned long long, unsigned long long>",
   "referenced_type" : "_ZTIN5Eigen8internal13TensorUInt128IyyEE",
   "self_type" : "_ZTIN5Eigen8internal13TensorUInt128IyyEE",
   "size" : 16,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorUInt128.h",
   "template_args" : [ "_ZTIy", "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13cephes_helperIdEE",
   "name" : "Eigen::internal::cephes_helper<double>",
   "referenced_type" : "_ZTIN5Eigen8internal13cephes_helperIdEE",
   "self_type" : "_ZTIN5Eigen8internal13cephes_helperIdEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13cephes_helperIfEE",
   "name" : "Eigen::internal::cephes_helper<float>",
   "referenced_type" : "_ZTIN5Eigen8internal13cephes_helperIfEE",
   "self_type" : "_ZTIN5Eigen8internal13cephes_helperIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13igamma_retvalINS_4halfEEE",
   "name" : "Eigen::internal::igamma_retval<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal13igamma_retvalINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal13igamma_retvalINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13igamma_retvalIfEE",
   "name" : "Eigen::internal::igamma_retval<float>",
   "referenced_type" : "_ZTIN5Eigen8internal13igamma_retvalIfEE",
   "self_type" : "_ZTIN5Eigen8internal13igamma_retvalIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticINS_4halfEEE",
   "name" : "Eigen::internal::is_arithmetic<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/Half.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "Eigen::internal::is_arithmetic<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticIaEE",
   "name" : "Eigen::internal::is_arithmetic<signed char>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticIaEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticIaEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticIbEE",
   "name" : "Eigen::internal::is_arithmetic<bool>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticIbEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticIbEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticIcEE",
   "name" : "Eigen::internal::is_arithmetic<char>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticIcEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticIcEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticIdEE",
   "name" : "Eigen::internal::is_arithmetic<double>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticIdEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticIdEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticIeEE",
   "name" : "Eigen::internal::is_arithmetic<long double>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticIeEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticIeEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticIfEE",
   "name" : "Eigen::internal::is_arithmetic<float>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticIfEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticIfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticIhEE",
   "name" : "Eigen::internal::is_arithmetic<unsigned char>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticIhEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticIhEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticIiEE",
   "name" : "Eigen::internal::is_arithmetic<int>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticIiEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticIiEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticIjEE",
   "name" : "Eigen::internal::is_arithmetic<unsigned int>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticIjEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticIjEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticIlEE",
   "name" : "Eigen::internal::is_arithmetic<long>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticIlEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticIlEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticImEE",
   "name" : "Eigen::internal::is_arithmetic<unsigned long>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticImEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticImEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticIsEE",
   "name" : "Eigen::internal::is_arithmetic<short>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticIsEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticIsEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13is_arithmeticItEE",
   "name" : "Eigen::internal::is_arithmetic<unsigned short>",
   "referenced_type" : "_ZTIN5Eigen8internal13is_arithmeticItEE",
   "self_type" : "_ZTIN5Eigen8internal13is_arithmeticItEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13lgamma_retvalINS_4halfEEE",
   "name" : "Eigen::internal::lgamma_retval<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal13lgamma_retvalINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal13lgamma_retvalINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13lgamma_retvalIfEE",
   "name" : "Eigen::internal::lgamma_retval<float>",
   "referenced_type" : "_ZTIN5Eigen8internal13lgamma_retvalIfEE",
   "self_type" : "_ZTIN5Eigen8internal13lgamma_retvalIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13logical_or_opE",
   "name" : "Eigen::internal::logical_or_op",
   "referenced_type" : "_ZTIN5Eigen8internal13logical_or_opE",
   "self_type" : "_ZTIN5Eigen8internal13logical_or_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen8internal21default_packet_traitsE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal13packet_traitsINSt3__17complexIfEEEE",
   "name" : "Eigen::internal::packet_traits<std::complex<float>>",
   "referenced_type" : "_ZTIN5Eigen8internal13packet_traitsINSt3__17complexIfEEEE",
   "self_type" : "_ZTIN5Eigen8internal13packet_traitsINSt3__17complexIfEEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/Complex.h",
   "template_args" : [ "_ZTINSt3__17complexIfEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen8internal21default_packet_traitsE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal13packet_traitsIfEE",
   "name" : "Eigen::internal::packet_traits<float>",
   "referenced_type" : "_ZTIN5Eigen8internal13packet_traitsIfEE",
   "self_type" : "_ZTIN5Eigen8internal13packet_traitsIfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen8internal21default_packet_traitsE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal13packet_traitsIiEE",
   "name" : "Eigen::internal::packet_traits<int32_t>",
   "referenced_type" : "_ZTIN5Eigen8internal13packet_traitsIiEE",
   "self_type" : "_ZTIN5Eigen8internal13packet_traitsIiEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal13random_retvalIiEE",
   "name" : "Eigen::internal::random_retval<int>",
   "referenced_type" : "_ZTIN5Eigen8internal13random_retvalIiEE",
   "self_type" : "_ZTIN5Eigen8internal13random_retvalIiEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen8internal13scalar_sum_opIiiEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal13scalar_sum_opIbbEE",
   "name" : "Eigen::internal::scalar_sum_op<bool, bool>",
   "referenced_type" : "_ZTIN5Eigen8internal13scalar_sum_opIbbEE",
   "self_type" : "_ZTIN5Eigen8internal13scalar_sum_opIbbEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/functors/BinaryFunctors.h",
   "template_args" : [ "_ZTIb", "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen8internal14binary_op_baseIiiEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal13scalar_sum_opIiiEE",
   "name" : "Eigen::internal::scalar_sum_op<int, int>",
   "referenced_type" : "_ZTIN5Eigen8internal13scalar_sum_opIiiEE",
   "self_type" : "_ZTIN5Eigen8internal13scalar_sum_opIiiEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/functors/BinaryFunctors.h",
   "template_args" : [ "_ZTIi", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS0_9BandShapeEEE",
   "name" : "Eigen::internal::AssignmentKind<Eigen::DenseShape, Eigen::internal::BandShape>",
   "referenced_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS0_9BandShapeEEE",
   "self_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS0_9BandShapeEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/BandMatrix.h",
   "template_args" : [ "_ZTIN5Eigen10DenseShapeE", "_ZTIN5Eigen8internal9BandShapeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS_13DiagonalShapeEEE",
   "name" : "Eigen::internal::AssignmentKind<Eigen::DenseShape, Eigen::DiagonalShape>",
   "referenced_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS_13DiagonalShapeEEE",
   "self_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS_13DiagonalShapeEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/DiagonalMatrix.h",
   "template_args" : [ "_ZTIN5Eigen10DenseShapeE", "_ZTIN5Eigen13DiagonalShapeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS_15TriangularShapeEEE",
   "name" : "Eigen::internal::AssignmentKind<Eigen::DenseShape, Eigen::TriangularShape>",
   "referenced_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS_15TriangularShapeEEE",
   "self_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS_15TriangularShapeEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/TriangularMatrix.h",
   "template_args" : [ "_ZTIN5Eigen10DenseShapeE", "_ZTIN5Eigen15TriangularShapeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS_16PermutationShapeEEE",
   "name" : "Eigen::internal::AssignmentKind<Eigen::DenseShape, Eigen::PermutationShape>",
   "referenced_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS_16PermutationShapeEEE",
   "self_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeENS_16PermutationShapeEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/PermutationMatrix.h",
   "template_args" : [ "_ZTIN5Eigen10DenseShapeE", "_ZTIN5Eigen16PermutationShapeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeES2_EE",
   "name" : "Eigen::internal::AssignmentKind<Eigen::DenseShape, Eigen::DenseShape>",
   "referenced_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeES2_EE",
   "self_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_10DenseShapeES2_EE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/AssignEvaluator.h",
   "template_args" : [ "_ZTIN5Eigen10DenseShapeE", "_ZTIN5Eigen10DenseShapeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14AssignmentKindINS_15TriangularShapeENS_10DenseShapeEEE",
   "name" : "Eigen::internal::AssignmentKind<Eigen::TriangularShape, Eigen::DenseShape>",
   "referenced_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_15TriangularShapeENS_10DenseShapeEEE",
   "self_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_15TriangularShapeENS_10DenseShapeEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/TriangularMatrix.h",
   "template_args" : [ "_ZTIN5Eigen15TriangularShapeE", "_ZTIN5Eigen10DenseShapeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14AssignmentKindINS_15TriangularShapeES2_EE",
   "name" : "Eigen::internal::AssignmentKind<Eigen::TriangularShape, Eigen::TriangularShape>",
   "referenced_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_15TriangularShapeES2_EE",
   "self_type" : "_ZTIN5Eigen8internal14AssignmentKindINS_15TriangularShapeES2_EE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/TriangularMatrix.h",
   "template_args" : [ "_ZTIN5Eigen15TriangularShapeE", "_ZTIN5Eigen15TriangularShapeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14Diagonal2DenseE",
   "name" : "Eigen::internal::Diagonal2Dense",
   "referenced_type" : "_ZTIN5Eigen8internal14Diagonal2DenseE",
   "self_type" : "_ZTIN5Eigen8internal14Diagonal2DenseE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/DiagonalMatrix.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14DimInitializerINS_5SizesIJEEEEE",
   "name" : "Eigen::internal::DimInitializer<Eigen::Sizes<>>",
   "referenced_type" : "_ZTIN5Eigen8internal14DimInitializerINS_5SizesIJEEEEE",
   "self_type" : "_ZTIN5Eigen8internal14DimInitializerINS_5SizesIJEEEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorReduction.h",
   "template_args" : [ "_ZTIN5Eigen5SizesIJEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14betainc_helperIdEE",
   "name" : "Eigen::internal::betainc_helper<double>",
   "referenced_type" : "_ZTIN5Eigen8internal14betainc_helperIdEE",
   "self_type" : "_ZTIN5Eigen8internal14betainc_helperIdEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14betainc_helperIfEE",
   "name" : "Eigen::internal::betainc_helper<float>",
   "referenced_type" : "_ZTIN5Eigen8internal14betainc_helperIfEE",
   "self_type" : "_ZTIN5Eigen8internal14betainc_helperIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14betainc_retvalINS_4halfEEE",
   "name" : "Eigen::internal::betainc_retval<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal14betainc_retvalINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal14betainc_retvalINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14betainc_retvalIfEE",
   "name" : "Eigen::internal::betainc_retval<float>",
   "referenced_type" : "_ZTIN5Eigen8internal14betainc_retvalIfEE",
   "self_type" : "_ZTIN5Eigen8internal14betainc_retvalIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14binary_op_baseIiiEE",
   "name" : "Eigen::internal::binary_op_base<int, int>",
   "referenced_type" : "_ZTIN5Eigen8internal14binary_op_baseIiiEE",
   "self_type" : "_ZTIN5Eigen8internal14binary_op_baseIiiEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/functors/BinaryFunctors.h",
   "template_args" : [ "_ZTIi", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14digamma_retvalINS_4halfEEE",
   "name" : "Eigen::internal::digamma_retval<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal14digamma_retvalINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal14digamma_retvalINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14digamma_retvalIfEE",
   "name" : "Eigen::internal::digamma_retval<float>",
   "referenced_type" : "_ZTIN5Eigen8internal14digamma_retvalIfEE",
   "self_type" : "_ZTIN5Eigen8internal14digamma_retvalIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14functor_traitsINS0_14scalar_cast_opINS_4halfEfEEEE",
   "name" : "Eigen::internal::functor_traits<Eigen::internal::scalar_cast_op<Eigen::half, float>>",
   "referenced_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_14scalar_cast_opINS_4halfEfEEEE",
   "self_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_14scalar_cast_opINS_4halfEfEEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/TypeCasting.h",
   "template_args" : [ "_ZTIN5Eigen8internal14scalar_cast_opINS_4halfEfEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14functor_traitsINS0_14scalar_cast_opIfNS_4halfEEEEE",
   "name" : "Eigen::internal::functor_traits<Eigen::internal::scalar_cast_op<float, Eigen::half>>",
   "referenced_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_14scalar_cast_opIfNS_4halfEEEEE",
   "self_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_14scalar_cast_opIfNS_4halfEEEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/TypeCasting.h",
   "template_args" : [ "_ZTIN5Eigen8internal14scalar_cast_opIfNS_4halfEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14functor_traitsINS0_14scalar_cast_opIiNS_4halfEEEEE",
   "name" : "Eigen::internal::functor_traits<Eigen::internal::scalar_cast_op<int, Eigen::half>>",
   "referenced_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_14scalar_cast_opIiNS_4halfEEEEE",
   "self_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_14scalar_cast_opIiNS_4halfEEEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/TypeCasting.h",
   "template_args" : [ "_ZTIN5Eigen8internal14scalar_cast_opIiNS_4halfEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14functor_traitsINS0_20scalar_boolean_or_opEEE",
   "name" : "Eigen::internal::functor_traits<Eigen::internal::scalar_boolean_or_op>",
   "referenced_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_20scalar_boolean_or_opEEE",
   "self_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_20scalar_boolean_or_opEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/functors/BinaryFunctors.h",
   "template_args" : [ "_ZTIN5Eigen8internal20scalar_boolean_or_opE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14functor_traitsINS0_21scalar_boolean_and_opEEE",
   "name" : "Eigen::internal::functor_traits<Eigen::internal::scalar_boolean_and_op>",
   "referenced_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_21scalar_boolean_and_opEEE",
   "self_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_21scalar_boolean_and_opEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/functors/BinaryFunctors.h",
   "template_args" : [ "_ZTIN5Eigen8internal21scalar_boolean_and_opE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14functor_traitsINS0_21scalar_boolean_xor_opEEE",
   "name" : "Eigen::internal::functor_traits<Eigen::internal::scalar_boolean_xor_op>",
   "referenced_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_21scalar_boolean_xor_opEEE",
   "self_type" : "_ZTIN5Eigen8internal14functor_traitsINS0_21scalar_boolean_xor_opEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/functors/BinaryFunctors.h",
   "template_args" : [ "_ZTIN5Eigen8internal21scalar_boolean_xor_opE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14igammac_retvalINS_4halfEEE",
   "name" : "Eigen::internal::igammac_retval<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal14igammac_retvalINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal14igammac_retvalINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14igammac_retvalIfEE",
   "name" : "Eigen::internal::igammac_retval<float>",
   "referenced_type" : "_ZTIN5Eigen8internal14igammac_retvalIfEE",
   "self_type" : "_ZTIN5Eigen8internal14igammac_retvalIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14logical_and_opE",
   "name" : "Eigen::internal::logical_and_op",
   "referenced_type" : "_ZTIN5Eigen8internal14logical_and_opE",
   "self_type" : "_ZTIN5Eigen8internal14logical_and_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14polygamma_implIfEE",
   "name" : "Eigen::internal::polygamma_impl<float>",
   "referenced_type" : "_ZTIN5Eigen8internal14polygamma_implIfEE",
   "self_type" : "_ZTIN5Eigen8internal14polygamma_implIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14scalar_cast_opINS_4halfEfEE",
   "name" : "Eigen::internal::scalar_cast_op<Eigen::half, float>",
   "referenced_type" : "_ZTIN5Eigen8internal14scalar_cast_opINS_4halfEfEE",
   "self_type" : "_ZTIN5Eigen8internal14scalar_cast_opINS_4halfEfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/TypeCasting.h",
   "template_args" : [ "_ZTIN5Eigen4halfE", "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14scalar_cast_opIfNS_4halfEEE",
   "name" : "Eigen::internal::scalar_cast_op<float, Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal14scalar_cast_opIfNS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal14scalar_cast_opIfNS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/TypeCasting.h",
   "template_args" : [ "_ZTIf", "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal14scalar_cast_opIiNS_4halfEEE",
   "name" : "Eigen::internal::scalar_cast_op<int, Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal14scalar_cast_opIiNS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal14scalar_cast_opIiNS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/TypeCasting.h",
   "template_args" : [ "_ZTIi", "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15is_input_scalarINS_5SizesIJEEEEE",
   "name" : "Eigen::internal::is_input_scalar<Eigen::Sizes<>>",
   "referenced_type" : "_ZTIN5Eigen8internal15is_input_scalarINS_5SizesIJEEEEE",
   "self_type" : "_ZTIN5Eigen8internal15is_input_scalarINS_5SizesIJEEEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorBroadcasting.h",
   "template_args" : [ "_ZTIN5Eigen5SizesIJEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15lesser_equal_opE",
   "name" : "Eigen::internal::lesser_equal_op",
   "referenced_type" : "_ZTIN5Eigen8internal15lesser_equal_opE",
   "self_type" : "_ZTIN5Eigen8internal15lesser_equal_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi0ELi31ELi1EEE",
   "name" : "Eigen::internal::meta_floor_log2<2147483648, 0, 31, 1>",
   "referenced_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi0ELi31ELi1EEE",
   "self_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi0ELi31ELi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi15ELi31ELi1EEE",
   "name" : "Eigen::internal::meta_floor_log2<2147483648, 15, 31, 1>",
   "referenced_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi15ELi31ELi1EEE",
   "self_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi15ELi31ELi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi23ELi31ELi1EEE",
   "name" : "Eigen::internal::meta_floor_log2<2147483648, 23, 31, 1>",
   "referenced_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi23ELi31ELi1EEE",
   "self_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi23ELi31ELi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi27ELi31ELi1EEE",
   "name" : "Eigen::internal::meta_floor_log2<2147483648, 27, 31, 1>",
   "referenced_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi27ELi31ELi1EEE",
   "self_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi27ELi31ELi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi29ELi31ELi1EEE",
   "name" : "Eigen::internal::meta_floor_log2<2147483648, 29, 31, 1>",
   "referenced_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi29ELi31ELi1EEE",
   "self_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi29ELi31ELi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi30ELi31ELi0EEE",
   "name" : "Eigen::internal::meta_floor_log2<2147483648, 30, 31, 0>",
   "referenced_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi30ELi31ELi0EEE",
   "self_type" : "_ZTIN5Eigen8internal15meta_floor_log2ILj2147483648ELi30ELi31ELi0EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15unpacket_traitsI17__simd128_int32_tEE",
   "name" : "Eigen::internal::unpacket_traits<Packet4i>",
   "referenced_type" : "_ZTIN5Eigen8internal15unpacket_traitsI17__simd128_int32_tEE",
   "self_type" : "_ZTIN5Eigen8internal15unpacket_traitsI17__simd128_int32_tEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTI17__simd128_int32_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15unpacket_traitsI19__simd128_float32_tEE",
   "name" : "Eigen::internal::unpacket_traits<Packet4f>",
   "referenced_type" : "_ZTIN5Eigen8internal15unpacket_traitsI19__simd128_float32_tEE",
   "self_type" : "_ZTIN5Eigen8internal15unpacket_traitsI19__simd128_float32_tEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/PacketMath.h",
   "template_args" : [ "_ZTI19__simd128_float32_t" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15unpacket_traitsINS0_9Packet2cfEEE",
   "name" : "Eigen::internal::unpacket_traits<Eigen::internal::Packet2cf>",
   "referenced_type" : "_ZTIN5Eigen8internal15unpacket_traitsINS0_9Packet2cfEEE",
   "self_type" : "_ZTIN5Eigen8internal15unpacket_traitsINS0_9Packet2cfEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/Complex.h",
   "template_args" : [ "_ZTIN5Eigen8internal9Packet2cfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal15unpacket_traitsIfEE",
   "name" : "Eigen::internal::unpacket_traits<float>",
   "referenced_type" : "_ZTIN5Eigen8internal15unpacket_traitsIfEE",
   "self_type" : "_ZTIN5Eigen8internal15unpacket_traitsIfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/XprHelper.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal16Dense2TriangularE",
   "name" : "Eigen::internal::Dense2Triangular",
   "referenced_type" : "_ZTIN5Eigen8internal16Dense2TriangularE",
   "self_type" : "_ZTIN5Eigen8internal16Dense2TriangularE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/TriangularMatrix.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "magic",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "shift",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal16TensorIntDivisorIiLb1EEE",
   "name" : "Eigen::internal::TensorIntDivisor<int32_t, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN5Eigen8internal16TensorIntDivisorIiLb1EEE",
   "self_type" : "_ZTIN5Eigen8internal16TensorIntDivisorIiLb1EEE",
   "size" : 8,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorIntDiv.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal16Triangular2DenseE",
   "name" : "Eigen::internal::Triangular2Dense",
   "referenced_type" : "_ZTIN5Eigen8internal16Triangular2DenseE",
   "self_type" : "_ZTIN5Eigen8internal16Triangular2DenseE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/TriangularMatrix.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal16greater_equal_opE",
   "name" : "Eigen::internal::greater_equal_op",
   "referenced_type" : "_ZTIN5Eigen8internal16greater_equal_opE",
   "self_type" : "_ZTIN5Eigen8internal16greater_equal_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal16polygamma_retvalINS_4halfEEE",
   "name" : "Eigen::internal::polygamma_retval<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen8internal16polygamma_retvalINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen8internal16polygamma_retvalINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal16polygamma_retvalIfEE",
   "name" : "Eigen::internal::polygamma_retval<float>",
   "referenced_type" : "_ZTIN5Eigen8internal16polygamma_retvalIfEE",
   "self_type" : "_ZTIN5Eigen8internal16polygamma_retvalIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal16zeta_impl_seriesIdEE",
   "name" : "Eigen::internal::zeta_impl_series<double>",
   "referenced_type" : "_ZTIN5Eigen8internal16zeta_impl_seriesIdEE",
   "self_type" : "_ZTIN5Eigen8internal16zeta_impl_seriesIdEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal16zeta_impl_seriesIfEE",
   "name" : "Eigen::internal::zeta_impl_series<float>",
   "referenced_type" : "_ZTIN5Eigen8internal16zeta_impl_seriesIfEE",
   "self_type" : "_ZTIN5Eigen8internal16zeta_impl_seriesIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal17scalar_fuzzy_implIbEE",
   "name" : "Eigen::internal::scalar_fuzzy_impl<bool>",
   "referenced_type" : "_ZTIN5Eigen8internal17scalar_fuzzy_implIbEE",
   "self_type" : "_ZTIN5Eigen8internal17scalar_fuzzy_implIbEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal18h_skip_helper_typeILi0EJEEE",
   "name" : "Eigen::internal::h_skip_helper_type<0>",
   "referenced_type" : "_ZTIN5Eigen8internal18h_skip_helper_typeILi0EJEEE",
   "self_type" : "_ZTIN5Eigen8internal18h_skip_helper_typeILi0EJEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal18scalar_logistic_opIfEE",
   "name" : "Eigen::internal::scalar_logistic_op<float>",
   "referenced_type" : "_ZTIN5Eigen8internal18scalar_logistic_opIfEE",
   "self_type" : "_ZTIN5Eigen8internal18scalar_logistic_opIfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/functors/UnaryFunctors.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal19EigenBase2EigenBaseE",
   "name" : "Eigen::internal::EigenBase2EigenBase",
   "referenced_type" : "_ZTIN5Eigen8internal19EigenBase2EigenBaseE",
   "self_type" : "_ZTIN5Eigen8internal19EigenBase2EigenBaseE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/AssignEvaluator.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi0ELb0EEE",
   "name" : "Eigen::internal::gemv_dense_selector<OnTheRight, ColMajor, false>",
   "referenced_type" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi0ELb0EEE",
   "self_type" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi0ELb0EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi0ELb1EEE",
   "name" : "Eigen::internal::gemv_dense_selector<OnTheRight, ColMajor, true>",
   "referenced_type" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi0ELb1EEE",
   "self_type" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi0ELb1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi1ELb0EEE",
   "name" : "Eigen::internal::gemv_dense_selector<OnTheRight, RowMajor, false>",
   "referenced_type" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi1ELb0EEE",
   "self_type" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi1ELb0EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi1ELb1EEE",
   "name" : "Eigen::internal::gemv_dense_selector<OnTheRight, RowMajor, true>",
   "referenced_type" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi1ELb1EEE",
   "self_type" : "_ZTIN5Eigen8internal19gemv_dense_selectorILi2ELi1ELb1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal19random_default_implINS_4halfELb0ELb0EEE",
   "name" : "Eigen::internal::random_default_impl<Eigen::half, false, false>",
   "referenced_type" : "_ZTIN5Eigen8internal19random_default_implINS_4halfELb0ELb0EEE",
   "self_type" : "_ZTIN5Eigen8internal19random_default_implINS_4halfELb0ELb0EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/Half.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal19random_default_implIiLb0ELb1EEE",
   "name" : "Eigen::internal::random_default_impl<int, false, true>",
   "referenced_type" : "_ZTIN5Eigen8internal19random_default_implIiLb0ELb1EEE",
   "self_type" : "_ZTIN5Eigen8internal19random_default_implIiLb0ELb1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal20scalar_boolean_or_opE",
   "name" : "Eigen::internal::scalar_boolean_or_op",
   "referenced_type" : "_ZTIN5Eigen8internal20scalar_boolean_or_opE",
   "self_type" : "_ZTIN5Eigen8internal20scalar_boolean_or_opE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/functors/BinaryFunctors.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21Triangular2TriangularE",
   "name" : "Eigen::internal::Triangular2Triangular",
   "referenced_type" : "_ZTIN5Eigen8internal21Triangular2TriangularE",
   "self_type" : "_ZTIN5Eigen8internal21Triangular2TriangularE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/TriangularMatrix.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21default_packet_traitsE",
   "name" : "Eigen::internal::default_packet_traits",
   "referenced_type" : "_ZTIN5Eigen8internal21default_packet_traitsE",
   "self_type" : "_ZTIN5Eigen8internal21default_packet_traitsE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GenericPacketMath.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21greater_equal_zero_opE",
   "name" : "Eigen::internal::greater_equal_zero_op",
   "referenced_type" : "_ZTIN5Eigen8internal21greater_equal_zero_opE",
   "self_type" : "_ZTIN5Eigen8internal21greater_equal_zero_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi1ELi1EEE",
   "name" : "Eigen::internal::product_type_selector<1, 1, 1>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi1ELi1EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi1ELi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi2ELi2EEE",
   "name" : "Eigen::internal::product_type_selector<1, Large, Large>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi2ELi2EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi2ELi2EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi2ELi3EEE",
   "name" : "Eigen::internal::product_type_selector<1, Large, Small>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi2ELi3EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi2ELi3EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi3ELi2EEE",
   "name" : "Eigen::internal::product_type_selector<1, Small, Large>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi3ELi2EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi3ELi2EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi3ELi3EEE",
   "name" : "Eigen::internal::product_type_selector<1, Small, Small>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi3ELi3EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi1ELi3ELi3EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi1ELi2EEE",
   "name" : "Eigen::internal::product_type_selector<Large, 1, Large>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi1ELi2EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi1ELi2EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi1ELi3EEE",
   "name" : "Eigen::internal::product_type_selector<Large, 1, Small>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi1ELi3EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi1ELi3EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi2ELi2EEE",
   "name" : "Eigen::internal::product_type_selector<Large, Large, Large>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi2ELi2EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi2ELi2EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi2ELi3EEE",
   "name" : "Eigen::internal::product_type_selector<Large, Large, Small>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi2ELi3EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi2ELi3EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi3ELi1EEE",
   "name" : "Eigen::internal::product_type_selector<Large, Small, 1>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi3ELi1EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi3ELi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi3ELi2EEE",
   "name" : "Eigen::internal::product_type_selector<Large, Small, Large>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi3ELi2EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi3ELi2EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi3ELi3EEE",
   "name" : "Eigen::internal::product_type_selector<Large, Small, Small>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi3ELi3EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi2ELi3ELi3EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi1ELi2EEE",
   "name" : "Eigen::internal::product_type_selector<Small, 1, Large>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi1ELi2EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi1ELi2EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi1ELi3EEE",
   "name" : "Eigen::internal::product_type_selector<Small, 1, Small>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi1ELi3EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi1ELi3EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi2ELi1EEE",
   "name" : "Eigen::internal::product_type_selector<Small, Large, 1>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi2ELi1EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi2ELi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi2ELi2EEE",
   "name" : "Eigen::internal::product_type_selector<Small, Large, Large>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi2ELi2EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi2ELi2EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi2ELi3EEE",
   "name" : "Eigen::internal::product_type_selector<Small, Large, Small>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi2ELi3EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi2ELi3EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi3ELi1EEE",
   "name" : "Eigen::internal::product_type_selector<Small, Small, 1>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi3ELi1EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi3ELi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi3ELi2EEE",
   "name" : "Eigen::internal::product_type_selector<Small, Small, Large>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi3ELi2EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi3ELi2EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi3ELi3EEE",
   "name" : "Eigen::internal::product_type_selector<Small, Small, Small>",
   "referenced_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi3ELi3EEE",
   "self_type" : "_ZTIN5Eigen8internal21product_type_selectorILi3ELi3ELi3EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/GeneralProduct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21scalar_boolean_and_opE",
   "name" : "Eigen::internal::scalar_boolean_and_op",
   "referenced_type" : "_ZTIN5Eigen8internal21scalar_boolean_and_opE",
   "self_type" : "_ZTIN5Eigen8internal21scalar_boolean_and_opE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/functors/BinaryFunctors.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21scalar_boolean_xor_opE",
   "name" : "Eigen::internal::scalar_boolean_xor_op",
   "referenced_type" : "_ZTIN5Eigen8internal21scalar_boolean_xor_opE",
   "self_type" : "_ZTIN5Eigen8internal21scalar_boolean_xor_opE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/functors/BinaryFunctors.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_13DiagonalShapeEEE",
   "name" : "Eigen::internal::storage_kind_to_shape<Eigen::DiagonalShape>",
   "referenced_type" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_13DiagonalShapeEEE",
   "self_type" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_13DiagonalShapeEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/DiagonalMatrix.h",
   "template_args" : [ "_ZTIN5Eigen13DiagonalShapeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_13SolverStorageEEE",
   "name" : "Eigen::internal::storage_kind_to_shape<Eigen::SolverStorage>",
   "referenced_type" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_13SolverStorageEEE",
   "self_type" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_13SolverStorageEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/CoreEvaluators.h",
   "template_args" : [ "_ZTIN5Eigen13SolverStorageE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_18PermutationStorageEEE",
   "name" : "Eigen::internal::storage_kind_to_shape<Eigen::PermutationStorage>",
   "referenced_type" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_18PermutationStorageEEE",
   "self_type" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_18PermutationStorageEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/CoreEvaluators.h",
   "template_args" : [ "_ZTIN5Eigen18PermutationStorageE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_21TranspositionsStorageEEE",
   "name" : "Eigen::internal::storage_kind_to_shape<Eigen::TranspositionsStorage>",
   "referenced_type" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_21TranspositionsStorageEEE",
   "self_type" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_21TranspositionsStorageEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/CoreEvaluators.h",
   "template_args" : [ "_ZTIN5Eigen21TranspositionsStorageE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_5DenseEEE",
   "name" : "Eigen::internal::storage_kind_to_shape<Eigen::Dense>",
   "referenced_type" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_5DenseEEE",
   "self_type" : "_ZTIN5Eigen8internal21storage_kind_to_shapeINS_5DenseEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/CoreEvaluators.h",
   "template_args" : [ "_ZTIN5Eigen5DenseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal22no_assignment_operatorE",
   "name" : "Eigen::internal::no_assignment_operator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN5Eigen8internal22no_assignment_operatorE",
   "self_type" : "_ZTIN5Eigen8internal22no_assignment_operatorE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/XprHelper.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal23digamma_impl_maybe_polyIdEE",
   "name" : "Eigen::internal::digamma_impl_maybe_poly<double>",
   "referenced_type" : "_ZTIN5Eigen8internal23digamma_impl_maybe_polyIdEE",
   "self_type" : "_ZTIN5Eigen8internal23digamma_impl_maybe_polyIdEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal23digamma_impl_maybe_polyIfEE",
   "name" : "Eigen::internal::digamma_impl_maybe_poly<float>",
   "referenced_type" : "_ZTIN5Eigen8internal23digamma_impl_maybe_polyIfEE",
   "self_type" : "_ZTIN5Eigen8internal23digamma_impl_maybe_polyIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi0ELi31EEE",
   "name" : "Eigen::internal::meta_floor_log2_selector<2147483648, 0, 31>",
   "referenced_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi0ELi31EEE",
   "self_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi0ELi31EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi15ELi31EEE",
   "name" : "Eigen::internal::meta_floor_log2_selector<2147483648, 15, 31>",
   "referenced_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi15ELi31EEE",
   "self_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi15ELi31EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi23ELi31EEE",
   "name" : "Eigen::internal::meta_floor_log2_selector<2147483648, 23, 31>",
   "referenced_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi23ELi31EEE",
   "self_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi23ELi31EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi27ELi31EEE",
   "name" : "Eigen::internal::meta_floor_log2_selector<2147483648, 27, 31>",
   "referenced_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi27ELi31EEE",
   "self_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi27ELi31EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi29ELi31EEE",
   "name" : "Eigen::internal::meta_floor_log2_selector<2147483648, 29, 31>",
   "referenced_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi29ELi31EEE",
   "self_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi29ELi31EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi30ELi31EEE",
   "name" : "Eigen::internal::meta_floor_log2_selector<2147483648, 30, 31>",
   "referenced_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi30ELi31EEE",
   "self_type" : "_ZTIN5Eigen8internal24meta_floor_log2_selectorILj2147483648ELi30ELi31EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal28check_rows_cols_for_overflowILin1EEE",
   "name" : "Eigen::internal::check_rows_cols_for_overflow<Dynamic>",
   "referenced_type" : "_ZTIN5Eigen8internal28check_rows_cols_for_overflowILin1EEE",
   "self_type" : "_ZTIN5Eigen8internal28check_rows_cols_for_overflowILin1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/PlainObjectBase.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal31unaligned_dense_assignment_loopILb0EEE",
   "name" : "Eigen::internal::unaligned_dense_assignment_loop<false>",
   "referenced_type" : "_ZTIN5Eigen8internal31unaligned_dense_assignment_loopILb0EEE",
   "self_type" : "_ZTIN5Eigen8internal31unaligned_dense_assignment_loopILb0EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/AssignEvaluator.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal31vectorwise_reverse_inplace_implILi0EEE",
   "name" : "Eigen::internal::vectorwise_reverse_inplace_impl<Vertical>",
   "referenced_type" : "_ZTIN5Eigen8internal31vectorwise_reverse_inplace_implILi0EEE",
   "self_type" : "_ZTIN5Eigen8internal31vectorwise_reverse_inplace_implILi0EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/Reverse.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal31vectorwise_reverse_inplace_implILi1EEE",
   "name" : "Eigen::internal::vectorwise_reverse_inplace_impl<Horizontal>",
   "referenced_type" : "_ZTIN5Eigen8internal31vectorwise_reverse_inplace_implILi1EEE",
   "self_type" : "_ZTIN5Eigen8internal31vectorwise_reverse_inplace_implILi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/Reverse.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal36global_math_functions_filtering_baseINS_4halfEvEE",
   "name" : "Eigen::internal::global_math_functions_filtering_base<Eigen::half, void>",
   "referenced_type" : "_ZTIN5Eigen8internal36global_math_functions_filtering_baseINS_4halfEvEE",
   "self_type" : "_ZTIN5Eigen8internal36global_math_functions_filtering_baseINS_4halfEvEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTIN5Eigen4halfE", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal36global_math_functions_filtering_baseIfvEE",
   "name" : "Eigen::internal::global_math_functions_filtering_base<float, void>",
   "referenced_type" : "_ZTIN5Eigen8internal36global_math_functions_filtering_baseIfvEE",
   "self_type" : "_ZTIN5Eigen8internal36global_math_functions_filtering_baseIfvEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTIf", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal36global_math_functions_filtering_baseIivEE",
   "name" : "Eigen::internal::global_math_functions_filtering_base<int, void>",
   "referenced_type" : "_ZTIN5Eigen8internal36global_math_functions_filtering_baseIivEE",
   "self_type" : "_ZTIN5Eigen8internal36global_math_functions_filtering_baseIivEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTIi", "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal42constructor_without_unaligned_array_assertE",
   "name" : "Eigen::internal::constructor_without_unaligned_array_assert",
   "referenced_type" : "_ZTIN5Eigen8internal42constructor_without_unaligned_array_assertE",
   "self_type" : "_ZTIN5Eigen8internal42constructor_without_unaligned_array_assertE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/DenseStorage.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal4takeILi0ENS0_9type_listIJEEEEE",
   "name" : "Eigen::internal::take<0, Eigen::internal::type_list<>>",
   "referenced_type" : "_ZTIN5Eigen8internal4takeILi0ENS0_9type_listIJEEEEE",
   "self_type" : "_ZTIN5Eigen8internal4takeILi0ENS0_9type_listIJEEEEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h",
   "template_args" : [ "_ZTIN5Eigen8internal9type_listIJEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6cephes6polevlIdLi0EEE",
   "name" : "Eigen::internal::cephes::polevl<double, 0>",
   "referenced_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi0EEE",
   "self_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi0EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6cephes6polevlIdLi1EEE",
   "name" : "Eigen::internal::cephes::polevl<double, 1>",
   "referenced_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi1EEE",
   "self_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6cephes6polevlIdLi2EEE",
   "name" : "Eigen::internal::cephes::polevl<double, 2>",
   "referenced_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi2EEE",
   "self_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi2EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6cephes6polevlIdLi3EEE",
   "name" : "Eigen::internal::cephes::polevl<double, 3>",
   "referenced_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi3EEE",
   "self_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi3EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6cephes6polevlIdLi4EEE",
   "name" : "Eigen::internal::cephes::polevl<double, 4>",
   "referenced_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi4EEE",
   "self_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi4EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6cephes6polevlIdLi5EEE",
   "name" : "Eigen::internal::cephes::polevl<double, 5>",
   "referenced_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi5EEE",
   "self_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi5EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6cephes6polevlIdLi6EEE",
   "name" : "Eigen::internal::cephes::polevl<double, 6>",
   "referenced_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi6EEE",
   "self_type" : "_ZTIN5Eigen8internal6cephes6polevlIdLi6EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6cephes6polevlIfLi0EEE",
   "name" : "Eigen::internal::cephes::polevl<float, 0>",
   "referenced_type" : "_ZTIN5Eigen8internal6cephes6polevlIfLi0EEE",
   "self_type" : "_ZTIN5Eigen8internal6cephes6polevlIfLi0EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6cephes6polevlIfLi1EEE",
   "name" : "Eigen::internal::cephes::polevl<float, 1>",
   "referenced_type" : "_ZTIN5Eigen8internal6cephes6polevlIfLi1EEE",
   "self_type" : "_ZTIN5Eigen8internal6cephes6polevlIfLi1EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6cephes6polevlIfLi2EEE",
   "name" : "Eigen::internal::cephes::polevl<float, 2>",
   "referenced_type" : "_ZTIN5Eigen8internal6cephes6polevlIfLi2EEE",
   "self_type" : "_ZTIN5Eigen8internal6cephes6polevlIfLi2EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6cephes6polevlIfLi3EEE",
   "name" : "Eigen::internal::cephes::polevl<float, 3>",
   "referenced_type" : "_ZTIN5Eigen8internal6cephes6polevlIfLi3EEE",
   "self_type" : "_ZTIN5Eigen8internal6cephes6polevlIfLi3EEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6not_opE",
   "name" : "Eigen::internal::not_op",
   "referenced_type" : "_ZTIN5Eigen8internal6not_opE",
   "self_type" : "_ZTIN5Eigen8internal6not_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal6sum_opE",
   "name" : "Eigen::internal::sum_op",
   "referenced_type" : "_ZTIN5Eigen8internal6sum_opE",
   "self_type" : "_ZTIN5Eigen8internal6sum_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal7conj_ifILb0EEE",
   "name" : "Eigen::internal::conj_if<false>",
   "referenced_type" : "_ZTIN5Eigen8internal7conj_ifILb0EEE",
   "self_type" : "_ZTIN5Eigen8internal7conj_ifILb0EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/BlasUtil.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal7conj_ifILb1EEE",
   "name" : "Eigen::internal::conj_if<true>",
   "referenced_type" : "_ZTIN5Eigen8internal7conj_ifILb1EEE",
   "self_type" : "_ZTIN5Eigen8internal7conj_ifILb1EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/BlasUtil.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal7is_sameIddEE",
   "name" : "Eigen::internal::is_same<double, double>",
   "referenced_type" : "_ZTIN5Eigen8internal7is_sameIddEE",
   "self_type" : "_ZTIN5Eigen8internal7is_sameIddEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTId", "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal7is_sameIdfEE",
   "name" : "Eigen::internal::is_same<double, float>",
   "referenced_type" : "_ZTIN5Eigen8internal7is_sameIdfEE",
   "self_type" : "_ZTIN5Eigen8internal7is_sameIdfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTId", "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal7is_sameIfdEE",
   "name" : "Eigen::internal::is_same<float, double>",
   "referenced_type" : "_ZTIN5Eigen8internal7is_sameIfdEE",
   "self_type" : "_ZTIN5Eigen8internal7is_sameIfdEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIf", "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal7is_sameIffEE",
   "name" : "Eigen::internal::is_same<float, float>",
   "referenced_type" : "_ZTIN5Eigen8internal7is_sameIffEE",
   "self_type" : "_ZTIN5Eigen8internal7is_sameIffEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIf", "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "a",
     "referenced_type" : "_ZTIA2_c"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal7meta_noE",
   "name" : "Eigen::internal::meta_no",
   "referenced_type" : "_ZTIN5Eigen8internal7meta_noE",
   "self_type" : "_ZTIN5Eigen8internal7meta_noE",
   "size" : 2,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal8equal_opE",
   "name" : "Eigen::internal::equal_op",
   "referenced_type" : "_ZTIN5Eigen8internal8equal_opE",
   "self_type" : "_ZTIN5Eigen8internal8equal_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal8erf_implIdEE",
   "name" : "Eigen::internal::erf_impl<double>",
   "referenced_type" : "_ZTIN5Eigen8internal8erf_implIdEE",
   "self_type" : "_ZTIN5Eigen8internal8erf_implIdEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal8erf_implIfEE",
   "name" : "Eigen::internal::erf_impl<float>",
   "referenced_type" : "_ZTIN5Eigen8internal8erf_implIfEE",
   "self_type" : "_ZTIN5Eigen8internal8erf_implIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "a",
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal8meta_yesE",
   "name" : "Eigen::internal::meta_yes",
   "referenced_type" : "_ZTIN5Eigen8internal8meta_yesE",
   "self_type" : "_ZTIN5Eigen8internal8meta_yesE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal8pow_implIddLb0EEE",
   "name" : "Eigen::internal::pow_impl<double, double, false>",
   "referenced_type" : "_ZTIN5Eigen8internal8pow_implIddLb0EEE",
   "self_type" : "_ZTIN5Eigen8internal8pow_implIddLb0EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTId", "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal8pow_implIffLb0EEE",
   "name" : "Eigen::internal::pow_impl<float, float, false>",
   "referenced_type" : "_ZTIN5Eigen8internal8pow_implIffLb0EEE",
   "self_type" : "_ZTIN5Eigen8internal8pow_implIffLb0EEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/MathFunctions.h",
   "template_args" : [ "_ZTIf", "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal9BandShapeE",
   "name" : "Eigen::internal::BandShape",
   "referenced_type" : "_ZTIN5Eigen8internal9BandShapeE",
   "self_type" : "_ZTIN5Eigen8internal9BandShapeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/BandMatrix.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal9OrReducerE",
   "name" : "Eigen::internal::OrReducer",
   "referenced_type" : "_ZTIN5Eigen8internal9OrReducerE",
   "self_type" : "_ZTIN5Eigen8internal9OrReducerE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorFunctors.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTI19__simd128_float32_t"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen8internal9Packet2cfE",
   "name" : "Eigen::internal::Packet2cf",
   "referenced_type" : "_ZTIN5Eigen8internal9Packet2cfE",
   "self_type" : "_ZTIN5Eigen8internal9Packet2cfE",
   "size" : 16,
   "source_file" : "external/eigen/Eigen/src/Core/arch/NEON/Complex.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal9enable_ifILb1EdEE",
   "name" : "Eigen::internal::enable_if<true, double>",
   "referenced_type" : "_ZTIN5Eigen8internal9enable_ifILb1EdEE",
   "self_type" : "_ZTIN5Eigen8internal9enable_ifILb1EdEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal9enable_ifILb1EfEE",
   "name" : "Eigen::internal::enable_if<true, float>",
   "referenced_type" : "_ZTIN5Eigen8internal9enable_ifILb1EfEE",
   "self_type" : "_ZTIN5Eigen8internal9enable_ifILb1EfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal9erfc_implIdEE",
   "name" : "Eigen::internal::erfc_impl<double>",
   "referenced_type" : "_ZTIN5Eigen8internal9erfc_implIdEE",
   "self_type" : "_ZTIN5Eigen8internal9erfc_implIdEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal9erfc_implIfEE",
   "name" : "Eigen::internal::erfc_impl<float>",
   "referenced_type" : "_ZTIN5Eigen8internal9erfc_implIfEE",
   "self_type" : "_ZTIN5Eigen8internal9erfc_implIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal9lesser_opE",
   "name" : "Eigen::internal::lesser_op",
   "referenced_type" : "_ZTIN5Eigen8internal9lesser_opE",
   "self_type" : "_ZTIN5Eigen8internal9lesser_opE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/util/CXX11Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal9true_typeE",
   "name" : "Eigen::internal::true_type",
   "referenced_type" : "_ZTIN5Eigen8internal9true_typeE",
   "self_type" : "_ZTIN5Eigen8internal9true_typeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Meta.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen8internal9zeta_implIfEE",
   "name" : "Eigen::internal::zeta_impl<float>",
   "referenced_type" : "_ZTIN5Eigen8internal9zeta_implIfEE",
   "self_type" : "_ZTIN5Eigen8internal9zeta_implIfEE",
   "size" : 1,
   "source_file" : "external/eigen/unsupported/Eigen/src/SpecialFunctions/SpecialFunctionsImpl.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen9BandShapeE",
   "name" : "Eigen::BandShape",
   "referenced_type" : "_ZTIN5Eigen9BandShapeE",
   "self_type" : "_ZTIN5Eigen9BandShapeE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "first",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "second",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen9IndexPairIiEE",
   "name" : "Eigen::IndexPair<int>",
   "referenced_type" : "_ZTIN5Eigen9IndexPairIiEE",
   "self_type" : "_ZTIN5Eigen9IndexPairIiEE",
   "size" : 8,
   "source_file" : "external/eigen/unsupported/Eigen/CXX11/src/Tensor/TensorMeta.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen9MatrixXprE",
   "name" : "Eigen::MatrixXpr",
   "referenced_type" : "_ZTIN5Eigen9MatrixXprE",
   "self_type" : "_ZTIN5Eigen9MatrixXprE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/util/Constants.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsINS_4halfEEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen9NumTraitsINS_4halfEEE",
   "name" : "Eigen::NumTraits<Eigen::half>",
   "referenced_type" : "_ZTIN5Eigen9NumTraitsINS_4halfEEE",
   "self_type" : "_ZTIN5Eigen9NumTraitsINS_4halfEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/Half.h",
   "template_args" : [ "_ZTIN5Eigen4halfE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsINSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen9NumTraitsINSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEEE",
   "name" : "Eigen::NumTraits<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN5Eigen9NumTraitsINSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN5Eigen9NumTraitsINSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen9NumTraitsIbEE",
   "name" : "Eigen::NumTraits<bool>",
   "referenced_type" : "_ZTIN5Eigen9NumTraitsIbEE",
   "self_type" : "_ZTIN5Eigen9NumTraitsIbEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsIdEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen9NumTraitsIdEE",
   "name" : "Eigen::NumTraits<double>",
   "referenced_type" : "_ZTIN5Eigen9NumTraitsIdEE",
   "self_type" : "_ZTIN5Eigen9NumTraitsIdEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsIeEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen9NumTraitsIeEE",
   "name" : "Eigen::NumTraits<long double>",
   "referenced_type" : "_ZTIN5Eigen9NumTraitsIeEE",
   "self_type" : "_ZTIN5Eigen9NumTraitsIeEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsIfEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen9NumTraitsIfEE",
   "name" : "Eigen::NumTraits<float>",
   "referenced_type" : "_ZTIN5Eigen9NumTraitsIfEE",
   "self_type" : "_ZTIN5Eigen9NumTraitsIfEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen16GenericNumTraitsIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen9NumTraitsIiEE",
   "name" : "Eigen::NumTraits<int>",
   "referenced_type" : "_ZTIN5Eigen9NumTraitsIiEE",
   "self_type" : "_ZTIN5Eigen9NumTraitsIiEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN5Eigen9NumTraitsIvEE",
   "name" : "Eigen::NumTraits<void>",
   "referenced_type" : "_ZTIN5Eigen9NumTraitsIvEE",
   "self_type" : "_ZTIN5Eigen9NumTraitsIvEE",
   "size" : 1,
   "source_file" : "external/eigen/Eigen/src/Core/NumTraits.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "u",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen9half_impl4FP32E",
   "name" : "Eigen::half_impl::FP32",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN5Eigen9half_impl4FP32E",
   "self_type" : "_ZTIN5Eigen9half_impl4FP32E",
   "size" : 4,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/Half.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen9half_impl6__halfE",
   "name" : "Eigen::half_impl::__half",
   "referenced_type" : "_ZTIN5Eigen9half_impl6__halfE",
   "self_type" : "_ZTIN5Eigen9half_impl6__halfE",
   "size" : 2,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/Half.h"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN5Eigen9half_impl6__halfE"
    }
   ],
   "linker_set_key" : "_ZTIN5Eigen9half_impl9half_baseE",
   "name" : "Eigen::half_impl::half_base",
   "referenced_type" : "_ZTIN5Eigen9half_impl9half_baseE",
   "self_type" : "_ZTIN5Eigen9half_impl9half_baseE",
   "size" : 2,
   "source_file" : "external/eigen/Eigen/src/Core/arch/CUDA/Half.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogMessageE",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogMessageE",
   "self_type" : "_ZTIN7android4base10LogMessageE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "_ZTIN7android4base5LogIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogdLoggerE",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogdLoggerE",
   "self_type" : "_ZTIN7android4base10LogdLoggerE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "name" : "android::base::LogNullGuard<std::nullptr_t>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIDn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "name" : "android::base::LogNullGuard<const char *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "name" : "android::base::LogNullGuard<char *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" : [ "_ZTIPc" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "_ZTIKi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base13ErrnoRestorerE",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base13ErrnoRestorerE",
   "self_type" : "_ZTIN7android4base13ErrnoRestorerE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/errno_restorer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "_ZTIN7android4base11LogSeverityE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base17ScopedLogSeverityE",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base17ScopedLogSeverityE",
   "self_type" : "_ZTIN7android4base17ScopedLogSeverityE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA13_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:232:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN8ucontextUt_Ut_E"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_Ut_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)::(anonymous struct at bionic/libc/include/sys/ucontext.h:91:5)",
   "referenced_type" : "_ZTIN8ucontextUt_Ut_E",
   "self_type" : "_ZTIN8ucontextUt_Ut_E",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:89:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__buf_",
     "referenced_type" : "_ZTINSt3__115aligned_storageILj12ELj8EE4typeE"
    },
    {
     "access" : "private",
     "field_name" : "__f_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPNSt3__110__function6__baseIFvN7android4base5LogIdENS3_11LogSeverityEPKcS7_jS7_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function12__value_funcIFvN7android4base5LogIdENS3_11LogSeverityEPKcS7_jS7_EEE",
   "name" : "std::__function::__value_func<void (LogId, LogSeverity, const char *, const char *, unsigned int, const char *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110__function12__value_funcIFvN7android4base5LogIdENS3_11LogSeverityEPKcS7_jS7_EEE",
   "self_type" : "_ZTINSt3__110__function12__value_funcIFvN7android4base5LogIdENS3_11LogSeverityEPKcS7_jS7_EEE",
   "size" : 24,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIFvN7android4base5LogIdENS0_11LogSeverityEPKcS4_jS4_E" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__buf_",
     "referenced_type" : "_ZTINSt3__115aligned_storageILj12ELj8EE4typeE"
    },
    {
     "access" : "private",
     "field_name" : "__f_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPNSt3__110__function6__baseIFvPKcEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function12__value_funcIFvPKcEEE",
   "name" : "std::__function::__value_func<void (const char *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110__function12__value_funcIFvPKcEEE",
   "self_type" : "_ZTINSt3__110__function12__value_funcIFvPKcEEE",
   "size" : 24,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIFvPKcE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__110__function16__policy_storageE",
   "self_type" : "_ZTINSt3__110__function16__policy_storageE",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvN7android4base5LogIdENS3_11LogSeverityEPKcS7_jS7_EEE",
   "name" : "std::__function::__maybe_derive_from_unary_function<void (LogId, LogSeverity, const char *, const char *, unsigned int, const char *)>",
   "referenced_type" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvN7android4base5LogIdENS3_11LogSeverityEPKcS7_jS7_EEE",
   "self_type" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvN7android4base5LogIdENS3_11LogSeverityEPKcS7_jS7_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIFvN7android4base5LogIdENS0_11LogSeverityEPKcS4_jS4_E" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIPKcvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvPKcEEE",
   "name" : "std::__function::__maybe_derive_from_unary_function<void (const char *)>",
   "referenced_type" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvPKcEEE",
   "self_type" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvPKcEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIFvPKcE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvN7android4base5LogIdENS3_11LogSeverityEPKcS7_jS7_EEE",
   "name" : "std::__function::__maybe_derive_from_binary_function<void (LogId, LogSeverity, const char *, const char *, unsigned int, const char *)>",
   "referenced_type" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvN7android4base5LogIdENS3_11LogSeverityEPKcS7_jS7_EEE",
   "self_type" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvN7android4base5LogIdENS3_11LogSeverityEPKcS7_jS7_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIFvN7android4base5LogIdENS0_11LogSeverityEPKcS4_jS4_E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvPKcEEE",
   "name" : "std::__function::__maybe_derive_from_binary_function<void (const char *)>",
   "referenced_type" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvPKcEEE",
   "self_type" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvPKcEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIFvPKcE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "referenced_type" : "_ZTINSt3__110__function8__policyE",
   "self_type" : "_ZTINSt3__110__function8__policyE",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj0EEE",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj1EEE",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "_ZTINSt3__110__ignore_tIhEE",
   "self_type" : "_ZTINSt3__110__ignore_tIhEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000000>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000000EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000000000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx3600ELx1EEEEE",
   "name" : "std::__is_ratio<std::ratio<3600, 1>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx3600ELx1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx3600ELx1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx3600ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx60ELx1EEEEE",
   "name" : "std::__is_ratio<std::ratio<60, 1>>",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx60ELx1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx60ELx1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx60ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_13__invokable_rIvRN7android4base10LogdLoggerEJNS3_5LogIdENS3_11LogSeverityEPKcS9_jS9_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_17integral_constantIbLb1EEEJNS_13__invokable_rIvRN7android4base10LogdLoggerEJNS5_5LogIdENS5_11LogSeverityEPKcSB_jSB_EEEEEE",
   "name" : "std::__lazy_and<std::integral_constant<bool, true>, __invokable_r<void, LogdLogger &, LogId, LogSeverity, const char *, const char *, unsigned int, const char *>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_17integral_constantIbLb1EEEJNS_13__invokable_rIvRN7android4base10LogdLoggerEJNS5_5LogIdENS5_11LogSeverityEPKcSB_jSB_EEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_17integral_constantIbLb1EEEJNS_13__invokable_rIvRN7android4base10LogdLoggerEJNS5_5LogIdENS5_11LogSeverityEPKcSB_jSB_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_13__invokable_rIvRPFvPKcEJS3_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_17integral_constantIbLb1EEEJNS_13__invokable_rIvRPFvPKcEJS5_EEEEEE",
   "name" : "std::__lazy_and<std::integral_constant<bool, true>, __invokable_r<void, void (*&)(const char *), const char *>>",
   "referenced_type" : "_ZTINSt3__110__lazy_andINS_17integral_constantIbLb1EEEJNS_13__invokable_rIvRPFvPKcEJS5_EEEEEE",
   "self_type" : "_ZTINSt3__110__lazy_andINS_17integral_constantIbLb1EEEJNS_13__invokable_rIvRPFvPKcEJS5_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117integral_constantIbLb1EEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__loc_",
     "referenced_type" : "_ZTIP10__locale_t"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__time_getE",
   "name" : "std::__time_get",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110__time_getE",
   "self_type" : "_ZTINSt3__110__time_getE",
   "size" : 4,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__loc_",
     "referenced_type" : "_ZTIP10__locale_t"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__time_putE",
   "name" : "std::__time_put",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110__time_putE",
   "self_type" : "_ZTINSt3__110__time_putE",
   "size" : 4,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110ctype_baseE",
   "name" : "std::ctype_base",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110ctype_baseE",
   "self_type" : "_ZTINSt3__110ctype_baseE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__locale"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__val_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "__cat_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKNSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110error_codeE",
   "name" : "std::error_code",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110error_codeE",
   "self_type" : "_ZTINSt3__110error_codeE",
   "size" : 8,
   "source_file" : "external/libcxx/include/system_error"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "referenced_type" : "_ZTINSt3__110in_place_tE",
   "self_type" : "_ZTINSt3__110in_place_tE",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_base_ofINS_8ios_baseERNS_13basic_ostreamIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_base_of<std::ios_base, std::basic_ostream<char, std::char_traits<char>> &>",
   "referenced_type" : "_ZTINSt3__110is_base_ofINS_8ios_baseERNS_13basic_ostreamIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__110is_base_ofINS_8ios_baseERNS_13basic_ostreamIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18ios_baseE",
    "_ZTIRNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDiEE",
   "name" : "std::is_trivial<char32_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDiEE",
   "self_type" : "_ZTINSt3__110is_trivialIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDsEE",
   "name" : "std::is_trivial<char16_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDsEE",
   "self_type" : "_ZTINSt3__110is_trivialIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "referenced_type" : "_ZTINSt3__110is_trivialIcEE",
   "self_type" : "_ZTINSt3__110is_trivialIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIwEE",
   "self_type" : "_ZTINSt3__110is_trivialIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110less_equalIvEE",
   "name" : "std::less_equal<void>",
   "referenced_type" : "_ZTINSt3__110less_equalIvEE",
   "self_type" : "_ZTINSt3__110less_equalIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110logical_orIvEE",
   "name" : "std::logical_or<void>",
   "referenced_type" : "_ZTINSt3__110logical_orIvEE",
   "self_type" : "_ZTINSt3__110logical_orIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "field",
     "referenced_type" : "_ZTIA4_c"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110money_base7patternE",
   "name" : "std::money_base::pattern",
   "referenced_type" : "_ZTINSt3__110money_base7patternE",
   "self_type" : "_ZTINSt3__110money_base7patternE",
   "size" : 4,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110money_baseE",
   "name" : "std::money_base",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110money_baseE",
   "self_type" : "_ZTINSt3__110money_baseE",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIcLb0EEE",
   "name" : "std::moneypunct<char, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIcLb0EEE",
   "self_type" : "_ZTINSt3__110moneypunctIcLb0EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIcLb0EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb0EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb0EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIcLb1EEE",
   "name" : "std::moneypunct<char, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIcLb1EEE",
   "self_type" : "_ZTINSt3__110moneypunctIcLb1EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIcLb1EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb1EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb1EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIwLb0EEE",
   "name" : "std::moneypunct<wchar_t, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIwLb0EEE",
   "self_type" : "_ZTINSt3__110moneypunctIwLb0EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIwLb0EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb0EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb0EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIwLb1EEE",
   "name" : "std::moneypunct<wchar_t, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIwLb1EEE",
   "self_type" : "_ZTINSt3__110moneypunctIwLb1EEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIwLb1EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb1EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb1EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110multipliesIvEE",
   "name" : "std::multiplies<void>",
   "referenced_type" : "_ZTINSt3__110multipliesIvEE",
   "self_type" : "_ZTINSt3__110multipliesIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "referenced_type" : "_ZTINSt3__110owner_lessIvEE",
   "self_type" : "_ZTINSt3__110owner_lessIvEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE",
   "name" : "std::unique_ptr<android::base::LogMessageData, std::default_delete<android::base::LogMessageData>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIN7android4base14LogMessageDataE",
    "_ZTINSt3__114default_deleteIN7android4base14LogMessageDataEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPcPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIcPFvPvEEE",
   "name" : "std::unique_ptr<char, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIcPFvPvEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIcPFvPvEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIc", "_ZTIPFvPvE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPhPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIhPFvPvEEE",
   "name" : "std::unique_ptr<unsigned char, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIhPFvPvEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIhPFvPvEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIh", "_ZTIPFvPvE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPjPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIjPFvPvEEE",
   "name" : "std::unique_ptr<unsigned int, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIjPFvPvEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIjPFvPvEEE",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTIj", "_ZTIPFvPvE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__19enable_ifILb1EvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__invoke_ofIRN7android4base10LogdLoggerEJNS2_5LogIdENS2_11LogSeverityEPKcS8_jS8_EEE",
   "name" : "std::__invoke_of<android::base::LogdLogger &, LogId, LogSeverity, const char *, const char *, unsigned int, const char *>",
   "referenced_type" : "_ZTINSt3__111__invoke_ofIRN7android4base10LogdLoggerEJNS2_5LogIdENS2_11LogSeverityEPKcS8_jS8_EEE",
   "self_type" : "_ZTINSt3__111__invoke_ofIRN7android4base10LogdLoggerEJNS2_5LogIdENS2_11LogSeverityEPKcS8_jS8_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRN7android4base10LogdLoggerE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__19enable_ifILb1EvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__invoke_ofIRPFvPKcEJS2_EEE",
   "name" : "std::__invoke_of<void (*&)(const char *), const char *>",
   "referenced_type" : "_ZTINSt3__111__invoke_ofIRPFvPKcEJS2_EEE",
   "self_type" : "_ZTINSt3__111__invoke_ofIRPFvPKcEJS2_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIRPFvPKcE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_getIcEE",
   "name" : "std::__money_get<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_getIcEE",
   "self_type" : "_ZTINSt3__111__money_getIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_getIwEE",
   "name" : "std::__money_get<wchar_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_getIwEE",
   "self_type" : "_ZTINSt3__111__money_getIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_putIcEE",
   "name" : "std::__money_put<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_putIcEE",
   "self_type" : "_ZTINSt3__111__money_putIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_putIwEE",
   "name" : "std::__money_put<wchar_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_putIwEE",
   "self_type" : "_ZTINSt3__111__money_putIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEENS1_ILx1ELx1EEEEE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEENS1_ILx1ELx1EEEEE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEENS1_ILx1ELx1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILx1ELx1000000000EEE",
    "_ZTINSt3__15ratioILx1ELx1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1000000000>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILx1ELx1000000000EEE",
    "_ZTINSt3__15ratioILx1ELx1000000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000>, std::ratio<1, 1000000>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILx1ELx1000000EEE",
    "_ZTINSt3__15ratioILx1ELx1000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000>, std::ratio<1, 1000>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000EEE", "_ZTINSt3__15ratioILx1ELx1000EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1>, std::ratio<1, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1EEE", "_ZTINSt3__15ratioILx1ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx3600ELx1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<3600, 1>, std::ratio<3600, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx3600ELx1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx3600ELx1EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx3600ELx1EEE", "_ZTINSt3__15ratioILx3600ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx60ELx1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<60, 1>, std::ratio<60, 1>>",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx60ELx1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx60ELx1EEES2_EE",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx60ELx1EEE", "_ZTINSt3__15ratioILx60ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char32_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDiEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char16_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDsEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIdEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<double>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIdEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIdEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIdEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIjEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<unsigned int>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIjEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIjEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIjEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__nat>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__nat>>>>>",
   "referenced_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__i",
     "referenced_type" : "_ZTIPKd"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__wrap_iterIPKdEE",
   "name" : "std::__wrap_iter<const double *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__wrap_iterIPKdEE",
   "self_type" : "_ZTINSt3__111__wrap_iterIPKdEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPKd" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__i",
     "referenced_type" : "_ZTIPKj"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__wrap_iterIPKjEE",
   "name" : "std::__wrap_iter<const unsigned int *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__wrap_iterIPKjEE",
   "self_type" : "_ZTINSt3__111__wrap_iterIPKjEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPKj" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__i",
     "referenced_type" : "_ZTIPd"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__wrap_iterIPdEE",
   "name" : "std::__wrap_iter<double *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__wrap_iterIPdEE",
   "self_type" : "_ZTINSt3__111__wrap_iterIPdEE",
   "size" : 4,
   "source_file" : "external/libcxx/include/iterator",
   "template_args" : [ "_ZTIPd" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIDnEE",
   "name" : "std::add_pointer<nullptr_t>",
   "referenced_type" : "_ZTINSt3__111add_pointerIDnEE",
   "self_type" : "_ZTINSt3__111add_pointerIDnEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDn" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN7android4base14LogMessageDataENS_14default_deleteIS4_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<android::base::LogMessageData *, std::default_delete<android::base::LogMessageData>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN7android4base14LogMessageDataENS_14default_deleteIS4_EEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN7android4base14LogMessageDataENS_14default_deleteIS4_EEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<char *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPcPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<unsigned char *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPhPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjNS_9allocatorIjEEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<unsigned int *, std::allocator<unsigned int>>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjNS_9allocatorIjEEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjNS_9allocatorIjEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPjNS_9allocatorIjEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<unsigned int *, void (*)(void *)>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPjPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN7android4base14LogMessageDataEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<android::base::LogMessageData>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN7android4base14LogMessageDataEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN7android4base14LogMessageDataEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIN7android4base14LogMessageDataEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIjEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<unsigned int>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIjEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIjEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIjEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<void (*)(void *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN7android4base14LogMessageDataELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<android::base::LogMessageData *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN7android4base14LogMessageDataELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN7android4base14LogMessageDataELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPN7android4base14LogMessageDataELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<unsigned char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPhLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<unsigned int *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPjLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIN7android4base10LogdLoggerEEE",
   "name" : "std::add_pointer<android::base::LogdLogger>",
   "referenced_type" : "_ZTINSt3__111add_pointerIN7android4base10LogdLoggerEEE",
   "self_type" : "_ZTINSt3__111add_pointerIN7android4base10LogdLoggerEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN7android4base10LogdLoggerE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIN7android4base5LogIdEEE",
   "name" : "std::add_pointer<android::base::LogId>",
   "referenced_type" : "_ZTINSt3__111add_pointerIN7android4base5LogIdEEE",
   "self_type" : "_ZTINSt3__111add_pointerIN7android4base5LogIdEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN7android4base5LogIdE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t>>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN7android4base14LogMessageDataEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<android::base::LogMessageData>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN7android4base14LogMessageDataEEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN7android4base14LogMessageDataEEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIN7android4base14LogMessageDataEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIjEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<unsigned int>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIjEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIjEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIjEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<void (*)(void *), 1, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPN7android4base14LogMessageDataELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<android::base::LogMessageData *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPN7android4base14LogMessageDataELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPN7android4base14LogMessageDataELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIPN7android4base14LogMessageDataELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<unsigned char *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPhLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<unsigned int *, 0, false>>",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPjLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIPFvPKcEEE",
   "name" : "std::add_pointer<void (*)(const char *)>",
   "referenced_type" : "_ZTINSt3__111add_pointerIPFvPKcEEE",
   "self_type" : "_ZTINSt3__111add_pointerIPFvPKcEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPFvPKcE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIPKcEE",
   "name" : "std::add_pointer<const char *>",
   "referenced_type" : "_ZTINSt3__111add_pointerIPKcEE",
   "self_type" : "_ZTINSt3__111add_pointerIPKcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIeEE",
   "name" : "std::add_pointer<long double>",
   "referenced_type" : "_ZTINSt3__111add_pointerIeEE",
   "self_type" : "_ZTINSt3__111add_pointerIeEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIlEE",
   "name" : "std::add_pointer<long>",
   "referenced_type" : "_ZTINSt3__111add_pointerIlEE",
   "self_type" : "_ZTINSt3__111add_pointerIlEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIxEE",
   "name" : "std::add_pointer<long long>",
   "referenced_type" : "_ZTINSt3__111add_pointerIxEE",
   "self_type" : "_ZTINSt3__111add_pointerIxEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDiEE",
   "name" : "std::char_traits<char32_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDiEE",
   "self_type" : "_ZTINSt3__111char_traitsIDiEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDsEE",
   "name" : "std::char_traits<char16_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDsEE",
   "self_type" : "_ZTINSt3__111char_traitsIDsEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIcEE",
   "name" : "std::char_traits<char>",
   "referenced_type" : "_ZTINSt3__111char_traitsIcEE",
   "self_type" : "_ZTINSt3__111char_traitsIcEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIwEE",
   "name" : "std::char_traits<wchar_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIwEE",
   "self_type" : "_ZTINSt3__111char_traitsIwEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000000>>, duration<long double, ratio<1, 1000000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000>>, duration<long double, ratio<1, 1000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000>>, duration<long double, ratio<1, 1000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1>>, duration<long double, ratio<1, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<3600, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<3600, 1>>, duration<long double, ratio<3600, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<60, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<60, 1>>, duration<long double, ratio<60, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long, ratio<3600, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long, ratio<3600, 1>>, duration<long, ratio<3600, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long, ratio<60, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long, ratio<60, 1>>, duration<long, ratio<60, 1>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000000>>>",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEEE",
