#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_V6_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_V6_0_TYPES_H

#include <android/hardware/audio/common/6.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace audio {
namespace V6_0 {

// Forward declaration for forward reference support:
enum class Result : int32_t;
enum class AudioDrain : int32_t;
struct TimeSpec;
struct ParameterValue;
enum class MmapBufferFlag : uint32_t;
struct MmapBufferInfo;
struct MmapPosition;
enum class MessageQueueFlagBits : uint32_t;
struct AudioMicrophoneCoordinate;
enum class AudioMicrophoneChannelMapping : uint32_t;
enum class AudioMicrophoneLocation : uint32_t;
enum class AudioMicrophoneDirectionality : uint32_t;
struct AudioFrequencyResponsePoint;
struct MicrophoneInfo;
enum class MicrophoneDirection : int32_t;
enum class DualMonoMode : int32_t;
enum class TimestretchMode : int32_t;
enum class TimestretchFallbackMode : int32_t;
struct PlaybackRate;

enum class Result : int32_t {
    OK = 0,
    NOT_INITIALIZED = 1 /* ::android::hardware::audio::V6_0::Result.OK implicitly + 1 */,
    INVALID_ARGUMENTS = 2 /* ::android::hardware::audio::V6_0::Result.NOT_INITIALIZED implicitly + 1 */,
    INVALID_STATE = 3 /* ::android::hardware::audio::V6_0::Result.INVALID_ARGUMENTS implicitly + 1 */,
    /**
     * Methods marked as "Optional method" must return this result value
     * if the operation is not supported by HAL.
     */
    NOT_SUPPORTED = 4 /* ::android::hardware::audio::V6_0::Result.INVALID_STATE implicitly + 1 */,
};

enum class AudioDrain : int32_t {
    /**
     * drain() returns when all data has been played.
     */
    ALL = 0,
    /**
     * drain() returns a short time before all data from the current track has
     * been played to give time for gapless track switch.
     */
    EARLY_NOTIFY = 1 /* ::android::hardware::audio::V6_0::AudioDrain.ALL implicitly + 1 */,
};

/**
 * A substitute for POSIX timespec.
 */
struct TimeSpec final {
    uint64_t tvSec __attribute__ ((aligned(8)));
    uint64_t tvNSec __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::V6_0::TimeSpec, tvSec) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::TimeSpec, tvNSec) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V6_0::TimeSpec) == 16, "wrong size");
static_assert(__alignof(::android::hardware::audio::V6_0::TimeSpec) == 8, "wrong alignment");

struct ParameterValue final {
    ::android::hardware::hidl_string key __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string value __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::V6_0::ParameterValue, key) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::ParameterValue, value) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V6_0::ParameterValue) == 32, "wrong size");
static_assert(__alignof(::android::hardware::audio::V6_0::ParameterValue) == 8, "wrong alignment");

enum class MmapBufferFlag : uint32_t {
    NONE = 0u /* 0x0 */,
    /**
     * If the buffer can be securely shared to untrusted applications
     * through the AAudio exclusive mode.
     * Only set this flag if applications are restricted from accessing the
     * memory surrounding the audio data buffer by a kernel mechanism.
     * See Linux kernel's dma_buf.
     */
    APPLICATION_SHAREABLE = 1u /* 0x1 */,
};

/**
 * Mmap buffer descriptor returned by IStream.createMmapBuffer().
 * Used by streams opened in mmap mode.
 */
struct MmapBufferInfo final {
    /**
     * Mmap memory buffer
     */
    ::android::hardware::hidl_memory sharedMemory __attribute__ ((aligned(8)));
    /**
     * Total buffer size in frames
     */
    uint32_t bufferSizeFrames __attribute__ ((aligned(4)));
    /**
     * Transfer size granularity in frames
     */
    uint32_t burstSizeFrames __attribute__ ((aligned(4)));
    /**
     * Attributes describing the buffer.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::audio::V6_0::MmapBufferFlag> flags __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V6_0::MmapBufferInfo, sharedMemory) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MmapBufferInfo, bufferSizeFrames) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MmapBufferInfo, burstSizeFrames) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MmapBufferInfo, flags) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V6_0::MmapBufferInfo) == 56, "wrong size");
static_assert(__alignof(::android::hardware::audio::V6_0::MmapBufferInfo) == 8, "wrong alignment");

/**
 * Mmap buffer read/write position returned by IStream.getMmapPosition().
 * Used by streams opened in mmap mode.
 */
struct MmapPosition final {
    int64_t timeNanoseconds __attribute__ ((aligned(8)));
    int32_t positionFrames __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V6_0::MmapPosition, timeNanoseconds) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MmapPosition, positionFrames) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V6_0::MmapPosition) == 16, "wrong size");
static_assert(__alignof(::android::hardware::audio::V6_0::MmapPosition) == 8, "wrong alignment");

/**
 * The message queue flags used to synchronize reads and writes from
 * message queues used by StreamIn and StreamOut.
 */
enum class MessageQueueFlagBits : uint32_t {
    NOT_EMPTY = 1u /* 1 << 0 */,
    NOT_FULL = 2u /* 1 << 1 */,
};

/*
 * Microphone information
 *
 *
 *
 * A 3D point used to represent position or orientation of a microphone.
 *
 * Position: Coordinates of the microphone's capsule, in meters, from the
 * bottom-left-back corner of the bounding box of android device in natural
 * orientation (PORTRAIT for phones, LANDSCAPE for tablets, tvs, etc).
 * The orientation musth match the reported by the api Display.getRotation().
 *
 * Orientation: Normalized vector to signal the main orientation of the
 * microphone's capsule. Magnitude = sqrt(x^2 + y^2 + z^2) = 1
 */
struct AudioMicrophoneCoordinate final {
    float x __attribute__ ((aligned(4)));
    float y __attribute__ ((aligned(4)));
    float z __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V6_0::AudioMicrophoneCoordinate, x) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::AudioMicrophoneCoordinate, y) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::AudioMicrophoneCoordinate, z) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V6_0::AudioMicrophoneCoordinate) == 12, "wrong size");
static_assert(__alignof(::android::hardware::audio::V6_0::AudioMicrophoneCoordinate) == 4, "wrong alignment");

/**
 * Enum to identify the type of channel mapping for active microphones.
 * Used channels further identify if the microphone has any significative
 * process (e.g. High Pass Filtering, dynamic compression)
 * Simple processing as constant gain adjustment must be DIRECT.
 */
enum class AudioMicrophoneChannelMapping : uint32_t {
    UNUSED = 0u,
    /*
     * Channel not used
     */
    DIRECT = 1u,
    /*
     * Channel used and signal not processed
     */
    PROCESSED = 2u,
};

/**
 * Enum to identify locations of microphones in regards to the body of the
 * android device.
 */
enum class AudioMicrophoneLocation : uint32_t {
    UNKNOWN = 0u,
    MAINBODY = 1u,
    MAINBODY_MOVABLE = 2u,
    PERIPHERAL = 3u,
};

/**
 * Identifier to help group related microphones together
 * e.g. microphone arrays should belong to the same group
 */
typedef int32_t AudioMicrophoneGroup;

/**
 * Enum with standard polar patterns of microphones
 */
enum class AudioMicrophoneDirectionality : uint32_t {
    UNKNOWN = 0u,
    OMNI = 1u,
    BI_DIRECTIONAL = 2u,
    CARDIOID = 3u,
    HYPER_CARDIOID = 4u,
    SUPER_CARDIOID = 5u,
};

/**
 * A (frequency, level) pair. Used to represent frequency response.
 */
struct AudioFrequencyResponsePoint final {
    /**
     * In Hz
     */
    float frequency __attribute__ ((aligned(4)));
    /**
     * In dB
     */
    float level __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V6_0::AudioFrequencyResponsePoint, frequency) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::AudioFrequencyResponsePoint, level) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V6_0::AudioFrequencyResponsePoint) == 8, "wrong size");
static_assert(__alignof(::android::hardware::audio::V6_0::AudioFrequencyResponsePoint) == 4, "wrong alignment");

/**
 * Structure used by the HAL to describe microphone's characteristics
 * Used by StreamIn and Device
 */
struct MicrophoneInfo final {
    /**
     * Unique alphanumeric id for microphone. Guaranteed to be the same
     * even after rebooting.
     */
    ::android::hardware::hidl_string deviceId __attribute__ ((aligned(8)));
    /**
     * Device specific information
     */
    ::android::hardware::audio::common::V6_0::DeviceAddress deviceAddress __attribute__ ((aligned(8)));
    /**
     * Each element of the vector must describe the channel with the same
     *  index.
     */
    ::android::hardware::hidl_vec<::android::hardware::audio::V6_0::AudioMicrophoneChannelMapping> channelMapping __attribute__ ((aligned(8)));
    /**
     * Location of the microphone in regard to the body of the device
     */
    ::android::hardware::audio::V6_0::AudioMicrophoneLocation location __attribute__ ((aligned(4)));
    /**
     * Identifier to help group related microphones together
     *  e.g. microphone arrays should belong to the same group
     */
    int32_t group __attribute__ ((aligned(4)));
    /**
     * Index of this microphone within the group.
     *  (group, index) must be unique within the same device.
     */
    uint32_t indexInTheGroup __attribute__ ((aligned(4)));
    /**
     * Level in dBFS produced by a 1000 Hz tone at 94 dB SPL
     */
    float sensitivity __attribute__ ((aligned(4)));
    /**
     * Level in dB of the max SPL supported at 1000 Hz
     */
    float maxSpl __attribute__ ((aligned(4)));
    /**
     * Level in dB of the min SPL supported at 1000 Hz
     */
    float minSpl __attribute__ ((aligned(4)));
    /**
     * Standard polar pattern of the microphone
     */
    ::android::hardware::audio::V6_0::AudioMicrophoneDirectionality directionality __attribute__ ((aligned(4)));
    /**
     * Vector with ordered frequency responses (from low to high frequencies)
     *  with the frequency response of the microphone.
     *  Levels are in dB, relative to level at 1000 Hz
     */
    ::android::hardware::hidl_vec<::android::hardware::audio::V6_0::AudioFrequencyResponsePoint> frequencyResponse __attribute__ ((aligned(8)));
    /**
     * Position of the microphone's capsule in meters, from the
     *  bottom-left-back corner of the bounding box of device.
     */
    ::android::hardware::audio::V6_0::AudioMicrophoneCoordinate position __attribute__ ((aligned(4)));
    /**
     * Normalized point to signal the main orientation of the microphone's
     *  capsule. sqrt(x^2 + y^2 + z^2) = 1
     */
    ::android::hardware::audio::V6_0::AudioMicrophoneCoordinate orientation __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, deviceId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, deviceAddress) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, channelMapping) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, location) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, group) == 84, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, indexInTheGroup) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, sensitivity) == 92, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, maxSpl) == 96, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, minSpl) == 100, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, directionality) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, frequencyResponse) == 112, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, position) == 128, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::MicrophoneInfo, orientation) == 140, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V6_0::MicrophoneInfo) == 152, "wrong size");
static_assert(__alignof(::android::hardware::audio::V6_0::MicrophoneInfo) == 8, "wrong alignment");

/**
 * Constants used by the HAL to determine how to select microphones and process those inputs in
 * order to optimize for capture in the specified direction.
 *
 * MicrophoneDirection Constants are defined in MicrophoneDirection.java.
 */
enum class MicrophoneDirection : int32_t {
    /**
     * Don't do any directionality processing of the activated microphone(s).
     */
    UNSPECIFIED = 0,
    /**
     * Optimize capture for audio coming from the screen-side of the device.
     */
    FRONT = 1,
    /**
     * Optimize capture for audio coming from the side of the device opposite the screen.
     */
    BACK = 2,
    /**
     * Optimize capture for audio coming from an off-device microphone.
     */
    EXTERNAL = 3,
};

/*
 * Dual Mono handling is used when a stereo audio stream
 * contains separate audio content on the left and right channels.
 * Such information about the content of the stream may be found, for example,
 * in ITU T-REC-J.94-201610 A.6.2.3 Component descriptor.
 */
enum class DualMonoMode : int32_t {
    /**
     * Disable any Dual Mono presentation effect.
     *
     */
    OFF = 0,
    /**
     * This mode indicates that a stereo stream should be presented
     * with the left and right audio channels blended together
     * and delivered to both channels.
     *
     * Behavior for non-stereo streams is implementation defined.
     * A suggested guideline is that the left-right stereo symmetric
     * channels are pairwise blended, the other channels such as center
     * are left alone.
     */
    LR = 1,
    /**
     * This mode indicates that a stereo stream should be presented
     * with the left audio channel replicated into the right audio channel.
     *
     * Behavior for non-stereo streams is implementation defined.
     * A suggested guideline is that all channels with left-right
     * stereo symmetry will have the left channel position replicated
     * into the right channel position. The center channels (with no
     * left/right symmetry) or unbalanced channels are left alone.
     */
    LL = 2,
    /**
     * This mode indicates that a stereo stream should be presented
     * with the right audio channel replicated into the left audio channel.
     *
     * Behavior for non-stereo streams is implementation defined.
     * A suggested guideline is that all channels with left-right
     * stereo symmetry will have the right channel position replicated
     * into the left channel position. The center channels (with no
     * left/right symmetry) or unbalanced channels are left alone.
     */
    RR = 3,
};

/**
 * Algorithms used for timestretching (preserving pitch while playing audio
 * content at different speed).
 */
enum class TimestretchMode : int32_t {
    DEFAULT = 0,
    /**
     * Selects timestretch algorithm best suitable for voice (speech) content.
     */
    VOICE = 1,
};

/**
 * Behavior when the values for speed and / or pitch are out
 * of applicable range.
 */
enum class TimestretchFallbackMode : int32_t {
    /**
     * Play silence for parameter values that are out of range.
     */
    MUTE = 1,
    /**
     * Return an error while trying to set the parameters.
     */
    FAIL = 2,
};

/**
 * Parameters determining playback behavior. They are used to speed up or
 * slow down playback and / or change the tonal frequency of the audio content
 * (pitch).
 */
struct PlaybackRate final {
    /**
     * Speed factor (multiplier). Normal speed has the value of 1.0f.
     * Values less than 1.0f slow down playback, value greater than 1.0f
     * speed it up.
     */
    float speed __attribute__ ((aligned(4)));
    /**
     * Pitch factor (multiplier). Setting pitch value to 1.0f together
     * with changing playback speed preserves the pitch, this is often
     * called "timestretching." Setting the pitch value equal to speed produces
     * the same effect as playing audio content at different sampling rate.
     */
    float pitch __attribute__ ((aligned(4)));
    /**
     * Selects the algorithm used for timestretching (preserving pitch while
     * playing audio at different speed).
     */
    ::android::hardware::audio::V6_0::TimestretchMode timestretchMode __attribute__ ((aligned(4)));
    /**
     * Selects the behavior when the specified values for speed and / or pitch
     * are out of applicable range.
     */
    ::android::hardware::audio::V6_0::TimestretchFallbackMode fallbackMode __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::V6_0::PlaybackRate, speed) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::PlaybackRate, pitch) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::PlaybackRate, timestretchMode) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::audio::V6_0::PlaybackRate, fallbackMode) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::audio::V6_0::PlaybackRate) == 16, "wrong size");
static_assert(__alignof(::android::hardware::audio::V6_0::PlaybackRate) == 4, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::audio::V6_0::Result o);
static inline void PrintTo(::android::hardware::audio::V6_0::Result o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::audio::V6_0::Result lhs, const ::android::hardware::audio::V6_0::Result rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::audio::V6_0::Result rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::audio::V6_0::Result lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
