#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_COMMON_V6_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_COMMON_V6_0_TYPES_H

#include <android/hidl/safe_union/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace audio {
namespace common {
namespace V6_0 {

// Forward declaration for forward reference support:
enum class AudioHandleConsts : int32_t;
struct Uuid;
enum class AudioStreamType : int32_t;
enum class AudioSource : int32_t;
enum class AudioSessionConsts : int32_t;
enum class AudioFormat : uint32_t;
enum class FixedChannelCount : int32_t;
enum class AudioChannelMask : uint32_t;
enum class AudioMode : int32_t;
enum class AudioDevice : uint32_t;
struct DeviceAddress;
enum class AudioOutputFlag : int32_t;
enum class AudioInputFlag : int32_t;
enum class AudioUsage : int32_t;
enum class AudioContentType : uint32_t;
enum class AudioEncapsulationMode : int32_t;
struct AudioOffloadInfo;
struct AudioConfig;
struct PlaybackTrackMetadata;
struct SourceMetadata;
struct RecordTrackMetadata;
struct SinkMetadata;
enum class AudioGainMode : uint32_t;
struct AudioGain;
struct AudioGainConfig;
enum class AudioPortRole : int32_t;
enum class AudioPortType : int32_t;
struct AudioPortConfigDeviceExt;
struct AudioPortConfigSessionExt;
enum class AudioPortConfigMask : uint32_t;
struct AudioPortConfig;
struct AudioPortDeviceExt;
enum class AudioMixLatencyClass : int32_t;
struct AudioPortMixExt;
struct AudioPortSessionExt;
struct AudioPort;
struct ThreadInfo;

/*
 *  IDs and Handles
 *
 *
 *
 * Handle type for identifying audio sources and sinks.
 */
typedef int32_t AudioIoHandle;

/**
 * Audio hw module handle functions or structures referencing a module.
 */
typedef int32_t AudioModuleHandle;

/**
 * Each port has a unique ID or handle allocated by policy manager.
 */
typedef int32_t AudioPortHandle;

/**
 * Each patch is identified by a handle at the interface used to create that
 * patch. For instance, when a patch is created by the audio HAL, the HAL
 * allocates and returns a handle.  This handle is unique to a given audio HAL
 * hardware module.  But the same patch receives another system wide unique
 * handle allocated by the framework.  This unique handle is used for all
 * transactions inside the framework.
 */
typedef int32_t AudioPatchHandle;

/**
 * A HW synchronization source returned by the audio HAL.
 */
typedef uint32_t AudioHwSync;

/**
 * Each port has a unique ID or handle allocated by policy manager.
 */
enum class AudioHandleConsts : int32_t {
    AUDIO_IO_HANDLE_NONE = 0,
    AUDIO_MODULE_HANDLE_NONE = 0,
    AUDIO_PORT_HANDLE_NONE = 0,
    AUDIO_PATCH_HANDLE_NONE = 0,
};

/**
 * Commonly used structure for passing unique identifieds (UUID).
 * For the definition of UUID, refer to ITU-T X.667 spec.
 */
struct Uuid final {
    uint32_t timeLow __attribute__ ((aligned(4)));
    uint16_t timeMid __attribute__ ((aligned(2)));
    uint16_t versionAndTimeHigh __attribute__ ((aligned(2)));
    uint16_t variantAndClockSeqHigh __attribute__ ((aligned(2)));
    ::android::hardware::hidl_array<uint8_t, 6> node __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::Uuid, timeLow) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::Uuid, timeMid) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::Uuid, versionAndTimeHigh) == 6, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::Uuid, variantAndClockSeqHigh) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::Uuid, node) == 10, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::Uuid) == 16, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::Uuid) == 4, "wrong alignment");

/*
 *  Audio streams
 *
 *
 *
 * Audio stream type describing the intended use case of a stream.
 */
enum class AudioStreamType : int32_t {
    /**
     * Used to identify the default audio stream volume.
     */
    DEFAULT = -1 /* -1 */,
    /**
     * Specifies the minimum value for use in checks and loops.
     */
    MIN = 0,
    /**
     * Used to identify the volume of audio streams for phone calls.
     */
    VOICE_CALL = 0,
    /**
     * Used to identify the volume of audio streams for system sounds.
     */
    SYSTEM = 1,
    /**
     * Used to identify the volume of audio streams for the phone ring
     * and message alerts.
     */
    RING = 2,
    /**
     * Used to identify the volume of audio streams for music playback.
     */
    MUSIC = 3,
    /**
     * Used to identify the volume of audio streams for alarms.
     */
    ALARM = 4,
    /**
     * Used to identify the volume of audio streams for notifications.
     */
    NOTIFICATION = 5,
    /**
     * Used to identify the volume of audio streams for phone calls
     * when connected on bluetooth.
     */
    BLUETOOTH_SCO = 6,
    /**
     * Used to identify the volume of audio streams for enforced system
     * sounds in certain countries (e.g camera in Japan).
     */
    ENFORCED_AUDIBLE = 7,
    /**
     * Used to identify the volume of audio streams for DTMF tones.
     */
    DTMF = 8,
    /**
     * Used to identify the volume of audio streams exclusively transmitted
     * through the speaker (TTS) of the device.
     */
    TTS = 9,
    /**
     * Used to identify the volume of audio streams for accessibility prompts.
     */
    ACCESSIBILITY = 10,
    /**
     * Used to identify the volume of audio streams for virtual assistant.
     */
    ASSISTANT = 11,
};

enum class AudioSource : int32_t {
    /**
     * Default audio source.
     */
    DEFAULT = 0,
    /**
     * Microphone audio source.
     */
    MIC = 1,
    /**
     * Voice call uplink (Tx) audio source.
     */
    VOICE_UPLINK = 2,
    /**
     * Voice call downlink (Rx) audio source.
     */
    VOICE_DOWNLINK = 3,
    /**
     * Voice call uplink + downlink audio source.
     */
    VOICE_CALL = 4,
    /**
     * Microphone audio source tuned for video recording, with the same
     * orientation as the camera if available.
     */
    CAMCORDER = 5,
    /**
     * Microphone audio source tuned for voice recognition.
     */
    VOICE_RECOGNITION = 6,
    /**
     * Microphone audio source tuned for voice communications such as VoIP. It
     * will for instance take advantage of echo cancellation or automatic gain
     * control if available.
     */
    VOICE_COMMUNICATION = 7,
    /**
     * Source for the mix to be presented remotely. An example of remote
     * presentation is Wifi Display where a dongle attached to a TV can be used
     * to play the mix captured by this audio source.
     */
    REMOTE_SUBMIX = 8,
    /**
     * Source for unprocessed sound. Usage examples include level measurement
     * and raw signal analysis.
     */
    UNPROCESSED = 9,
    /**
     * Source for capturing audio meant to be processed in real time and played back for live
     * performance (e.g karaoke). The capture path will minimize latency and coupling with
     * playback path.
     */
    VOICE_PERFORMANCE = 10,
    /**
     * Source for an echo canceller to capture the reference signal to be cancelled.
     * The echo reference signal will be captured as close as possible to the DAC in order
     * to include all post processing applied to the playback path.
     */
    ECHO_REFERENCE = 1997,
    /**
     * Virtual source for the built-in FM tuner.
     */
    FM_TUNER = 1998,
    /**
     * Virtual source for the last captured hotword.
     */
    HOTWORD = 1999,
};

typedef int32_t AudioSession;

/**
 * Special audio session values.
 */
enum class AudioSessionConsts : int32_t {
    /**
     * Session for effects attached to a particular sink or source audio device
     * (e.g an effect only applied to a speaker)
     */
    DEVICE = -2 /* -2 */,
    /**
     * Session for effects attached to a particular output stream
     * (value must be less than 0)
     */
    OUTPUT_STAGE = -1 /* -1 */,
    /**
     * Session for effects applied to output mix. These effects can
     * be moved by audio policy manager to another output stream
     * (value must be 0)
     */
    OUTPUT_MIX = 0,
    /**
     * Application does not specify an explicit session ID to be used, and
     * requests a new session ID to be allocated. Corresponds to
     * AudioManager.AUDIO_SESSION_ID_GENERATE and
     * AudioSystem.AUDIO_SESSION_ALLOCATE.
     */
    ALLOCATE = 0,
    /**
     * For use with AudioRecord::start(), this indicates no trigger session.
     * It is also used with output tracks and patch tracks, which never have a
     * session.
     */
    NONE = 0,
};

/**
 * Audio format  is a 32-bit word that consists of:
 *   main format field (upper 8 bits)
 *   sub format field (lower 24 bits).
 *
 * The main format indicates the main codec type. The sub format field indicates
 * options and parameters for each format. The sub format is mainly used for
 * record to indicate for instance the requested bitrate or profile.  It can
 * also be used for certain formats to give informations not present in the
 * encoded audio stream (e.g. octet alignement for AMR).
 */
enum class AudioFormat : uint32_t {
    INVALID = 4294967295u /* 0xFFFFFFFFUL */,
    DEFAULT = 0u,
    PCM = 0u /* 0x00000000UL */,
    MP3 = 16777216u /* 0x01000000UL */,
    AMR_NB = 33554432u /* 0x02000000UL */,
    AMR_WB = 50331648u /* 0x03000000UL */,
    AAC = 67108864u /* 0x04000000UL */,
    /**
     * Deprecated, Use AAC_HE_V1
     */
    HE_AAC_V1 = 83886080u /* 0x05000000UL */,
    /**
     * Deprecated, Use AAC_HE_V2
     */
    HE_AAC_V2 = 100663296u /* 0x06000000UL */,
    VORBIS = 117440512u /* 0x07000000UL */,
    OPUS = 134217728u /* 0x08000000UL */,
    AC3 = 150994944u /* 0x09000000UL */,
    E_AC3 = 167772160u /* 0x0A000000UL */,
    DTS = 184549376u /* 0x0B000000UL */,
    DTS_HD = 201326592u /* 0x0C000000UL */,
    /**
     * IEC61937 is encoded audio wrapped in 16-bit PCM.
     */
    IEC61937 = 218103808u /* 0x0D000000UL */,
    DOLBY_TRUEHD = 234881024u /* 0x0E000000UL */,
    EVRC = 268435456u /* 0x10000000UL */,
    EVRCB = 285212672u /* 0x11000000UL */,
    EVRCWB = 301989888u /* 0x12000000UL */,
    EVRCNW = 318767104u /* 0x13000000UL */,
    AAC_ADIF = 335544320u /* 0x14000000UL */,
    WMA = 352321536u /* 0x15000000UL */,
    WMA_PRO = 369098752u /* 0x16000000UL */,
    AMR_WB_PLUS = 385875968u /* 0x17000000UL */,
    MP2 = 402653184u /* 0x18000000UL */,
    QCELP = 419430400u /* 0x19000000UL */,
    DSD = 436207616u /* 0x1A000000UL */,
    FLAC = 452984832u /* 0x1B000000UL */,
    ALAC = 469762048u /* 0x1C000000UL */,
    APE = 486539264u /* 0x1D000000UL */,
    AAC_ADTS = 503316480u /* 0x1E000000UL */,
    SBC = 520093696u /* 0x1F000000UL */,
    APTX = 536870912u /* 0x20000000UL */,
    APTX_HD = 553648128u /* 0x21000000UL */,
    AC4 = 570425344u /* 0x22000000UL */,
    LDAC = 587202560u /* 0x23000000UL */,
    /**
     * Dolby Metadata-enhanced Audio Transmission
     */
    MAT = 603979776u /* 0x24000000UL */,
    AAC_LATM = 620756992u /* 0x25000000UL */,
    CELT = 637534208u /* 0x26000000UL */,
    APTX_ADAPTIVE = 654311424u /* 0x27000000UL */,
    LHDC = 671088640u /* 0x28000000UL */,
    LHDC_LL = 687865856u /* 0x29000000UL */,
    APTX_TWSP = 704643072u /* 0x2A000000UL */,
    /**
     * Deprecated
     */
    MAIN_MASK = 4278190080u /* 0xFF000000UL */,
    SUB_MASK = 16777215u /* 0x00FFFFFFUL */,
    /*
     * Subformats
     */
    PCM_SUB_16_BIT = 1u /* 0x1 */,
    PCM_SUB_8_BIT = 2u /* 0x2 */,
    PCM_SUB_32_BIT = 3u /* 0x3 */,
    PCM_SUB_8_24_BIT = 4u /* 0x4 */,
    PCM_SUB_FLOAT = 5u /* 0x5 */,
    PCM_SUB_24_BIT_PACKED = 6u /* 0x6 */,
    MP3_SUB_NONE = 0u /* 0x0 */,
    AMR_SUB_NONE = 0u /* 0x0 */,
    AAC_SUB_MAIN = 1u /* 0x1 */,
    AAC_SUB_LC = 2u /* 0x2 */,
    AAC_SUB_SSR = 4u /* 0x4 */,
    AAC_SUB_LTP = 8u /* 0x8 */,
    AAC_SUB_HE_V1 = 16u /* 0x10 */,
    AAC_SUB_SCALABLE = 32u /* 0x20 */,
    AAC_SUB_ERLC = 64u /* 0x40 */,
    AAC_SUB_LD = 128u /* 0x80 */,
    AAC_SUB_HE_V2 = 256u /* 0x100 */,
    AAC_SUB_ELD = 512u /* 0x200 */,
    AAC_SUB_XHE = 768u /* 0x300 */,
    VORBIS_SUB_NONE = 0u /* 0x0 */,
    E_AC3_SUB_JOC = 1u /* 0x1 */,
    MAT_SUB_1_0 = 1u /* 0x1 */,
    MAT_SUB_2_0 = 2u /* 0x2 */,
    MAT_SUB_2_1 = 3u /* 0x3 */,
    /*
     * Aliases
     *
     *
     * note != AudioFormat.ENCODING_PCM_16BIT
     */
    PCM_16_BIT = 1u /* (PCM | PCM_SUB_16_BIT) */,
    /**
     * note != AudioFormat.ENCODING_PCM_8BIT
     */
    PCM_8_BIT = 2u /* (PCM | PCM_SUB_8_BIT) */,
    PCM_32_BIT = 3u /* (PCM | PCM_SUB_32_BIT) */,
    PCM_8_24_BIT = 4u /* (PCM | PCM_SUB_8_24_BIT) */,
    PCM_FLOAT = 5u /* (PCM | PCM_SUB_FLOAT) */,
    PCM_24_BIT_PACKED = 6u /* (PCM | PCM_SUB_24_BIT_PACKED) */,
    AAC_MAIN = 67108865u /* (AAC | AAC_SUB_MAIN) */,
    AAC_LC = 67108866u /* (AAC | AAC_SUB_LC) */,
    AAC_SSR = 67108868u /* (AAC | AAC_SUB_SSR) */,
    AAC_LTP = 67108872u /* (AAC | AAC_SUB_LTP) */,
    AAC_HE_V1 = 67108880u /* (AAC | AAC_SUB_HE_V1) */,
    AAC_SCALABLE = 67108896u /* (AAC | AAC_SUB_SCALABLE) */,
    AAC_ERLC = 67108928u /* (AAC | AAC_SUB_ERLC) */,
    AAC_LD = 67108992u /* (AAC | AAC_SUB_LD) */,
    AAC_HE_V2 = 67109120u /* (AAC | AAC_SUB_HE_V2) */,
    AAC_ELD = 67109376u /* (AAC | AAC_SUB_ELD) */,
    AAC_XHE = 67109632u /* (AAC | AAC_SUB_XHE) */,
    AAC_ADTS_MAIN = 503316481u /* (AAC_ADTS | AAC_SUB_MAIN) */,
    AAC_ADTS_LC = 503316482u /* (AAC_ADTS | AAC_SUB_LC) */,
    AAC_ADTS_SSR = 503316484u /* (AAC_ADTS | AAC_SUB_SSR) */,
    AAC_ADTS_LTP = 503316488u /* (AAC_ADTS | AAC_SUB_LTP) */,
    AAC_ADTS_HE_V1 = 503316496u /* (AAC_ADTS | AAC_SUB_HE_V1) */,
    AAC_ADTS_SCALABLE = 503316512u /* (AAC_ADTS | AAC_SUB_SCALABLE) */,
    AAC_ADTS_ERLC = 503316544u /* (AAC_ADTS | AAC_SUB_ERLC) */,
    AAC_ADTS_LD = 503316608u /* (AAC_ADTS | AAC_SUB_LD) */,
    AAC_ADTS_HE_V2 = 503316736u /* (AAC_ADTS | AAC_SUB_HE_V2) */,
    AAC_ADTS_ELD = 503316992u /* (AAC_ADTS | AAC_SUB_ELD) */,
    AAC_ADTS_XHE = 503317248u /* (AAC_ADTS | AAC_SUB_XHE) */,
    E_AC3_JOC = 167772161u /* (E_AC3 | E_AC3_SUB_JOC) */,
    MAT_1_0 = 603979777u /* (MAT | MAT_SUB_1_0) */,
    MAT_2_0 = 603979778u /* (MAT | MAT_SUB_2_0) */,
    MAT_2_1 = 603979779u /* (MAT | MAT_SUB_2_1) */,
    AAC_LATM_LC = 620756994u /* (AAC_LATM | AAC_SUB_LC) */,
    AAC_LATM_HE_V1 = 620757008u /* (AAC_LATM | AAC_SUB_HE_V1) */,
    AAC_LATM_HE_V2 = 620757248u /* (AAC_LATM | AAC_SUB_HE_V2) */,
};

/**
 * Usage of these values highlights places in the code that use 2- or 8- channel
 * assumptions.
 */
enum class FixedChannelCount : int32_t {
    FCC_2 = 2,
    FCC_8 = 8,
};

/**
 * A channel mask per se only defines the presence or absence of a channel, not
 * the order.
 *
 * The channel order convention is that channels are interleaved in order from
 * least significant channel mask bit to most significant channel mask bit,
 * with unused bits skipped. For example for stereo, LEFT would be first,
 * followed by RIGHT.
 * Any exceptions to this convention are noted at the appropriate API.
 *
 * AudioChannelMask is an opaque type and its internal layout should not be
 * assumed as it may change in the future.  Instead, always use functions
 * to examine it.
 *
 * These are the current representations:
 *
 *   REPRESENTATION_POSITION
 *     is a channel mask representation for position assignment.  Each low-order
 *     bit corresponds to the spatial position of a transducer (output), or
 *     interpretation of channel (input).  The user of a channel mask needs to
 *     know the context of whether it is for output or input.  The constants
 *     OUT_* or IN_* apply to the bits portion.  It is not permitted for no bits
 *     to be set.
 *
 *   REPRESENTATION_INDEX
 *     is a channel mask representation for index assignment.  Each low-order
 *     bit corresponds to a selected channel.  There is no platform
 *     interpretation of the various bits.  There is no concept of output or
 *     input.  It is not permitted for no bits to be set.
 *
 * All other representations are reserved for future use.
 *
 * Warning: current representation distinguishes between input and output, but
 * this will not the be case in future revisions of the platform. Wherever there
 * is an ambiguity between input and output that is currently resolved by
 * checking the channel mask, the implementer should look for ways to fix it
 * with additional information outside of the mask.
 */
enum class AudioChannelMask : uint32_t {
    /**
     * must be 0 for compatibility
     */
    REPRESENTATION_POSITION = 0u,
    /**
     * 1 is reserved for future use
     */
    REPRESENTATION_INDEX = 2u,
    /*
     * 3 is reserved for future use
     *
     *
     * These can be a complete value of AudioChannelMask
     */
    NONE = 0u /* 0x0 */,
    INVALID = 3221225472u /* 0xC0000000 */,
    /*
     * These can be the bits portion of an AudioChannelMask
     * with representation REPRESENTATION_POSITION.
     *
     *
     * output channels
     */
    OUT_FRONT_LEFT = 1u /* 0x1 */,
    OUT_FRONT_RIGHT = 2u /* 0x2 */,
    OUT_FRONT_CENTER = 4u /* 0x4 */,
    OUT_LOW_FREQUENCY = 8u /* 0x8 */,
    OUT_BACK_LEFT = 16u /* 0x10 */,
    OUT_BACK_RIGHT = 32u /* 0x20 */,
    OUT_FRONT_LEFT_OF_CENTER = 64u /* 0x40 */,
    OUT_FRONT_RIGHT_OF_CENTER = 128u /* 0x80 */,
    OUT_BACK_CENTER = 256u /* 0x100 */,
    OUT_SIDE_LEFT = 512u /* 0x200 */,
    OUT_SIDE_RIGHT = 1024u /* 0x400 */,
    OUT_TOP_CENTER = 2048u /* 0x800 */,
    OUT_TOP_FRONT_LEFT = 4096u /* 0x1000 */,
    OUT_TOP_FRONT_CENTER = 8192u /* 0x2000 */,
    OUT_TOP_FRONT_RIGHT = 16384u /* 0x4000 */,
    OUT_TOP_BACK_LEFT = 32768u /* 0x8000 */,
    OUT_TOP_BACK_CENTER = 65536u /* 0x10000 */,
    OUT_TOP_BACK_RIGHT = 131072u /* 0x20000 */,
    OUT_TOP_SIDE_LEFT = 262144u /* 0x40000 */,
    OUT_TOP_SIDE_RIGHT = 524288u /* 0x80000 */,
    /**
     * Haptic channel characteristics are specific to a device and
     * only used to play device specific resources (eg: ringtones).
     * The HAL can freely map A and B to haptic controllers, the
     * framework shall not interpret those values and forward them
     * from the device audio assets.
     */
    OUT_HAPTIC_A = 536870912u /* 0x20000000 */,
    OUT_HAPTIC_B = 268435456u /* 0x10000000 */,
    OUT_MONO = 1u /* OUT_FRONT_LEFT */,
    OUT_STEREO = 3u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT) */,
    OUT_2POINT1 = 11u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_LOW_FREQUENCY) */,
    OUT_2POINT0POINT2 = 786435u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_TOP_SIDE_LEFT | OUT_TOP_SIDE_RIGHT) */,
    OUT_2POINT1POINT2 = 786443u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_TOP_SIDE_LEFT | OUT_TOP_SIDE_RIGHT | OUT_LOW_FREQUENCY) */,
    OUT_3POINT0POINT2 = 786439u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_FRONT_CENTER | OUT_TOP_SIDE_LEFT | OUT_TOP_SIDE_RIGHT) */,
    OUT_3POINT1POINT2 = 786447u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_FRONT_CENTER | OUT_TOP_SIDE_LEFT | OUT_TOP_SIDE_RIGHT | OUT_LOW_FREQUENCY) */,
    OUT_QUAD = 51u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_BACK_LEFT | OUT_BACK_RIGHT) */,
    OUT_QUAD_BACK = 51u /* OUT_QUAD */,
    /**
     * like OUT_QUAD_BACK with *_SIDE_* instead of *_BACK_*
     */
    OUT_QUAD_SIDE = 1539u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_SIDE_LEFT | OUT_SIDE_RIGHT) */,
    OUT_SURROUND = 263u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_FRONT_CENTER | OUT_BACK_CENTER) */,
    OUT_PENTA = 55u /* (OUT_QUAD | OUT_FRONT_CENTER) */,
    OUT_5POINT1 = 63u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_FRONT_CENTER | OUT_LOW_FREQUENCY | OUT_BACK_LEFT | OUT_BACK_RIGHT) */,
    OUT_5POINT1_BACK = 63u /* OUT_5POINT1 */,
    /**
     * like OUT_5POINT1_BACK with *_SIDE_* instead of *_BACK_*
     */
    OUT_5POINT1_SIDE = 1551u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_FRONT_CENTER | OUT_LOW_FREQUENCY | OUT_SIDE_LEFT | OUT_SIDE_RIGHT) */,
    OUT_5POINT1POINT2 = 786495u /* (OUT_5POINT1 | OUT_TOP_SIDE_LEFT | OUT_TOP_SIDE_RIGHT) */,
    OUT_5POINT1POINT4 = 184383u /* (OUT_5POINT1 | OUT_TOP_FRONT_LEFT | OUT_TOP_FRONT_RIGHT | OUT_TOP_BACK_LEFT | OUT_TOP_BACK_RIGHT) */,
    OUT_6POINT1 = 319u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_FRONT_CENTER | OUT_LOW_FREQUENCY | OUT_BACK_LEFT | OUT_BACK_RIGHT | OUT_BACK_CENTER) */,
    /**
     * matches the correct AudioFormat.CHANNEL_OUT_7POINT1_SURROUND
     */
    OUT_7POINT1 = 1599u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_FRONT_CENTER | OUT_LOW_FREQUENCY | OUT_BACK_LEFT | OUT_BACK_RIGHT | OUT_SIDE_LEFT | OUT_SIDE_RIGHT) */,
    OUT_7POINT1POINT2 = 788031u /* (OUT_7POINT1 | OUT_TOP_SIDE_LEFT | OUT_TOP_SIDE_RIGHT) */,
    OUT_7POINT1POINT4 = 185919u /* (OUT_7POINT1 | OUT_TOP_FRONT_LEFT | OUT_TOP_FRONT_RIGHT | OUT_TOP_BACK_LEFT | OUT_TOP_BACK_RIGHT) */,
    OUT_MONO_HAPTIC_A = 536870913u /* (OUT_FRONT_LEFT | OUT_HAPTIC_A) */,
    OUT_STEREO_HAPTIC_A = 536870915u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_HAPTIC_A) */,
    OUT_HAPTIC_AB = 805306368u /* (OUT_HAPTIC_A | OUT_HAPTIC_B) */,
    OUT_MONO_HAPTIC_AB = 805306369u /* (OUT_FRONT_LEFT | OUT_HAPTIC_A | OUT_HAPTIC_B) */,
    OUT_STEREO_HAPTIC_AB = 805306371u /* (OUT_FRONT_LEFT | OUT_FRONT_RIGHT | OUT_HAPTIC_A | OUT_HAPTIC_B) */,
    /*
     * These are bits only, not complete values
     *
     *
     * input channels
     */
    IN_LEFT = 4u /* 0x4 */,
    IN_RIGHT = 8u /* 0x8 */,
    IN_FRONT = 16u /* 0x10 */,
    IN_BACK = 32u /* 0x20 */,
    IN_LEFT_PROCESSED = 64u /* 0x40 */,
    IN_RIGHT_PROCESSED = 128u /* 0x80 */,
    IN_FRONT_PROCESSED = 256u /* 0x100 */,
    IN_BACK_PROCESSED = 512u /* 0x200 */,
    IN_PRESSURE = 1024u /* 0x400 */,
    IN_X_AXIS = 2048u /* 0x800 */,
    IN_Y_AXIS = 4096u /* 0x1000 */,
    IN_Z_AXIS = 8192u /* 0x2000 */,
    IN_BACK_LEFT = 65536u /* 0x10000 */,
    IN_BACK_RIGHT = 131072u /* 0x20000 */,
    IN_CENTER = 262144u /* 0x40000 */,
    IN_LOW_FREQUENCY = 1048576u /* 0x100000 */,
    IN_TOP_LEFT = 2097152u /* 0x200000 */,
    IN_TOP_RIGHT = 4194304u /* 0x400000 */,
    IN_VOICE_UPLINK = 16384u /* 0x4000 */,
    IN_VOICE_DNLINK = 32768u /* 0x8000 */,
    IN_MONO = 16u /* IN_FRONT */,
    IN_STEREO = 12u /* (IN_LEFT | IN_RIGHT) */,
    IN_FRONT_BACK = 48u /* (IN_FRONT | IN_BACK) */,
    IN_6 = 252u /* (IN_LEFT | IN_RIGHT | IN_FRONT | IN_BACK | IN_LEFT_PROCESSED | IN_RIGHT_PROCESSED) */,
    IN_2POINT0POINT2 = 6291468u /* (IN_LEFT | IN_RIGHT | IN_TOP_LEFT | IN_TOP_RIGHT) */,
    IN_2POINT1POINT2 = 7340044u /* (IN_LEFT | IN_RIGHT | IN_TOP_LEFT | IN_TOP_RIGHT | IN_LOW_FREQUENCY) */,
    IN_3POINT0POINT2 = 6553612u /* (IN_LEFT | IN_CENTER | IN_RIGHT | IN_TOP_LEFT | IN_TOP_RIGHT) */,
    IN_3POINT1POINT2 = 7602188u /* (IN_LEFT | IN_CENTER | IN_RIGHT | IN_TOP_LEFT | IN_TOP_RIGHT | IN_LOW_FREQUENCY) */,
    IN_5POINT1 = 1507340u /* (IN_LEFT | IN_CENTER | IN_RIGHT | IN_BACK_LEFT | IN_BACK_RIGHT | IN_LOW_FREQUENCY) */,
    IN_VOICE_UPLINK_MONO = 16400u /* (IN_VOICE_UPLINK | IN_MONO) */,
    IN_VOICE_DNLINK_MONO = 32784u /* (IN_VOICE_DNLINK | IN_MONO) */,
    IN_VOICE_CALL_MONO = 49168u /* (IN_VOICE_UPLINK_MONO | IN_VOICE_DNLINK_MONO) */,
    COUNT_MAX = 30u,
    INDEX_HDR = 2147483648u /* REPRESENTATION_INDEX << COUNT_MAX */,
    INDEX_MASK_1 = 2147483649u /* INDEX_HDR | ((1 << 1) - 1) */,
    INDEX_MASK_2 = 2147483651u /* INDEX_HDR | ((1 << 2) - 1) */,
    INDEX_MASK_3 = 2147483655u /* INDEX_HDR | ((1 << 3) - 1) */,
    INDEX_MASK_4 = 2147483663u /* INDEX_HDR | ((1 << 4) - 1) */,
    INDEX_MASK_5 = 2147483679u /* INDEX_HDR | ((1 << 5) - 1) */,
    INDEX_MASK_6 = 2147483711u /* INDEX_HDR | ((1 << 6) - 1) */,
    INDEX_MASK_7 = 2147483775u /* INDEX_HDR | ((1 << 7) - 1) */,
    INDEX_MASK_8 = 2147483903u /* INDEX_HDR | ((1 << 8) - 1) */,
    INDEX_MASK_9 = 2147484159u /* INDEX_HDR | ((1 << 9) - 1) */,
    INDEX_MASK_10 = 2147484671u /* INDEX_HDR | ((1 << 10) - 1) */,
    INDEX_MASK_11 = 2147485695u /* INDEX_HDR | ((1 << 11) - 1) */,
    INDEX_MASK_12 = 2147487743u /* INDEX_HDR | ((1 << 12) - 1) */,
    INDEX_MASK_13 = 2147491839u /* INDEX_HDR | ((1 << 13) - 1) */,
    INDEX_MASK_14 = 2147500031u /* INDEX_HDR | ((1 << 14) - 1) */,
    INDEX_MASK_15 = 2147516415u /* INDEX_HDR | ((1 << 15) - 1) */,
    INDEX_MASK_16 = 2147549183u /* INDEX_HDR | ((1 << 16) - 1) */,
    INDEX_MASK_17 = 2147614719u /* INDEX_HDR | ((1 << 17) - 1) */,
    INDEX_MASK_18 = 2147745791u /* INDEX_HDR | ((1 << 18) - 1) */,
    INDEX_MASK_19 = 2148007935u /* INDEX_HDR | ((1 << 19) - 1) */,
    INDEX_MASK_20 = 2148532223u /* INDEX_HDR | ((1 << 20) - 1) */,
    INDEX_MASK_21 = 2149580799u /* INDEX_HDR | ((1 << 21) - 1) */,
    INDEX_MASK_22 = 2151677951u /* INDEX_HDR | ((1 << 22) - 1) */,
    INDEX_MASK_23 = 2155872255u /* INDEX_HDR | ((1 << 23) - 1) */,
    INDEX_MASK_24 = 2164260863u /* INDEX_HDR | ((1 << 24) - 1) */,
};

/**
 * Major modes for a mobile device. The current mode setting affects audio
 * routing.
 */
enum class AudioMode : int32_t {
    NORMAL = 0,
    RINGTONE = 1,
    /**
     * Calls handled by the telephony stack (Eg: PSTN).
     */
    IN_CALL = 2,
    /**
     * Calls handled by apps (Eg: Hangout).
     */
    IN_COMMUNICATION = 3,
    /**
     * Call screening in progress.
     */
    CALL_SCREEN = 4,
};

enum class AudioDevice : uint32_t {
    NONE = 0u /* 0x0 */,
    /**
     * reserved bits
     */
    BIT_IN = 2147483648u /* 0x80000000 */,
    BIT_DEFAULT = 1073741824u /* 0x40000000 */,
    /**
     * output devices
     */
    OUT_EARPIECE = 1u /* 0x1 */,
    OUT_SPEAKER = 2u /* 0x2 */,
    OUT_WIRED_HEADSET = 4u /* 0x4 */,
    OUT_WIRED_HEADPHONE = 8u /* 0x8 */,
    OUT_BLUETOOTH_SCO = 16u /* 0x10 */,
    OUT_BLUETOOTH_SCO_HEADSET = 32u /* 0x20 */,
    OUT_BLUETOOTH_SCO_CARKIT = 64u /* 0x40 */,
    OUT_BLUETOOTH_A2DP = 128u /* 0x80 */,
    OUT_BLUETOOTH_A2DP_HEADPHONES = 256u /* 0x100 */,
    OUT_BLUETOOTH_A2DP_SPEAKER = 512u /* 0x200 */,
    OUT_AUX_DIGITAL = 1024u /* 0x400 */,
    OUT_HDMI = 1024u /* OUT_AUX_DIGITAL */,
    /**
     * uses an analog connection (multiplexed over the USB pins for instance)
     */
    OUT_ANLG_DOCK_HEADSET = 2048u /* 0x800 */,
    OUT_DGTL_DOCK_HEADSET = 4096u /* 0x1000 */,
    /**
     * USB accessory mode: Android device is USB device and dock is USB host
     */
    OUT_USB_ACCESSORY = 8192u /* 0x2000 */,
    /**
     * USB host mode: Android device is USB host and dock is USB device
     */
    OUT_USB_DEVICE = 16384u /* 0x4000 */,
    OUT_REMOTE_SUBMIX = 32768u /* 0x8000 */,
    /**
     * Telephony voice TX path
     */
    OUT_TELEPHONY_TX = 65536u /* 0x10000 */,
    /**
     * Analog jack with line impedance detected
     */
    OUT_LINE = 131072u /* 0x20000 */,
    /**
     * HDMI Audio Return Channel
     */
    OUT_HDMI_ARC = 262144u /* 0x40000 */,
    /**
     * S/PDIF out
     */
    OUT_SPDIF = 524288u /* 0x80000 */,
    /**
     * FM transmitter out
     */
    OUT_FM = 1048576u /* 0x100000 */,
    /**
     * Line out for av devices
     */
    OUT_AUX_LINE = 2097152u /* 0x200000 */,
    /**
     * limited-output speaker device for acoustic safety
     */
    OUT_SPEAKER_SAFE = 4194304u /* 0x400000 */,
    OUT_IP = 8388608u /* 0x800000 */,
    /**
     * audio bus implemented by the audio system (e.g an MOST stereo channel)
     */
    OUT_BUS = 16777216u /* 0x1000000 */,
    OUT_PROXY = 33554432u /* 0x2000000 */,
    OUT_USB_HEADSET = 67108864u /* 0x4000000 */,
    OUT_HEARING_AID = 134217728u /* 0x8000000 */,
    OUT_ECHO_CANCELLER = 268435456u /* 0x10000000 */,
    OUT_DEFAULT = 1073741824u /* BIT_DEFAULT */,
    /**
     * input devices
     */
    IN_COMMUNICATION = 2147483649u /* BIT_IN | 0x1 */,
    IN_AMBIENT = 2147483650u /* BIT_IN | 0x2 */,
    IN_BUILTIN_MIC = 2147483652u /* BIT_IN | 0x4 */,
    IN_BLUETOOTH_SCO_HEADSET = 2147483656u /* BIT_IN | 0x8 */,
    IN_WIRED_HEADSET = 2147483664u /* BIT_IN | 0x10 */,
    IN_AUX_DIGITAL = 2147483680u /* BIT_IN | 0x20 */,
    IN_HDMI = 2147483680u /* IN_AUX_DIGITAL */,
    /**
     * Telephony voice RX path
     */
    IN_VOICE_CALL = 2147483712u /* BIT_IN | 0x40 */,
    IN_TELEPHONY_RX = 2147483712u /* IN_VOICE_CALL */,
    IN_BACK_MIC = 2147483776u /* BIT_IN | 0x80 */,
    IN_REMOTE_SUBMIX = 2147483904u /* BIT_IN | 0x100 */,
    IN_ANLG_DOCK_HEADSET = 2147484160u /* BIT_IN | 0x200 */,
    IN_DGTL_DOCK_HEADSET = 2147484672u /* BIT_IN | 0x400 */,
    IN_USB_ACCESSORY = 2147485696u /* BIT_IN | 0x800 */,
    IN_USB_DEVICE = 2147487744u /* BIT_IN | 0x1000 */,
    /**
     * FM tuner input
     */
    IN_FM_TUNER = 2147491840u /* BIT_IN | 0x2000 */,
    /**
     * TV tuner input
     */
    IN_TV_TUNER = 2147500032u /* BIT_IN | 0x4000 */,
    /**
     * Analog jack with line impedance detected
     */
    IN_LINE = 2147516416u /* BIT_IN | 0x8000 */,
    /**
     * S/PDIF in
     */
    IN_SPDIF = 2147549184u /* BIT_IN | 0x10000 */,
    IN_BLUETOOTH_A2DP = 2147614720u /* BIT_IN | 0x20000 */,
    IN_LOOPBACK = 2147745792u /* BIT_IN | 0x40000 */,
    IN_IP = 2148007936u /* BIT_IN | 0x80000 */,
    /**
     * audio bus implemented by the audio system (e.g an MOST stereo channel)
     */
    IN_BUS = 2148532224u /* BIT_IN | 0x100000 */,
    IN_PROXY = 2164260864u /* BIT_IN | 0x1000000 */,
    IN_USB_HEADSET = 2181038080u /* BIT_IN | 0x2000000 */,
    IN_BLUETOOTH_BLE = 2214592512u /* BIT_IN | 0x4000000 */,
    IN_ECHO_REFERENCE = 2415919104u /* BIT_IN | 0x10000000 */,
    IN_DEFAULT = 3221225472u /* BIT_IN | BIT_DEFAULT */,
};

/**
 * IEEE 802 MAC address.
 */
typedef ::android::hardware::hidl_array<uint8_t, 6> MacAddress;

/**
 * Specifies a device address in case when several devices of the same type
 * can be connected (e.g. BT A2DP, USB).
 */
struct DeviceAddress final {
    // Forward declaration for forward reference support:
    union Address;

    union Address final {
        // Forward declaration for forward reference support:
        struct Alsa;

        struct Alsa final {
            int32_t card __attribute__ ((aligned(4)));
            int32_t device __attribute__ ((aligned(4)));
        };

        static_assert(offsetof(::android::hardware::audio::common::V6_0::DeviceAddress::Address::Alsa, card) == 0, "wrong offset");
        static_assert(offsetof(::android::hardware::audio::common::V6_0::DeviceAddress::Address::Alsa, device) == 4, "wrong offset");
        static_assert(sizeof(::android::hardware::audio::common::V6_0::DeviceAddress::Address::Alsa) == 8, "wrong size");
        static_assert(__alignof(::android::hardware::audio::common::V6_0::DeviceAddress::Address::Alsa) == 4, "wrong alignment");

        ::android::hardware::hidl_array<uint8_t, 6> mac __attribute__ ((aligned(1)));
        ::android::hardware::hidl_array<uint8_t, 4> ipv4 __attribute__ ((aligned(1)));
        ::android::hardware::audio::common::V6_0::DeviceAddress::Address::Alsa alsa __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::audio::common::V6_0::DeviceAddress::Address, mac) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::common::V6_0::DeviceAddress::Address, ipv4) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::common::V6_0::DeviceAddress::Address, alsa) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::audio::common::V6_0::DeviceAddress::Address) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::audio::common::V6_0::DeviceAddress::Address) == 4, "wrong alignment");

    ::android::hardware::audio::common::V6_0::AudioDevice device __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::DeviceAddress::Address address __attribute__ ((aligned(4)));
    /**
     * Arbitrary BUS device unique address. Should not be interpreted by the framework.
     */
    ::android::hardware::hidl_string busAddress __attribute__ ((aligned(8)));
    /**
     * Arbitrary REMOTE_SUBMIX device unique address. Should not be interpreted by the HAL.
     */
    ::android::hardware::hidl_string rSubmixAddress __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::DeviceAddress, device) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::DeviceAddress, address) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::DeviceAddress, busAddress) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::DeviceAddress, rSubmixAddress) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::DeviceAddress) == 48, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::DeviceAddress) == 8, "wrong alignment");

/**
 * The audio output flags serve two purposes:
 *
 *  - when an AudioTrack is created they indicate a "wish" to be connected to an
 *    output stream with attributes corresponding to the specified flags;
 *
 *  - when present in an output profile descriptor listed for a particular audio
 *    hardware module, they indicate that an output stream can be opened that
 *    supports the attributes indicated by the flags.
 *
 * The audio policy manager will try to match the flags in the request
 * (when getOuput() is called) to an available output stream.
 */
enum class AudioOutputFlag : int32_t {
    NONE = 0 /* 0x0 */,
    DIRECT = 1 /* 0x1 */,
    PRIMARY = 2 /* 0x2 */,
    FAST = 4 /* 0x4 */,
    DEEP_BUFFER = 8 /* 0x8 */,
    COMPRESS_OFFLOAD = 16 /* 0x10 */,
    NON_BLOCKING = 32 /* 0x20 */,
    HW_AV_SYNC = 64 /* 0x40 */,
    TTS = 128 /* 0x80 */,
    RAW = 256 /* 0x100 */,
    SYNC = 512 /* 0x200 */,
    IEC958_NONAUDIO = 1024 /* 0x400 */,
    DIRECT_PCM = 8192 /* 0x2000 */,
    MMAP_NOIRQ = 16384 /* 0x4000 */,
    VOIP_RX = 32768 /* 0x8000 */,
    /**
     * preferred output for call music
     */
    INCALL_MUSIC = 65536 /* 0x10000 */,
};

/**
 * The audio input flags are analogous to audio output flags.
 * Currently they are used only when an AudioRecord is created,
 * to indicate a preference to be connected to an input stream with
 * attributes corresponding to the specified flags.
 */
enum class AudioInputFlag : int32_t {
    NONE = 0 /* 0x0 */,
    FAST = 1 /* 0x1 */,
    HW_HOTWORD = 2 /* 0x2 */,
    RAW = 4 /* 0x4 */,
    SYNC = 8 /* 0x8 */,
    MMAP_NOIRQ = 16 /* 0x10 */,
    VOIP_TX = 32 /* 0x20 */,
    HW_AV_SYNC = 64 /* 0x40 */,
    DIRECT = 128 /* 0x80 */,
};

enum class AudioUsage : int32_t {
    /**
     * Usage value to use when the usage is unknown.
     */
    UNKNOWN = 0,
    /**
     * Usage value to use when the usage is media, such as music, or movie
     * soundtracks.
     */
    MEDIA = 1,
    /**
     * Usage value to use when the usage is voice communications, such as
     * telephony or VoIP.
     */
    VOICE_COMMUNICATION = 2,
    /**
     * Usage value to use when the usage is in-call signalling, such as with
     * a "busy" beep, or DTMF tones.
     */
    VOICE_COMMUNICATION_SIGNALLING = 3,
    /**
     * Usage value to use when the usage is an alarm (e.g. wake-up alarm).
     */
    ALARM = 4,
    /**
     * Usage value to use when the usage is a generic notification.
     */
    NOTIFICATION = 5,
    /**
     * Usage value to use when the usage is telephony ringtone.
     */
    NOTIFICATION_TELEPHONY_RINGTONE = 6,
    /**
     * Usage value to use when the usage is for accessibility, such as with
     * a screen reader.
     */
    ASSISTANCE_ACCESSIBILITY = 11,
    /**
     * Usage value to use when the usage is driving or navigation directions.
     */
    ASSISTANCE_NAVIGATION_GUIDANCE = 12,
    /**
     * Usage value to use when the usage is sonification, such as  with user
     * interface sounds.
     */
    ASSISTANCE_SONIFICATION = 13,
    /**
     * Usage value to use when the usage is for game audio.
     */
    GAME = 14,
    /**
     * Usage value to use when feeding audio to the platform and replacing
     * "traditional" audio source, such as audio capture devices.
     */
    VIRTUAL_SOURCE = 15,
    /**
     * Usage value to use for audio responses to user queries, audio
     * instructions or help utterances.
     */
    ASSISTANT = 16,
    /**
     * Usage value to use for assistant voice interaction with remote caller
     * on Cell and VoIP calls.
     */
    CALL_ASSISTANT = 17,
    /**
     * Usage value to use when the usage is an emergency.
     */
    EMERGENCY = 1000,
    /**
     * Usage value to use when the usage is a safety sound.
     */
    SAFETY = 1001,
    /**
     * Usage value to use when the usage is a vehicle status.
     */
    VEHICLE_STATUS = 1002,
    /**
     * Usage value to use when the usage is an announcement.
     */
    ANNOUNCEMENT = 1003,
};

/**
 * Type of audio generated by an application.
 */
enum class AudioContentType : uint32_t {
    /**
     * Content type value to use when the content type is unknown, or other than
     * the ones defined.
     */
    UNKNOWN = 0u,
    /**
     * Content type value to use when the content type is speech.
     */
    SPEECH = 1u,
    /**
     * Content type value to use when the content type is music.
     */
    MUSIC = 2u,
    /**
     * Content type value to use when the content type is a soundtrack,
     * typically accompanying a movie or TV program.
     */
    MOVIE = 3u,
    /**
     * Content type value to use when the content type is a sound used to
     * accompany a user action, such as a beep or sound effect expressing a key
     * click, or event, such as the type of a sound for a bonus being received
     * in a game. These sounds are mostly synthesized or short Foley sounds.
     */
    SONIFICATION = 4u,
};

/**
 * Encapsulation mode used for sending audio compressed data.
 */
enum class AudioEncapsulationMode : int32_t {
    /**
     * No encapsulation mode for metadata.
     */
    NONE = 0,
    /**
     * Elementary stream payload with metadata
     */
    ELEMENTARY_STREAM = 1,
    /**
     *  Handle-based payload with metadata
     */
    HANDLE = 2,
};

/**
 * Additional information about the stream passed to hardware decoders.
 */
struct AudioOffloadInfo final {
    uint32_t sampleRateHz __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::audio::common::V6_0::AudioChannelMask> channelMask __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioFormat format __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioStreamType streamType __attribute__ ((aligned(4)));
    uint32_t bitRatePerSecond __attribute__ ((aligned(4)));
    int64_t durationMicroseconds __attribute__ ((aligned(8)));
    bool hasVideo __attribute__ ((aligned(1)));
    bool isStreaming __attribute__ ((aligned(1)));
    uint32_t bitWidth __attribute__ ((aligned(4)));
    uint32_t bufferSize __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioUsage usage __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioEncapsulationMode encapsulationMode __attribute__ ((aligned(4)));
    int32_t contentId __attribute__ ((aligned(4)));
    int32_t syncId __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, sampleRateHz) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, channelMask) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, format) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, streamType) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, bitRatePerSecond) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, durationMicroseconds) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, hasVideo) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, isStreaming) == 33, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, bitWidth) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, bufferSize) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, usage) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, encapsulationMode) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, contentId) == 52, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioOffloadInfo, syncId) == 56, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioOffloadInfo) == 64, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioOffloadInfo) == 8, "wrong alignment");

/**
 * Commonly used audio stream configuration parameters.
 */
struct AudioConfig final {
    uint32_t sampleRateHz __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::audio::common::V6_0::AudioChannelMask> channelMask __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioFormat format __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioOffloadInfo offloadInfo __attribute__ ((aligned(8)));
    uint64_t frameCount __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioConfig, sampleRateHz) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioConfig, channelMask) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioConfig, format) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioConfig, offloadInfo) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioConfig, frameCount) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioConfig) == 88, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioConfig) == 8, "wrong alignment");

/**
 * Metadata of a playback track for a StreamOut.
 */
struct PlaybackTrackMetadata final {
    ::android::hardware::audio::common::V6_0::AudioUsage usage __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioContentType contentType __attribute__ ((aligned(4)));
    /**
     * Positive linear gain applied to the track samples. 0 being muted and 1 is no attenuation,
     * 2 means double amplification...
     * Must not be negative.
     */
    float gain __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::PlaybackTrackMetadata, usage) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::PlaybackTrackMetadata, contentType) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::PlaybackTrackMetadata, gain) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::PlaybackTrackMetadata) == 12, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::PlaybackTrackMetadata) == 4, "wrong alignment");

/**
 * Metadatas of the source of a StreamOut.
 */
struct SourceMetadata final {
    ::android::hardware::hidl_vec<::android::hardware::audio::common::V6_0::PlaybackTrackMetadata> tracks __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::SourceMetadata, tracks) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::SourceMetadata) == 16, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::SourceMetadata) == 8, "wrong alignment");

/**
 * Metadata of a record track for a StreamIn.
 */
struct RecordTrackMetadata final {
    // Forward declaration for forward reference support:
    struct Destination;

    /**
     * Indicates the destination of an input stream, can be left unspecified.
     */
    struct Destination final {
        enum class hidl_discriminator : uint8_t {
            unspecified = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            device = 1,  // ::android::hardware::audio::common::V6_0::DeviceAddress
        };

        Destination();
        ~Destination();
        Destination(Destination&&);
        Destination(const Destination&);
        Destination& operator=(Destination&&);
        Destination& operator=(const Destination&);

        void unspecified(const ::android::hidl::safe_union::V1_0::Monostate&);
        void unspecified(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& unspecified();
        const ::android::hidl::safe_union::V1_0::Monostate& unspecified() const;

        void device(const ::android::hardware::audio::common::V6_0::DeviceAddress&);
        void device(::android::hardware::audio::common::V6_0::DeviceAddress&&);
        ::android::hardware::audio::common::V6_0::DeviceAddress& device();
        const ::android::hardware::audio::common::V6_0::DeviceAddress& device() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::audio::common::V6_0::RecordTrackMetadata::Destination, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate unspecified __attribute__ ((aligned(1)));
            ::android::hardware::audio::common::V6_0::DeviceAddress device __attribute__ ((aligned(8)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::audio::common::V6_0::RecordTrackMetadata::Destination::hidl_union) == 48, "wrong size");
        static_assert(__alignof(::android::hardware::audio::common::V6_0::RecordTrackMetadata::Destination::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::audio::common::V6_0::RecordTrackMetadata::Destination::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::audio::common::V6_0::RecordTrackMetadata::Destination::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::audio::common::V6_0::RecordTrackMetadata::Destination) == 56, "wrong size");
    static_assert(__alignof(::android::hardware::audio::common::V6_0::RecordTrackMetadata::Destination) == 8, "wrong alignment");

    ::android::hardware::audio::common::V6_0::AudioSource source __attribute__ ((aligned(4)));
    /**
     * Positive linear gain applied to the track samples. 0 being muted and 1 is no attenuation,
     * 2 means double amplification...
     * Must not be negative.
     */
    float gain __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::RecordTrackMetadata::Destination destination __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::RecordTrackMetadata, source) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::RecordTrackMetadata, gain) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::RecordTrackMetadata, destination) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::RecordTrackMetadata) == 64, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::RecordTrackMetadata) == 8, "wrong alignment");

/**
 * Metadatas of the sink of a StreamIn.
 */
struct SinkMetadata final {
    ::android::hardware::hidl_vec<::android::hardware::audio::common::V6_0::RecordTrackMetadata> tracks __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::SinkMetadata, tracks) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::SinkMetadata) == 16, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::SinkMetadata) == 8, "wrong alignment");

/*
 *  Volume control
 *
 *
 *
 * Type of gain control exposed by an audio port.
 */
enum class AudioGainMode : uint32_t {
    JOINT = 1u /* 0x1 */,
    CHANNELS = 2u /* 0x2 */,
    RAMP = 4u /* 0x4 */,
};

/**
 * An audio_gain struct is a representation of a gain stage.
 * A gain stage is always attached to an audio port.
 */
struct AudioGain final {
    ::android::hardware::hidl_bitfield<::android::hardware::audio::common::V6_0::AudioGainMode> mode __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::audio::common::V6_0::AudioChannelMask> channelMask __attribute__ ((aligned(4)));
    int32_t minValue __attribute__ ((aligned(4)));
    int32_t maxValue __attribute__ ((aligned(4)));
    int32_t defaultValue __attribute__ ((aligned(4)));
    uint32_t stepValue __attribute__ ((aligned(4)));
    uint32_t minRampMs __attribute__ ((aligned(4)));
    uint32_t maxRampMs __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGain, mode) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGain, channelMask) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGain, minValue) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGain, maxValue) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGain, defaultValue) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGain, stepValue) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGain, minRampMs) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGain, maxRampMs) == 28, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioGain) == 32, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioGain) == 4, "wrong alignment");

/**
 * The gain configuration structure is used to get or set the gain values of a
 * given port.
 */
struct AudioGainConfig final {
    int32_t index __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioGainMode mode __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioChannelMask channelMask __attribute__ ((aligned(4)));
    /**
     * 4 = sizeof(AudioChannelMask),
     * 8 is not "FCC_8", so it won't need to be changed for > 8 channels.
     * Gain values in millibels for each channel ordered from LSb to MSb in
     * channel mask. The number of values is 1 in joint mode or
     * popcount(channel_mask).
     */
    ::android::hardware::hidl_array<int32_t, 32 /* 4 * 8 */> values __attribute__ ((aligned(4)));
    uint32_t rampDurationMs __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGainConfig, index) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGainConfig, mode) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGainConfig, channelMask) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGainConfig, values) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioGainConfig, rampDurationMs) == 140, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioGainConfig) == 144, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioGainConfig) == 4, "wrong alignment");

/*
 *  Routing control
 *
 *
 *
 * Types defined here are used to describe an audio source or sink at internal
 * framework interfaces (audio policy, patch panel) or at the audio HAL.
 * Sink and sources are grouped in a concept of audio port representing an
 * audio end point at the edge of the system managed by the module exposing
 * the interface.
 *
 *
 * Audio port role: either source or sink
 */
enum class AudioPortRole : int32_t {
    NONE = 0,
    SOURCE = 1 /* ::android::hardware::audio::common::V6_0::AudioPortRole.NONE implicitly + 1 */,
    SINK = 2 /* ::android::hardware::audio::common::V6_0::AudioPortRole.SOURCE implicitly + 1 */,
};

/**
 * Audio port type indicates if it is a session (e.g AudioTrack), a mix (e.g
 * PlaybackThread output) or a physical device (e.g OUT_SPEAKER)
 */
enum class AudioPortType : int32_t {
    NONE = 0,
    DEVICE = 1 /* ::android::hardware::audio::common::V6_0::AudioPortType.NONE implicitly + 1 */,
    MIX = 2 /* ::android::hardware::audio::common::V6_0::AudioPortType.DEVICE implicitly + 1 */,
    SESSION = 3 /* ::android::hardware::audio::common::V6_0::AudioPortType.MIX implicitly + 1 */,
};

/**
 * Extension for audio port configuration structure when the audio port is a
 * hardware device.
 */
struct AudioPortConfigDeviceExt final {
    int32_t hwModule __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioDevice type __attribute__ ((aligned(4)));
    ::android::hardware::hidl_array<uint8_t, 32> address __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfigDeviceExt, hwModule) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfigDeviceExt, type) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfigDeviceExt, address) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioPortConfigDeviceExt) == 40, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioPortConfigDeviceExt) == 4, "wrong alignment");

/**
 * Extension for audio port configuration structure when the audio port is an
 * audio session.
 */
struct AudioPortConfigSessionExt final {
    int32_t session __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfigSessionExt, session) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioPortConfigSessionExt) == 4, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioPortConfigSessionExt) == 4, "wrong alignment");

/**
 * Flags indicating which fields are to be considered in AudioPortConfig.
 */
enum class AudioPortConfigMask : uint32_t {
    SAMPLE_RATE = 1u /* 0x1 */,
    CHANNEL_MASK = 2u /* 0x2 */,
    FORMAT = 4u /* 0x4 */,
    GAIN = 8u /* 0x8 */,
};

/**
 * Audio port configuration structure used to specify a particular configuration
 * of an audio port.
 */
struct AudioPortConfig final {
    // Forward declaration for forward reference support:
    union Ext;

    union Ext final {
        // Forward declaration for forward reference support:
        struct AudioPortConfigMixExt;

        struct AudioPortConfigMixExt final {
            // Forward declaration for forward reference support:
            union UseCase;

            union UseCase final {
                ::android::hardware::audio::common::V6_0::AudioStreamType stream __attribute__ ((aligned(4)));
                ::android::hardware::audio::common::V6_0::AudioSource source __attribute__ ((aligned(4)));
            };

            static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext::AudioPortConfigMixExt::UseCase, stream) == 0, "wrong offset");
            static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext::AudioPortConfigMixExt::UseCase, source) == 0, "wrong offset");
            static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext::AudioPortConfigMixExt::UseCase) == 4, "wrong size");
            static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext::AudioPortConfigMixExt::UseCase) == 4, "wrong alignment");

            int32_t hwModule __attribute__ ((aligned(4)));
            int32_t ioHandle __attribute__ ((aligned(4)));
            ::android::hardware::audio::common::V6_0::AudioPortConfig::Ext::AudioPortConfigMixExt::UseCase useCase __attribute__ ((aligned(4)));
        };

        static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext::AudioPortConfigMixExt, hwModule) == 0, "wrong offset");
        static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext::AudioPortConfigMixExt, ioHandle) == 4, "wrong offset");
        static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext::AudioPortConfigMixExt, useCase) == 8, "wrong offset");
        static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext::AudioPortConfigMixExt) == 12, "wrong size");
        static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext::AudioPortConfigMixExt) == 4, "wrong alignment");

        ::android::hardware::audio::common::V6_0::AudioPortConfigDeviceExt device __attribute__ ((aligned(4)));
        ::android::hardware::audio::common::V6_0::AudioPortConfig::Ext::AudioPortConfigMixExt mix __attribute__ ((aligned(4)));
        ::android::hardware::audio::common::V6_0::AudioPortConfigSessionExt session __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext, device) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext, mix) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext, session) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext) == 40, "wrong size");
    static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioPortConfig::Ext) == 4, "wrong alignment");

    int32_t id __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::audio::common::V6_0::AudioPortConfigMask> configMask __attribute__ ((aligned(4)));
    uint32_t sampleRateHz __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::audio::common::V6_0::AudioChannelMask> channelMask __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioFormat format __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioGainConfig gain __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioPortType type __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioPortRole role __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioPortConfig::Ext ext __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig, id) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig, configMask) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig, sampleRateHz) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig, channelMask) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig, format) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig, gain) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig, type) == 164, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig, role) == 168, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortConfig, ext) == 172, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioPortConfig) == 212, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioPortConfig) == 4, "wrong alignment");

/**
 * Extension for audio port structure when the audio port is a hardware device.
 */
struct AudioPortDeviceExt final {
    int32_t hwModule __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioDevice type __attribute__ ((aligned(4)));
    /**
     * 32 byte string identifying the port.
     */
    ::android::hardware::hidl_array<uint8_t, 32> address __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortDeviceExt, hwModule) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortDeviceExt, type) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortDeviceExt, address) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioPortDeviceExt) == 40, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioPortDeviceExt) == 4, "wrong alignment");

/**
 * Latency class of the audio mix.
 */
enum class AudioMixLatencyClass : int32_t {
    LOW = 0,
    NORMAL = 1 /* ::android::hardware::audio::common::V6_0::AudioMixLatencyClass.LOW implicitly + 1 */,
};

struct AudioPortMixExt final {
    int32_t hwModule __attribute__ ((aligned(4)));
    int32_t ioHandle __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioMixLatencyClass latencyClass __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortMixExt, hwModule) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortMixExt, ioHandle) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortMixExt, latencyClass) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioPortMixExt) == 12, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioPortMixExt) == 4, "wrong alignment");

/**
 * Extension for audio port structure when the audio port is an audio session.
 */
struct AudioPortSessionExt final {
    int32_t session __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPortSessionExt, session) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioPortSessionExt) == 4, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioPortSessionExt) == 4, "wrong alignment");

struct AudioPort final {
    // Forward declaration for forward reference support:
    union Ext;

    union Ext final {
        ::android::hardware::audio::common::V6_0::AudioPortDeviceExt device __attribute__ ((aligned(4)));
        ::android::hardware::audio::common::V6_0::AudioPortMixExt mix __attribute__ ((aligned(4)));
        ::android::hardware::audio::common::V6_0::AudioPortSessionExt session __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort::Ext, device) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort::Ext, mix) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort::Ext, session) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioPort::Ext) == 40, "wrong size");
    static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioPort::Ext) == 4, "wrong alignment");

    int32_t id __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioPortRole role __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<uint32_t> sampleRates __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::hidl_bitfield<::android::hardware::audio::common::V6_0::AudioChannelMask>> channelMasks __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::audio::common::V6_0::AudioFormat> formats __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::audio::common::V6_0::AudioGain> gains __attribute__ ((aligned(8)));
    ::android::hardware::audio::common::V6_0::AudioPortConfig activeConfig __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioPortType type __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioPort::Ext ext __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort, id) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort, role) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort, name) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort, sampleRates) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort, channelMasks) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort, formats) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort, gains) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort, activeConfig) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort, type) == 300, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::AudioPort, ext) == 304, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::AudioPort) == 344, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::AudioPort) == 8, "wrong alignment");

struct ThreadInfo final {
    int64_t pid __attribute__ ((aligned(8)));
    int64_t tid __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::common::V6_0::ThreadInfo, pid) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::common::V6_0::ThreadInfo, tid) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::audio::common::V6_0::ThreadInfo) == 16, "wrong size");
static_assert(__alignof(::android::hardware::audio::common::V6_0::ThreadInfo) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::audio::common::V6_0::AudioHandleConsts o);
static inline void PrintTo(::android::hardware::audio::common::V6_0::AudioHandleConsts o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::audio::common::V6_0::AudioHandleConsts lhs, const ::android::hardware::audio::common::V6_0::AudioHandleConsts rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::audio::common::V6_0::AudioHandleConsts rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::audio::common::V6_0::AudioHandleConsts lhs, const int32_t rhs) {
