#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_MAPPER_V4_0_IMAPPER_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_MAPPER_V4_0_IMAPPER_H

#include <android/hardware/graphics/common/1.2/types.h>
#include <android/hardware/graphics/mapper/4.0/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace graphics {
namespace mapper {
namespace V4_0 {

struct IMapper : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.graphics.mapper@4.0::IMapper"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    struct BufferDescriptorInfo;
    struct Rect;
    struct MetadataType;
    struct MetadataTypeDescription;
    struct MetadataDump;
    struct BufferDump;

    struct BufferDescriptorInfo final {
        /**
         * The name of the buffer. Useful for debugging/tracing.
         */
        ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
        /**
         * The width specifies how many columns of pixels must be in the
         * allocated buffer, but does not necessarily represent the offset in
         * columns between the same column in adjacent rows. The rows may be
         * padded.
         */
        uint32_t width __attribute__ ((aligned(4)));
        /**
         * The height specifies how many rows of pixels must be in the
         * allocated buffer.
         */
        uint32_t height __attribute__ ((aligned(4)));
        /**
         * The number of image layers that must be in the allocated buffer.
         */
        uint32_t layerCount __attribute__ ((aligned(4)));
        /**
         * Buffer pixel format.
         */
        ::android::hardware::graphics::common::V1_2::PixelFormat format __attribute__ ((aligned(4)));
        /**
         * Buffer usage mask; valid flags can be found in the definition of
         * BufferUsage.
         */
        ::android::hardware::hidl_bitfield<::android::hardware::graphics::common::V1_2::BufferUsage> usage __attribute__ ((aligned(8)));
        /**
         * The size in bytes of the reserved region associated with the buffer.
         * See getReservedRegion for more information.
         */
        uint64_t reservedSize __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDescriptorInfo, name) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDescriptorInfo, width) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDescriptorInfo, height) == 20, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDescriptorInfo, layerCount) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDescriptorInfo, format) == 28, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDescriptorInfo, usage) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDescriptorInfo, reservedSize) == 40, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDescriptorInfo) == 48, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDescriptorInfo) == 8, "wrong alignment");

    struct Rect final {
        int32_t left __attribute__ ((aligned(4)));
        int32_t top __attribute__ ((aligned(4)));
        int32_t width __attribute__ ((aligned(4)));
        int32_t height __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::Rect, left) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::Rect, top) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::Rect, width) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::Rect, height) == 12, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::mapper::V4_0::IMapper::Rect) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::mapper::V4_0::IMapper::Rect) == 4, "wrong alignment");

    /**
     * Description for get(...), set(...) and getFromBufferDescriptorInfo(...)
     *
     * ------------ Overview -----------------------------------
     * Gralloc 4 adds support for getting and setting buffer metadata on a buffer.
     *
     * To get buffer metadata, the client passes in a buffer handle and a token that
     * represents the type of buffer metadata they would like to get. IMapper returns
     * a byte stream that contains the buffer metadata. To set the buffer metadata, the
     * client passes in a buffer handle and a token that represents the type of buffer
     * metadata they would like to set and a byte stream that contains the buffer metadata
     * they are setting.
     *
     * Buffer metadata is global for a buffer. When the metadata is set on the buffer
     * in a process, the updated metadata should be available to all other processes.
     * Please see "Storing and Propagating Metadata" below for more details.
     *
     * The getter and setter functions have been optimized for easy vendor extension.
     * They do not require a formal HIDL extension to add support for getting and setting
     * vendor defined buffer metadata. In order to allow easy extension, the types used
     * here are not typical HIDL types. See "Buffer Metadata Token" and
     * "Buffer Metadata Stream" below for more details.
     *
     * ------------ Storing and Propagating Metadata -----------
     * Buffer metadata must be global. Any changes to the metadata must be propagated
     * to all other processes immediately. Vendors may chose how they would like support
     * this functionality.
     *
     * We recommend supporting this functionality by allocating an extra page of shared
     * memory and storing it in the buffer's native_handle_t. The buffer metadata can
     * be stored in the extra page of shared memory. Set operations are automatically
     * propagated to all other processes.
     *
     * ------------ Buffer Metadata Synchronization ------------
     * There are no explicit buffer metadata synchronization primitives. Many devices
     * before gralloc 4 already support getting and setting of global buffer metadata
     * with no explicit synchronization primitives. Adding synchronization primitives
     * would just add unnecessary complexity.
     *
     * The general rule is if a process has permission to write to a buffer, they
     * have permission to write to the buffer's metadata. If a process has permission
     * to read from a buffer, they have permission to read the buffer's metadata.
     *
     * There is one exception to this rule. Fences CANNOT be used to protect a buffer's
     * metadata. A process should finish writing to a buffer's metadata before
     * sending the buffer to another process that will read or write to the buffer.
     * This exception is needed because sometimes userspace needs to read the
     * buffer's metadata before the buffer's contents are ready.
     *
     * As a simple example: an app renders to a buffer and then displays the buffer.
     * In this example when the app renders to the buffer, both the buffer and its
     * metadata need to be updated. The app's process queues up its work on the GPU
     * and gets back an acquire fence. The app's process must update the buffer's
     * metadata before enqueuing the buffer to SurfaceFlinger. The app process CANNOT
     * update the buffer's metadata after enqueuing the buffer. When HardwareComposer
     * receives the buffer, it is immediately safe to read the buffer's metadata
     * and use it to program the display driver. To read the buffer's contents,
     * display driver must still wait on the acquire fence.
     *
     * ------------ Buffer Metadata Token ----------------------
     * In order to allow arbitrary vendor defined metadata, we could not use a
     * HIDL enum as the buffer metadata token. Extending a HIDL enum requires a full
     * HIDL extension. We also could not use a simple non-HIDL enum because vendor
     * defined enums from different vendors could collide. Instead we have defined
     * a struct that has a string representing the enum type and an int that
     * represents the enum value. The string protects different enum values from
     * colliding.
     *
     * The token struct (MetadataType) is defined as a HIDL struct since it
     * is passed into a HIDL function. The standard buffer metadata types are NOT
     * defined as a HIDL enum because it would have required a new IMapper version
     * just to add future standard buffer metadata types. By putting the enum in the
     * stable AIDL (hardware/interfaces/graphics/common/aidl/android/hardware/
     * graphics/common/StandardMetadataType.aidl), vendors will be able to optionally
     * choose to support future standard buffer metadata types without upgrading
     * HIDL versions. For more information see the description of "struct MetadataType".
     *
     * ------------ Buffer Metadata Stream ---------------------
     * The buffer metadata is get and set as a byte stream (vec<uint8_t>). By getting
     * and setting buffer metadata as a byte stream, vendors can use the standard
     * getters and setter functions defined here. Vendors do NOT need to add their own
     * getters and setter functions for each new type of buffer metadata.
     *
     * Converting buffer metadata into a byte stream can be non-trivial. For the standard
     * buffer metadata types defined in StandardMetadataType.aidl, there are also
     * support functions that will encode the buffer metadata into a byte stream
     * and decode the buffer metadata from a byte stream. We STRONGLY recommend using
     * these support functions. The framework will use them when getting and setting
     * metadata. The support functions are defined in
     * frameworks/native/libs/gralloc/types/include/gralloctypes/Gralloc4.h.
     *
     *
     * MetadataType represents the different types of buffer metadata that could be
     * associated with a buffer. It is used by IMapper to help get and set buffer metadata
     * on the buffer's native handle.
     *
     * Standard buffer metadata will have the name field set to
     * "android.hardware.graphics.common.StandardMetadataType" and will contain values
     * from StandardMetadataType.aidl.
     *
     * This struct should be "extended" by devices that use a proprietary or non-standard
     * buffer metadata. To extend the struct, first create a custom @VendorStability vendor
     * AIDL interface that defines the new type(s) you would like to support. Set the
     * struct's name field to the custom aidl interface's name
     * (eg. "vendor.mycompanyname.graphics.common.MetadataType"). Set the struct's value
     * field to the custom @VendorStabilty vendor AIDL interface.
     *
     * Each company should create their own StandardMetadataType.aidl extension. The name
     * field prevents values from different companies from colliding.
     */
    struct MetadataType final {
        ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
        int64_t value __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataType, name) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataType, value) == 16, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataType) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataType) == 8, "wrong alignment");

    struct MetadataTypeDescription final {
        ::android::hardware::graphics::mapper::V4_0::IMapper::MetadataType metadataType __attribute__ ((aligned(8)));
        /**
         * description should contain a string representation of the MetadataType.
         *
         * For example: "MyExampleMetadataType is a 64-bit timestamp in nanoseconds
         * that indicates when a buffer is decoded. It is set by the media HAL after
         * a buffer is decoded. It is used by the display HAL for hardware
         * synchronization".
         *
         * This field is required for any non-StandardMetadataTypes.
         */
        ::android::hardware::hidl_string description __attribute__ ((aligned(8)));
        /**
         * isGettable represents if the MetadataType can be get.
         */
        bool isGettable __attribute__ ((aligned(1)));
        /**
         * isSettable represents if the MetadataType can be set.
         */
        bool isSettable __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataTypeDescription, metadataType) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataTypeDescription, description) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataTypeDescription, isGettable) == 40, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataTypeDescription, isSettable) == 41, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataTypeDescription) == 48, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataTypeDescription) == 8, "wrong alignment");

    struct MetadataDump final {
        /**
         * The type of metadata being dumped.
         */
        ::android::hardware::graphics::mapper::V4_0::IMapper::MetadataType metadataType __attribute__ ((aligned(8)));
        /**
         * The byte stream representation of the metadata. If the metadata is not
         * gettable, the vector must be empty.
         */
        ::android::hardware::hidl_vec<uint8_t> metadata __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataDump, metadataType) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataDump, metadata) == 24, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataDump) == 40, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::mapper::V4_0::IMapper::MetadataDump) == 8, "wrong alignment");

    struct BufferDump final {
        /**
         * A vector of all the metadata that is being dumped for a particular buffer.
         */
        ::android::hardware::hidl_vec<::android::hardware::graphics::mapper::V4_0::IMapper::MetadataDump> metadataDump __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDump, metadataDump) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDump) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::mapper::V4_0::IMapper::BufferDump) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Return callback for createDescriptor
     */
    using createDescriptor_cb = std::function<void(::android::hardware::graphics::mapper::V4_0::Error error, const ::android::hardware::hidl_vec<uint8_t>& descriptor)>;
    /**
     * Creates a buffer descriptor. The descriptor can be used with IAllocator
     * to allocate buffers.
     *
     * Since the buffer descriptor fully describes a buffer, any device
     * dependent or device independent checks must be performed here whenever
     * possible. When layered buffers are not supported, this function must
     * return `UNSUPPORTED` if `description.layers` is great than 1. This
     * function may return `UNSUPPORTED` if `description.reservedSize` is
