#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GNSS_V1_0_IAGNSSRIL_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GNSS_V1_0_IAGNSSRIL_H

#include <android/hardware/gnss/1.0/IAGnssRilCallback.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace gnss {
namespace V1_0 {

/**
 * Extended interface for AGNSS RIL support. An Assisted GNSS Radio Interface
 * Layer interface allows the GNSS chipset to request radio interface layer
 * information from Android platform. Examples of such information are reference
 * location, unique subscriber ID, phone number string and network availability changes.
 */
struct IAGnssRil : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.gnss@1.0::IAGnssRil"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class SetIDType : uint8_t;
    enum class NetworkType : uint8_t;
    enum class AGnssRefLocationType : uint8_t;
    struct AGnssRefLocationCellID;
    struct AGnssRefLocation;

    enum class SetIDType : uint8_t {
        NONE = 0,
        IMSI = 1,
        MSISDM = 2,
    };

    enum class NetworkType : uint8_t {
        MOBILE = 0,
        WIFI = 1,
        MMS = 2,
        SUPL = 3,
        DUN = 4,
        HIPRI = 5,
        WIMAX = 6,
    };

    enum class AGnssRefLocationType : uint8_t {
        GSM_CELLID = 1,
        UMTS_CELLID = 2,
        LTE_CELLID = 4,
    };

    /**
     * CellID for 2G, 3G and LTE, used in AGNSS.
     */
    struct AGnssRefLocationCellID final {
        ::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationType type __attribute__ ((aligned(1)));
        /**
         * Mobile Country Code.
         */
        uint16_t mcc __attribute__ ((aligned(2)));
        /**
         * Mobile Network Code .
         */
        uint16_t mnc __attribute__ ((aligned(2)));
        /**
         * Location Area Code in 2G, 3G and LTE. In 3G lac is discarded. In LTE,
         * lac is populated with tac, to ensure that we don't break old clients that
         * might rely in the old (wrong) behavior.
         */
        uint16_t lac __attribute__ ((aligned(2)));
        /**
         * Cell id in 2G. Utran Cell id in 3G. Cell Global Id EUTRA in LTE.
         */
        uint32_t cid __attribute__ ((aligned(4)));
        /**
         * Tracking Area Code in LTE.
         */
        uint16_t tac __attribute__ ((aligned(2)));
        /**
         * Physical Cell id in LTE (not used in 2G and 3G)
         */
        uint16_t pcid __attribute__ ((aligned(2)));
    };

    static_assert(offsetof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationCellID, type) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationCellID, mcc) == 2, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationCellID, mnc) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationCellID, lac) == 6, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationCellID, cid) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationCellID, tac) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationCellID, pcid) == 14, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationCellID) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationCellID) == 4, "wrong alignment");

    /**
     * Represents ref locations
     */
    struct AGnssRefLocation final {
        ::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationType type __attribute__ ((aligned(1)));
        ::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocationCellID cellID __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocation, type) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocation, cellID) == 4, "wrong offset");
    static_assert(sizeof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocation) == 20, "wrong size");
    static_assert(__alignof(::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocation) == 4, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Opens the AGNSS interface and provides the callback routines
     * to the implementation of this interface.
     *
     * @param callback Interface for AGnssRil callbacks.
     */
    virtual ::android::hardware::Return<void> setCallback(const ::android::sp<::android::hardware::gnss::V1_0::IAGnssRilCallback>& callback) = 0;

    /**
     * Sets the reference location.
     *
     * @param agnssReflocation AGNSS reference location CellID.
     */
    virtual ::android::hardware::Return<void> setRefLocation(const ::android::hardware::gnss::V1_0::IAGnssRil::AGnssRefLocation& agnssReflocation) = 0;

    /**
     * Sets the SET ID.
     *
