{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA56_h",
   "name" : "unsigned char [56]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA56_h",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA60_j",
   "name" : "unsigned int [60]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA60_j",
   "size" : 240,
   "source_file" : "external/boringssl/src/include/openssl/aes.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPPKvS1_E",
   "name" : "int (const void **, const void **)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPPKv"
    },
    {
     "referenced_type" : "_ZTIPPKv"
    }
   ],
   "referenced_type" : "_ZTIFiPPKvS1_E",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPPKvS1_E",
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPhmE",
   "name" : "int (unsigned char *, unsigned long)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPh"
    },
    {
     "referenced_type" : "_ZTIm"
    }
   ],
   "referenced_type" : "_ZTIFiPhmE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPhmE",
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFivE",
   "name" : "int (void)",
   "referenced_type" : "_ZTIFivE",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFivE",
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFvPKviE",
   "name" : "void (const void *, int)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPKv"
    },
    {
     "referenced_type" : "_ZTIi"
    }
   ],
   "referenced_type" : "_ZTIFvPKviE",
   "return_type" : "_ZTIv",
   "self_type" : "_ZTIFvPKviE",
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFvPKvidE",
   "name" : "void (const void *, int, double)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPKv"
    },
    {
     "referenced_type" : "_ZTIi"
    },
    {
     "referenced_type" : "_ZTId"
    }
   ],
   "referenced_type" : "_ZTIFvPKvidE",
   "return_type" : "_ZTIv",
   "self_type" : "_ZTIFvPKvidE",
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFvvE",
   "name" : "void (void)",
   "referenced_type" : "_ZTIFvvE",
   "return_type" : "_ZTIv",
   "self_type" : "_ZTIFvvE",
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  }
 ],
 "functions" :
 [
  {
   "function_name" : "RAND_enable_fork_unsafe_buffering",
   "linker_set_key" : "RAND_enable_fork_unsafe_buffering",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIi"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  }
 ],
 "global_vars" : [],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP13stack_st_void",
   "name" : "stack_st_void *",
   "referenced_type" : "_ZTI13stack_st_void",
   "self_type" : "_ZTIP13stack_st_void",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP20CRYPTO_dynlock_value",
   "name" : "CRYPTO_dynlock_value *",
   "referenced_type" : "_ZTI20CRYPTO_dynlock_value",
   "self_type" : "_ZTIP20CRYPTO_dynlock_value",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPPKvS1_E",
   "name" : "int (*)(const void **, const void **)",
   "referenced_type" : "_ZTIFiPPKvS1_E",
   "self_type" : "_ZTIPFiPPKvS1_E",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPhmE",
   "name" : "int (*)(unsigned char *, unsigned long)",
   "referenced_type" : "_ZTIFiPhmE",
   "self_type" : "_ZTIPFiPhmE",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFivE",
   "name" : "int (*)(void)",
   "referenced_type" : "_ZTIFivE",
   "self_type" : "_ZTIPFivE",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFvPKviE",
   "name" : "void (*)(const void *, int)",
   "referenced_type" : "_ZTIFvPKviE",
   "self_type" : "_ZTIPFvPKviE",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFvPKvidE",
   "name" : "void (*)(const void *, int, double)",
   "referenced_type" : "_ZTIFvPKvidE",
   "self_type" : "_ZTIPFvPKvidE",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFvvE",
   "name" : "void (*)(void)",
   "referenced_type" : "_ZTIFvvE",
   "self_type" : "_ZTIPFvvE",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKv",
   "name" : "const void **",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIPPKv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rd_key",
     "referenced_type" : "_ZTIA60_j"
    },
    {
     "field_name" : "rounds",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10aes_key_st",
   "name" : "aes_key_st",
   "referenced_type" : "_ZTI10aes_key_st",
   "self_type" : "_ZTI10aes_key_st",
   "size" : 244,
   "source_file" : "external/boringssl/src/include/openssl/aes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "seed",
     "referenced_type" : "_ZTIPFvPKviE"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPhmE"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "add",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvPKvidE"
    },
    {
     "field_name" : "pseudorand",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiPhmE"
    },
    {
     "field_name" : "status",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFivE"
    }
   ],
   "linker_set_key" : "_ZTI12rand_meth_st",
   "name" : "rand_meth_st",
   "referenced_type" : "_ZTI12rand_meth_st",
   "self_type" : "_ZTI12rand_meth_st",
   "size" : 48,
   "source_file" : "external/boringssl/src/include/openssl/rand.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
    }
   ],
   "linker_set_key" : "_ZTI14CRYPTO_dynlock",
   "name" : "CRYPTO_dynlock",
   "referenced_type" : "_ZTI14CRYPTO_dynlock",
   "self_type" : "_ZTI14CRYPTO_dynlock",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTIA56_h"
    }
   ],
   "linker_set_key" : "_ZTI15crypto_mutex_st",
   "name" : "crypto_mutex_st",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15crypto_mutex_st",
   "self_type" : "_ZTI15crypto_mutex_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sk",
     "referenced_type" : "_ZTIP13stack_st_void"
    }
   ],
   "linker_set_key" : "_ZTI17crypto_ex_data_st",
   "name" : "crypto_ex_data_st",
   "referenced_type" : "_ZTI17crypto_ex_data_st",
   "self_type" : "_ZTI17crypto_ex_data_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPPv"
    },
    {
     "field_name" : "sorted",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_alloc",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "comp",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiPPKvS1_E"
    }
   ],
   "linker_set_key" : "_ZTI8stack_st",
   "name" : "stack_st",
   "referenced_type" : "_ZTI8stack_st",
   "self_type" : "_ZTI8stack_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "rvalue_reference_types" : []
}
