#ifndef HIDL_GENERATED_ANDROID_HARDWARE_DRM_V1_4_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_DRM_V1_4_TYPES_H

#include <android/hardware/drm/1.2/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace drm {
namespace V1_4 {

// Forward declaration for forward reference support:
enum class LogPriority : uint32_t;
struct LogMessage;
enum class Status : uint32_t;

enum class LogPriority : uint32_t {
    UNKNOWN = 0u,
    DEFAULT = 1u /* ::android::hardware::drm::V1_4::LogPriority.UNKNOWN implicitly + 1 */,
    VERBOSE = 2u /* ::android::hardware::drm::V1_4::LogPriority.DEFAULT implicitly + 1 */,
    DEBUG = 3u /* ::android::hardware::drm::V1_4::LogPriority.VERBOSE implicitly + 1 */,
    INFO = 4u /* ::android::hardware::drm::V1_4::LogPriority.DEBUG implicitly + 1 */,
    WARN = 5u /* ::android::hardware::drm::V1_4::LogPriority.INFO implicitly + 1 */,
    ERROR = 6u /* ::android::hardware::drm::V1_4::LogPriority.WARN implicitly + 1 */,
    FATAL = 7u /* ::android::hardware::drm::V1_4::LogPriority.ERROR implicitly + 1 */,
};

/**
 * Returned by getLogMessages to report error diagnostics to the
 * app.
 *
 * The |message| field is for informational purposes only, and
 * NOT meant to be parsed programmatically when handling errors.
 * For programmatic error handling, please check the return |Status|
 * of APIs instead.
 */
struct LogMessage final {
    /**
     * Epoch time in milliseconds.
     */
    int64_t timeMs __attribute__ ((aligned(8)));
    ::android::hardware::drm::V1_4::LogPriority priority __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string message __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::drm::V1_4::LogMessage, timeMs) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::drm::V1_4::LogMessage, priority) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::drm::V1_4::LogMessage, message) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::drm::V1_4::LogMessage) == 32, "wrong size");
static_assert(__alignof(::android::hardware::drm::V1_4::LogMessage) == 8, "wrong alignment");

enum class Status : uint32_t {
    /**
     * The DRM plugin must return OK when an operation completes without any
     * errors.
     */
    OK = 0u,
    /**
     * The DRM plugin must return ERROR_DRM_NO_LICENSE, when decryption is
     * attempted and no license keys have been provided.
     */
    ERROR_DRM_NO_LICENSE = 1u /* ::android::hardware::drm::V1_0::Status.OK implicitly + 1 */,
    /**
     * ERROR_DRM_LICENSE_EXPIRED must be returned when an attempt is made
     * to use a license and the keys in that license have expired.
     */
    ERROR_DRM_LICENSE_EXPIRED = 2u /* ::android::hardware::drm::V1_0::Status.ERROR_DRM_NO_LICENSE implicitly + 1 */,
    /**
     * The DRM plugin must return ERROR_DRM_SESSION_NOT_OPENED when an
     * attempt is made to use a session that has not been opened.
     */
