#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUTOMOTIVE_EVS_V1_1_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUTOMOTIVE_EVS_V1_1_TYPES_H

#include <android/hardware/automotive/evs/1.0/types.h>
#include <android/hardware/camera/device/3.2/types.h>
#include <android/hardware/graphics/common/1.2/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace automotive {
namespace evs {
namespace V1_1 {

// Forward declaration for forward reference support:
struct CameraDesc;
struct BufferDesc;
enum class EvsEventType : uint32_t;
struct EvsEventDesc;
enum class CameraParam : uint32_t;
struct UltrasonicsArrayDesc;
struct RotationQuat;
struct Translation;
struct SensorPose;
struct UltrasonicSensor;
struct UltrasonicsDataFrameDesc;

/**
 * Structure describing the basic properties of an EVS camera, extended from its
 * v1.0 declaration.
 *
 * The HAL is responsible for filling out this structure for each
 * EVS camera in the system.
 */
struct CameraDesc final {
    ::android::hardware::automotive::evs::V1_0::CameraDesc v1 __attribute__ ((aligned(8)));
    /**
     * Store camera metadata such as lens characteristics.
     */
    ::android::hardware::hidl_vec<uint8_t> metadata __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::automotive::evs::V1_1::CameraDesc, v1) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::CameraDesc, metadata) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::evs::V1_1::CameraDesc) == 40, "wrong size");
static_assert(__alignof(::android::hardware::automotive::evs::V1_1::CameraDesc) == 8, "wrong alignment");

/**
 * Structure representing an image buffer through our APIs
 *
 * In addition to the handle to the graphics memory, we need to retain
 * the properties of the buffer for easy reference and reconstruction of
 * an ANativeWindowBuffer object on the remote side of API calls.
 * (Not least because OpenGL expect an ANativeWindowBuffer* for us as a
 * texture via eglCreateImageKHR().
 */
struct BufferDesc final {
    /**
     * HIDL counterpart of `AHardwareBuffer_Desc`.  Please see
     * hardware/interfaces/graphics/common/1.2/types.hal for more details.
     */
    ::android::hardware::graphics::common::V1_2::HardwareBuffer buffer __attribute__ ((aligned(8)));
    /**
     * The size of a pixel in the units of bytes
     */
    uint32_t pixelSize __attribute__ ((aligned(4)));
    /**
     * Opaque value from driver
     */
    uint32_t bufferId __attribute__ ((aligned(4)));
    /**
     * Unique identifier of the physical camera device that produces this buffer.
     */
    ::android::hardware::hidl_string deviceId __attribute__ ((aligned(8)));
    /**
     * Time that this buffer is being filled.
     */
    int64_t timestamp __attribute__ ((aligned(8)));
    /**
     * Frame metadata.  This is opaque to EVS manager.
     */
    ::android::hardware::hidl_vec<uint8_t> metadata __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::automotive::evs::V1_1::BufferDesc, buffer) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::BufferDesc, pixelSize) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::BufferDesc, bufferId) == 60, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::BufferDesc, deviceId) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::BufferDesc, timestamp) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::BufferDesc, metadata) == 88, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::evs::V1_1::BufferDesc) == 104, "wrong size");
static_assert(__alignof(::android::hardware::automotive::evs::V1_1::BufferDesc) == 8, "wrong alignment");

/**
 * Types of informative streaming events
 */
enum class EvsEventType : uint32_t {
    /**
     * Video stream is started
     */
    STREAM_STARTED = 0u,
    /**
     * Video stream is stopped
     */
    STREAM_STOPPED = 1u /* ::android::hardware::automotive::evs::V1_1::EvsEventType.STREAM_STARTED implicitly + 1 */,
    /**
     * Video frame is dropped
     */
    FRAME_DROPPED = 2u /* ::android::hardware::automotive::evs::V1_1::EvsEventType.STREAM_STOPPED implicitly + 1 */,
    /**
     * Timeout happens
     */
    TIMEOUT = 3u /* ::android::hardware::automotive::evs::V1_1::EvsEventType.FRAME_DROPPED implicitly + 1 */,
    /**
     * Camera parameter is changed; payload contains a changed parameter ID and
     * its value
     */
    PARAMETER_CHANGED = 4u /* ::android::hardware::automotive::evs::V1_1::EvsEventType.TIMEOUT implicitly + 1 */,
    /**
     * Master role has become available
     */
    MASTER_RELEASED = 5u /* ::android::hardware::automotive::evs::V1_1::EvsEventType.PARAMETER_CHANGED implicitly + 1 */,
    /**
     * Any other erroneous streaming events
     */
    STREAM_ERROR = 6u /* ::android::hardware::automotive::evs::V1_1::EvsEventType.MASTER_RELEASED implicitly + 1 */,
};

/**
 * Structure that describes informative events occurred during EVS is streaming
 */
struct EvsEventDesc final {
    /**
     * Type of an informative event
     */
    ::android::hardware::automotive::evs::V1_1::EvsEventType aType __attribute__ ((aligned(4)));
    /**
     * Device identifier
     */
    ::android::hardware::hidl_string deviceId __attribute__ ((aligned(8)));
    /**
     * Possible additional information
     */
    ::android::hardware::hidl_array<uint32_t, 4> payload __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::evs::V1_1::EvsEventDesc, aType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::EvsEventDesc, deviceId) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::EvsEventDesc, payload) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::evs::V1_1::EvsEventDesc) == 40, "wrong size");
static_assert(__alignof(::android::hardware::automotive::evs::V1_1::EvsEventDesc) == 8, "wrong alignment");

/**
 * EVS Camera Parameter
 */
enum class CameraParam : uint32_t {
    /**
     * The brightness of image frames
     */
    BRIGHTNESS = 0u,
    /**
     * The contrast of image frames
     */
    CONTRAST = 1u /* ::android::hardware::automotive::evs::V1_1::CameraParam.BRIGHTNESS implicitly + 1 */,
    /**
     * Automatic gain/exposure control
     */
    AUTOGAIN = 2u /* ::android::hardware::automotive::evs::V1_1::CameraParam.CONTRAST implicitly + 1 */,
    /**
     * Gain control
     */
    GAIN = 3u /* ::android::hardware::automotive::evs::V1_1::CameraParam.AUTOGAIN implicitly + 1 */,
    /**
     * Automatic Whitebalance
     */
    AUTO_WHITE_BALANCE = 4u /* ::android::hardware::automotive::evs::V1_1::CameraParam.GAIN implicitly + 1 */,
    /**
     * Manual white balance setting as a color temperature in Kelvin.
     */
    WHITE_BALANCE_TEMPERATURE = 5u /* ::android::hardware::automotive::evs::V1_1::CameraParam.AUTO_WHITE_BALANCE implicitly + 1 */,
    /**
     * Image sharpness adjustment
     */
    SHARPNESS = 6u /* ::android::hardware::automotive::evs::V1_1::CameraParam.WHITE_BALANCE_TEMPERATURE implicitly + 1 */,
    /**
     * Auto Exposure Control modes; auto, manual, shutter priority, or
     * aperture priority.
     */
    AUTO_EXPOSURE = 7u /* ::android::hardware::automotive::evs::V1_1::CameraParam.SHARPNESS implicitly + 1 */,
    /**
     * Manual exposure time of the camera
     */
    ABSOLUTE_EXPOSURE = 8u /* ::android::hardware::automotive::evs::V1_1::CameraParam.AUTO_EXPOSURE implicitly + 1 */,
    /**
     * Set the focal point of the camera to the specified position.  This
     * parameter may not be effective when auto focus is enabled.
     */
    ABSOLUTE_FOCUS = 9u /* ::android::hardware::automotive::evs::V1_1::CameraParam.ABSOLUTE_EXPOSURE implicitly + 1 */,
    /**
     * Enables continuous automatic focus adjustments.
     */
    AUTO_FOCUS = 10u /* ::android::hardware::automotive::evs::V1_1::CameraParam.ABSOLUTE_FOCUS implicitly + 1 */,
    /**
     * Specify the objective lens focal length as an absolute value.
     */
    ABSOLUTE_ZOOM = 11u /* ::android::hardware::automotive::evs::V1_1::CameraParam.AUTO_FOCUS implicitly + 1 */,
};

/**
 * Structure identifies and describes an ultrasonics array in the car.
 *
 * A ultrasonics array represents a group of ultrasonic sensors within the
 * car. These may be sensors that are physically connected to the same hardware
 * control unit or represent a logical group of sensors like front and back.
 * The HAL is responsible for filling out this structure for each Ultrasonics
 * Array.
 */
struct UltrasonicsArrayDesc final {
    /**
     * Unique identifier for the ultrasonic array. This may be a path or name of the
     * physical control device or a string identifying a logical group of sensors forming an array
     * such as "front_array" and "back_array".
     */
    ::android::hardware::hidl_string ultrasonicsArrayId __attribute__ ((aligned(8)));
    /**
     * Maximum number of readings (points on waveform) provided per sensor in
     * each data frame. Used by client to pre-allocate required memory buffer for
     * incoming data.
     */
    uint32_t maxReadingsPerSensorCount __attribute__ ((aligned(4)));
    /**
     * Maximum number of receiver sensors in a data frame. Must be between 1
     * and sensorCount. Used by client to pre-allocate required memory buffer for
     * incoming data.
     */
    uint32_t maxReceiversCount __attribute__ ((aligned(4)));
    /**
     * The order of sensors specified should preferably be in clockwise order
     * around the car, starting from front left-most sensor.
     */
    ::android::hardware::hidl_vec<::android::hardware::automotive::evs::V1_1::UltrasonicSensor> sensors __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicsArrayDesc, ultrasonicsArrayId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicsArrayDesc, maxReadingsPerSensorCount) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicsArrayDesc, maxReceiversCount) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicsArrayDesc, sensors) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::evs::V1_1::UltrasonicsArrayDesc) == 40, "wrong size");
static_assert(__alignof(::android::hardware::automotive::evs::V1_1::UltrasonicsArrayDesc) == 8, "wrong alignment");

/**
 * Structure for rotation expressed as quaternions.
 * Convention used: Unit quaternion with hamilton convention.
 */
struct RotationQuat final {
    float x __attribute__ ((aligned(4)));
    float y __attribute__ ((aligned(4)));
    float z __attribute__ ((aligned(4)));
    float w __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::evs::V1_1::RotationQuat, x) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::RotationQuat, y) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::RotationQuat, z) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::RotationQuat, w) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::evs::V1_1::RotationQuat) == 16, "wrong size");
static_assert(__alignof(::android::hardware::automotive::evs::V1_1::RotationQuat) == 4, "wrong alignment");

/**
 * Structure for translation with x, y and z units.
 */
struct Translation final {
    float x __attribute__ ((aligned(4)));
    float y __attribute__ ((aligned(4)));
    float z __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::evs::V1_1::Translation, x) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::Translation, y) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::Translation, z) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::evs::V1_1::Translation) == 12, "wrong size");
static_assert(__alignof(::android::hardware::automotive::evs::V1_1::Translation) == 4, "wrong alignment");

/**
 * Provides the orientation and location of a car sensor relative to the android automotive
 * coordinate system:
 * https://source.android.com/devices/sensors/sensor-types#auto_axes
 * The sensor pose defines the transformation to be applied to the android automotive axes to
 * obtain the sensor local axes.
 * The pose consists of rotation, (specified as a quaternions) and translation
 * (vector with x, y, z).
 * This rotation and translation applied to the sensor data in the sensor's local coordinate
 * system transform the data to the automotive coordinate system.
 * i.e   Pcar =  ( Rot * Psensor ) + Trans
 * Here Pcar is a point in automotive coordinate system and Psensor is a point in the sensor's
 * coordinate system.
 * Example:
 * For a sensor on the front bumper and on the left corner of the car with its X axis pointing to
 * the front, the sensor is located at (-2, 4, 0) meters w.r.t android automotive axes and the
 * sensor local axes has a rotation of 90 degrees counter-clockwise w.r.t android automotive axes
 * when viewing the car from top on the +Z axis side:
 *
 *      ↑X sensor
 *    Y←∘______
 *      |      |  front
 *      | car  |
 *      |  ↑Y  |
 *      |  ∘→X |  rear
 *      |______|
 *
 * For this example the rotation and translation will be:
 * Rotation = + 90 degrees around Z axis = (0.7071, 0, 0, 0.7071) as a unit quaternion.
 * Translation = (-2, 4, 0) in meters = (-2000, 4000, 0) in milli-meters.
 * Note: Every sensor type must specify its own pose.
 */
struct SensorPose final {
    /**
     * Rotation part of the sensor pose, expressed as a unit quaternion.
     */
    ::android::hardware::automotive::evs::V1_1::RotationQuat rotation __attribute__ ((aligned(4)));
    /**
     * Translation part of the sensor pose, in (x, y, z) format with milli-meter units.
     */
    ::android::hardware::automotive::evs::V1_1::Translation translation __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::evs::V1_1::SensorPose, rotation) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::SensorPose, translation) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::evs::V1_1::SensorPose) == 28, "wrong size");
static_assert(__alignof(::android::hardware::automotive::evs::V1_1::SensorPose) == 4, "wrong alignment");

/**
 * Structure that contains all information of an ultrasonic sensor.
 */
struct UltrasonicSensor final {
    /**
     * Pose provides the orientation and location of the ultrasonic sensor within the car.
     * The +Y axis points along the center of the beam spread the X axis to the right and the Z
     * axis in the up direction.
     */
    ::android::hardware::automotive::evs::V1_1::SensorPose pose __attribute__ ((aligned(4)));
    /**
     * Maximum range of the sensor in milli-metres.
     */
    float maxRange __attribute__ ((aligned(4)));
    /**
     * Half-angle of the angle of measurement of the sensor, relative to the
     * sensor’s x axis, in radians.
     */
    float angleOfMeasurement __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicSensor, pose) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicSensor, maxRange) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicSensor, angleOfMeasurement) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::evs::V1_1::UltrasonicSensor) == 36, "wrong size");
static_assert(__alignof(::android::hardware::automotive::evs::V1_1::UltrasonicSensor) == 4, "wrong alignment");

/**
 * Structure that describes the data frame received from an ultrasonics array.
 *
 * Each data frame returned consists of received waveform signals from a subset
 * of sensors in an array as indicated by the receiversIdList. The signal is
 * transmitted at a particular time instant indicated by timestampNs from a
 * subset of sensors in the array as provided in the transmittersIdList.
 */
struct UltrasonicsDataFrameDesc final {
    /**
     * Timestamp of the start of the transmit signal for this data frame.
     * Timestamp unit is nanoseconds and is obtained from android elapsed realtime clock which is
     * the time since system was booted and includes deep sleep.
     * timeOfFlight readings are future-deltas to this timestamp.
     */
    uint64_t timestampNs __attribute__ ((aligned(8)));
    /**
     * Identifier of data frame. Used by implementation for managing multiple frames in flight.
     */
    uint32_t dataFrameId __attribute__ ((aligned(4)));
    /**
     * List of indexes of sensors in range [0, sensorCount - 1] that
     * transmitted the signal for this data frame.
     */
    ::android::hardware::hidl_vec<uint8_t> transmittersIdList __attribute__ ((aligned(8)));
    /**
     * List of indexes of sensors in range [0, sensorCount - 1] that received
     * the signal. The order of ids must match the order of the waveforms in the
     * waveformsData.
     * Size of list is upper bound by maxReceiversCount.
     */
    ::android::hardware::hidl_vec<uint8_t> receiversIdList __attribute__ ((aligned(8)));
    /**
     * List of the number of readings corresponding to each ultrasonics sensor in
     * the receiversIdList. Order of the readings count must match the order in
     * receiversIdList.
     * Size of list is upper bound by maxReadingsPerSensorCount.
     */
    ::android::hardware::hidl_vec<uint32_t> receiversReadingsCountList __attribute__ ((aligned(8)));
    /**
     * Shared memory object containing the waveforms data. Contains one waveform
     * for each sensor specified in receiversIdList, in order.
     * Each waveform is represented by a number of readings, which are sample
     * points on the waveform. The number of readings for each waveform is as
     * specified in the receiversReadingsCountList.
     * Each reading is a pair of time Of flight and resonance.
     * Time of flight (float): Time between transmit and receive signal in nanoseconds.
     * Resonance (float): Resonance at time on waveform in range [0.0, 1.0].
     *
     * The structure of shared memory (example with 2 waveforms, each with 2 readings):
     *
     * Byte: |   0    |  1-4  |  5-8  | 9-12  | 13-16 ||   17   |  18-21 | 22-25  | 26-29 | 30-33 |
     * Data: | RecId1 | TOF1  | RES1  | TOF2  | RES2  || RecId2 |  TOF1  |  RES1  | TOF2  | RES2  |
     *       |              Waveform1                 ||             Waveform2                    |
     * Here:
     * RecId : Receiver's Id. Order matches the receiversIdList, type uint8_t
     * TOF : Time of flight, type float (4 bytes)
     * RES : Resonance, type float (4 bytes)
     * Note: All readings and waveforms are contigious with no padding.
     */
    ::android::hardware::hidl_memory waveformsData __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicsDataFrameDesc, timestampNs) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicsDataFrameDesc, dataFrameId) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicsDataFrameDesc, transmittersIdList) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicsDataFrameDesc, receiversIdList) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicsDataFrameDesc, receiversReadingsCountList) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::evs::V1_1::UltrasonicsDataFrameDesc, waveformsData) == 64, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::evs::V1_1::UltrasonicsDataFrameDesc) == 104, "wrong size");
static_assert(__alignof(::android::hardware::automotive::evs::V1_1::UltrasonicsDataFrameDesc) == 8, "wrong alignment");

//
// type declarations for package
//

static inline std::string toString(const ::android::hardware::automotive::evs::V1_1::CameraDesc& o);
static inline void PrintTo(const ::android::hardware::automotive::evs::V1_1::CameraDesc& o, ::std::ostream*);
static inline bool operator==(const ::android::hardware::automotive::evs::V1_1::CameraDesc& lhs, const ::android::hardware::automotive::evs::V1_1::CameraDesc& rhs);
static inline bool operator!=(const ::android::hardware::automotive::evs::V1_1::CameraDesc& lhs, const ::android::hardware::automotive::evs::V1_1::CameraDesc& rhs);

static inline std::string toString(const ::android::hardware::automotive::evs::V1_1::BufferDesc& o);
static inline void PrintTo(const ::android::hardware::automotive::evs::V1_1::BufferDesc& o, ::std::ostream*);
// operator== and operator!= are not generated for BufferDesc

template<typename>
