{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" : [],
 "functions" :
 [
  {
   "function_name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler::DeathHandler",
   "linker_set_key" : "_ZN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerC1EOS4_",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    },
    {
     "referenced_type" : "_ZTION4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "function_name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler::DeathHandler",
   "linker_set_key" : "_ZN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerC2EOS4_",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    },
    {
     "referenced_type" : "_ZTION4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "function_name" : "aidl::android::hardware::neuralnetworks::utils::getDevice",
   "linker_set_key" : "_ZN4aidl7android8hardware14neuralnetworks5utils9getDeviceERKNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIRKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "return_type" : "_ZTIN7android4base8expectedINSt3__110shared_ptrIKNS_2nn7IDeviceEEENS4_12GeneralErrorEEE",
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Service.h"
  },
  {
   "function_name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler::getDeathMonitor",
   "linker_set_key" : "_ZNK4aidl7android8hardware14neuralnetworks5utils12DeathHandler15getDeathMonitorEv",
   "parameters" :
   [
    {
     "is_this_ptr" : true,
     "referenced_type" : "_ZTIPKN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    }
   ],
   "return_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorEEE",
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  }
 ],
 "global_vars" : [],
 "lvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIRKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>> &",
   "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIRKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Service.h"
  }
 ],
 "pointer_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "const aidl::android::hardware::neuralnetworks::utils::DeathHandler *",
   "referenced_type" : "_ZTIKN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIPKN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler *",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIPN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "const aidl::android::hardware::neuralnetworks::utils::DeathHandler",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIKN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 40,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2nn10DeviceTypeE",
   "name" : "const android::nn::DeviceType",
   "referenced_type" : "_ZTIN7android2nn10DeviceTypeE",
   "self_type" : "_ZTIKN7android2nn10DeviceTypeE",
   "size" : 4,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2nn12CapabilitiesE",
   "name" : "const android::nn::Capabilities",
   "referenced_type" : "_ZTIN7android2nn12CapabilitiesE",
   "self_type" : "_ZTIKN7android2nn12CapabilitiesE",
   "size" : 56,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IDeviceEEE",
   "name" : "const std::shared_ptr<aidl::android::hardware::neuralnetworks::IDevice>",
   "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IDeviceEEE",
   "self_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IDeviceEEE",
   "size" : 16,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Service.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIjjEE",
   "name" : "const std::pair<unsigned int, unsigned int>",
   "referenced_type" : "_ZTINSt3__14pairIjjEE",
   "self_type" : "_ZTIKNSt3__14pairIjjEE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE",
   "name" : "const std::vector<android::nn::Extension, std::allocator<android::nn::Extension>>",
   "referenced_type" : "_ZTINSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE",
   "size" : 24,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kObject",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    },
    {
     "access" : "private",
     "field_name" : "kDeathRecipient",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE"
    },
    {
     "access" : "private",
     "field_name" : "kDeathMonitor",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 40,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorIPN7android8hardware14neuralnetworks5utils18IProtectedCallbackENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::DeathMonitor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathMonitorE",
   "size" : 64,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6Device21PrivateConstructorTagE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::Device::PrivateConstructorTag",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6Device21PrivateConstructorTagE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6Device21PrivateConstructorTagE",
   "size" : 1,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2nn7IDeviceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "kName",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "kVersionString",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "kDeviceType",
     "field_offset" : 448,
     "referenced_type" : "_ZTIKN7android2nn10DeviceTypeE"
    },
    {
     "access" : "private",
     "field_name" : "kExtensions",
     "field_offset" : 512,
     "referenced_type" : "_ZTIKNSt3__16vectorIN7android2nn9ExtensionENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "kCapabilities",
     "field_offset" : 704,
     "referenced_type" : "_ZTIKN7android2nn12CapabilitiesE"
    },
    {
     "access" : "private",
     "field_name" : "kNumberOfCacheFilesNeeded",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIKNSt3__14pairIjjEE"
    },
    {
     "access" : "private",
     "field_name" : "kDevice",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIKNSt3__110shared_ptrIN4aidl7android8hardware14neuralnetworks7IDeviceEEE"
    },
    {
     "access" : "private",
     "field_name" : "kDeathHandler",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIKN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6DeviceE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::Device",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6DeviceE",
   "self_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6DeviceE",
   "size" : 208,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/Device.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils6DeviceE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device7getNameEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device16getVersionStringEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device15getFeatureLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device7getTypeEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device22getSupportedExtensionsEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device15getCapabilitiesEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device27getNumberOfCacheFilesNeededEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device4waitEv"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device22getSupportedOperationsERKN7android2nn5ModelE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device12prepareModelERKN7android2nn5ModelENS6_19ExecutionPreferenceENS6_8PriorityENSt3__18optionalINSC_6chrono10time_pointINS5_4base10boot_clockENSE_8durationIxNSC_5ratioILl1ELl1000000000EEEEEEEEERKNSC_6vectorINSC_10shared_ptrIKNS6_6HandleEEENSC_9allocatorISS_EEEESX_RKNSC_5arrayIhLm32EEE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device21prepareModelFromCacheENSt3__18optionalINS5_6chrono10time_pointIN7android4base10boot_clockENS7_8durationIxNS5_5ratioILl1ELl1000000000EEEEEEEEERKNS5_6vectorINS5_10shared_ptrIKNS9_2nn6HandleEEENS5_9allocatorISN_EEEESS_RKNS5_5arrayIhLm32EEE"
    },
    {
     "mangled_component_name" : "_ZNK4aidl7android8hardware14neuralnetworks5utils6Device8allocateERKN7android2nn10BufferDescERKNSt3__16vectorINSA_10shared_ptrIKNS6_14IPreparedModelEEENSA_9allocatorISF_EEEERKNSB_INS6_10BufferRoleENSG_ISL_EEEESP_"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils6DeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware14neuralnetworks5utils6DeviceD0Ev"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "name" : "aidl::android::hardware::neuralnetworks::utils::DeathHandler &&",
   "referenced_type" : "_ZTIN4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "self_type" : "_ZTION4aidl7android8hardware14neuralnetworks5utils12DeathHandlerE",
   "size" : 8,
   "source_file" : "hardware/interfaces/neuralnetworks/aidl/utils/include/nnapi/hal/aidl/ProtectCallback.h"
  }
 ]
}
