{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "system/core/libcutils/include_outside_system/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA3_h",
   "name" : "unsigned char [3]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA3_h",
   "size" : 3,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA5121_h",
   "name" : "unsigned char [5121]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA5121_h",
   "size" : 5121,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA7_h",
   "name" : "unsigned char [7]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA7_h",
   "size" : 7,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,

   "name" : "const std::array<android::hardware::media::bufferpool::V2_0::BufferStatus, 10>",
   "referenced_type" : "_ZTINSt3__15arrayIN7android8hardware5media10bufferpool4V2_012BufferStatusELj10EEE",
   "self_type" : "_ZTIKNSt3__15arrayIN7android8hardware5media10bufferpool4V2_012BufferStatusELj10EEE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/types.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__15arrayIN7android8hardware5media10bufferpool4V2_012ResultStatusELj5EEE",
   "name" : "const std::array<android::hardware::media::bufferpool::V2_0::ResultStatus, 5>",
   "referenced_type" : "_ZTINSt3__15arrayIN7android8hardware5media10bufferpool4V2_012ResultStatusELj5EEE",
   "self_type" : "_ZTIKNSt3__15arrayIN7android8hardware5media10bufferpool4V2_012ResultStatusELj5EEE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/types.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS0_IPvNS_9allocatorIS9_EEEEEEENSA_ISF_EEEE",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *>> *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *>> *)>>>",
   "referenced_type" : "_ZTINSt3__16vectorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS0_IPvNS_9allocatorIS9_EEEEEEENSA_ISF_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS0_IPvNS_9allocatorIS9_EEEEEEENSA_ISF_EEEE",
   "size" : 12,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "system/core/libcutils/include_outside_system/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include_vndk/log/log_time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android12NativeHandleE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android19VirtualLightRefBaseE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12NativeHandleE",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12NativeHandleE",
   "self_type" : "_ZTIN7android12NativeHandleE",
   "size" : 12,
   "source_file" : "system/core/libutils/include/utils/NativeHandle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14ReferenceMoverE",
   "self_type" : "_ZTIN7android14ReferenceMoverE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDesc",
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware12MQDescriptorINS2_5media10bufferpool4V2_019BufferStatusMessageELNS2_8MQFlavorE1EEENS_14default_deleteIS9_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mRing",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "private",
     "field_name" : "mReadPtr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPNSt3__16atomicIyEE"
    },
    {
     "access" : "private",
     "field_name" : "mWritePtr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPNSt3__16atomicIyEE"
    },
    {
     "access" : "private",
     "field_name" : "mEvFlagWord",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPNSt3__16atomicIjEE"
    },
    {
     "access" : "private",
     "field_name" : "mEventFlag",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPN7android8hardware9EventFlagE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16MessageQueueBaseINS_8hardware12MQDescriptorENS1_5media10bufferpool4V2_019BufferStatusMessageELNS1_8MQFlavorE1EEE",
   "name" : "android::MessageQueueBase<android::hardware::MQDescriptor, android::hardware::media::bufferpool::V2_0::BufferStatusMessage, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "_ZTIN7android16MessageQueueBaseINS_8hardware12MQDescriptorENS1_5media10bufferpool4V2_019BufferStatusMessageELNS1_8MQFlavorE1EEE",
   "self_type" : "_ZTIN7android16MessageQueueBaseINS_8hardware12MQDescriptorENS1_5media10bufferpool4V2_019BufferStatusMessageELNS1_8MQFlavorE1EEE",
   "size" : 24,
   "source_file" : "system/libfmq/include/fmq/MessageQueueBase.h",
   "template_args" : [ "_ZTIN7android8hardware5media10bufferpool4V2_019BufferStatusMessageE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDesc",
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8hardware12MQDescriptorINS2_5media10bufferpool4V2_025BufferInvalidationMessageELNS2_8MQFlavorE2EEENS_14default_deleteIS9_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mRing",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "private",
     "field_name" : "mReadPtr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPNSt3__16atomicIyEE"
    },
    {
     "access" : "private",
     "field_name" : "mWritePtr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPNSt3__16atomicIyEE"
    },
    {
     "access" : "private",
     "field_name" : "mEvFlagWord",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPNSt3__16atomicIjEE"
    },
    {
     "access" : "private",
     "field_name" : "mEventFlag",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPN7android8hardware9EventFlagE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16MessageQueueBaseINS_8hardware12MQDescriptorENS1_5media10bufferpool4V2_025BufferInvalidationMessageELNS1_8MQFlavorE2EEE",
   "name" : "android::MessageQueueBase<android::hardware::MQDescriptor, android::hardware::media::bufferpool::V2_0::BufferInvalidationMessage, android::hardware::kUnsynchronizedWrite>",
   "referenced_type" : "_ZTIN7android16MessageQueueBaseINS_8hardware12MQDescriptorENS1_5media10bufferpool4V2_025BufferInvalidationMessageELNS1_8MQFlavorE2EEE",
   "self_type" : "_ZTIN7android16MessageQueueBaseINS_8hardware12MQDescriptorENS1_5media10bufferpool4V2_025BufferInvalidationMessageELNS1_8MQFlavorE2EEE",
   "size" : 24,
   "source_file" : "system/libfmq/include/fmq/MessageQueueBase.h",
   "template_args" :
   [
    "_ZTIN7android8hardware5media10bufferpool4V2_025BufferInvalidationMessageE"
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16ReferenceRenamerE",
   "self_type" : "_ZTIN7android16ReferenceRenamerE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "self_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl4base4V1_05IBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl7manager4V1_020IServiceNotificationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware20hidl_death_recipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware20hidl_death_recipientE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media10bufferpool4V2_011IConnectionE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_011IConnectionEEE",
   "name" : "android::sp<android::hardware::media::bufferpool::V2_0::IConnection>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_011IConnectionEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_011IConnectionEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media10bufferpool4V2_011IConnectionE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media10bufferpool4V2_014implementation10ConnectionE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_014implementation10ConnectionEEE",
   "name" : "android::sp<android::hardware::media::bufferpool::V2_0::implementation::Connection>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_014implementation10ConnectionEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_014implementation10ConnectionEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android8hardware5media10bufferpool4V2_014implementation10ConnectionE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media10bufferpool4V2_014implementation8AccessorE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_014implementation8AccessorEEE",
   "name" : "android::sp<android::hardware::media::bufferpool::V2_0::implementation::Accessor>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_014implementation8AccessorEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_014implementation8AccessorEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android8hardware5media10bufferpool4V2_014implementation8AccessorE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media10bufferpool4V2_09IAccessorE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_09IAccessorEEE",
   "name" : "android::sp<android::hardware::media::bufferpool::V2_0::IAccessor>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_09IAccessorEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_09IAccessorEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media10bufferpool4V2_09IAccessorE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media10bufferpool4V2_09IObserverE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_09IObserverEEE",
   "name" : "android::sp<android::hardware::media::bufferpool::V2_0::IObserver>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_09IObserverEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_09IObserverEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media10bufferpool4V2_09IObserverE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base11borrowed_fdE",
   "name" : "android::base::borrowed_fd",
   "referenced_type" : "_ZTIN7android4base11borrowed_fdE",
   "self_type" : "_ZTIN7android4base11borrowed_fdE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base13DefaultCloserE",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "_ZTIN7android4base13DefaultCloserE",
   "self_type" : "_ZTIN7android4base13DefaultCloserE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h",
   "template_args" : [ "_ZTIN7android4base13DefaultCloserE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "name" : "android::hidl::base::V1_0::IBase",
   "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "self_type" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android4hidl4base4V1_09DebugInfo12ArchitectureE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "referenced_type" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "self_type" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "self_type" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIN7android7RefBaseE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10HidlMemoryE",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware10HidlMemoryE",
   "self_type" : "_ZTIN7android8hardware10HidlMemoryE",
   "size" : 56,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 72,
     "referenced_type" : "_ZTIA7_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_handleE",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "_ZTIN7android8hardware11hidl_handleE",
   "self_type" : "_ZTIN7android8hardware11hidl_handleE",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "_ZTIN7android8hardware11hidl_handleE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_memoryE",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE",
   "self_type" : "_ZTIN7android8hardware11hidl_memoryE",
   "size" : 40,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_stringE",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "_ZTIN7android8hardware11hidl_stringE",
   "self_type" : "_ZTIN7android8hardware11hidl_stringE",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGrantors",
     "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE"
    },
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE"
    },
    {
     "access" : "private",
     "field_name" : "mQuantum",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12MQDescriptorINS0_5media10bufferpool4V2_019BufferStatusMessageELNS0_8MQFlavorE1EEE",
   "name" : "android::hardware::MQDescriptor<android::hardware::media::bufferpool::V2_0::BufferStatusMessage, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "_ZTIN7android8hardware12MQDescriptorINS0_5media10bufferpool4V2_019BufferStatusMessageELNS0_8MQFlavorE1EEE",
   "self_type" : "_ZTIN7android8hardware12MQDescriptorINS0_5media10bufferpool4V2_019BufferStatusMessageELNS0_8MQFlavorE1EEE",
   "size" : 32,
   "source_file" : "system/libhidl/base/include/hidl/MQDescriptor.h",
   "template_args" : [ "_ZTIN7android8hardware5media10bufferpool4V2_019BufferStatusMessageE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGrantors",
     "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE"
    },
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE"
    },
    {
     "access" : "private",
     "field_name" : "mQuantum",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12MQDescriptorINS0_5media10bufferpool4V2_025BufferInvalidationMessageELNS0_8MQFlavorE2EEE",
   "name" : "android::hardware::MQDescriptor<android::hardware::media::bufferpool::V2_0::BufferInvalidationMessage, android::hardware::kUnsynchronizedWrite>",
   "referenced_type" : "_ZTIN7android8hardware12MQDescriptorINS0_5media10bufferpool4V2_025BufferInvalidationMessageELNS0_8MQFlavorE2EEE",
   "self_type" : "_ZTIN7android8hardware12MQDescriptorINS0_5media10bufferpool4V2_025BufferInvalidationMessageELNS0_8MQFlavorE2EEE",
   "size" : 32,
   "source_file" : "system/libhidl/base/include/hidl/MQDescriptor.h",
   "template_args" :
   [
    "_ZTIN7android8hardware5media10bufferpool4V2_025BufferInvalidationMessageE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android16MessageQueueBaseINS_8hardware12MQDescriptorENS1_5media10bufferpool4V2_019BufferStatusMessageELNS1_8MQFlavorE1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12MessageQueueINS0_5media10bufferpool4V2_019BufferStatusMessageELNS0_8MQFlavorE1EEE",
   "name" : "android::hardware::MessageQueue<android::hardware::media::bufferpool::V2_0::BufferStatusMessage, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "_ZTIN7android8hardware12MessageQueueINS0_5media10bufferpool4V2_019BufferStatusMessageELNS0_8MQFlavorE1EEE",
   "self_type" : "_ZTIN7android8hardware12MessageQueueINS0_5media10bufferpool4V2_019BufferStatusMessageELNS0_8MQFlavorE1EEE",
   "size" : 24,
   "source_file" : "system/libfmq/include/fmq/MessageQueue.h",
   "template_args" : [ "_ZTIN7android8hardware5media10bufferpool4V2_019BufferStatusMessageE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android16MessageQueueBaseINS_8hardware12MQDescriptorENS1_5media10bufferpool4V2_025BufferInvalidationMessageELNS1_8MQFlavorE2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12MessageQueueINS0_5media10bufferpool4V2_025BufferInvalidationMessageELNS0_8MQFlavorE2EEE",
   "name" : "android::hardware::MessageQueue<android::hardware::media::bufferpool::V2_0::BufferInvalidationMessage, android::hardware::kUnsynchronizedWrite>",
   "referenced_type" : "_ZTIN7android8hardware12MessageQueueINS0_5media10bufferpool4V2_025BufferInvalidationMessageELNS0_8MQFlavorE2EEE",
   "self_type" : "_ZTIN7android8hardware12MessageQueueINS0_5media10bufferpool4V2_025BufferInvalidationMessageELNS0_8MQFlavorE2EEE",
   "size" : 24,
   "source_file" : "system/libfmq/include/fmq/MessageQueue.h",
   "template_args" :
   [
    "_ZTIN7android8hardware5media10bufferpool4V2_025BufferInvalidationMessageE"
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12hidl_versionE",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "_ZTIN7android8hardware12hidl_versionE",
   "self_type" : "_ZTIN7android8hardware12hidl_versionE",
   "size" : 4,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "self_type" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "size" : 24,
   "source_file" : "system/libfmq/base/fmq/MQDescriptorBase.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "self_type" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "size" : 12,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEyRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mConnectionId",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "mId",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media10bufferpool14BufferPoolDataE",
   "name" : "android::hardware::media::bufferpool::BufferPoolData",
   "referenced_type" : "_ZTIN7android8hardware5media10bufferpool14BufferPoolDataE",
   "self_type" : "_ZTIN7android8hardware5media10bufferpool14BufferPoolDataE",
   "size" : 16,
   "source_file" : "frameworks/av/media/bufferpool/2.0/include/bufferpool/BufferPoolTypes.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media10bufferpool4V2_011IConnectionE",
   "name" : "android::hardware::media::bufferpool::V2_0::IConnection",
   "referenced_type" : "_ZTIN7android8hardware5media10bufferpool4V2_011IConnectionE",
   "self_type" : "_ZTIN7android8hardware5media10bufferpool4V2_011IConnectionE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/IConnection.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_011IConnectionE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media10bufferpool4V2_011IConnection8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnectionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnectionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection5fetchEyjNSt3__18functionIFvNS3_12ResultStatusERKNS3_6BufferEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_011IConnectionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_011IConnectionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_011IConnectionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android8hardware5media10bufferpool4V2_014implementation19BufferPoolAllocatorE",
   "name" : "android::hardware::media::bufferpool::V2_0::implementation::BufferPoolAllocator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware5media10bufferpool4V2_014implementation19BufferPoolAllocatorE",
   "self_type" : "_ZTIN7android8hardware5media10bufferpool4V2_014implementation19BufferPoolAllocatorE",
   "size" : 4,
   "source_file" : "frameworks/av/media/bufferpool/2.0/include/bufferpool/BufferPoolTypes.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_014implementation19BufferPoolAllocatorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014implementation19BufferPoolAllocator8allocateERKNSt3__16vectorIhNS6_9allocatorIhEEEEPNS6_10shared_ptrINS4_20BufferPoolAllocationEEEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014implementation19BufferPoolAllocator10compatibleERKNSt3__16vectorIhNS6_9allocatorIhEEEESC_"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014implementation19BufferPoolAllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014implementation19BufferPoolAllocatorD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mHandle",
     "referenced_type" : "_ZTIPK13native_handle"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media10bufferpool4V2_014implementation20BufferPoolAllocationE",
   "name" : "android::hardware::media::bufferpool::V2_0::implementation::BufferPoolAllocation",
   "referenced_type" : "_ZTIN7android8hardware5media10bufferpool4V2_014implementation20BufferPoolAllocationE",
   "self_type" : "_ZTIN7android8hardware5media10bufferpool4V2_014implementation20BufferPoolAllocationE",
   "size" : 4,
   "source_file" : "frameworks/av/media/bufferpool/2.0/include/bufferpool/BufferPoolTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "transactionId",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "bufferId",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "newStatus",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android8hardware5media10bufferpool4V2_012BufferStatusE"
    },
    {
     "field_name" : "connectionId",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "targetConnectionId",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "timestampUs",
     "field_offset" : 256,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media10bufferpool4V2_019BufferStatusMessageE",
   "name" : "android::hardware::media::bufferpool::V2_0::BufferStatusMessage",
   "referenced_type" : "_ZTIN7android8hardware5media10bufferpool4V2_019BufferStatusMessageE",
   "self_type" : "_ZTIN7android8hardware5media10bufferpool4V2_019BufferStatusMessageE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "messageId",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fromBufferId",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "toBufferId",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media10bufferpool4V2_025BufferInvalidationMessageE",
   "name" : "android::hardware::media::bufferpool::V2_0::BufferInvalidationMessage",
   "referenced_type" : "_ZTIN7android8hardware5media10bufferpool4V2_025BufferInvalidationMessageE",
   "self_type" : "_ZTIN7android8hardware5media10bufferpool4V2_025BufferInvalidationMessageE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android8hardware11hidl_handleE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media10bufferpool4V2_06BufferE",
   "name" : "android::hardware::media::bufferpool::V2_0::Buffer",
   "referenced_type" : "_ZTIN7android8hardware5media10bufferpool4V2_06BufferE",
   "self_type" : "_ZTIN7android8hardware5media10bufferpool4V2_06BufferE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media10bufferpool4V2_09IAccessorE",
   "name" : "android::hardware::media::bufferpool::V2_0::IAccessor",
   "referenced_type" : "_ZTIN7android8hardware5media10bufferpool4V2_09IAccessorE",
   "self_type" : "_ZTIN7android8hardware5media10bufferpool4V2_09IAccessorE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/IAccessor.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IAccessorE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media10bufferpool4V2_09IAccessor8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessorD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor7connectERKNS_2spINS3_9IObserverEEENSt3__18functionIFvNS3_12ResultStatusERKNS5_INS3_11IConnectionEEExjRKNS0_12MQDescriptorINS3_19BufferStatusMessageELNS0_8MQFlavorE1EEERKNSH_INS3_25BufferInvalidationMessageELSJ_2EEEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IAccessorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IAccessorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IAccessorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media10bufferpool4V2_09IObserverE",
   "name" : "android::hardware::media::bufferpool::V2_0::IObserver",
   "referenced_type" : "_ZTIN7android8hardware5media10bufferpool4V2_09IObserverE",
   "self_type" : "_ZTIN7android8hardware5media10bufferpool4V2_09IObserverE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/IObserver.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IObserverE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media10bufferpool4V2_09IObserver8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserverD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver9onMessageExj"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnIvEE",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ReturnIvEE",
   "self_type" : "_ZTIN7android8hardware6ReturnIvEE",
   "size" : 24,
   "source_file" : "system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6StatusE",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6StatusE",
   "self_type" : "_ZTIN7android8hardware6StatusE",
   "size" : 20,
   "source_file" : "system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTI13native_handle" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:114:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIK13native_handle" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPK13native_handle"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:114:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIKc" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:114:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIN7android8hardware17GrantorDescriptorE" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPN7android8hardware17GrantorDescriptorE"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:114:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "_ZTIN7android8hardware6StatusE"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details13return_statusE",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware7details13return_statusE",
   "self_type" : "_ZTIN7android8hardware7details13return_statusE",
   "size" : 24,
   "source_file" : "system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS0_IPvNS_9allocatorIS9_EEEEEEENSA_ISF_EEEE"
    },
    {
     "access" : "protected",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorUt_E"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details16HidlInstrumentorE",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE",
   "self_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE",
   "size" : 44,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mEnableInstrumentation",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "mReserved0",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details16HidlInstrumentorUt_E",
   "name" : "android::hardware::details::HidlInstrumentor::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:204:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorUt_E",
   "self_type" : "_ZTIN7android8hardware7details16HidlInstrumentorUt_E",
   "size" : 4,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details5i_tagE",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "_ZTIN7android8hardware7details5i_tagE",
   "self_type" : "_ZTIN7android8hardware7details5i_tagE",
   "size" : 1,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details6bs_tagE",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "_ZTIN7android8hardware7details6bs_tagE",
   "self_type" : "_ZTIN7android8hardware7details6bs_tagE",
   "size" : 1,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details8bnhw_tagE",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "_ZTIN7android8hardware7details8bnhw_tagE",
   "self_type" : "_ZTIN7android8hardware7details8bnhw_tagE",
   "size" : 1,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details8bphw_tagE",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "_ZTIN7android8hardware7details8bphw_tagE",
   "self_type" : "_ZTIN7android8hardware7details8bphw_tagE",
   "size" : 1,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE",
   "self_type" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "_ZTIN7android8hardware17GrantorDescriptorE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mEfWordNeedsUnmapping",
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mEfWordPtr",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPNSt3__16atomicIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware9EventFlagE",
   "name" : "android::hardware::EventFlag",
   "referenced_type" : "_ZTIN7android8hardware9EventFlagE",
   "self_type" : "_ZTIN7android8hardware9EventFlagE",
   "size" : 8,
   "source_file" : "system/libfmq/include/fmq/EventFlag.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIA5121_h"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "_ZTI12logger_entry"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7log_msgUt_E",
   "name" : "log_msg::(anonymous union at system/logging/liblog/include_vndk/log/log_read.h:58:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7log_msgUt_E",
   "self_type" : "_ZTIN7log_msgUt_E",
   "size" : 5124,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android2spINS_8hardware5media10bufferpool4V2_09IObserverEEE",
   "name" : "android::sp<android::hardware::media::bufferpool::V2_0::IObserver> &&",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media10bufferpool4V2_09IObserverEEE",
   "self_type" : "_ZTION7android2spINS_8hardware5media10bufferpool4V2_09IObserverEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser> &&",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTION7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android8hardware11hidl_handleE",
   "name" : "android::hardware::hidl_handle &&",
   "referenced_type" : "_ZTIN7android8hardware11hidl_handleE",
   "self_type" : "_ZTION7android8hardware11hidl_handleE",
   "size" : 4,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android8hardware11hidl_memoryE",
   "name" : "android::hardware::hidl_memory &&",
   "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE",
   "self_type" : "_ZTION7android8hardware11hidl_memoryE",
   "size" : 4,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android8hardware6ReturnIvEE",
   "name" : "android::hardware::Return<void> &&",
   "referenced_type" : "_ZTIN7android8hardware6ReturnIvEE",
   "self_type" : "_ZTION7android8hardware6ReturnIvEE",
   "size" : 4,
   "source_file" : "system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android8hardware6StatusE",
   "name" : "android::hardware::Status &&",
   "referenced_type" : "_ZTIN7android8hardware6StatusE",
   "self_type" : "_ZTION7android8hardware6StatusE",
   "size" : 4,
   "source_file" : "system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android8hardware7details13return_statusE",
   "name" : "android::hardware::details::return_status &&",
   "referenced_type" : "_ZTIN7android8hardware7details13return_statusE",
   "self_type" : "_ZTION7android8hardware7details13return_statusE",
   "size" : 4,
   "source_file" : "system/libhidl/base/include/hidl/Status.h"
  }
 ]
}
