{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA56_h",
   "name" : "unsigned char [56]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA56_h",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIt",
   "name" : "unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIt",
   "size" : 2
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" : [],
 "function_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFiPPKvS1_E",
   "name" : "int (const void **, const void **)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPPKv"
    },
    {
     "referenced_type" : "_ZTIPPKv"
    }
   ],
   "referenced_type" : "_ZTIFiPPKvS1_E",
   "return_type" : "_ZTIi",
   "self_type" : "_ZTIFiPPKvS1_E",
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "functions" :
 [
  {
   "function_name" : "CBS_asn1_bitstring_has_bit",
   "linker_set_key" : "CBS_asn1_bitstring_has_bit",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_asn1_oid_to_text",
   "linker_set_key" : "CBS_asn1_oid_to_text",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    }
   ],
   "return_type" : "_ZTIPc",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_contains_zero_byte",
   "linker_set_key" : "CBS_contains_zero_byte",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_copy_bytes",
   "linker_set_key" : "CBS_copy_bytes",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPh"
    },
    {
     "referenced_type" : "_ZTIm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_data",
   "linker_set_key" : "CBS_data",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    }
   ],
   "return_type" : "_ZTIPKh",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_any_asn1",
   "linker_set_key" : "CBS_get_any_asn1",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_any_asn1_element",
   "linker_set_key" : "CBS_get_any_asn1_element",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPj"
    },
    {
     "referenced_type" : "_ZTIPm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_any_ber_asn1_element",
   "linker_set_key" : "CBS_get_any_ber_asn1_element",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPj"
    },
    {
     "referenced_type" : "_ZTIPm"
    },
    {
     "referenced_type" : "_ZTIPi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_asn1",
   "linker_set_key" : "CBS_get_asn1",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_asn1_bool",
   "linker_set_key" : "CBS_get_asn1_bool",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_asn1_element",
   "linker_set_key" : "CBS_get_asn1_element",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_asn1_int64",
   "linker_set_key" : "CBS_get_asn1_int64",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPl"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_asn1_uint64",
   "linker_set_key" : "CBS_get_asn1_uint64",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_bytes",
   "linker_set_key" : "CBS_get_bytes",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_last_u8",
   "linker_set_key" : "CBS_get_last_u8",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPh"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_optional_asn1",
   "linker_set_key" : "CBS_get_optional_asn1",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPi"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_optional_asn1_bool",
   "linker_set_key" : "CBS_get_optional_asn1_bool",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPi"
    },
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_optional_asn1_octet_string",
   "linker_set_key" : "CBS_get_optional_asn1_octet_string",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPi"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_optional_asn1_uint64",
   "linker_set_key" : "CBS_get_optional_asn1_uint64",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPm"
    },
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_u16",
   "linker_set_key" : "CBS_get_u16",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPt"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_u16_length_prefixed",
   "linker_set_key" : "CBS_get_u16_length_prefixed",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIP6cbs_st"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_u16le",
   "linker_set_key" : "CBS_get_u16le",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPt"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_u24",
   "linker_set_key" : "CBS_get_u24",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_u24_length_prefixed",
   "linker_set_key" : "CBS_get_u24_length_prefixed",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIP6cbs_st"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_u32",
   "linker_set_key" : "CBS_get_u32",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_u32le",
   "linker_set_key" : "CBS_get_u32le",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_u64",
   "linker_set_key" : "CBS_get_u64",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_u64le",
   "linker_set_key" : "CBS_get_u64le",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_u8",
   "linker_set_key" : "CBS_get_u8",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPh"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_get_u8_length_prefixed",
   "linker_set_key" : "CBS_get_u8_length_prefixed",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIP6cbs_st"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_init",
   "linker_set_key" : "CBS_init",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPKh"
    },
    {
     "referenced_type" : "_ZTIm"
    }
   ],
   "return_type" : "_ZTIv",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_is_unsigned_asn1_integer",
   "linker_set_key" : "CBS_is_unsigned_asn1_integer",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_is_valid_asn1_bitstring",
   "linker_set_key" : "CBS_is_valid_asn1_bitstring",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_is_valid_asn1_integer",
   "linker_set_key" : "CBS_is_valid_asn1_integer",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_len",
   "linker_set_key" : "CBS_len",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    }
   ],
   "return_type" : "_ZTIm",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_mem_equal",
   "linker_set_key" : "CBS_mem_equal",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPKh"
    },
    {
     "referenced_type" : "_ZTIm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_peek_asn1_tag",
   "linker_set_key" : "CBS_peek_asn1_tag",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_skip",
   "linker_set_key" : "CBS_skip",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP6cbs_st"
    },
    {
     "referenced_type" : "_ZTIm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_stow",
   "linker_set_key" : "CBS_stow",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPPh"
    },
    {
     "referenced_type" : "_ZTIPm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "function_name" : "CBS_strdup",
   "linker_set_key" : "CBS_strdup",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK6cbs_st"
    },
    {
     "referenced_type" : "_ZTIPPc"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  }
 ],
 "global_vars" : [],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP13cbb_buffer_st",
   "name" : "cbb_buffer_st *",
   "referenced_type" : "_ZTI13cbb_buffer_st",
   "self_type" : "_ZTIP13cbb_buffer_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP13stack_st_void",
   "name" : "stack_st_void *",
   "referenced_type" : "_ZTI13stack_st_void",
   "self_type" : "_ZTIP13stack_st_void",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP20CRYPTO_dynlock_value",
   "name" : "CRYPTO_dynlock_value *",
   "referenced_type" : "_ZTI20CRYPTO_dynlock_value",
   "self_type" : "_ZTIP20CRYPTO_dynlock_value",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP6cbb_st",
   "name" : "cbb_st *",
   "referenced_type" : "_ZTI6cbb_st",
   "self_type" : "_ZTIP6cbb_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIP6cbs_st",
   "name" : "cbs_st *",
   "referenced_type" : "_ZTI6cbs_st",
   "self_type" : "_ZTIP6cbs_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFiPPKvS1_E",
   "name" : "int (*)(const void **, const void **)",
   "referenced_type" : "_ZTIFiPPKvS1_E",
   "self_type" : "_ZTIPFiPPKvS1_E",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK6cbs_st",
   "name" : "const cbs_st *",
   "referenced_type" : "_ZTIK6cbs_st",
   "self_type" : "_ZTIPK6cbs_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKh",
   "name" : "const unsigned char *",
   "referenced_type" : "_ZTIKh",
   "self_type" : "_ZTIPKh",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKv",
   "name" : "const void **",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIPPKv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPc",
   "name" : "char **",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIPPc",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPh",
   "name" : "unsigned char **",
   "referenced_type" : "_ZTIPh",
   "self_type" : "_ZTIPPh",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPl",
   "name" : "long *",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIPl",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPt",
   "name" : "unsigned short *",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIPt",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK6cbs_st",
   "name" : "const cbs_st",
   "referenced_type" : "_ZTI6cbs_st",
   "self_type" : "_ZTIK6cbs_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cap",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "can_resize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "error",
     "field_offset" : 200,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI13cbb_buffer_st",
   "name" : "cbb_buffer_st",
   "referenced_type" : "_ZTI13cbb_buffer_st",
   "self_type" : "_ZTI13cbb_buffer_st",
   "size" : 32,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
    }
   ],
   "linker_set_key" : "_ZTI14CRYPTO_dynlock",
   "name" : "CRYPTO_dynlock",
   "referenced_type" : "_ZTI14CRYPTO_dynlock",
   "self_type" : "_ZTI14CRYPTO_dynlock",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTIA56_h"
    }
   ],
   "linker_set_key" : "_ZTI15crypto_mutex_st",
   "name" : "crypto_mutex_st",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15crypto_mutex_st",
   "self_type" : "_ZTI15crypto_mutex_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sk",
     "referenced_type" : "_ZTIP13stack_st_void"
    }
   ],
   "linker_set_key" : "_ZTI17crypto_ex_data_st",
   "name" : "crypto_ex_data_st",
   "referenced_type" : "_ZTI17crypto_ex_data_st",
   "self_type" : "_ZTI17crypto_ex_data_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIP13cbb_buffer_st"
    },
    {
     "field_name" : "child",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP6cbb_st"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pending_len_len",
     "field_offset" : 192,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pending_is_asn1",
     "field_offset" : 200,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "is_child",
     "field_offset" : 208,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI6cbb_st",
   "name" : "cbb_st",
   "referenced_type" : "_ZTI6cbb_st",
   "self_type" : "_ZTI6cbb_st",
   "size" : 32,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI6cbs_st",
   "name" : "cbs_st",
   "referenced_type" : "_ZTI6cbs_st",
   "self_type" : "_ZTI6cbs_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/bytestring.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPPv"
    },
    {
     "field_name" : "sorted",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_alloc",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "comp",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiPPKvS1_E"
    }
   ],
   "linker_set_key" : "_ZTI8stack_st",
   "name" : "stack_st",
   "referenced_type" : "_ZTI8stack_st",
   "self_type" : "_ZTI8stack_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "rvalue_reference_types" : []
}
