#ifndef HIDL_GENERATED_ANDROID_HARDWARE_TV_TUNER_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_TV_TUNER_V1_0_TYPES_H

#include <android/hidl/safe_union/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace tv {
namespace tuner {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class Result : int32_t;
enum class FrontendType : uint32_t;
enum class FrontendInnerFec : uint64_t;
enum class FrontendAtscModulation : uint32_t;
struct FrontendAtscSettings;
struct FrontendAtscCapabilities;
enum class FrontendAtsc3Modulation : uint32_t;
enum class FrontendAtsc3Bandwidth : uint32_t;
enum class FrontendAtsc3TimeInterleaveMode : uint32_t;
enum class FrontendAtsc3CodeRate : uint32_t;
enum class FrontendAtsc3Fec : uint32_t;
enum class FrontendAtsc3DemodOutputFormat : uint8_t;
struct FrontendAtsc3PlpSettings;
struct FrontendAtsc3Settings;
struct FrontendAtsc3Capabilities;
enum class FrontendDvbsModulation : int32_t;
enum class FrontendDvbsRolloff : uint32_t;
enum class FrontendDvbsPilot : uint32_t;
struct FrontendDvbsCodeRate;
enum class FrontendDvbsStandard : uint8_t;
enum class FrontendDvbsVcmMode : uint32_t;
struct FrontendDvbsSettings;
struct FrontendDvbsCapabilities;
enum class FrontendDvbcModulation : uint32_t;
enum class FrontendDvbcOuterFec : uint32_t;
enum class FrontendDvbcAnnex : uint8_t;

enum class FrontendDvbtStandard : uint8_t;
struct FrontendDvbtSettings;
struct FrontendDvbtCapabilities;
enum class FrontendIsdbsRolloff : uint32_t;
enum class FrontendIsdbsModulation : uint32_t;
enum class FrontendIsdbsCoderate : uint32_t;
enum class FrontendIsdbsStreamIdType : uint32_t;
struct FrontendIsdbsSettings;
struct FrontendIsdbsCapabilities;
enum class FrontendIsdbs3Rolloff : uint32_t;
enum class FrontendIsdbs3Modulation : uint32_t;
enum class FrontendIsdbs3Coderate : uint32_t;
struct FrontendIsdbs3Settings;
struct FrontendIsdbs3Capabilities;
enum class FrontendIsdbtMode : uint32_t;
enum class FrontendIsdbtBandwidth : uint32_t;
enum class FrontendIsdbtModulation : uint32_t;
struct FrontendIsdbtSettings;
struct FrontendIsdbtCapabilities;
enum class FrontendAnalogType : uint32_t;
enum class FrontendAnalogSifStandard : uint32_t;
struct FrontendAnalogSettings;
struct FrontendAnalogCapabilities;
struct FrontendSettings;
enum class FrontendScanType : uint32_t;
enum class FrontendScanMessageType : uint32_t;
struct FrontendScanAtsc3PlpInfo;
struct FrontendScanMessage;
enum class FrontendEventType : uint32_t;
enum class FrontendStatusType : uint32_t;
struct FrontendStatusAtsc3PlpInfo;
struct FrontendModulationStatus;
enum class LnbVoltage : uint32_t;
struct FrontendStatus;
struct FrontendInfo;
enum class LnbTone : int32_t;
enum class LnbPosition : int32_t;
enum class LnbEventType : uint32_t;
enum class DemuxFilterMainType : uint32_t;
enum class DemuxTsFilterType : uint32_t;
enum class DemuxMmtpFilterType : uint32_t;
enum class DemuxIpFilterType : uint32_t;
enum class DemuxTlvFilterType : uint32_t;
enum class DemuxAlpFilterType : uint32_t;
struct DemuxFilterType;
struct DemuxPid;
enum class Constant : uint32_t;
enum class DemuxFilterStatus : uint8_t;
enum class DemuxTsIndex : uint32_t;
enum class DemuxScIndex : uint32_t;
enum class DemuxScHevcIndex : uint32_t;
enum class DemuxRecordScIndexType : uint32_t;
struct DemuxFilterRecordSettings;
struct DemuxFilterSectionBits;
struct DemuxFilterSectionSettings;
struct DemuxFilterPesDataSettings;
struct DemuxFilterAvSettings;
struct DemuxFilterDownloadSettings;
struct DemuxIpAddress;
struct DemuxTsFilterSettings;
struct DemuxMmtpFilterSettings;
struct DemuxIpFilterSettings;
struct DemuxTlvFilterSettings;
enum class DemuxAlpLengthType : uint8_t;
struct DemuxAlpFilterSettings;
struct DemuxFilterSettings;
enum class DemuxQueueNotifyBits : uint32_t;
struct DemuxFilterSectionEvent;
struct AudioExtraMetaData;
struct DemuxFilterMediaEvent;
struct DemuxFilterPesEvent;
struct DemuxFilterTsRecordEvent;
struct DemuxFilterTemiEvent;
struct DemuxFilterMmtpRecordEvent;
struct DemuxFilterDownloadEvent;
struct DemuxFilterIpPayloadEvent;
struct DemuxFilterEvent;
enum class DataFormat : uint32_t;
struct RecordSettings;
enum class PlaybackStatus : uint32_t;
struct PlaybackSettings;
enum class DvrType : uint8_t;
struct DvrSettings;
struct DemuxCapabilities;

// Order of inner types was changed for forward reference support.

enum class Result : int32_t {
    SUCCESS = 0,
    UNAVAILABLE = 1 /* ::android::hardware::tv::tuner::V1_0::Result.SUCCESS implicitly + 1 */,
    NOT_INITIALIZED = 2 /* ::android::hardware::tv::tuner::V1_0::Result.UNAVAILABLE implicitly + 1 */,
    INVALID_STATE = 3 /* ::android::hardware::tv::tuner::V1_0::Result.NOT_INITIALIZED implicitly + 1 */,
    INVALID_ARGUMENT = 4 /* ::android::hardware::tv::tuner::V1_0::Result.INVALID_STATE implicitly + 1 */,
    OUT_OF_MEMORY = 5 /* ::android::hardware::tv::tuner::V1_0::Result.INVALID_ARGUMENT implicitly + 1 */,
    UNKNOWN_ERROR = 6 /* ::android::hardware::tv::tuner::V1_0::Result.OUT_OF_MEMORY implicitly + 1 */,
};

/**
 * Frontend ID.
 */
typedef uint32_t FrontendId;

/**
 *  Frontend Types.
 */
enum class FrontendType : uint32_t {
    UNDEFINED = 0u,
    ANALOG = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendType.UNDEFINED implicitly + 1 */,
    /**
     * Advanced Television Systems Committee (ATSC) Standard A/72.
     */
    ATSC = 2u /* ::android::hardware::tv::tuner::V1_0::FrontendType.ANALOG implicitly + 1 */,
    /**
     * Advanced Television Systems Committee (ATSC 3.0) Standard A/300.
     */
    ATSC3 = 3u /* ::android::hardware::tv::tuner::V1_0::FrontendType.ATSC implicitly + 1 */,
    /**
     * Digital Video Broadcasting - Cable
     * DVB Cable Frontend Standard ETSI EN 300 468 V1.15.1.
     */
    DVBC = 4u /* ::android::hardware::tv::tuner::V1_0::FrontendType.ATSC3 implicitly + 1 */,
    /**
     * Digital Video Broadcasting - Satellite
     * DVB Satellite Frontend Standard ETSI EN 300 468 V1.15.1 and
     * ETSI EN 302 307-2 V1.1.1.
     */
    DVBS = 5u /* ::android::hardware::tv::tuner::V1_0::FrontendType.DVBC implicitly + 1 */,
    /**
     * Digital Video Broadcasting - Terrestrial
     * DVB Terrestrial Frontend Standard ETSI EN 300 468 V1.15.1 and
     * ETSI EN 302 755 V1.4.1.
     */
    DVBT = 6u /* ::android::hardware::tv::tuner::V1_0::FrontendType.DVBS implicitly + 1 */,
    /**
     * Integrated Services Digital Broadcasting-Satellite (ISDB-S)
     * ARIB STD-B20 is technical document of ISDB-S.
     */
    ISDBS = 7u /* ::android::hardware::tv::tuner::V1_0::FrontendType.DVBT implicitly + 1 */,
    /**
     * Integrated Services Digital Broadcasting-Satellite (ISDB-S)
     * ARIB STD-B44 is technical document of ISDB-S3.
     */
    ISDBS3 = 8u /* ::android::hardware::tv::tuner::V1_0::FrontendType.ISDBS implicitly + 1 */,
    /**
     * Integrated Services Digital Broadcasting-Terrestrial (ISDB-T or SBTVD)
     * ABNT NBR 15603 is technical document of ISDB-T.
     */
    ISDBT = 9u /* ::android::hardware::tv::tuner::V1_0::FrontendType.ISDBS3 implicitly + 1 */,
};

/**
 *  Inner Forward Error Correction type as specified in ETSI EN 300 468 V1.15.1
 *  and ETSI EN 302 307-2 V1.1.1.
 */
enum class FrontendInnerFec : uint64_t {
    /**
     * Not defined
     */
    FEC_UNDEFINED = 0ull,
    /**
     * hardware is able to detect and set FEC automatically
     */
    AUTO = 1ull /* 1 << 0 */,
    /**
     * 1/2 conv. code rate
     */
    FEC_1_2 = 2ull /* 1 << 1 */,
    /**
     * 1/3 conv. code rate
     */
    FEC_1_3 = 4ull /* 1 << 2 */,
    /**
     * 1/4 conv. code rate
     */
    FEC_1_4 = 8ull /* 1 << 3 */,
    /**
     * 1/5 conv. code rate
     */
    FEC_1_5 = 16ull /* 1 << 4 */,
    /**
     * 2/3 conv. code rate
     */
    FEC_2_3 = 32ull /* 1 << 5 */,
    /**
     * 2/5 conv. code rate
     */
    FEC_2_5 = 64ull /* 1 << 6 */,
    /**
     * 2/9 conv. code rate
     */
    FEC_2_9 = 128ull /* 1 << 7 */,
    /**
     * 3/4 conv. code rate
     */
    FEC_3_4 = 256ull /* 1 << 8 */,
    /**
     * 3/5 conv. code rate
     */
    FEC_3_5 = 512ull /* 1 << 9 */,
    /**
     * 4/5 conv. code rate
     */
    FEC_4_5 = 1024ull /* 1 << 10 */,
    /**
     * 4/15 conv. code rate
     */
    FEC_4_15 = 2048ull /* 1 << 11 */,
    /**
     * 5/6 conv. code rate
     */
    FEC_5_6 = 4096ull /* 1 << 12 */,
    /**
     * 5/9 conv. code rate
     */
    FEC_5_9 = 8192ull /* 1 << 13 */,
    /**
     * 6/7 conv. code rate
     */
    FEC_6_7 = 16384ull /* 1 << 14 */,
    /**
     * 7/8 conv. code rate
     */
    FEC_7_8 = 32768ull /* 1 << 15 */,
    /**
     * 7/9 conv. code rate
     */
    FEC_7_9 = 65536ull /* 1 << 16 */,
    /**
     * 7/15 conv. code rate
     */
    FEC_7_15 = 131072ull /* 1 << 17 */,
    /**
     * 8/9 conv. code rate
     */
    FEC_8_9 = 262144ull /* 1 << 18 */,
    /**
     * 8/15 conv. code rate
     */
    FEC_8_15 = 524288ull /* 1 << 19 */,
    /**
     * 9/10 conv. code rate
     */
    FEC_9_10 = 1048576ull /* 1 << 20 */,
    /**
     * 9/20 conv. code rate
     */
    FEC_9_20 = 2097152ull /* 1 << 21 */,
    /**
     * 11/15 conv. code rate
     */
    FEC_11_15 = 4194304ull /* 1 << 22 */,
    /**
     * 11/20 conv. code rate
     */
    FEC_11_20 = 8388608ull /* 1 << 23 */,
    /**
     * 11/45 conv. code rate
     */
    FEC_11_45 = 16777216ull /* 1 << 24 */,
    /**
     * 13/18 conv. code rate
     */
    FEC_13_18 = 33554432ull /* 1 << 25 */,
    /**
     * 13/45 conv. code rate
     */
    FEC_13_45 = 67108864ull /* 1 << 26 */,
    /**
     * 14/45 conv. code rate
     */
    FEC_14_45 = 134217728ull /* 1 << 27 */,
    /**
     * 23/36 conv. code rate
     */
    FEC_23_36 = 268435456ull /* 1 << 28 */,
    /**
     * 25/36 conv. code rate
     */
    FEC_25_36 = 536870912ull /* 1 << 29 */,
    /**
     * 26/45 conv. code rate
     */
    FEC_26_45 = 1073741824ull /* 1 << 30 */,
    /**
     * 28/45 conv. code rate
     */
    FEC_28_45 = 18446744071562067968ull /* 1 << 31 */,
    /**
     * 29/45 conv. code rate
     */
    FEC_29_45 = 1ull /* 1 << 32 */,
    /**
     * 31/45 conv. code rate
     */
    FEC_31_45 = 2ull /* 1 << 33 */,
    /**
     * 32/45 conv. code rate
     */
    FEC_32_45 = 4ull /* 1 << 34 */,
    /**
     * 77/90 conv. code rate
     */
    FEC_77_90 = 8ull /* 1 << 35 */,
};

/**
 *  Modulation Type for ATSC.
 */
enum class FrontendAtscModulation : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set modulation automatically
     */
    AUTO = 1u /* 1 << 0 */,
    MOD_8VSB = 4u /* 1 << 2 */,
    MOD_16VSB = 8u /* 1 << 3 */,
};

/**
 *  Signal Settings for an ATSC Frontend.
 */
struct FrontendAtscSettings final {
    /**
     * Signal frequency in Hertz
     */
    uint32_t frequency __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendAtscModulation modulation __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtscSettings, frequency) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtscSettings, modulation) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendAtscSettings) == 8, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendAtscSettings) == 4, "wrong alignment");

/**
 *  Capabilities for ATSC Frontend.
 */
struct FrontendAtscCapabilities final {
    /**
     * Modulation capability
     */
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendAtscModulation> modulationCap __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtscCapabilities, modulationCap) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendAtscCapabilities) == 4, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendAtscCapabilities) == 4, "wrong alignment");

/**
 *  Modulation Type for ATSC3.
 */
enum class FrontendAtsc3Modulation : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set modulation automatically
     */
    AUTO = 1u /* 1 << 0 */,
    MOD_QPSK = 2u /* 1 << 1 */,
    MOD_16QAM = 4u /* 1 << 2 */,
    MOD_64QAM = 8u /* 1 << 3 */,
    MOD_256QAM = 16u /* 1 << 4 */,
    MOD_1024QAM = 32u /* 1 << 5 */,
    MOD_4096QAM = 64u /* 1 << 6 */,
};

/**
 *  Bandwidth for ATSC3.
 */
enum class FrontendAtsc3Bandwidth : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set bandwidth automatically
     */
    AUTO = 1u /* 1 << 0 */,
    BANDWIDTH_6MHZ = 2u /* 1 << 1 */,
    BANDWIDTH_7MHZ = 4u /* 1 << 2 */,
    BANDWIDTH_8MHZ = 8u /* 1 << 3 */,
};

/**
 *  Time Interleave Mode for ATSC3.
 */
enum class FrontendAtsc3TimeInterleaveMode : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set TimeInterleaveMode automatically
     */
    AUTO = 1u /* 1 << 0 */,
    CTI = 2u /* 1 << 1 */,
    HTI = 4u /* 1 << 2 */,
};

/**
 *  Code Rate for ATSC3.
 */
enum class FrontendAtsc3CodeRate : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Coderate automatically
     */
    AUTO = 1u /* 1 << 0 */,
    CODERATE_2_15 = 2u /* 1 << 1 */,
    CODERATE_3_15 = 4u /* 1 << 2 */,
    CODERATE_4_15 = 8u /* 1 << 3 */,
    CODERATE_5_15 = 16u /* 1 << 4 */,
    CODERATE_6_15 = 32u /* 1 << 5 */,
    CODERATE_7_15 = 64u /* 1 << 6 */,
    CODERATE_8_15 = 128u /* 1 << 7 */,
    CODERATE_9_15 = 256u /* 1 << 8 */,
    CODERATE_10_15 = 512u /* 1 << 9 */,
    CODERATE_11_15 = 1024u /* 1 << 10 */,
    CODERATE_12_15 = 2048u /* 1 << 11 */,
    CODERATE_13_15 = 4096u /* 1 << 12 */,
};

/**
 *  Forward Error Correction (FEC) for ATSC3.
 */
enum class FrontendAtsc3Fec : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set FEC automatically
     */
    AUTO = 1u /* 1 << 0 */,
    BCH_LDPC_16K = 2u /* 1 << 1 */,
    BCH_LDPC_64K = 4u /* 1 << 2 */,
    CRC_LDPC_16K = 8u /* 1 << 3 */,
    CRC_LDPC_64K = 16u /* 1 << 4 */,
    LDPC_16K = 32u /* 1 << 5 */,
    LDPC_64K = 64u /* 1 << 6 */,
};

/**
 *  Demodulator Output Format for an ATSC3 Frontend.
 */
enum class FrontendAtsc3DemodOutputFormat : uint8_t {
    /**
     * Dummy. Scan uses this.
     */
    UNDEFINED = 0,
    /**
     * ALP format. Typically used in US region.
     */
    ATSC3_LINKLAYER_PACKET = 1 /* 1 << 0 */,
    /**
     * BaseBand packet format. Typically used in Korea region.
     */
    BASEBAND_PACKET = 2 /* 1 << 1 */,
};

/**
 *  PLP basis Signal Settings for an ATSC3 Frontend.
 */
struct FrontendAtsc3PlpSettings final {
    uint8_t plpId __attribute__ ((aligned(1)));
    ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Modulation modulation __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendAtsc3TimeInterleaveMode interleaveMode __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendAtsc3CodeRate codeRate __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Fec fec __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3PlpSettings, plpId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3PlpSettings, modulation) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3PlpSettings, interleaveMode) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3PlpSettings, codeRate) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3PlpSettings, fec) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3PlpSettings) == 20, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3PlpSettings) == 4, "wrong alignment");

/**
 *  Signal Settings for an ATSC3 Frontend.
 */
struct FrontendAtsc3Settings final {
    /**
     * Signal frequency in Hertz
     */
    uint32_t frequency __attribute__ ((aligned(4)));
    /**
     * Bandwidth of tuning band.
     */
    ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Bandwidth bandwidth __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendAtsc3DemodOutputFormat demodOutputFormat __attribute__ ((aligned(1)));
    ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendAtsc3PlpSettings> plpSettings __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings, frequency) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings, bandwidth) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings, demodOutputFormat) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings, plpSettings) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings) == 32, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings) == 8, "wrong alignment");

/**
 *  Capabilities for ATSC3 Frontend.
 */
struct FrontendAtsc3Capabilities final {
    /**
     * Bandwidth capability
     */
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendAtsc3Bandwidth> bandwidthCap __attribute__ ((aligned(4)));
    /**
     * Modulation capability
     */
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendAtsc3Modulation> modulationCap __attribute__ ((aligned(4)));
    /**
     * TimeInterleaveMode capability
     */
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendAtsc3TimeInterleaveMode> timeInterleaveModeCap __attribute__ ((aligned(4)));
    /**
     * CodeRate capability
     */
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendAtsc3CodeRate> codeRateCap __attribute__ ((aligned(4)));
    /**
     * FEC capability
     */
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendAtsc3Fec> fecCap __attribute__ ((aligned(4)));
    /**
     * Demodulator Output Format capability
     */
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendAtsc3DemodOutputFormat> demodOutputFormatCap __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities, bandwidthCap) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities, modulationCap) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities, timeInterleaveModeCap) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities, codeRateCap) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities, fecCap) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities, demodOutputFormatCap) == 20, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities) == 24, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities) == 4, "wrong alignment");

/**
 *  Modulation Type for DVBS.
 */
enum class FrontendDvbsModulation : int32_t {
    UNDEFINED = 0,
    /**
     * hardware is able to detect and set Modulation automatically
     */
    AUTO = 1 /* 1 << 0 */,
    MOD_QPSK = 2 /* 1 << 1 */,
    MOD_8PSK = 4 /* 1 << 2 */,
    MOD_16QAM = 8 /* 1 << 3 */,
    MOD_16PSK = 16 /* 1 << 4 */,
    MOD_32PSK = 32 /* 1 << 5 */,
    MOD_ACM = 64 /* 1 << 6 */,
    MOD_8APSK = 128 /* 1 << 7 */,
    MOD_16APSK = 256 /* 1 << 8 */,
    MOD_32APSK = 512 /* 1 << 9 */,
    MOD_64APSK = 1024 /* 1 << 10 */,
    MOD_128APSK = 2048 /* 1 << 11 */,
    MOD_256APSK = 4096 /* 1 << 12 */,
    /**
     * Reserved for Proprietary modulation
     */
    MOD_RESERVED = 8192 /* 1 << 13 */,
};

/**
 *  Roll Off value for DVBS.
 */
enum class FrontendDvbsRolloff : uint32_t {
    UNDEFINED = 0u,
    ROLLOFF_0_35 = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbsRolloff.UNDEFINED implicitly + 1 */,
    ROLLOFF_0_25 = 2u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbsRolloff.ROLLOFF_0_35 implicitly + 1 */,
    ROLLOFF_0_20 = 3u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbsRolloff.ROLLOFF_0_25 implicitly + 1 */,
    ROLLOFF_0_15 = 4u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbsRolloff.ROLLOFF_0_20 implicitly + 1 */,
    ROLLOFF_0_10 = 5u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbsRolloff.ROLLOFF_0_15 implicitly + 1 */,
    ROLLOFF_0_5 = 6u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbsRolloff.ROLLOFF_0_10 implicitly + 1 */,
};

/**
 *  Pilot mode for DVBS.
 */
enum class FrontendDvbsPilot : uint32_t {
    UNDEFINED = 0u,
    ON = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbsPilot.UNDEFINED implicitly + 1 */,
    OFF = 2u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbsPilot.ON implicitly + 1 */,
    AUTO = 3u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbsPilot.OFF implicitly + 1 */,
};

/**
 *  Code Rate for DVBS.
 */
struct FrontendDvbsCodeRate final {
    ::android::hardware::tv::tuner::V1_0::FrontendInnerFec fec __attribute__ ((aligned(8)));
    bool isLinear __attribute__ ((aligned(1)));
    /**
     * true if enable short frame
     */
    bool isShortFrames __attribute__ ((aligned(1)));
    /**
     * bits number in 1000 symbol. 0 if use the default.
     */
    uint32_t bitsPer1000Symbol __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsCodeRate, fec) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsCodeRate, isLinear) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsCodeRate, isShortFrames) == 9, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsCodeRate, bitsPer1000Symbol) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendDvbsCodeRate) == 16, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendDvbsCodeRate) == 8, "wrong alignment");

/**
 *  Sub standards in DVBS.
 */
enum class FrontendDvbsStandard : uint8_t {
    AUTO = 1 /* 1 << 0 */,
    S = 2 /* 1 << 1 */,
    S2 = 4 /* 1 << 2 */,
    S2X = 8 /* 1 << 3 */,
};

/**
 *   VCM mode in DVBS.
 */
enum class FrontendDvbsVcmMode : uint32_t {
    UNDEFINED = 0u,
    AUTO = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbsVcmMode.UNDEFINED implicitly + 1 */,
    MANUAL = 2u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbsVcmMode.AUTO implicitly + 1 */,
};

/**
 *  Signal Settings for an DVBS Frontend.
 */
struct FrontendDvbsSettings final {
    /**
     * Signal frequency in Hertz
     */
    uint32_t frequency __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbsModulation modulation __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbsCodeRate coderate __attribute__ ((aligned(8)));
    /**
     * Symbols per second
     */
    uint32_t symbolRate __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbsRolloff rolloff __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbsPilot pilot __attribute__ ((aligned(4)));
    uint32_t inputStreamId __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbsStandard standard __attribute__ ((aligned(1)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbsVcmMode vcmMode __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings, frequency) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings, modulation) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings, coderate) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings, symbolRate) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings, rolloff) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings, pilot) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings, inputStreamId) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings, standard) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings, vcmMode) == 44, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings) == 48, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings) == 8, "wrong alignment");

/**
 *  Capabilities for DVBS Frontend.
 */
struct FrontendDvbsCapabilities final {
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbsModulation> modulationCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendInnerFec> innerfecCap __attribute__ ((aligned(8)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbsStandard> standard __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsCapabilities, modulationCap) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsCapabilities, innerfecCap) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbsCapabilities, standard) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendDvbsCapabilities) == 24, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendDvbsCapabilities) == 8, "wrong alignment");

/**
 *  Modulation Type for DVBC.
 */
enum class FrontendDvbcModulation : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Modulation automatically
     */
    AUTO = 1u /* 1 << 0 */,
    MOD_16QAM = 2u /* 1 << 1 */,
    MOD_32QAM = 4u /* 1 << 2 */,
    MOD_64QAM = 8u /* 1 << 3 */,
    MOD_128QAM = 16u /* 1 << 4 */,
    MOD_256QAM = 32u /* 1 << 5 */,
};

/**
 *  Outer Forward Error Correction (FEC) Type for DVBC.
 */
enum class FrontendDvbcOuterFec : uint32_t {
    UNDEFINED = 0u,
    OUTER_FEC_NONE = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbcOuterFec.UNDEFINED implicitly + 1 */,
    OUTER_FEC_RS = 2u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbcOuterFec.OUTER_FEC_NONE implicitly + 1 */,
};

/**
 *   Annex Type for DVBC.
 */
enum class FrontendDvbcAnnex : uint8_t {
    UNDEFINED = 0,
    A = 1 /* 1 << 0 */,
    B = 2 /* 1 << 1 */,
    C = 4 /* 1 << 2 */,
};

/**
 *   Spectral Inversion Type for DVBC.
 */
enum class FrontendDvbcSpectralInversion : uint32_t {
    UNDEFINED = 0u,
    NORMAL = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbcSpectralInversion.UNDEFINED implicitly + 1 */,
    INVERTED = 2u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbcSpectralInversion.NORMAL implicitly + 1 */,
};

/**
 *  Signal Settings for an DVBC Frontend.
 */
struct FrontendDvbcSettings final {
    /**
     * Signal frequency in Hertz
     */
    uint32_t frequency __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbcModulation modulation __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendInnerFec fec __attribute__ ((aligned(8)));
    /**
     * Symbols per second
     */
    uint32_t symbolRate __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbcOuterFec outerFec __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbcAnnex annex __attribute__ ((aligned(1)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbcSpectralInversion spectralInversion __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings, frequency) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings, modulation) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings, fec) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings, symbolRate) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings, outerFec) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings, annex) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings, spectralInversion) == 28, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings) == 32, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings) == 8, "wrong alignment");

/**
 *  Capabilities for DVBC Frontend.
 */
struct FrontendDvbcCapabilities final {
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbcModulation> modulationCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendInnerFec> fecCap __attribute__ ((aligned(8)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbcAnnex> annexCap __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbcCapabilities, modulationCap) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbcCapabilities, fecCap) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbcCapabilities, annexCap) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendDvbcCapabilities) == 24, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendDvbcCapabilities) == 8, "wrong alignment");

/**
 *  Bandwidth Type for DVBT.
 */
enum class FrontendDvbtBandwidth : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Bandwidth automatically
     */
    AUTO = 1u /* 1 << 0 */,
    BANDWIDTH_8MHZ = 2u /* 1 << 1 */,
    BANDWIDTH_7MHZ = 4u /* 1 << 2 */,
    BANDWIDTH_6MHZ = 8u /* 1 << 3 */,
    BANDWIDTH_5MHZ = 16u /* 1 << 4 */,
    BANDWIDTH_1_7MHZ = 32u /* 1 << 5 */,
    BANDWIDTH_10MHZ = 64u /* 1 << 6 */,
};

/**
 *  Constellation Type for DVBT.
 */
enum class FrontendDvbtConstellation : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Constellation automatically
     */
    AUTO = 1u /* 1 << 0 */,
    CONSTELLATION_QPSK = 2u /* 1 << 1 */,
    CONSTELLATION_16QAM = 4u /* 1 << 2 */,
    CONSTELLATION_64QAM = 8u /* 1 << 3 */,
    CONSTELLATION_256QAM = 16u /* 1 << 4 */,
};

/**
 *  Hierarchy Type for DVBT.
 */
enum class FrontendDvbtHierarchy : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Hierarchy automatically
     */
    AUTO = 1u /* 1 << 0 */,
    HIERARCHY_NON_NATIVE = 2u /* 1 << 1 */,
    HIERARCHY_1_NATIVE = 4u /* 1 << 2 */,
    HIERARCHY_2_NATIVE = 8u /* 1 << 3 */,
    HIERARCHY_4_NATIVE = 16u /* 1 << 4 */,
    HIERARCHY_NON_INDEPTH = 32u /* 1 << 5 */,
    HIERARCHY_1_INDEPTH = 64u /* 1 << 6 */,
    HIERARCHY_2_INDEPTH = 128u /* 1 << 7 */,
    HIERARCHY_4_INDEPTH = 256u /* 1 << 8 */,
};

/**
 *  Hierarchy Type for DVBT.
 */
enum class FrontendDvbtCoderate : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Hierarchy automatically
     */
    AUTO = 1u /* 1 << 0 */,
    CODERATE_1_2 = 2u /* 1 << 1 */,
    CODERATE_2_3 = 4u /* 1 << 2 */,
    CODERATE_3_4 = 8u /* 1 << 3 */,
    CODERATE_5_6 = 16u /* 1 << 4 */,
    CODERATE_7_8 = 32u /* 1 << 5 */,
    CODERATE_3_5 = 64u /* 1 << 6 */,
    CODERATE_4_5 = 128u /* 1 << 7 */,
    CODERATE_6_7 = 256u /* 1 << 8 */,
    CODERATE_8_9 = 512u /* 1 << 9 */,
};

/**
 *  Guard Interval Type for DVBT.
 */
enum class FrontendDvbtGuardInterval : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Guard Interval automatically
     */
    AUTO = 1u /* 1 << 0 */,
    INTERVAL_1_32 = 2u /* 1 << 1 */,
    INTERVAL_1_16 = 4u /* 1 << 2 */,
    INTERVAL_1_8 = 8u /* 1 << 3 */,
    INTERVAL_1_4 = 16u /* 1 << 4 */,
    INTERVAL_1_128 = 32u /* 1 << 5 */,
    INTERVAL_19_128 = 64u /* 1 << 6 */,
    INTERVAL_19_256 = 128u /* 1 << 7 */,
};

/**
 *  Transmission Mode for DVBT.
 */
enum class FrontendDvbtTransmissionMode : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Transmission Mode automatically
     */
    AUTO = 1u /* 1 << 0 */,
    MODE_2K = 2u /* 1 << 1 */,
    MODE_8K = 4u /* 1 << 2 */,
    MODE_4K = 8u /* 1 << 3 */,
    MODE_1K = 16u /* 1 << 4 */,
    MODE_16K = 32u /* 1 << 5 */,
    MODE_32K = 64u /* 1 << 6 */,
};

/**
 *   Physical Layer Pipe (PLP) Mode for DVBT.
 */
enum class FrontendDvbtPlpMode : uint32_t {
    UNDEFINED = 0u,
    AUTO = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbtPlpMode.UNDEFINED implicitly + 1 */,
    MANUAL = 2u /* ::android::hardware::tv::tuner::V1_0::FrontendDvbtPlpMode.AUTO implicitly + 1 */,
};

/**
 *  Sub standards in DVBT.
 */
enum class FrontendDvbtStandard : uint8_t {
    AUTO = 1 /* 1 << 0 */,
    T = 2 /* 1 << 1 */,
    T2 = 4 /* 1 << 2 */,
};

/**
 *  Signal Settings for DVBT Frontend.
 */
struct FrontendDvbtSettings final {
    /**
     * Signal frequency in Hertz
     */
    uint32_t frequency __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtTransmissionMode transmissionMode __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtBandwidth bandwidth __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtConstellation constellation __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy hierarchy __attribute__ ((aligned(4)));
    /**
     * Code Rate for High Priority level
     */
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtCoderate hpCoderate __attribute__ ((aligned(4)));
    /**
     * Code Rate for Low Priority level
     */
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtCoderate lpCoderate __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtGuardInterval guardInterval __attribute__ ((aligned(4)));
    bool isHighPriority __attribute__ ((aligned(1)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtStandard standard __attribute__ ((aligned(1)));
    bool isMiso __attribute__ ((aligned(1)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtPlpMode plpMode __attribute__ ((aligned(4)));
    /**
     * Physical Layer Pipe (PLP) Id
     */
    uint8_t plpId __attribute__ ((aligned(1)));
    /**
     * Group Id for Physical Layer Pipe (PLP)
     */
    uint8_t plpGroupId __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, frequency) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, transmissionMode) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, bandwidth) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, constellation) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, hierarchy) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, hpCoderate) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, lpCoderate) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, guardInterval) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, isHighPriority) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, standard) == 33, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, isMiso) == 34, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, plpMode) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, plpId) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings, plpGroupId) == 41, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings) == 44, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings) == 4, "wrong alignment");

/**
 *  Capabilities for DVBT Frontend.
 */
struct FrontendDvbtCapabilities final {
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbtTransmissionMode> transmissionModeCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbtBandwidth> bandwidthCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbtConstellation> constellationCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbtCoderate> coderateCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy> hierarchyCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbtGuardInterval> guardIntervalCap __attribute__ ((aligned(4)));
    bool isT2Supported __attribute__ ((aligned(1)));
    bool isMisoSupported __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities, transmissionModeCap) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities, bandwidthCap) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities, constellationCap) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities, coderateCap) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities, hierarchyCap) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities, guardIntervalCap) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities, isT2Supported) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities, isMisoSupported) == 25, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities) == 28, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities) == 4, "wrong alignment");

/**
 *  Roll Off Type for ISDBS.
 */
enum class FrontendIsdbsRolloff : uint32_t {
    UNDEFINED = 0u,
    ROLLOFF_0_35 = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendIsdbsRolloff.UNDEFINED implicitly + 1 */,
};

/**
 *  Modulation Type for ISDBS.
 */
enum class FrontendIsdbsModulation : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Modulation automatically
     */
    AUTO = 1u /* 1 << 0 */,
    MOD_BPSK = 2u /* 1 << 1 */,
    MOD_QPSK = 4u /* 1 << 2 */,
    MOD_TC8PSK = 8u /* 1 << 3 */,
};

/**
 *  Code Rate Type for ISDBS.
 */
enum class FrontendIsdbsCoderate : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Code Rate automatically
     */
    AUTO = 1u /* 1 << 0 */,
    CODERATE_1_2 = 2u /* 1 << 1 */,
    CODERATE_2_3 = 4u /* 1 << 2 */,
    CODERATE_3_4 = 8u /* 1 << 3 */,
    CODERATE_5_6 = 16u /* 1 << 4 */,
    CODERATE_7_8 = 32u /* 1 << 5 */,
};

/**
 *  Stream Id Type for ISDBS.
 */
enum class FrontendIsdbsStreamIdType : uint32_t {
    STREAM_ID = 0u,
    RELATIVE_STREAM_NUMBER = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendIsdbsStreamIdType.STREAM_ID implicitly + 1 */,
};

/**
 *  Signal Settings for ISDBS Frontend.
 */
struct FrontendIsdbsSettings final {
    /**
     * Signal frequency in Hertz
     */
    uint32_t frequency __attribute__ ((aligned(4)));
    uint16_t streamId __attribute__ ((aligned(2)));
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbsStreamIdType streamIdType __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbsModulation modulation __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbsCoderate coderate __attribute__ ((aligned(4)));
    /**
     * Symbols per second
     */
    uint32_t symbolRate __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbsRolloff rolloff __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings, frequency) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings, streamId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings, streamIdType) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings, modulation) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings, coderate) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings, symbolRate) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings, rolloff) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings) == 28, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings) == 4, "wrong alignment");

/**
 *  Capabilities for ISDBS Frontend.
 */
struct FrontendIsdbsCapabilities final {
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendIsdbsModulation> modulationCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendIsdbsCoderate> coderateCap __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsCapabilities, modulationCap) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsCapabilities, coderateCap) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsCapabilities) == 8, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendIsdbsCapabilities) == 4, "wrong alignment");

/**
 *  Roll of Type for ISDBS3.
 */
enum class FrontendIsdbs3Rolloff : uint32_t {
    UNDEFINED = 0u,
    ROLLOFF_0_03 = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Rolloff.UNDEFINED implicitly + 1 */,
};

/**
 *  Modulaltion Type for ISDBS3.
 */
enum class FrontendIsdbs3Modulation : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Modulation automatically
     */
    AUTO = 1u /* 1 << 0 */,
    MOD_BPSK = 2u /* 1 << 1 */,
    MOD_QPSK = 4u /* 1 << 2 */,
    MOD_8PSK = 8u /* 1 << 3 */,
    MOD_16APSK = 16u /* 1 << 4 */,
    MOD_32APSK = 32u /* 1 << 5 */,
};

/**
 *  Code Rate Type for ISDBS3.
 */
enum class FrontendIsdbs3Coderate : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Code Rate automatically
     */
    AUTO = 1u /* 1 << 0 */,
    CODERATE_1_3 = 2u /* 1 << 1 */,
    CODERATE_2_5 = 4u /* 1 << 2 */,
    CODERATE_1_2 = 8u /* 1 << 3 */,
    CODERATE_3_5 = 16u /* 1 << 4 */,
    CODERATE_2_3 = 32u /* 1 << 5 */,
    CODERATE_3_4 = 64u /* 1 << 6 */,
    CODERATE_7_9 = 128u /* 1 << 7 */,
    CODERATE_4_5 = 256u /* 1 << 8 */,
    CODERATE_5_6 = 512u /* 1 << 9 */,
    CODERATE_7_8 = 1024u /* 1 << 10 */,
    CODERATE_9_10 = 2048u /* 1 << 11 */,
};

/**
 *  Signal Settings for ISDBS3 Frontend.
 */
struct FrontendIsdbs3Settings final {
    /**
     * Signal frequency in Hertz
     */
    uint32_t frequency __attribute__ ((aligned(4)));
    uint16_t streamId __attribute__ ((aligned(2)));
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbsStreamIdType streamIdType __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Modulation modulation __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Coderate coderate __attribute__ ((aligned(4)));
    /**
     * Symbols per second
     */
    uint32_t symbolRate __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Rolloff rolloff __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings, frequency) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings, streamId) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings, streamIdType) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings, modulation) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings, coderate) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings, symbolRate) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings, rolloff) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings) == 28, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings) == 4, "wrong alignment");

/**
 *  Capabilities for ISDBS3 Frontend.
 */
struct FrontendIsdbs3Capabilities final {
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Modulation> modulationCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Coderate> coderateCap __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Capabilities, modulationCap) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Capabilities, coderateCap) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Capabilities) == 8, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Capabilities) == 4, "wrong alignment");

/**
 *   Mode for ISDBT.
 */
enum class FrontendIsdbtMode : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Mode automatically
     */
    AUTO = 1u /* 1 << 0 */,
    MODE_1 = 2u /* 1 << 1 */,
    MODE_2 = 4u /* 1 << 2 */,
    MODE_3 = 8u /* 1 << 3 */,
};

/**
 *   Bandwidth for ISDBT.
 */
enum class FrontendIsdbtBandwidth : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Bandwidth automatically
     */
    AUTO = 1u /* 1 << 0 */,
    BANDWIDTH_8MHZ = 2u /* 1 << 1 */,
    BANDWIDTH_7MHZ = 4u /* 1 << 2 */,
    BANDWIDTH_6MHZ = 8u /* 1 << 3 */,
};

/**
 *   Modulation for ISDBT.
 */
enum class FrontendIsdbtModulation : uint32_t {
    UNDEFINED = 0u,
    /**
     * hardware is able to detect and set Modulation automatically
     */
    AUTO = 1u /* 1 << 0 */,
    MOD_DQPSK = 2u /* 1 << 1 */,
    MOD_QPSK = 4u /* 1 << 2 */,
    MOD_16QAM = 8u /* 1 << 3 */,
    MOD_64QAM = 16u /* 1 << 4 */,
};

typedef ::android::hardware::tv::tuner::V1_0::FrontendDvbtCoderate FrontendIsdbtCoderate;

typedef ::android::hardware::tv::tuner::V1_0::FrontendDvbtGuardInterval FrontendIsdbtGuardInterval;

/**
 *  Signal Settings for ISDBT Frontend.
 */
struct FrontendIsdbtSettings final {
    /**
     * Signal frequency in Hertz
     */
    uint32_t frequency __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbtModulation modulation __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbtBandwidth bandwidth __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbtMode mode __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtCoderate coderate __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtGuardInterval guardInterval __attribute__ ((aligned(4)));
    uint32_t serviceAreaId __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings, frequency) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings, modulation) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings, bandwidth) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings, mode) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings, coderate) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings, guardInterval) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings, serviceAreaId) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings) == 28, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings) == 4, "wrong alignment");

/**
 *  Capabilities for ISDBT Frontend.
 */
struct FrontendIsdbtCapabilities final {
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendIsdbtMode> modeCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendIsdbtBandwidth> bandwidthCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendIsdbtModulation> modulationCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbtCoderate> coderateCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendDvbtGuardInterval> guardIntervalCap __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities, modeCap) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities, bandwidthCap) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities, modulationCap) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities, coderateCap) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities, guardIntervalCap) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities) == 20, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities) == 4, "wrong alignment");

/**
 *   Signal Type for Analog Frontend.
 */
enum class FrontendAnalogType : uint32_t {
    UNDEFINED = 0u,
    AUTO = 1u /* 1 << 0 */,
    PAL = 2u /* 1 << 1 */,
    PAL_M = 4u /* 1 << 2 */,
    PAL_N = 8u /* 1 << 3 */,
    PAL_60 = 16u /* 1 << 4 */,
    NTSC = 32u /* 1 << 5 */,
    NTSC_443 = 64u /* 1 << 6 */,
    SECAM = 128u /* 1 << 7 */,
};

/**
 *   Standard Interchange Format (SIF) for Analog Frontend.
 */
enum class FrontendAnalogSifStandard : uint32_t {
    UNDEFINED = 0u,
    AUTO = 1u /* 1 << 0 */,
    BG = 2u /* 1 << 1 */,
    BG_A2 = 4u /* 1 << 2 */,
    BG_NICAM = 8u /* 1 << 3 */,
    I = 16u /* 1 << 4 */,
    DK = 32u /* 1 << 5 */,
    DK1_A2 = 64u /* 1 << 6 */,
    DK2_A2 = 128u /* 1 << 7 */,
    DK3_A2 = 256u /* 1 << 8 */,
    DK_NICAM = 512u /* 1 << 9 */,
    L = 1024u /* 1 << 10 */,
    M = 2048u /* 1 << 11 */,
    M_BTSC = 4096u /* 1 << 12 */,
    M_A2 = 8192u /* 1 << 13 */,
    M_EIAJ = 16384u /* 1 << 14 */,
    I_NICAM = 32768u /* 1 << 15 */,
    L_NICAM = 65536u /* 1 << 16 */,
    L_PRIME = 131072u /* 1 << 17 */,
};

/**
 *  Signal Settings for Analog Frontend.
 */
struct FrontendAnalogSettings final {
    /**
     * Signal frequency in Hertz
     */
    uint32_t frequency __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendAnalogType type __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::FrontendAnalogSifStandard sifStandard __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAnalogSettings, frequency) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAnalogSettings, type) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAnalogSettings, sifStandard) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendAnalogSettings) == 12, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendAnalogSettings) == 4, "wrong alignment");

/**
 *  Capabilities for Analog Frontend.
 */
struct FrontendAnalogCapabilities final {
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendAnalogType> typeCap __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::FrontendAnalogSifStandard> sifStandardCap __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAnalogCapabilities, typeCap) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendAnalogCapabilities, sifStandardCap) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendAnalogCapabilities) == 8, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendAnalogCapabilities) == 4, "wrong alignment");

/**
 *  Signal Settings for Frontend.
 */
struct FrontendSettings final {
    enum class hidl_discriminator : uint8_t {
        analog = 0,  // ::android::hardware::tv::tuner::V1_0::FrontendAnalogSettings
        atsc = 1,  // ::android::hardware::tv::tuner::V1_0::FrontendAtscSettings
        atsc3 = 2,  // ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings
        dvbs = 3,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings
        dvbc = 4,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings
        dvbt = 5,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings
        isdbs = 6,  // ::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings
        isdbs3 = 7,  // ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings
        isdbt = 8,  // ::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings
    };

    FrontendSettings();
    ~FrontendSettings();
    FrontendSettings(FrontendSettings&&);
    FrontendSettings(const FrontendSettings&);
    FrontendSettings& operator=(FrontendSettings&&);
    FrontendSettings& operator=(const FrontendSettings&);

    void analog(const ::android::hardware::tv::tuner::V1_0::FrontendAnalogSettings&);
    void analog(::android::hardware::tv::tuner::V1_0::FrontendAnalogSettings&&);
    ::android::hardware::tv::tuner::V1_0::FrontendAnalogSettings& analog();
    const ::android::hardware::tv::tuner::V1_0::FrontendAnalogSettings& analog() const;

    void atsc(const ::android::hardware::tv::tuner::V1_0::FrontendAtscSettings&);
    void atsc(::android::hardware::tv::tuner::V1_0::FrontendAtscSettings&&);
    ::android::hardware::tv::tuner::V1_0::FrontendAtscSettings& atsc();
    const ::android::hardware::tv::tuner::V1_0::FrontendAtscSettings& atsc() const;

    void atsc3(const ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings&);
    void atsc3(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings&&);
    ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings& atsc3();
    const ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings& atsc3() const;

    void dvbs(const ::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings&);
    void dvbs(::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings&&);
    ::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings& dvbs();
    const ::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings& dvbs() const;

    void dvbc(const ::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings&);
    void dvbc(::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings&&);
    ::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings& dvbc();
    const ::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings& dvbc() const;

    void dvbt(const ::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings&);
    void dvbt(::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings&&);
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings& dvbt();
    const ::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings& dvbt() const;

    void isdbs(const ::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings&);
    void isdbs(::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings&&);
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings& isdbs();
    const ::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings& isdbs() const;

    void isdbs3(const ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings&);
    void isdbs3(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings&&);
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings& isdbs3();
    const ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings& isdbs3() const;

    void isdbt(const ::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings&);
    void isdbt(::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings&&);
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings& isdbt();
    const ::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings& isdbt() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::tv::tuner::V1_0::FrontendSettings, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hardware::tv::tuner::V1_0::FrontendAnalogSettings analog __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendAtscSettings atsc __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Settings atsc3 __attribute__ ((aligned(8)));
        ::android::hardware::tv::tuner::V1_0::FrontendDvbsSettings dvbs __attribute__ ((aligned(8)));
        ::android::hardware::tv::tuner::V1_0::FrontendDvbcSettings dvbc __attribute__ ((aligned(8)));
        ::android::hardware::tv::tuner::V1_0::FrontendDvbtSettings dvbt __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendIsdbsSettings isdbs __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Settings isdbs3 __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendIsdbtSettings isdbt __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendSettings::hidl_union) == 48, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendSettings::hidl_union) == 8, "wrong alignment");
    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendSettings::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendSettings::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendSettings) == 56, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendSettings) == 8, "wrong alignment");

/**
 *  Scan type for Frontend.
 */
enum class FrontendScanType : uint32_t {
    SCAN_UNDEFINED = 0u,
    SCAN_AUTO = 1u /* 1 << 0 */,
    SCAN_BLIND = 2u /* 1 << 1 */,
};

/**
 *  Scan Message Type for Frontend.
 */
enum class FrontendScanMessageType : uint32_t {
    /**
     * Scan locked the signal.
     */
    LOCKED = 0u,
    /**
     * Scan stopped.
     */
    END = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendScanMessageType.LOCKED implicitly + 1 */,
    /**
     * Scan progress report.
     */
    PROGRESS_PERCENT = 2u /* ::android::hardware::tv::tuner::V1_0::FrontendScanMessageType.END implicitly + 1 */,
    /**
     * Locked frequency report.
     */
    FREQUENCY = 3u /* ::android::hardware::tv::tuner::V1_0::FrontendScanMessageType.PROGRESS_PERCENT implicitly + 1 */,
    /**
     * Locked symbol rate.
     */
    SYMBOL_RATE = 4u /* ::android::hardware::tv::tuner::V1_0::FrontendScanMessageType.FREQUENCY implicitly + 1 */,
    /**
     * Locked HIERARCHY for DVBT2 frontend.
     */
    HIERARCHY = 5u /* ::android::hardware::tv::tuner::V1_0::FrontendScanMessageType.SYMBOL_RATE implicitly + 1 */,
    ANALOG_TYPE = 6u /* ::android::hardware::tv::tuner::V1_0::FrontendScanMessageType.HIERARCHY implicitly + 1 */,
    /**
     * Locked Plp Ids for DVBT2 frontend.
     */
    PLP_IDS = 7u /* ::android::hardware::tv::tuner::V1_0::FrontendScanMessageType.ANALOG_TYPE implicitly + 1 */,
    /**
     * Locked group Ids for DVBT2 frontend.
     */
    GROUP_IDS = 8u /* ::android::hardware::tv::tuner::V1_0::FrontendScanMessageType.PLP_IDS implicitly + 1 */,
    /**
     * Stream Ids.
     */
    INPUT_STREAM_IDS = 9u /* ::android::hardware::tv::tuner::V1_0::FrontendScanMessageType.GROUP_IDS implicitly + 1 */,
    /**
     * Locked signal standard.
     */
    STANDARD = 10u /* ::android::hardware::tv::tuner::V1_0::FrontendScanMessageType.INPUT_STREAM_IDS implicitly + 1 */,
    /**
     * PLP status in a tuned frequency band for ATSC3 frontend.
     */
    ATSC3_PLP_INFO = 11u /* ::android::hardware::tv::tuner::V1_0::FrontendScanMessageType.STANDARD implicitly + 1 */,
};

/**
 *  ATSC3.0 PLP information for scan
 */
struct FrontendScanAtsc3PlpInfo final {
    uint8_t plpId __attribute__ ((aligned(1)));
    bool bLlsFlag __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendScanAtsc3PlpInfo, plpId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendScanAtsc3PlpInfo, bLlsFlag) == 1, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendScanAtsc3PlpInfo) == 2, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendScanAtsc3PlpInfo) == 1, "wrong alignment");

/**
 *  Scan Message for Frontend.
 */
struct FrontendScanMessage final {
    // Forward declaration for forward reference support:
    struct Standard;

    struct Standard final {
        enum class hidl_discriminator : uint8_t {
            sStd = 0,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbsStandard
            tStd = 1,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbtStandard
            sifStd = 2,  // ::android::hardware::tv::tuner::V1_0::FrontendAnalogSifStandard
        };

        Standard();
        ~Standard();
        Standard(Standard&&);
        Standard(const Standard&);
        Standard& operator=(Standard&&);
        Standard& operator=(const Standard&);

        void sStd(::android::hardware::tv::tuner::V1_0::FrontendDvbsStandard);
        ::android::hardware::tv::tuner::V1_0::FrontendDvbsStandard& sStd();
        ::android::hardware::tv::tuner::V1_0::FrontendDvbsStandard sStd() const;

        void tStd(::android::hardware::tv::tuner::V1_0::FrontendDvbtStandard);
        ::android::hardware::tv::tuner::V1_0::FrontendDvbtStandard& tStd();
        ::android::hardware::tv::tuner::V1_0::FrontendDvbtStandard tStd() const;

        void sifStd(::android::hardware::tv::tuner::V1_0::FrontendAnalogSifStandard);
        ::android::hardware::tv::tuner::V1_0::FrontendAnalogSifStandard& sifStd();
        ::android::hardware::tv::tuner::V1_0::FrontendAnalogSifStandard sifStd() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::tv::tuner::V1_0::FrontendDvbsStandard sStd __attribute__ ((aligned(1)));
            ::android::hardware::tv::tuner::V1_0::FrontendDvbtStandard tStd __attribute__ ((aligned(1)));
            ::android::hardware::tv::tuner::V1_0::FrontendAnalogSifStandard sifStd __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard::hidl_union) == 4, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard) == 4, "wrong alignment");

    enum class hidl_discriminator : uint8_t {
        isLocked = 0,  // bool
        isEnd = 1,  // bool
        /**
         * scan progress percent (0..100)
         */
        progressPercent = 2,  // uint8_t
        /**
         * Signal frequencies in Hertz
         */
        frequencies = 3,  // ::android::hardware::hidl_vec<uint32_t>
        /**
         * Symbols per second
         */
        symbolRates = 4,  // ::android::hardware::hidl_vec<uint32_t>
        hierarchy = 5,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy
        analogType = 6,  // ::android::hardware::tv::tuner::V1_0::FrontendAnalogType
        plpIds = 7,  // ::android::hardware::hidl_vec<uint8_t>
        groupIds = 8,  // ::android::hardware::hidl_vec<uint8_t>
        inputStreamIds = 9,  // ::android::hardware::hidl_vec<uint16_t>
        std = 10,  // ::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard
        /**
         * A list of PLP status in a tuned frequency band for ATSC3 frontend.
         */
        atsc3PlpInfos = 11,  // ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendScanAtsc3PlpInfo>
    };

    FrontendScanMessage();
    ~FrontendScanMessage();
    FrontendScanMessage(FrontendScanMessage&&);
    FrontendScanMessage(const FrontendScanMessage&);
    FrontendScanMessage& operator=(FrontendScanMessage&&);
    FrontendScanMessage& operator=(const FrontendScanMessage&);

    void isLocked(bool);
    bool& isLocked();
    bool isLocked() const;

    void isEnd(bool);
    bool& isEnd();
    bool isEnd() const;

    void progressPercent(uint8_t);
    uint8_t& progressPercent();
    uint8_t progressPercent() const;

    void frequencies(const ::android::hardware::hidl_vec<uint32_t>&);
    void frequencies(::android::hardware::hidl_vec<uint32_t>&&);
    ::android::hardware::hidl_vec<uint32_t>& frequencies();
    const ::android::hardware::hidl_vec<uint32_t>& frequencies() const;

    void symbolRates(const ::android::hardware::hidl_vec<uint32_t>&);
    void symbolRates(::android::hardware::hidl_vec<uint32_t>&&);
    ::android::hardware::hidl_vec<uint32_t>& symbolRates();
    const ::android::hardware::hidl_vec<uint32_t>& symbolRates() const;

    void hierarchy(::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy);
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy& hierarchy();
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy hierarchy() const;

    void analogType(::android::hardware::tv::tuner::V1_0::FrontendAnalogType);
    ::android::hardware::tv::tuner::V1_0::FrontendAnalogType& analogType();
    ::android::hardware::tv::tuner::V1_0::FrontendAnalogType analogType() const;

    void plpIds(const ::android::hardware::hidl_vec<uint8_t>&);
    void plpIds(::android::hardware::hidl_vec<uint8_t>&&);
    ::android::hardware::hidl_vec<uint8_t>& plpIds();
    const ::android::hardware::hidl_vec<uint8_t>& plpIds() const;

    void groupIds(const ::android::hardware::hidl_vec<uint8_t>&);
    void groupIds(::android::hardware::hidl_vec<uint8_t>&&);
    ::android::hardware::hidl_vec<uint8_t>& groupIds();
    const ::android::hardware::hidl_vec<uint8_t>& groupIds() const;

    void inputStreamIds(const ::android::hardware::hidl_vec<uint16_t>&);
    void inputStreamIds(::android::hardware::hidl_vec<uint16_t>&&);
    ::android::hardware::hidl_vec<uint16_t>& inputStreamIds();
    const ::android::hardware::hidl_vec<uint16_t>& inputStreamIds() const;

    void std(const ::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard&);
    void std(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard&&);
    ::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard& std();
    const ::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard& std() const;

    void atsc3PlpInfos(const ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendScanAtsc3PlpInfo>&);
    void atsc3PlpInfos(::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendScanAtsc3PlpInfo>&&);
    ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendScanAtsc3PlpInfo>& atsc3PlpInfos();
    const ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendScanAtsc3PlpInfo>& atsc3PlpInfos() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        bool isLocked __attribute__ ((aligned(1)));
        bool isEnd __attribute__ ((aligned(1)));
        uint8_t progressPercent __attribute__ ((aligned(1)));
        ::android::hardware::hidl_vec<uint32_t> frequencies __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<uint32_t> symbolRates __attribute__ ((aligned(8)));
        ::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy hierarchy __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendAnalogType analogType __attribute__ ((aligned(4)));
        ::android::hardware::hidl_vec<uint8_t> plpIds __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<uint8_t> groupIds __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<uint16_t> inputStreamIds __attribute__ ((aligned(8)));
        ::android::hardware::tv::tuner::V1_0::FrontendScanMessage::Standard std __attribute__ ((aligned(4)));
        ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendScanAtsc3PlpInfo> atsc3PlpInfos __attribute__ ((aligned(8)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::hidl_union) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::hidl_union) == 8, "wrong alignment");
    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage) == 24, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendScanMessage) == 8, "wrong alignment");

/**
 * Frontend Event Type.
 */
enum class FrontendEventType : uint32_t {
    /**
     * The frontend has locked to the signal specified by the tune method.
     */
    LOCKED = 0u,
    /**
     * The frontend is unable to lock to the signal specified by the tune method.
     */
    NO_SIGNAL = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendEventType.LOCKED implicitly + 1 */,
    /**
     * The frontend has lost the lock to the signal specified by the tune method.
     */
    LOST_LOCK = 2u /* ::android::hardware::tv::tuner::V1_0::FrontendEventType.NO_SIGNAL implicitly + 1 */,
};

/**
 * Frontend Status Type.
 */
enum class FrontendStatusType : uint32_t {
    /**
     * Lock status for Demod.
     */
    DEMOD_LOCK = 0u,
    /**
     * Signal to Noise Ratio.
     */
    SNR = 1u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.DEMOD_LOCK implicitly + 1 */,
    /**
     * Bit Error Ratio.
     */
    BER = 2u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.SNR implicitly + 1 */,
    /**
     * Packages Error Ratio.
     */
    PER = 3u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.BER implicitly + 1 */,
    /**
     * Bit Error Ratio before FEC.
     */
    PRE_BER = 4u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.PER implicitly + 1 */,
    /**
     * Signal Quality (0..100). Good data over total data in percent can be
     * used as a way to present Signal Quality.
     */
    SIGNAL_QUALITY = 5u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.PRE_BER implicitly + 1 */,
    /**
     * Signal Strength.
     */
    SIGNAL_STRENGTH = 6u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.SIGNAL_QUALITY implicitly + 1 */,
    /**
     * Symbol Rate.
     */
    SYMBOL_RATE = 7u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.SIGNAL_STRENGTH implicitly + 1 */,
    /**
     * Forward Error Correction Type.
     */
    FEC = 8u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.SYMBOL_RATE implicitly + 1 */,
    /**
     * Modulation Type.
     */
    MODULATION = 9u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.FEC implicitly + 1 */,
    /**
     * Spectral Inversion Type.
     */
    SPECTRAL = 10u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.MODULATION implicitly + 1 */,
    /**
     * LNB Voltage.
     */
    LNB_VOLTAGE = 11u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.SPECTRAL implicitly + 1 */,
    /**
     * Physical Layer Pipe ID.
     */
    PLP_ID = 12u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.LNB_VOLTAGE implicitly + 1 */,
    /**
     * Status for Emergency Warning Broadcasting System.
     */
    EWBS = 13u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.PLP_ID implicitly + 1 */,
    /**
     * Automatic Gain Control.
     */
    AGC = 14u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.EWBS implicitly + 1 */,
    /**
     * Low Noise Amplifier.
     */
    LNA = 15u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.AGC implicitly + 1 */,
    /**
     * Error status by layer.
     */
    LAYER_ERROR = 16u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.LNA implicitly + 1 */,
    /**
     * Moduration Error Ratio.
     */
    MER = 17u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.LAYER_ERROR implicitly + 1 */,
    /**
     * Difference between tuning frequency and actual locked frequency.
     */
    FREQ_OFFSET = 18u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.MER implicitly + 1 */,
    /**
     * Hierarchy for DVBT.
     */
    HIERARCHY = 19u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.FREQ_OFFSET implicitly + 1 */,
    /**
     * Lock status for RF.
     */
    RF_LOCK = 20u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.HIERARCHY implicitly + 1 */,
    /**
     * PLP information in a frequency band for ATSC3.0 frontend.
     */
    ATSC3_PLP_INFO = 21u /* ::android::hardware::tv::tuner::V1_0::FrontendStatusType.RF_LOCK implicitly + 1 */,
};

/**
 * Status for each tuning PLPs
 */
struct FrontendStatusAtsc3PlpInfo final {
    /**
     * PLP Id value.
     */
    uint8_t plpId __attribute__ ((aligned(1)));
    /**
     * Demod Lock/Unlock status of this particular PLP.
     */
    bool isLocked __attribute__ ((aligned(1)));
    /**
     * Uncorrectable Error Counts (UEC) of this particular PLP since last tune operation.
     */
    uint32_t uec __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendStatusAtsc3PlpInfo, plpId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendStatusAtsc3PlpInfo, isLocked) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendStatusAtsc3PlpInfo, uec) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendStatusAtsc3PlpInfo) == 8, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendStatusAtsc3PlpInfo) == 4, "wrong alignment");

/**
 * Modulation Type for Frontend's status.
 */
struct FrontendModulationStatus final {
    enum class hidl_discriminator : uint8_t {
        dvbc = 0,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbcModulation
        dvbs = 1,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbsModulation
        isdbs = 2,  // ::android::hardware::tv::tuner::V1_0::FrontendIsdbsModulation
        isdbs3 = 3,  // ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Modulation
        isdbt = 4,  // ::android::hardware::tv::tuner::V1_0::FrontendIsdbtModulation
    };

    FrontendModulationStatus();
    ~FrontendModulationStatus();
    FrontendModulationStatus(FrontendModulationStatus&&);
    FrontendModulationStatus(const FrontendModulationStatus&);
    FrontendModulationStatus& operator=(FrontendModulationStatus&&);
    FrontendModulationStatus& operator=(const FrontendModulationStatus&);

    void dvbc(::android::hardware::tv::tuner::V1_0::FrontendDvbcModulation);
    ::android::hardware::tv::tuner::V1_0::FrontendDvbcModulation& dvbc();
    ::android::hardware::tv::tuner::V1_0::FrontendDvbcModulation dvbc() const;

    void dvbs(::android::hardware::tv::tuner::V1_0::FrontendDvbsModulation);
    ::android::hardware::tv::tuner::V1_0::FrontendDvbsModulation& dvbs();
    ::android::hardware::tv::tuner::V1_0::FrontendDvbsModulation dvbs() const;

    void isdbs(::android::hardware::tv::tuner::V1_0::FrontendIsdbsModulation);
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbsModulation& isdbs();
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbsModulation isdbs() const;

    void isdbs3(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Modulation);
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Modulation& isdbs3();
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Modulation isdbs3() const;

    void isdbt(::android::hardware::tv::tuner::V1_0::FrontendIsdbtModulation);
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbtModulation& isdbt();
    ::android::hardware::tv::tuner::V1_0::FrontendIsdbtModulation isdbt() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::tv::tuner::V1_0::FrontendModulationStatus, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hardware::tv::tuner::V1_0::FrontendDvbcModulation dvbc __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendDvbsModulation dvbs __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendIsdbsModulation isdbs __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Modulation isdbs3 __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendIsdbtModulation isdbt __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendModulationStatus::hidl_union) == 4, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendModulationStatus::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendModulationStatus::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendModulationStatus::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendModulationStatus) == 8, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendModulationStatus) == 4, "wrong alignment");

/**
 *  Power Voltage Type for LNB.
 */
enum class LnbVoltage : uint32_t {
    NONE = 0u,
    VOLTAGE_5V = 1u /* ::android::hardware::tv::tuner::V1_0::LnbVoltage.NONE implicitly + 1 */,
    VOLTAGE_11V = 2u /* ::android::hardware::tv::tuner::V1_0::LnbVoltage.VOLTAGE_5V implicitly + 1 */,
    VOLTAGE_12V = 3u /* ::android::hardware::tv::tuner::V1_0::LnbVoltage.VOLTAGE_11V implicitly + 1 */,
    VOLTAGE_13V = 4u /* ::android::hardware::tv::tuner::V1_0::LnbVoltage.VOLTAGE_12V implicitly + 1 */,
    VOLTAGE_14V = 5u /* ::android::hardware::tv::tuner::V1_0::LnbVoltage.VOLTAGE_13V implicitly + 1 */,
    VOLTAGE_15V = 6u /* ::android::hardware::tv::tuner::V1_0::LnbVoltage.VOLTAGE_14V implicitly + 1 */,
    VOLTAGE_18V = 7u /* ::android::hardware::tv::tuner::V1_0::LnbVoltage.VOLTAGE_15V implicitly + 1 */,
    VOLTAGE_19V = 8u /* ::android::hardware::tv::tuner::V1_0::LnbVoltage.VOLTAGE_18V implicitly + 1 */,
};

/**
 *  The status for Frontend.
 */
struct FrontendStatus final {
    enum class hidl_discriminator : uint8_t {
        /**
         * Lock status for Demod in True/False.
         */
        isDemodLocked = 0,  // bool
        /**
         * SNR value measured by 0.001 dB.
         */
        snr = 1,  // int32_t
        /**
         * The number of error bit per 1 billion bits.
         */
        ber = 2,  // uint32_t
        /**
         * The number of error package per 1 billion packages.
         */
        per = 3,  // uint32_t
        /**
         * The number of error bit per 1 billion bits before FEC.
         */
        preBer = 4,  // uint32_t
        /**
         * Signal Quality in percent.
         */
        signalQuality = 5,  // uint32_t
        /**
         * Signal Strength measured by 0.001 dBm.
         */
        signalStrength = 6,  // int32_t
        /**
         * Symbols per second
         */
        symbolRate = 7,  // uint32_t
        innerFec = 8,  // ::android::hardware::tv::tuner::V1_0::FrontendInnerFec
        modulation = 9,  // ::android::hardware::tv::tuner::V1_0::FrontendModulationStatus
        inversion = 10,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbcSpectralInversion
        lnbVoltage = 11,  // ::android::hardware::tv::tuner::V1_0::LnbVoltage
        plpId = 12,  // uint8_t
        isEWBS = 13,  // bool
        /**
         * AGC value is normalized from 0 to 255.
         */
        agc = 14,  // uint8_t
        isLnaOn = 15,  // bool
        isLayerError = 16,  // ::android::hardware::hidl_vec<bool>
        /**
         * MER value measured by 0.001 dB
         */
        mer = 17,  // int32_t
        /**
         * Frequency difference in Hertz.
         */
        freqOffset = 18,  // int32_t
        hierarchy = 19,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy
        isRfLocked = 20,  // bool
        /**
         * A list of PLP status for tuned PLPs for ATSC3 frontend.
         */
        plpInfo = 21,  // ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendStatusAtsc3PlpInfo>
    };

    FrontendStatus();
    ~FrontendStatus();
    FrontendStatus(FrontendStatus&&);
    FrontendStatus(const FrontendStatus&);
    FrontendStatus& operator=(FrontendStatus&&);
    FrontendStatus& operator=(const FrontendStatus&);

    void isDemodLocked(bool);
    bool& isDemodLocked();
    bool isDemodLocked() const;

    void snr(int32_t);
    int32_t& snr();
    int32_t snr() const;

    void ber(uint32_t);
    uint32_t& ber();
    uint32_t ber() const;

    void per(uint32_t);
    uint32_t& per();
    uint32_t per() const;

    void preBer(uint32_t);
    uint32_t& preBer();
    uint32_t preBer() const;

    void signalQuality(uint32_t);
    uint32_t& signalQuality();
    uint32_t signalQuality() const;

    void signalStrength(int32_t);
    int32_t& signalStrength();
    int32_t signalStrength() const;

    void symbolRate(uint32_t);
    uint32_t& symbolRate();
    uint32_t symbolRate() const;

    void innerFec(::android::hardware::tv::tuner::V1_0::FrontendInnerFec);
    ::android::hardware::tv::tuner::V1_0::FrontendInnerFec& innerFec();
    ::android::hardware::tv::tuner::V1_0::FrontendInnerFec innerFec() const;

    void modulation(const ::android::hardware::tv::tuner::V1_0::FrontendModulationStatus&);
    void modulation(::android::hardware::tv::tuner::V1_0::FrontendModulationStatus&&);
    ::android::hardware::tv::tuner::V1_0::FrontendModulationStatus& modulation();
    const ::android::hardware::tv::tuner::V1_0::FrontendModulationStatus& modulation() const;

    void inversion(::android::hardware::tv::tuner::V1_0::FrontendDvbcSpectralInversion);
    ::android::hardware::tv::tuner::V1_0::FrontendDvbcSpectralInversion& inversion();
    ::android::hardware::tv::tuner::V1_0::FrontendDvbcSpectralInversion inversion() const;

    void lnbVoltage(::android::hardware::tv::tuner::V1_0::LnbVoltage);
    ::android::hardware::tv::tuner::V1_0::LnbVoltage& lnbVoltage();
    ::android::hardware::tv::tuner::V1_0::LnbVoltage lnbVoltage() const;

    void plpId(uint8_t);
    uint8_t& plpId();
    uint8_t plpId() const;

    void isEWBS(bool);
    bool& isEWBS();
    bool isEWBS() const;

    void agc(uint8_t);
    uint8_t& agc();
    uint8_t agc() const;

    void isLnaOn(bool);
    bool& isLnaOn();
    bool isLnaOn() const;

    void isLayerError(const ::android::hardware::hidl_vec<bool>&);
    void isLayerError(::android::hardware::hidl_vec<bool>&&);
    ::android::hardware::hidl_vec<bool>& isLayerError();
    const ::android::hardware::hidl_vec<bool>& isLayerError() const;

    void mer(int32_t);
    int32_t& mer();
    int32_t mer() const;

    void freqOffset(int32_t);
    int32_t& freqOffset();
    int32_t freqOffset() const;

    void hierarchy(::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy);
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy& hierarchy();
    ::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy hierarchy() const;

    void isRfLocked(bool);
    bool& isRfLocked();
    bool isRfLocked() const;

    void plpInfo(const ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendStatusAtsc3PlpInfo>&);
    void plpInfo(::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendStatusAtsc3PlpInfo>&&);
    ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendStatusAtsc3PlpInfo>& plpInfo();
    const ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendStatusAtsc3PlpInfo>& plpInfo() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::tv::tuner::V1_0::FrontendStatus, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        bool isDemodLocked __attribute__ ((aligned(1)));
        int32_t snr __attribute__ ((aligned(4)));
        uint32_t ber __attribute__ ((aligned(4)));
        uint32_t per __attribute__ ((aligned(4)));
        uint32_t preBer __attribute__ ((aligned(4)));
        uint32_t signalQuality __attribute__ ((aligned(4)));
        int32_t signalStrength __attribute__ ((aligned(4)));
        uint32_t symbolRate __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendInnerFec innerFec __attribute__ ((aligned(8)));
        ::android::hardware::tv::tuner::V1_0::FrontendModulationStatus modulation __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendDvbcSpectralInversion inversion __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::LnbVoltage lnbVoltage __attribute__ ((aligned(4)));
        uint8_t plpId __attribute__ ((aligned(1)));
        bool isEWBS __attribute__ ((aligned(1)));
        uint8_t agc __attribute__ ((aligned(1)));
        bool isLnaOn __attribute__ ((aligned(1)));
        ::android::hardware::hidl_vec<bool> isLayerError __attribute__ ((aligned(8)));
        int32_t mer __attribute__ ((aligned(4)));
        int32_t freqOffset __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::FrontendDvbtHierarchy hierarchy __attribute__ ((aligned(4)));
        bool isRfLocked __attribute__ ((aligned(1)));
        ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendStatusAtsc3PlpInfo> plpInfo __attribute__ ((aligned(8)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendStatus::hidl_union) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendStatus::hidl_union) == 8, "wrong alignment");
    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendStatus::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendStatus::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendStatus) == 24, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendStatus) == 8, "wrong alignment");

/**
 *  Information for the Frontend.
 */
struct FrontendInfo final {
    // Forward declaration for forward reference support:
    struct FrontendCapabilities;

    struct FrontendCapabilities final {
        enum class hidl_discriminator : uint8_t {
            analogCaps = 0,  // ::android::hardware::tv::tuner::V1_0::FrontendAnalogCapabilities
            atscCaps = 1,  // ::android::hardware::tv::tuner::V1_0::FrontendAtscCapabilities
            atsc3Caps = 2,  // ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities
            dvbsCaps = 3,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbsCapabilities
            dvbcCaps = 4,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbcCapabilities
            dvbtCaps = 5,  // ::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities
            isdbsCaps = 6,  // ::android::hardware::tv::tuner::V1_0::FrontendIsdbsCapabilities
            isdbs3Caps = 7,  // ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Capabilities
            isdbtCaps = 8,  // ::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities
        };

        FrontendCapabilities();
        ~FrontendCapabilities();
        FrontendCapabilities(FrontendCapabilities&&);
        FrontendCapabilities(const FrontendCapabilities&);
        FrontendCapabilities& operator=(FrontendCapabilities&&);
        FrontendCapabilities& operator=(const FrontendCapabilities&);

        void analogCaps(const ::android::hardware::tv::tuner::V1_0::FrontendAnalogCapabilities&);
        void analogCaps(::android::hardware::tv::tuner::V1_0::FrontendAnalogCapabilities&&);
        ::android::hardware::tv::tuner::V1_0::FrontendAnalogCapabilities& analogCaps();
        const ::android::hardware::tv::tuner::V1_0::FrontendAnalogCapabilities& analogCaps() const;

        void atscCaps(const ::android::hardware::tv::tuner::V1_0::FrontendAtscCapabilities&);
        void atscCaps(::android::hardware::tv::tuner::V1_0::FrontendAtscCapabilities&&);
        ::android::hardware::tv::tuner::V1_0::FrontendAtscCapabilities& atscCaps();
        const ::android::hardware::tv::tuner::V1_0::FrontendAtscCapabilities& atscCaps() const;

        void atsc3Caps(const ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities&);
        void atsc3Caps(::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities&&);
        ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities& atsc3Caps();
        const ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities& atsc3Caps() const;

        void dvbsCaps(const ::android::hardware::tv::tuner::V1_0::FrontendDvbsCapabilities&);
        void dvbsCaps(::android::hardware::tv::tuner::V1_0::FrontendDvbsCapabilities&&);
        ::android::hardware::tv::tuner::V1_0::FrontendDvbsCapabilities& dvbsCaps();
        const ::android::hardware::tv::tuner::V1_0::FrontendDvbsCapabilities& dvbsCaps() const;

        void dvbcCaps(const ::android::hardware::tv::tuner::V1_0::FrontendDvbcCapabilities&);
        void dvbcCaps(::android::hardware::tv::tuner::V1_0::FrontendDvbcCapabilities&&);
        ::android::hardware::tv::tuner::V1_0::FrontendDvbcCapabilities& dvbcCaps();
        const ::android::hardware::tv::tuner::V1_0::FrontendDvbcCapabilities& dvbcCaps() const;

        void dvbtCaps(const ::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities&);
        void dvbtCaps(::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities&&);
        ::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities& dvbtCaps();
        const ::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities& dvbtCaps() const;

        void isdbsCaps(const ::android::hardware::tv::tuner::V1_0::FrontendIsdbsCapabilities&);
        void isdbsCaps(::android::hardware::tv::tuner::V1_0::FrontendIsdbsCapabilities&&);
        ::android::hardware::tv::tuner::V1_0::FrontendIsdbsCapabilities& isdbsCaps();
        const ::android::hardware::tv::tuner::V1_0::FrontendIsdbsCapabilities& isdbsCaps() const;

        void isdbs3Caps(const ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Capabilities&);
        void isdbs3Caps(::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Capabilities&&);
        ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Capabilities& isdbs3Caps();
        const ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Capabilities& isdbs3Caps() const;

        void isdbtCaps(const ::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities&);
        void isdbtCaps(::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities&&);
        ::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities& isdbtCaps();
        const ::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities& isdbtCaps() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::FrontendInfo::FrontendCapabilities, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::tv::tuner::V1_0::FrontendAnalogCapabilities analogCaps __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::FrontendAtscCapabilities atscCaps __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::FrontendAtsc3Capabilities atsc3Caps __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::FrontendDvbsCapabilities dvbsCaps __attribute__ ((aligned(8)));
            ::android::hardware::tv::tuner::V1_0::FrontendDvbcCapabilities dvbcCaps __attribute__ ((aligned(8)));
            ::android::hardware::tv::tuner::V1_0::FrontendDvbtCapabilities dvbtCaps __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::FrontendIsdbsCapabilities isdbsCaps __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::FrontendIsdbs3Capabilities isdbs3Caps __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::FrontendIsdbtCapabilities isdbtCaps __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendInfo::FrontendCapabilities::hidl_union) == 32, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendInfo::FrontendCapabilities::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendInfo::FrontendCapabilities::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendInfo::FrontendCapabilities::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendInfo::FrontendCapabilities) == 40, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendInfo::FrontendCapabilities) == 8, "wrong alignment");

    ::android::hardware::tv::tuner::V1_0::FrontendType type __attribute__ ((aligned(4)));
    /**
     * Frequency in Hertz
     */
    uint32_t minFrequency __attribute__ ((aligned(4)));
    /**
     * Frequency in Hertz
     */
    uint32_t maxFrequency __attribute__ ((aligned(4)));
    /**
     * Minimum symbols per second
     */
    uint32_t minSymbolRate __attribute__ ((aligned(4)));
    /**
     * Maximum symbols per second
     */
    uint32_t maxSymbolRate __attribute__ ((aligned(4)));
    /**
     * Range in Hertz
     */
    uint32_t acquireRange __attribute__ ((aligned(4)));
    /**
     * Frontends are assigned with the same exclusiveGroupId if they can't
     * function at same time. For instance, they share same hardware module.
     */
    uint32_t exclusiveGroupId __attribute__ ((aligned(4)));
    /**
     * A list of supported status types which client can inquiry
     */
    ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::FrontendStatusType> statusCaps __attribute__ ((aligned(8)));
    ::android::hardware::tv::tuner::V1_0::FrontendInfo::FrontendCapabilities frontendCaps __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendInfo, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendInfo, minFrequency) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendInfo, maxFrequency) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendInfo, minSymbolRate) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendInfo, maxSymbolRate) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendInfo, acquireRange) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendInfo, exclusiveGroupId) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendInfo, statusCaps) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::FrontendInfo, frontendCaps) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::FrontendInfo) == 88, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::FrontendInfo) == 8, "wrong alignment");

/*
 * Low-Noise Block downconverter (LNB) ID is used to associate with a hardware
 * LNB module.
 */
typedef uint32_t LnbId;

/**
 *  Tone Type for LNB.
 */
enum class LnbTone : int32_t {
    NONE = 0,
    CONTINUOUS = 1 /* ::android::hardware::tv::tuner::V1_0::LnbTone.NONE implicitly + 1 */,
};

/**
 *  The Position of LNB.
 */
enum class LnbPosition : int32_t {
    UNDEFINED = 0,
    POSITION_A = 1 /* ::android::hardware::tv::tuner::V1_0::LnbPosition.UNDEFINED implicitly + 1 */,
    POSITION_B = 2 /* ::android::hardware::tv::tuner::V1_0::LnbPosition.POSITION_A implicitly + 1 */,
};

/**
 * Lnb Event Type.
 */
enum class LnbEventType : uint32_t {
    DISEQC_RX_OVERFLOW = 0u,
    /**
     * If LNB detect that outgoing Diseqc message isn't delivered on time.
     */
    DISEQC_RX_TIMEOUT = 1u /* ::android::hardware::tv::tuner::V1_0::LnbEventType.DISEQC_RX_OVERFLOW implicitly + 1 */,
    /**
     * If LNB detect that the incoming Diseqc message has parity error.
     */
    DISEQC_RX_PARITY_ERROR = 2u /* ::android::hardware::tv::tuner::V1_0::LnbEventType.DISEQC_RX_TIMEOUT implicitly + 1 */,
    /**
     * If LNB detect that the LNB is overload.
     */
    LNB_OVERLOAD = 3u /* ::android::hardware::tv::tuner::V1_0::LnbEventType.DISEQC_RX_PARITY_ERROR implicitly + 1 */,
};

/*
 * Demux ID is used to associate with a hardware demux resource.
 */
typedef uint32_t DemuxId;

/**
 * Filter Main Type specifies the protocol that the filter use to extract data
 * from input stream.
 */
enum class DemuxFilterMainType : uint32_t {
    /**
     * Transport Stream according to ISO/IEC 13818-1.
     */
    TS = 1u /* 1 << 0 */,
    /**
     * MPEG Media Transport Protocol according to ISO/IEC 23008-1.
     */
    MMTP = 2u /* 1 << 1 */,
    /**
     * Internet Protocol.
     */
    IP = 4u /* 1 << 2 */,
    /**
     * Type Length Value according to ITU-R BT.1869.
     */
    TLV = 8u /* 1 << 3 */,
    /**
     * ATSC Link-Layer Protocol according to A/330 ATSC3.0.
     */
    ALP = 16u /* 1 << 4 */,
};

/**
 * TS Filter Type according to ISO/IEC 13818-1
 */
enum class DemuxTsFilterType : uint32_t {
    UNDEFINED = 0u,
    /**
     * A filter to filter Section data out from input stream, and queue the
     * data to the filter's FMQ (Fast Message Queue).
     */
    SECTION = 1u /* ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType.UNDEFINED implicitly + 1 */,
    /**
     * A filter to filter Packetized Elementary Stream data out from input
     * stream, and queue the data to the filter's FMQ.
     */
    PES = 2u /* ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType.SECTION implicitly + 1 */,
    /**
     * A filter to filter a Transport Stream out from input stream, and queue
     * the data to the filter's FMQ.
     */
    TS = 3u /* ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType.PES implicitly + 1 */,
    /**
     * A filter to filter Audio data out from input stream, and send Audio's
     * Metadata to client through onFilterEvent.
     */
    AUDIO = 4u /* ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType.TS implicitly + 1 */,
    /**
     * A filter to filter Video data out from input stream, and send Video's
     * Metadata to client through onFilterEvent.
     */
    VIDEO = 5u /* ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType.AUDIO implicitly + 1 */,
    /**
     * A filter to set PCR (Program Clock Reference) channel from input stream.
     */
    PCR = 6u /* ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType.VIDEO implicitly + 1 */,
    /**
     * A filter to filter data out from input stream, and queue the data to the
     * buffer of the record.
     */
    RECORD = 7u /* ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType.PCR implicitly + 1 */,
    /**
     * A filter to filter out Timed External Media Information (TEMI) according
     * to ISO/IEC 13818-1:2013/ DAM 6 from input stream, and send TEMI event to
     * client through onFilterEvent.
     */
    TEMI = 8u /* ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType.RECORD implicitly + 1 */,
};

/**
 * MMTP Filter Type according to ISO/IEC 23008-1
 */
enum class DemuxMmtpFilterType : uint32_t {
    UNDEFINED = 0u,
    /**
     * A filter to filter signaling data out from input stream, and queue the
     * data to the filter's FMQ (Fast Message Queue).
     */
    SECTION = 1u /* ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType.UNDEFINED implicitly + 1 */,
    /**
     * A filter to filter MFU (Media fragment unit) out from input stream, and
     * queue the data to the filter's FMQ.
     */
    PES = 2u /* ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType.SECTION implicitly + 1 */,
    /**
     * A filter to filter a MMTP stream out from input stream, and queue the
     * data to the filter's FMQ.
     */
    MMTP = 3u /* ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType.PES implicitly + 1 */,
    /**
     * A filter to filter Audio data out from input stream, and send Audio's
     * Metadata to client through onFilterEvent.
     */
    AUDIO = 4u /* ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType.MMTP implicitly + 1 */,
    /**
     * A filter to filter Video data out from input stream, and send Video's
     * Metadata to client through onFilterEvent.
     */
    VIDEO = 5u /* ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType.AUDIO implicitly + 1 */,
    /**
     * A filter to filter data out from input stream, and queue the data to the
     * buffer of the record.
     */
    RECORD = 6u /* ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType.VIDEO implicitly + 1 */,
    /**
     * A filter to filter application data out from input stream, and queue the
     * data to the filter's FMQ.
     */
    DOWNLOAD = 7u /* ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType.RECORD implicitly + 1 */,
};

/**
 * IP Filter Type.
 */
enum class DemuxIpFilterType : uint32_t {
    UNDEFINED = 0u,
    /**
     * A filter to filter section data out from input stream, and queue the
     * data to the filter's FMQ (Fast Message Queue).
     */
    SECTION = 1u /* ::android::hardware::tv::tuner::V1_0::DemuxIpFilterType.UNDEFINED implicitly + 1 */,
    /**
     * A filter to set NTP (Network Time Procotol) channel from input stream.
     */
    NTP = 2u /* ::android::hardware::tv::tuner::V1_0::DemuxIpFilterType.SECTION implicitly + 1 */,
    /**
     * A filter to strip out IP message header and queue the data to the
     * filter's FMQ.
     */
    IP_PAYLOAD = 3u /* ::android::hardware::tv::tuner::V1_0::DemuxIpFilterType.NTP implicitly + 1 */,
    /**
     * A filter to filter a IP stream out from input stream. The output can be
     * either upper stream of another filter or queued to the filter's FMQ.
     */
    IP = 4u /* ::android::hardware::tv::tuner::V1_0::DemuxIpFilterType.IP_PAYLOAD implicitly + 1 */,
    /**
     * A filter to strip out IP message header and be a data source of another
     * filter.
     */
    PAYLOAD_THROUGH = 5u /* ::android::hardware::tv::tuner::V1_0::DemuxIpFilterType.IP implicitly + 1 */,
};

/**
 * TLV Filter Type according to ITU-R BT.1869.
 */
enum class DemuxTlvFilterType : uint32_t {
    UNDEFINED = 0u,
    /**
     * A filter to filter signaling data out from input stream, and queue the
     * data to the filter's FMQ (Fast Message Queue).
     */
    SECTION = 1u /* ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterType.UNDEFINED implicitly + 1 */,
    /**
     * A filter to filter a TLV stream out from input stream. The output can be
     * either upper stream of another filter or queued to the filter's FMQ.
     */
    TLV = 2u /* ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterType.SECTION implicitly + 1 */,
    /**
     * A filter to strip out TLV message header and be a data source of another
     * filter.
     */
    PAYLOAD_THROUGH = 3u /* ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterType.TLV implicitly + 1 */,
};

/**
 * ALP Filter Type according to A/330 ATSC3.0.
 */
enum class DemuxAlpFilterType : uint32_t {
    UNDEFINED = 0u,
    /**
     * A filter to filter signaling data out from input stream, and queue the
     * data to the filter's FMQ (Fast Message Queue).
     */
    SECTION = 1u /* ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterType.UNDEFINED implicitly + 1 */,
    /**
     * A filter to set PTP (Precision Time Protocol) channel from input stream.
     */
    PTP = 2u /* ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterType.SECTION implicitly + 1 */,
    /**
     * A filter to strip out ALP message header and be a data source of another
     * filter.
     */
    PAYLOAD_THROUGH = 3u /* ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterType.PTP implicitly + 1 */,
};

/**
 * Demux Filter Type.
 */
struct DemuxFilterType final {
    // Forward declaration for forward reference support:
    struct DemuxFilterSubType;

    struct DemuxFilterSubType final {
        enum class hidl_discriminator : uint8_t {
            tsFilterType = 0,  // ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType
            mmtpFilterType = 1,  // ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType
            ipFilterType = 2,  // ::android::hardware::tv::tuner::V1_0::DemuxIpFilterType
            tlvFilterType = 3,  // ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterType
            alpFilterType = 4,  // ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterType
        };

        DemuxFilterSubType();
        ~DemuxFilterSubType();
        DemuxFilterSubType(DemuxFilterSubType&&);
        DemuxFilterSubType(const DemuxFilterSubType&);
        DemuxFilterSubType& operator=(DemuxFilterSubType&&);
        DemuxFilterSubType& operator=(const DemuxFilterSubType&);

        void tsFilterType(::android::hardware::tv::tuner::V1_0::DemuxTsFilterType);
        ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType& tsFilterType();
        ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType tsFilterType() const;

        void mmtpFilterType(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType);
        ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType& mmtpFilterType();
        ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType mmtpFilterType() const;

        void ipFilterType(::android::hardware::tv::tuner::V1_0::DemuxIpFilterType);
        ::android::hardware::tv::tuner::V1_0::DemuxIpFilterType& ipFilterType();
        ::android::hardware::tv::tuner::V1_0::DemuxIpFilterType ipFilterType() const;

        void tlvFilterType(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterType);
        ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterType& tlvFilterType();
        ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterType tlvFilterType() const;

        void alpFilterType(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterType);
        ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterType& alpFilterType();
        ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterType alpFilterType() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterType::DemuxFilterSubType, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::tv::tuner::V1_0::DemuxTsFilterType tsFilterType __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterType mmtpFilterType __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::DemuxIpFilterType ipFilterType __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterType tlvFilterType __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterType alpFilterType __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterType::DemuxFilterSubType::hidl_union) == 4, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterType::DemuxFilterSubType::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterType::DemuxFilterSubType::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterType::DemuxFilterSubType::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterType::DemuxFilterSubType) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterType::DemuxFilterSubType) == 4, "wrong alignment");

    ::android::hardware::tv::tuner::V1_0::DemuxFilterMainType mainType __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::DemuxFilterType::DemuxFilterSubType subType __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterType, mainType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterType, subType) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterType) == 12, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterType) == 4, "wrong alignment");

/*
 * Packet ID is used to specify packets in transport stream.
 */
typedef uint16_t DemuxTpid;

/*
 * Packet ID is used to specify packets in MMTP
 */
typedef uint16_t DemuxMmtpPid;

/**
 * Demux Packet ID.
 */
struct DemuxPid final {
    enum class hidl_discriminator : uint8_t {
        tPid = 0,  // uint16_t
        mmtpPid = 1,  // uint16_t
    };

    DemuxPid();
    ~DemuxPid();
    DemuxPid(DemuxPid&&);
    DemuxPid(const DemuxPid&);
    DemuxPid& operator=(DemuxPid&&);
    DemuxPid& operator=(const DemuxPid&);

    void tPid(uint16_t);
    uint16_t& tPid();
    uint16_t tPid() const;

    void mmtpPid(uint16_t);
    uint16_t& mmtpPid();
    uint16_t mmtpPid() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::tv::tuner::V1_0::DemuxPid, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        uint16_t tPid __attribute__ ((aligned(2)));
        uint16_t mmtpPid __attribute__ ((aligned(2)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxPid::hidl_union) == 2, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxPid::hidl_union) == 2, "wrong alignment");
    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxPid::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxPid::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxPid) == 4, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxPid) == 2, "wrong alignment");

enum class Constant : uint32_t {
    /**
     * An invalid packet ID in transport stream according to ISO/IEC 13818-1.
     */
    INVALID_TS_PID = 65535u /* 0xFFFF */,
    /**
     * An invalid Stream ID.
     */
    INVALID_STREAM_ID = 65535u /* 0xFFFF */,
    /**
     * An invalid Filter ID.
     */
    INVALID_FILTER_ID = 4294967295u /* 0xFFFFFFFF */,
    /**
     * An invalid AV sync hardware ID.
     */
    INVALID_AV_SYNC_ID = 4294967295u /* 0xFFFFFFFF */,
};

/**
 * A status of data in the filter's buffer.
 */
enum class DemuxFilterStatus : uint8_t {
    /**
     * The data in the filter buffer is ready to be read.
     */
    DATA_READY = 1 /* 1 << 0 */,
    /**
     * The available data amount in the filter buffer is at low level which is
     * set to 25 percent by default.
     */
    LOW_WATER = 2 /* 1 << 1 */,
    /**
     * The available data amount in the filter buffer is at high level which is
     * set to 75 percent by default.
     */
    HIGH_WATER = 4 /* 1 << 2 */,
    /**
     * The data in the filter buffer is full and newly filtered data is being
     * discarded.
     */
    OVERFLOW = 8 /* 1 << 3 */,
};

/**
 * Indexes can be tagged through TS (Transport Stream) header.
 */
enum class DemuxTsIndex : uint32_t {
    FIRST_PACKET = 1u /* 1 << 0 */,
    PAYLOAD_UNIT_START_INDICATOR = 2u /* 1 << 1 */,
    CHANGE_TO_NOT_SCRAMBLED = 4u /* 1 << 2 */,
    CHANGE_TO_EVEN_SCRAMBLED = 8u /* 1 << 3 */,
    CHANGE_TO_ODD_SCRAMBLED = 16u /* 1 << 4 */,
    DISCONTINUITY_INDICATOR = 32u /* 1 << 5 */,
    RANDOM_ACCESS_INDICATOR = 64u /* 1 << 6 */,
    PRIORITY_INDICATOR = 128u /* 1 << 7 */,
    PCR_FLAG = 256u /* 1 << 8 */,
    OPCR_FLAG = 512u /* 1 << 9 */,
    SPLICING_POINT_FLAG = 1024u /* 1 << 10 */,
    PRIVATE_DATA = 2048u /* 1 << 11 */,
    ADAPTATION_EXTENSION_FLAG = 4096u /* 1 << 12 */,
};

/**
 * Indexes can be tagged by Start Code in PES (Packetized Elementary Stream)
 * according to ISO/IEC 13818-1.
 */
enum class DemuxScIndex : uint32_t {
    /**
     * Start Code is for a new I Frame
     */
    I_FRAME = 1u /* 1 << 0 */,
    /**
     * Start Code is for a new P Frame
     */
    P_FRAME = 2u /* 1 << 1 */,
    /**
     * Start Code is for a new B Frame
     */
    B_FRAME = 4u /* 1 << 2 */,
    /**
     * Start Code is for a new Sequence
     */
    SEQUENCE = 8u /* 1 << 3 */,
};

/**
 * Indexes can be tagged by NAL unit group in HEVC
 * according to ISO/IEC 23008-2.
 */
enum class DemuxScHevcIndex : uint32_t {
    SPS = 1u /* 1 << 0 */,
    AUD = 2u /* 1 << 1 */,
    SLICE_CE_BLA_W_LP = 4u /* 1 << 2 */,
    SLICE_BLA_W_RADL = 8u /* 1 << 3 */,
    SLICE_BLA_N_LP = 16u /* 1 << 4 */,
    SLICE_IDR_W_RADL = 32u /* 1 << 5 */,
    SLICE_IDR_N_LP = 64u /* 1 << 6 */,
    SLICE_TRAIL_CRA = 128u /* 1 << 7 */,
};

/**
 * Start Code Index type to be used in the filter for record
 */
enum class DemuxRecordScIndexType : uint32_t {
    /**
     * Don't use SC index
     */
    NONE = 0u,
    /**
     * Use Start Code index
     */
    SC = 1u /* ::android::hardware::tv::tuner::V1_0::DemuxRecordScIndexType.NONE implicitly + 1 */,
    /**
     * Use Start Code index for HEVC
     */
    SC_HEVC = 2u /* ::android::hardware::tv::tuner::V1_0::DemuxRecordScIndexType.SC implicitly + 1 */,
};

/**
 *  Filter Settings for Record data.
 */
struct DemuxFilterRecordSettings final {
    // Forward declaration for forward reference support:
    struct ScIndexMask;

    struct ScIndexMask final {
        enum class hidl_discriminator : uint8_t {
            sc = 0,  // ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScIndex>
            scHevc = 1,  // ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScHevcIndex>
        };

        ScIndexMask();
        ~ScIndexMask();
        ScIndexMask(ScIndexMask&&);
        ScIndexMask(const ScIndexMask&);
        ScIndexMask& operator=(ScIndexMask&&);
        ScIndexMask& operator=(const ScIndexMask&);

        void sc(::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScIndex>);
        ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScIndex>& sc();
        ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScIndex> sc() const;

        void scHevc(::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScHevcIndex>);
        ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScHevcIndex>& scHevc();
        ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScHevcIndex> scHevc() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings::ScIndexMask, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScIndex> sc __attribute__ ((aligned(4)));
            ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScHevcIndex> scHevc __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings::ScIndexMask::hidl_union) == 4, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings::ScIndexMask::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings::ScIndexMask::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings::ScIndexMask::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings::ScIndexMask) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings::ScIndexMask) == 4, "wrong alignment");

    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxTsIndex> tsIndexMask __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::DemuxRecordScIndexType scIndexType __attribute__ ((aligned(4)));
    ::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings::ScIndexMask scIndexMask __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings, tsIndexMask) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings, scIndexType) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings, scIndexMask) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings) == 16, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings) == 4, "wrong alignment");

/**
 *  Bits Settings for Section Filter.
 */
struct DemuxFilterSectionBits final {
    /**
     * The bytes are configured for Section Filter
     */
    ::android::hardware::hidl_vec<uint8_t> filter __attribute__ ((aligned(8)));
    /**
     * Active bits in the configured bytes to be used for filtering
     */
    ::android::hardware::hidl_vec<uint8_t> mask __attribute__ ((aligned(8)));
    /**
     * Do positive match at the bit position of the configured bytes when the
     * bit at same position of the mode is 0.
     * Do negative match at the bit position of the configured bytes when the
     * bit at same position of the mode is 1.
     */
    ::android::hardware::hidl_vec<uint8_t> mode __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionBits, filter) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionBits, mask) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionBits, mode) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionBits) == 48, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionBits) == 8, "wrong alignment");

/**
 *  Filter Settings for Section data according to ISO/IEC 13818-1.
 */
struct DemuxFilterSectionSettings final {
    // Forward declaration for forward reference support:
    struct Condition;

    struct Condition final {
        // Forward declaration for forward reference support:
        struct TableInfo;

        struct TableInfo final {
            /**
             * Table ID for Section Filter
             */
            uint16_t tableId __attribute__ ((aligned(2)));
            /**
             * Version number for Section Filter
             */
            uint16_t version __attribute__ ((aligned(2)));
        };

        static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::TableInfo, tableId) == 0, "wrong offset");
        static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::TableInfo, version) == 2, "wrong offset");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::TableInfo) == 4, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::TableInfo) == 2, "wrong alignment");

        enum class hidl_discriminator : uint8_t {
            sectionBits = 0,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionBits
            tableInfo = 1,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::TableInfo
        };

        Condition();
        ~Condition();
        Condition(Condition&&);
        Condition(const Condition&);
        Condition& operator=(Condition&&);
        Condition& operator=(const Condition&);

        void sectionBits(const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionBits&);
        void sectionBits(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionBits&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionBits& sectionBits();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionBits& sectionBits() const;

        void tableInfo(const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::TableInfo&);
        void tableInfo(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::TableInfo&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::TableInfo& tableInfo();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::TableInfo& tableInfo() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionBits sectionBits __attribute__ ((aligned(8)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::TableInfo tableInfo __attribute__ ((aligned(2)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::hidl_union) == 48, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition) == 56, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition) == 8, "wrong alignment");

    ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings::Condition condition __attribute__ ((aligned(8)));
    /**
     * true if the filter checks CRC and discards data with wrong CRC
     */
    bool isCheckCrc __attribute__ ((aligned(1)));
    /**
     * true if the filter repeats the data with the same version
     */
    bool isRepeat __attribute__ ((aligned(1)));
    /**
     * true if the filter send onFilterStatus instead of onFilterEvent.
     */
    bool isRaw __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings, condition) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings, isCheckCrc) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings, isRepeat) == 57, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings, isRaw) == 58, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings) == 64, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings) == 8, "wrong alignment");

typedef uint16_t DemuxStreamId;

/**
 *  Filter Settings for a PES Data.
 */
struct DemuxFilterPesDataSettings final {
    uint16_t streamId __attribute__ ((aligned(2)));
    /**
     * true if the filter send onFilterStatus instead of onFilterEvent.
     */
    bool isRaw __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings, streamId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings, isRaw) == 2, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings) == 4, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings) == 2, "wrong alignment");

/**
 *  Filter Settings for a Video and Audio.
 */
struct DemuxFilterAvSettings final {
    /**
     * true if the filter output goes to decoder directly in pass through mode.
     */
    bool isPassthrough __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings, isPassthrough) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings) == 1, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings) == 1, "wrong alignment");

/**
 *  Filter Settings for a Download.
 */
struct DemuxFilterDownloadSettings final {
    uint32_t downloadId __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadSettings, downloadId) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadSettings) == 4, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadSettings) == 4, "wrong alignment");

/**
 *  IP Settings for a IP filter.
 */
struct DemuxIpAddress final {
    // Forward declaration for forward reference support:
    struct SrcIpAddress;
    struct DstIpAddress;

    struct SrcIpAddress final {
        enum class hidl_discriminator : uint8_t {
            /**
             * 0.0.0.0 is invalid. should be ignored.
             */
            v4 = 0,  // ::android::hardware::hidl_array<uint8_t, 4>
            /**
             * 0.0.0.0.0.0.0.0.0.0.0.0.0.0.0.0 is invalid. should be ignored.
             */
            v6 = 1,  // ::android::hardware::hidl_array<uint8_t, 16>
        };

        SrcIpAddress();
        ~SrcIpAddress();
        SrcIpAddress(SrcIpAddress&&);
        SrcIpAddress(const SrcIpAddress&);
        SrcIpAddress& operator=(SrcIpAddress&&);
        SrcIpAddress& operator=(const SrcIpAddress&);

        void v4(const ::android::hardware::hidl_array<uint8_t, 4>&);
        void v4(::android::hardware::hidl_array<uint8_t, 4>&&);
        ::android::hardware::hidl_array<uint8_t, 4>& v4();
        const ::android::hardware::hidl_array<uint8_t, 4>& v4() const;

        void v6(const ::android::hardware::hidl_array<uint8_t, 16>&);
        void v6(::android::hardware::hidl_array<uint8_t, 16>&&);
        ::android::hardware::hidl_array<uint8_t, 16>& v6();
        const ::android::hardware::hidl_array<uint8_t, 16>& v6() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::SrcIpAddress, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::hidl_array<uint8_t, 4> v4 __attribute__ ((aligned(1)));
            ::android::hardware::hidl_array<uint8_t, 16> v6 __attribute__ ((aligned(1)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::SrcIpAddress::hidl_union) == 16, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::SrcIpAddress::hidl_union) == 1, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::SrcIpAddress::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::SrcIpAddress::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::SrcIpAddress) == 17, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::SrcIpAddress) == 1, "wrong alignment");

    struct DstIpAddress final {
        enum class hidl_discriminator : uint8_t {
            /**
             * 0.0.0.0 is invalid. should be ignored.
             */
            v4 = 0,  // ::android::hardware::hidl_array<uint8_t, 4>
            /**
             * 0.0.0.0.0.0.0.0.0.0.0.0.0.0.0.0 is invalid. should be ignored.
             */
            v6 = 1,  // ::android::hardware::hidl_array<uint8_t, 16>
        };

        DstIpAddress();
        ~DstIpAddress();
        DstIpAddress(DstIpAddress&&);
        DstIpAddress(const DstIpAddress&);
        DstIpAddress& operator=(DstIpAddress&&);
        DstIpAddress& operator=(const DstIpAddress&);

        void v4(const ::android::hardware::hidl_array<uint8_t, 4>&);
        void v4(::android::hardware::hidl_array<uint8_t, 4>&&);
        ::android::hardware::hidl_array<uint8_t, 4>& v4();
        const ::android::hardware::hidl_array<uint8_t, 4>& v4() const;

        void v6(const ::android::hardware::hidl_array<uint8_t, 16>&);
        void v6(::android::hardware::hidl_array<uint8_t, 16>&&);
        ::android::hardware::hidl_array<uint8_t, 16>& v6();
        const ::android::hardware::hidl_array<uint8_t, 16>& v6() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::DstIpAddress, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::hidl_array<uint8_t, 4> v4 __attribute__ ((aligned(1)));
            ::android::hardware::hidl_array<uint8_t, 16> v6 __attribute__ ((aligned(1)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::DstIpAddress::hidl_union) == 16, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::DstIpAddress::hidl_union) == 1, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::DstIpAddress::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::DstIpAddress::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::DstIpAddress) == 17, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress::DstIpAddress) == 1, "wrong alignment");

    ::android::hardware::tv::tuner::V1_0::DemuxIpAddress::SrcIpAddress srcIpAddress __attribute__ ((aligned(1)));
    ::android::hardware::tv::tuner::V1_0::DemuxIpAddress::DstIpAddress dstIpAddress __attribute__ ((aligned(1)));
    /**
     * 0 is invalid. should be ignored.
     */
    uint16_t srcPort __attribute__ ((aligned(2)));
    /**
     * 0 is invalid. should be ignored.
     */
    uint16_t dstPort __attribute__ ((aligned(2)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress, srcIpAddress) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress, dstIpAddress) == 17, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress, srcPort) == 34, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress, dstPort) == 36, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress) == 38, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxIpAddress) == 2, "wrong alignment");

/**
 *  Filter Settings for a TS filter.
 */
struct DemuxTsFilterSettings final {
    // Forward declaration for forward reference support:
    struct FilterSettings;

    struct FilterSettings final {
        enum class hidl_discriminator : uint8_t {
            /**
             * Not additional parameters. it's used by PCR, TS, TEMI subtype
             * filters.
             */
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            section = 1,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings
            av = 2,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings
            pesData = 3,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings
            record = 4,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings
        };

        FilterSettings();
        ~FilterSettings();
        FilterSettings(FilterSettings&&);
        FilterSettings(const FilterSettings&);
        FilterSettings& operator=(FilterSettings&&);
        FilterSettings& operator=(const FilterSettings&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void section(const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings&);
        void section(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings& section();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings& section() const;

        void av(const ::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings&);
        void av(::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings& av();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings& av() const;

        void pesData(const ::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings&);
        void pesData(::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings& pesData();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings& pesData() const;

        void record(const ::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings&);
        void record(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings& record();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings& record() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings::FilterSettings, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings section __attribute__ ((aligned(8)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings av __attribute__ ((aligned(1)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings pesData __attribute__ ((aligned(2)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings record __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings::FilterSettings::hidl_union) == 64, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings::FilterSettings::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings::FilterSettings::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings::FilterSettings::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings::FilterSettings) == 72, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings::FilterSettings) == 8, "wrong alignment");

    uint16_t tpid __attribute__ ((aligned(2)));
    ::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings::FilterSettings filterSettings __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings, tpid) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings, filterSettings) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings) == 80, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings) == 8, "wrong alignment");

/**
 *  Filter Settings for a MMTP filter.
 */
struct DemuxMmtpFilterSettings final {
    // Forward declaration for forward reference support:
    struct FilterSettings;

    struct FilterSettings final {
        enum class hidl_discriminator : uint8_t {
            /**
             * Not additional parameters. it's used by MMTP subtype filters.
             */
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            section = 1,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings
            av = 2,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings
            pesData = 3,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings
            record = 4,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings
            download = 5,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadSettings
        };

        FilterSettings();
        ~FilterSettings();
        FilterSettings(FilterSettings&&);
        FilterSettings(const FilterSettings&);
        FilterSettings& operator=(FilterSettings&&);
        FilterSettings& operator=(const FilterSettings&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void section(const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings&);
        void section(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings& section();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings& section() const;

        void av(const ::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings&);
        void av(::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings& av();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings& av() const;

        void pesData(const ::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings&);
        void pesData(::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings& pesData();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings& pesData() const;

        void record(const ::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings&);
        void record(::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings& record();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings& record() const;

        void download(const ::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadSettings&);
        void download(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadSettings& download();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadSettings& download() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings::FilterSettings, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings section __attribute__ ((aligned(8)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterAvSettings av __attribute__ ((aligned(1)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterPesDataSettings pesData __attribute__ ((aligned(2)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterRecordSettings record __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadSettings download __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings::FilterSettings::hidl_union) == 64, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings::FilterSettings::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings::FilterSettings::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings::FilterSettings::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings::FilterSettings) == 72, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings::FilterSettings) == 8, "wrong alignment");

    uint16_t mmtpPid __attribute__ ((aligned(2)));
    ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings::FilterSettings filterSettings __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings, mmtpPid) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings, filterSettings) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings) == 80, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings) == 8, "wrong alignment");

/**
 *  Filter Settings for a IP filter.
 */
struct DemuxIpFilterSettings final {
    // Forward declaration for forward reference support:
    struct FilterSettings;

    struct FilterSettings final {
        enum class hidl_discriminator : uint8_t {
            /**
             * Not additional parameters. it's used by NTP, IP_PAYLOAD,
             * PAYLOAD_THROUGH subtype filters.
             */
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            section = 1,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings
            /**
             * true if the data from IP subtype go to next filter directly
             */
            bPassthrough = 2,  // bool
        };

        FilterSettings();
        ~FilterSettings();
        FilterSettings(FilterSettings&&);
        FilterSettings(const FilterSettings&);
        FilterSettings& operator=(FilterSettings&&);
        FilterSettings& operator=(const FilterSettings&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void section(const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings&);
        void section(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings& section();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings& section() const;

        void bPassthrough(bool);
        bool& bPassthrough();
        bool bPassthrough() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings::FilterSettings, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings section __attribute__ ((aligned(8)));
            bool bPassthrough __attribute__ ((aligned(1)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings::FilterSettings::hidl_union) == 64, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings::FilterSettings::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings::FilterSettings::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings::FilterSettings::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings::FilterSettings) == 72, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings::FilterSettings) == 8, "wrong alignment");

    ::android::hardware::tv::tuner::V1_0::DemuxIpAddress ipAddr __attribute__ ((aligned(2)));
    ::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings::FilterSettings filterSettings __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings, ipAddr) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings, filterSettings) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings) == 112, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings) == 8, "wrong alignment");

/**
 *  Filter Settings for a TLV filter.
 */
struct DemuxTlvFilterSettings final {
    // Forward declaration for forward reference support:
    struct FilterSettings;

    struct FilterSettings final {
        enum class hidl_discriminator : uint8_t {
            /**
             * Not additional parameters. it's used by PAYLOAD_THROUGH subtype
             * filters.
             */
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            section = 1,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings
            /**
             * true if the data from TLV subtype go to next filter directly
             */
            bPassthrough = 2,  // bool
        };

        FilterSettings();
        ~FilterSettings();
        FilterSettings(FilterSettings&&);
        FilterSettings(const FilterSettings&);
        FilterSettings& operator=(FilterSettings&&);
        FilterSettings& operator=(const FilterSettings&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void section(const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings&);
        void section(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings& section();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings& section() const;

        void bPassthrough(bool);
        bool& bPassthrough();
        bool bPassthrough() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings::FilterSettings, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings section __attribute__ ((aligned(8)));
            bool bPassthrough __attribute__ ((aligned(1)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings::FilterSettings::hidl_union) == 64, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings::FilterSettings::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings::FilterSettings::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings::FilterSettings::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings::FilterSettings) == 72, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings::FilterSettings) == 8, "wrong alignment");

    uint8_t packetType __attribute__ ((aligned(1)));
    /**
     * true if the filtered data is commpressed ip packet
     */
    bool isCompressedIpPacket __attribute__ ((aligned(1)));
    ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings::FilterSettings filterSettings __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings, packetType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings, isCompressedIpPacket) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings, filterSettings) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings) == 80, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings) == 8, "wrong alignment");

/**
 * ALP Length Type
 */
enum class DemuxAlpLengthType : uint8_t {
    UNDEFINED = 0,
    /**
     * Length does NOT include additional header. Used in US region.
     */
    WITHOUT_ADDITIONAL_HEADER = 1 /* ::android::hardware::tv::tuner::V1_0::DemuxAlpLengthType.UNDEFINED implicitly + 1 */,
    /**
     * Length includes additional header. Used in Korea region.
     */
    WITH_ADDITIONAL_HEADER = 2 /* ::android::hardware::tv::tuner::V1_0::DemuxAlpLengthType.WITHOUT_ADDITIONAL_HEADER implicitly + 1 */,
};

/**
 *  Filter Settings for a ALP filter.
 */
struct DemuxAlpFilterSettings final {
    // Forward declaration for forward reference support:
    struct FilterSettings;

    struct FilterSettings final {
        enum class hidl_discriminator : uint8_t {
            /**
             * Not additional parameters. it's used by PTP, PAYLOAD_THROUGH subtype
             * filters.
             */
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            section = 1,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings
        };

        FilterSettings();
        ~FilterSettings();
        FilterSettings(FilterSettings&&);
        FilterSettings(const FilterSettings&);
        FilterSettings& operator=(FilterSettings&&);
        FilterSettings& operator=(const FilterSettings&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void section(const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings&);
        void section(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings& section();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings& section() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings::FilterSettings, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionSettings section __attribute__ ((aligned(8)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings::FilterSettings::hidl_union) == 64, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings::FilterSettings::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings::FilterSettings::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings::FilterSettings::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings::FilterSettings) == 72, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings::FilterSettings) == 8, "wrong alignment");

    /**
     * 0: IpV4, 2:Compressed Ip, 4:Signaling.
     */
    uint8_t packetType __attribute__ ((aligned(1)));
    ::android::hardware::tv::tuner::V1_0::DemuxAlpLengthType lengthType __attribute__ ((aligned(1)));
    ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings::FilterSettings filterSettings __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings, packetType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings, lengthType) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings, filterSettings) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings) == 80, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings) == 8, "wrong alignment");

/**
 *  Filter Settings.
 */
struct DemuxFilterSettings final {
    enum class hidl_discriminator : uint8_t {
        ts = 0,  // ::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings
        mmtp = 1,  // ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings
        ip = 2,  // ::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings
        tlv = 3,  // ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings
        alp = 4,  // ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings
    };

    DemuxFilterSettings();
    ~DemuxFilterSettings();
    DemuxFilterSettings(DemuxFilterSettings&&);
    DemuxFilterSettings(const DemuxFilterSettings&);
    DemuxFilterSettings& operator=(DemuxFilterSettings&&);
    DemuxFilterSettings& operator=(const DemuxFilterSettings&);

    void ts(const ::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings&);
    void ts(::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings&&);
    ::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings& ts();
    const ::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings& ts() const;

    void mmtp(const ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings&);
    void mmtp(::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings&&);
    ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings& mmtp();
    const ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings& mmtp() const;

    void ip(const ::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings&);
    void ip(::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings&&);
    ::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings& ip();
    const ::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings& ip() const;

    void tlv(const ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings&);
    void tlv(::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings&&);
    ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings& tlv();
    const ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings& tlv() const;

    void alp(const ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings&);
    void alp(::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings&&);
    ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings& alp();
    const ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings& alp() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSettings, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hardware::tv::tuner::V1_0::DemuxTsFilterSettings ts __attribute__ ((aligned(8)));
        ::android::hardware::tv::tuner::V1_0::DemuxMmtpFilterSettings mmtp __attribute__ ((aligned(8)));
        ::android::hardware::tv::tuner::V1_0::DemuxIpFilterSettings ip __attribute__ ((aligned(8)));
        ::android::hardware::tv::tuner::V1_0::DemuxTlvFilterSettings tlv __attribute__ ((aligned(8)));
        ::android::hardware::tv::tuner::V1_0::DemuxAlpFilterSettings alp __attribute__ ((aligned(8)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterSettings::hidl_union) == 112, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterSettings::hidl_union) == 8, "wrong alignment");
    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterSettings::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterSettings::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterSettings) == 120, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterSettings) == 8, "wrong alignment");

/**
 * The bits of EventFlag in FMQ (Fast message queue) are used by client to
 * notify HAL the status change.
 */
enum class DemuxQueueNotifyBits : uint32_t {
    /**
     * client writes data and notify HAL the data is ready.
     */
    DATA_READY = 1u /* 1 << 0 */,
    /**
     * client reads data and notify HAL the data is consumed.
     */
    DATA_CONSUMED = 2u /* 1 << 1 */,
};

/**
 *  Filter Event for Section Filter.
 */
struct DemuxFilterSectionEvent final {
    /**
     * Table ID of filtered data
     */
    uint16_t tableId __attribute__ ((aligned(2)));
    /**
     * Version number of filtered data
     */
    uint16_t version __attribute__ ((aligned(2)));
    /**
     * Section number of filtered data
     */
    uint16_t sectionNum __attribute__ ((aligned(2)));
    /**
     * Data size in bytes of filtered data
     */
    uint16_t dataLength __attribute__ ((aligned(2)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent, tableId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent, version) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent, sectionNum) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent, dataLength) == 6, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent) == 8, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent) == 2, "wrong alignment");

/**
 *  Extra Meta Data from AD (Audio Descriptor) according to
 *  ETSI TS 101 154 V2.1.1.
 */
struct AudioExtraMetaData final {
    uint8_t adFade __attribute__ ((aligned(1)));
    uint8_t adPan __attribute__ ((aligned(1)));
    uint8_t versionTextTag __attribute__ ((aligned(1)));
    uint8_t adGainCenter __attribute__ ((aligned(1)));
    uint8_t adGainFront __attribute__ ((aligned(1)));
    uint8_t adGainSurround __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::AudioExtraMetaData, adFade) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::AudioExtraMetaData, adPan) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::AudioExtraMetaData, versionTextTag) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::AudioExtraMetaData, adGainCenter) == 3, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::AudioExtraMetaData, adGainFront) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::AudioExtraMetaData, adGainSurround) == 5, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::AudioExtraMetaData) == 6, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::AudioExtraMetaData) == 1, "wrong alignment");

/**
 *  Filter Event for Audio or Video Filter.
 */
struct DemuxFilterMediaEvent final {
    // Forward declaration for forward reference support:
    struct ExtraMetaData;

    struct ExtraMetaData final {
        enum class hidl_discriminator : uint8_t {
            /**
             * Not additional parameters. it's used for video.
             */
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            audio = 1,  // ::android::hardware::tv::tuner::V1_0::AudioExtraMetaData
        };

        ExtraMetaData();
        ~ExtraMetaData();
        ExtraMetaData(ExtraMetaData&&);
        ExtraMetaData(const ExtraMetaData&);
        ExtraMetaData& operator=(ExtraMetaData&&);
        ExtraMetaData& operator=(const ExtraMetaData&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void audio(const ::android::hardware::tv::tuner::V1_0::AudioExtraMetaData&);
        void audio(::android::hardware::tv::tuner::V1_0::AudioExtraMetaData&&);
        ::android::hardware::tv::tuner::V1_0::AudioExtraMetaData& audio();
        const ::android::hardware::tv::tuner::V1_0::AudioExtraMetaData& audio() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent::ExtraMetaData, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            ::android::hardware::tv::tuner::V1_0::AudioExtraMetaData audio __attribute__ ((aligned(1)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent::ExtraMetaData::hidl_union) == 6, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent::ExtraMetaData::hidl_union) == 1, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent::ExtraMetaData::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent::ExtraMetaData::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent::ExtraMetaData) == 7, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent::ExtraMetaData) == 1, "wrong alignment");

    uint16_t streamId __attribute__ ((aligned(2)));
    /**
     * true if PTS is present in PES header.
     */
    bool isPtsPresent __attribute__ ((aligned(1)));
    /**
     * Presentation Time Stamp for audio or video frame. It based on 90KHz has
     * the same format as PTS (Presentation Time Stamp).
     */
    uint64_t pts __attribute__ ((aligned(8)));
    /**
     * Data size in bytes of audio or video frame
     */
    uint32_t dataLength __attribute__ ((aligned(4)));
    /**
     *  The offset in the memory block which is shared among multiple
     *  MediaEvents.
     */
    uint32_t offset __attribute__ ((aligned(4)));
    /**
     * A handle associated to the memory where audio or video data stays.
     */
    ::android::hardware::hidl_handle avMemory __attribute__ ((aligned(8)));
    /**
     * True if the avMemory is in secure area, and isn't mappable.
     */
    bool isSecureMemory __attribute__ ((aligned(1)));
    /**
     * An Id is used by HAL to provide additional information for AV data.
     * For secure audio, it's the audio handle used by Audio Track.
     */
    uint64_t avDataId __attribute__ ((aligned(8)));
    /**
     * MPU sequence number of filtered data (only for MMTP)
     */
    uint32_t mpuSequenceNumber __attribute__ ((aligned(4)));
    bool isPesPrivateData __attribute__ ((aligned(1)));
    ::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent::ExtraMetaData extraMetaData __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent, streamId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent, isPtsPresent) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent, pts) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent, dataLength) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent, offset) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent, avMemory) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent, isSecureMemory) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent, avDataId) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent, mpuSequenceNumber) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent, isPesPrivateData) == 60, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent, extraMetaData) == 61, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent) == 72, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent) == 8, "wrong alignment");

/**
 *  Filter Event for PES data.
 */
struct DemuxFilterPesEvent final {
    uint16_t streamId __attribute__ ((aligned(2)));
    /**
     * Data size in bytes of PES data
     */
    uint16_t dataLength __attribute__ ((aligned(2)));
    /**
     * MPU sequence number of filtered data (only for MMTP)
     */
    uint32_t mpuSequenceNumber __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterPesEvent, streamId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterPesEvent, dataLength) == 2, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterPesEvent, mpuSequenceNumber) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterPesEvent) == 8, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterPesEvent) == 4, "wrong alignment");

/**
 *  Filter Event for TS Record data.
 */
struct DemuxFilterTsRecordEvent final {
    // Forward declaration for forward reference support:
    struct ScIndexMask;

    struct ScIndexMask final {
        enum class hidl_discriminator : uint8_t {
            sc = 0,  // ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScIndex>
            scHevc = 1,  // ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScHevcIndex>
        };

        ScIndexMask();
        ~ScIndexMask();
        ScIndexMask(ScIndexMask&&);
        ScIndexMask(const ScIndexMask&);
        ScIndexMask& operator=(ScIndexMask&&);
        ScIndexMask& operator=(const ScIndexMask&);

        void sc(::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScIndex>);
        ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScIndex>& sc();
        ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScIndex> sc() const;

        void scHevc(::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScHevcIndex>);
        ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScHevcIndex>& scHevc();
        ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScHevcIndex> scHevc() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent::ScIndexMask, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScIndex> sc __attribute__ ((aligned(4)));
            ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScHevcIndex> scHevc __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent::ScIndexMask::hidl_union) == 4, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent::ScIndexMask::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent::ScIndexMask::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent::ScIndexMask::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent::ScIndexMask) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent::ScIndexMask) == 4, "wrong alignment");

    ::android::hardware::tv::tuner::V1_0::DemuxPid pid __attribute__ ((aligned(2)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxTsIndex> tsIndexMask __attribute__ ((aligned(4)));
    /**
     * Indexes of record output
     */
    ::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent::ScIndexMask scIndexMask __attribute__ ((aligned(4)));
    /**
     * Byte number from beginning of the filter's output
     */
    uint64_t byteNumber __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent, pid) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent, tsIndexMask) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent, scIndexMask) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent, byteNumber) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent) == 24, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent) == 8, "wrong alignment");

/**
 *  Filter Event for Timed External Media Information (TEMI) data.
 */
struct DemuxFilterTemiEvent final {
    /**
     * Presentation Time Stamp for audio or video frame. It based on 90KHz has
     * the same format as PTS (Presentation Time Stamp) in ISO/IEC 13818-1.
     */
    uint64_t pts __attribute__ ((aligned(8)));
    /**
     * TEMI Descriptor Tag
     */
    uint8_t descrTag __attribute__ ((aligned(1)));
    /**
     * TEMI Descriptor
     */
    ::android::hardware::hidl_vec<uint8_t> descrData __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterTemiEvent, pts) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterTemiEvent, descrTag) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterTemiEvent, descrData) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterTemiEvent) == 32, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterTemiEvent) == 8, "wrong alignment");

/**
 *  Filter Event for MMTP Record data.
 */
struct DemuxFilterMmtpRecordEvent final {
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxScHevcIndex> scHevcIndexMask __attribute__ ((aligned(4)));
    /**
     * Byte number from beginning of the filter's output
     */
    uint64_t byteNumber __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMmtpRecordEvent, scHevcIndexMask) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterMmtpRecordEvent, byteNumber) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterMmtpRecordEvent) == 16, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterMmtpRecordEvent) == 8, "wrong alignment");

/**
 *  Filter Event for Download data.
 */
struct DemuxFilterDownloadEvent final {
    uint32_t itemId __attribute__ ((aligned(4)));
    /**
     * MPU sequence number of filtered data (only for MMTP)
     */
    uint32_t mpuSequenceNumber __attribute__ ((aligned(4)));
    uint32_t itemFragmentIndex __attribute__ ((aligned(4)));
    uint32_t lastItemFragmentIndex __attribute__ ((aligned(4)));
    /**
     * Data size in bytes of filtered data
     */
    uint16_t dataLength __attribute__ ((aligned(2)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent, itemId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent, mpuSequenceNumber) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent, itemFragmentIndex) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent, lastItemFragmentIndex) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent, dataLength) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent) == 20, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent) == 4, "wrong alignment");

/**
 *  Filter Event for IP payload data.
 */
struct DemuxFilterIpPayloadEvent final {
    /**
     * Data size in bytes of IP data
     */
    uint16_t dataLength __attribute__ ((aligned(2)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterIpPayloadEvent, dataLength) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterIpPayloadEvent) == 2, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterIpPayloadEvent) == 2, "wrong alignment");

/**
 * Filter Event.
 */
struct DemuxFilterEvent final {
    // Forward declaration for forward reference support:
    struct Event;

    struct Event final {
        enum class hidl_discriminator : uint8_t {
            section = 0,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent
            media = 1,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent
            pes = 2,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterPesEvent
            tsRecord = 3,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent
            mmtpRecord = 4,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterMmtpRecordEvent
            download = 5,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent
            ipPayload = 6,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterIpPayloadEvent
            temi = 7,  // ::android::hardware::tv::tuner::V1_0::DemuxFilterTemiEvent
        };

        Event();
        ~Event();
        Event(Event&&);
        Event(const Event&);
        Event& operator=(Event&&);
        Event& operator=(const Event&);

        void section(const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent&);
        void section(::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent& section();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent& section() const;

        void media(const ::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent&);
        void media(::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent& media();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent& media() const;

        void pes(const ::android::hardware::tv::tuner::V1_0::DemuxFilterPesEvent&);
        void pes(::android::hardware::tv::tuner::V1_0::DemuxFilterPesEvent&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterPesEvent& pes();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterPesEvent& pes() const;

        void tsRecord(const ::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent&);
        void tsRecord(::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent& tsRecord();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent& tsRecord() const;

        void mmtpRecord(const ::android::hardware::tv::tuner::V1_0::DemuxFilterMmtpRecordEvent&);
        void mmtpRecord(::android::hardware::tv::tuner::V1_0::DemuxFilterMmtpRecordEvent&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterMmtpRecordEvent& mmtpRecord();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterMmtpRecordEvent& mmtpRecord() const;

        void download(const ::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent&);
        void download(::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent& download();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent& download() const;

        void ipPayload(const ::android::hardware::tv::tuner::V1_0::DemuxFilterIpPayloadEvent&);
        void ipPayload(::android::hardware::tv::tuner::V1_0::DemuxFilterIpPayloadEvent&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterIpPayloadEvent& ipPayload();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterIpPayloadEvent& ipPayload() const;

        void temi(const ::android::hardware::tv::tuner::V1_0::DemuxFilterTemiEvent&);
        void temi(::android::hardware::tv::tuner::V1_0::DemuxFilterTemiEvent&&);
        ::android::hardware::tv::tuner::V1_0::DemuxFilterTemiEvent& temi();
        const ::android::hardware::tv::tuner::V1_0::DemuxFilterTemiEvent& temi() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterEvent::Event, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::tv::tuner::V1_0::DemuxFilterSectionEvent section __attribute__ ((aligned(2)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterMediaEvent media __attribute__ ((aligned(8)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterPesEvent pes __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterTsRecordEvent tsRecord __attribute__ ((aligned(8)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterMmtpRecordEvent mmtpRecord __attribute__ ((aligned(8)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterDownloadEvent download __attribute__ ((aligned(4)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterIpPayloadEvent ipPayload __attribute__ ((aligned(2)));
            ::android::hardware::tv::tuner::V1_0::DemuxFilterTemiEvent temi __attribute__ ((aligned(8)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterEvent::Event::hidl_union) == 72, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterEvent::Event::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterEvent::Event::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterEvent::Event::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterEvent::Event) == 80, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterEvent::Event) == 8, "wrong alignment");

    /**
     * An array of events
     */
    ::android::hardware::hidl_vec<::android::hardware::tv::tuner::V1_0::DemuxFilterEvent::Event> events __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxFilterEvent, events) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxFilterEvent) == 16, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxFilterEvent) == 8, "wrong alignment");

typedef uint32_t AvSyncHwId;

typedef ::android::hardware::hidl_vec<uint8_t> TunerKeyToken;

/**
 * A data format in demux's output or input according to ISO/IEC 13818-1.
 */
enum class DataFormat : uint32_t {
    /**
     * Data is Transport Stream.
     */
    TS = 0u,
    /**
     * Data is Packetized Elementary Stream.
     */
    PES = 1u /* ::android::hardware::tv::tuner::V1_0::DataFormat.TS implicitly + 1 */,
    /**
     * Data is Elementary Stream.
     */
    ES = 2u /* ::android::hardware::tv::tuner::V1_0::DataFormat.PES implicitly + 1 */,
    /**
     * Data is TLV (type-length-value) Stream for JP SHV
     */
    SHV_TLV = 3u /* ::android::hardware::tv::tuner::V1_0::DataFormat.ES implicitly + 1 */,
};

typedef ::android::hardware::tv::tuner::V1_0::DemuxFilterStatus RecordStatus;

/**
 *  The Settings for the record in DVR.
 */
struct RecordSettings final {
    /**
     * Register for interested status events so that the HAL can send these
     * status events back to client.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxFilterStatus> statusMask __attribute__ ((aligned(1)));
    /**
     * Unconsumed data size in bytes in the record. The HAL uses it to trigger
     * OutputStatus::LOW_WATER.
     */
    uint32_t lowThreshold __attribute__ ((aligned(4)));
    /**
     * Unconsumed data size in bytes in the record. The HAL uses it to trigger
     * OutputStatus::High_WATER.
     */
    uint32_t highThreshold __attribute__ ((aligned(4)));
    /**
     * The data format in the record.
     */
    ::android::hardware::tv::tuner::V1_0::DataFormat dataFormat __attribute__ ((aligned(4)));
    /**
     * The packet size in bytes in the record.
     */
    uint8_t packetSize __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::RecordSettings, statusMask) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::RecordSettings, lowThreshold) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::RecordSettings, highThreshold) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::RecordSettings, dataFormat) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::RecordSettings, packetSize) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::RecordSettings) == 20, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::RecordSettings) == 4, "wrong alignment");

/**
 * A status of the playback in DVR.
 */
enum class PlaybackStatus : uint32_t {
    /**
     * The space of the demux's playback is empty.
     */
    SPACE_EMPTY = 1u /* 1 << 0 */,
    /**
     * The spece of the demux's playback is almost empty.
     */
    SPACE_ALMOST_EMPTY = 2u /* 1 << 1 */,
    /**
     * The space of the demux's playback is almost full.
     */
    SPACE_ALMOST_FULL = 4u /* 1 << 2 */,
    /**
     * The space of the demux's playback is full.
     */
    SPACE_FULL = 8u /* 1 << 3 */,
};

/**
 * The Setting for the playback in DVR.
 */
struct PlaybackSettings final {
    /**
     * Register for interested status events so that the HAL can send these
     * status events back to client.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::PlaybackStatus> statusMask __attribute__ ((aligned(4)));
    /**
     * Unused space size in bytes in the playback. The HAL uses it to trigger
     * InputStatus::SPACE_ALMOST_EMPTY.
     */
    uint32_t lowThreshold __attribute__ ((aligned(4)));
    /**
     * Unused space size in bytes in the playback. The HAL uses it to trigger
     * InputStatus::SPACE_ALMOST_FULL.
     */
    uint32_t highThreshold __attribute__ ((aligned(4)));
    /**
     * The data format in the playback.
     */
    ::android::hardware::tv::tuner::V1_0::DataFormat dataFormat __attribute__ ((aligned(4)));
    /**
     * The packet size in bytes in the playback.
     */
    uint8_t packetSize __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::PlaybackSettings, statusMask) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::PlaybackSettings, lowThreshold) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::PlaybackSettings, highThreshold) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::PlaybackSettings, dataFormat) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::PlaybackSettings, packetSize) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::PlaybackSettings) == 20, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::PlaybackSettings) == 4, "wrong alignment");

/**
 * The type of DVR.
 */
enum class DvrType : uint8_t {
    RECORD = 0,
    PLAYBACK = 1 /* ::android::hardware::tv::tuner::V1_0::DvrType.RECORD implicitly + 1 */,
};

/**
 * The Setting for DVR.
 */
struct DvrSettings final {
    enum class hidl_discriminator : uint8_t {
        record = 0,  // ::android::hardware::tv::tuner::V1_0::RecordSettings
        playback = 1,  // ::android::hardware::tv::tuner::V1_0::PlaybackSettings
    };

    DvrSettings();
    ~DvrSettings();
    DvrSettings(DvrSettings&&);
    DvrSettings(const DvrSettings&);
    DvrSettings& operator=(DvrSettings&&);
    DvrSettings& operator=(const DvrSettings&);

    void record(const ::android::hardware::tv::tuner::V1_0::RecordSettings&);
    void record(::android::hardware::tv::tuner::V1_0::RecordSettings&&);
    ::android::hardware::tv::tuner::V1_0::RecordSettings& record();
    const ::android::hardware::tv::tuner::V1_0::RecordSettings& record() const;

    void playback(const ::android::hardware::tv::tuner::V1_0::PlaybackSettings&);
    void playback(::android::hardware::tv::tuner::V1_0::PlaybackSettings&&);
    ::android::hardware::tv::tuner::V1_0::PlaybackSettings& playback();
    const ::android::hardware::tv::tuner::V1_0::PlaybackSettings& playback() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::tv::tuner::V1_0::DvrSettings, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hardware::tv::tuner::V1_0::RecordSettings record __attribute__ ((aligned(4)));
        ::android::hardware::tv::tuner::V1_0::PlaybackSettings playback __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DvrSettings::hidl_union) == 20, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DvrSettings::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DvrSettings::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DvrSettings::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DvrSettings) == 24, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DvrSettings) == 4, "wrong alignment");

/**
 *  Capabilities for Demux.
 */
struct DemuxCapabilities final {
    /**
     * The number of Demux to be supported.
     */
    uint32_t numDemux __attribute__ ((aligned(4)));
    /**
     * The number of record to be supported.
     */
    uint32_t numRecord __attribute__ ((aligned(4)));
    /**
     * The number of playback to be supported.
     */
    uint32_t numPlayback __attribute__ ((aligned(4)));
    /**
     * The number of TS Filter to be supported.
     */
    uint32_t numTsFilter __attribute__ ((aligned(4)));
    /**
     * The number of Section Filter to be supported.
     */
    uint32_t numSectionFilter __attribute__ ((aligned(4)));
    /**
     * The number of Audio Filter to be supported.
     */
    uint32_t numAudioFilter __attribute__ ((aligned(4)));
    /**
     * The number of Video Filter to be supported.
     */
    uint32_t numVideoFilter __attribute__ ((aligned(4)));
    /**
     * The number of PES Filter to be supported.
     */
    uint32_t numPesFilter __attribute__ ((aligned(4)));
    /**
     * The number of PCR Filter to be supported.
     */
    uint32_t numPcrFilter __attribute__ ((aligned(4)));
    /**
     * The maximum number of bytes is supported in the mask of Section Filter.
     */
    uint32_t numBytesInSectionFilter __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxFilterMainType> filterCaps __attribute__ ((aligned(4)));
    /**
     * The array has same elements as DemuxFilterMainType. linkCaps[i] presents
     * filter's capability as soource for the ith type in DemuxFilterMainType.
     * The jth bit of linkCaps[i] is 1 if the output of ith type filter can be
     * data source for the filter type j.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_bitfield<::android::hardware::tv::tuner::V1_0::DemuxFilterMainType>> linkCaps __attribute__ ((aligned(8)));
    bool bTimeFilter __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, numDemux) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, numRecord) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, numPlayback) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, numTsFilter) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, numSectionFilter) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, numAudioFilter) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, numVideoFilter) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, numPesFilter) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, numPcrFilter) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, numBytesInSectionFilter) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, filterCaps) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, linkCaps) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities, bTimeFilter) == 64, "wrong offset");
static_assert(sizeof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities) == 72, "wrong size");
static_assert(__alignof(::android::hardware::tv::tuner::V1_0::DemuxCapabilities) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::tv::tuner::V1_0::Result o);
static inline void PrintTo(::android::hardware::tv::tuner::V1_0::Result o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::tv::tuner::V1_0::Result lhs, const ::android::hardware::tv::tuner::V1_0::Result rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::tv::tuner::V1_0::Result rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::tv::tuner::V1_0::Result lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
