{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "system/core/libcutils/include_outside_system/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_h",
   "name" : "unsigned char [128]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA128_h",
   "size" : 128,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1_h",
   "name" : "unsigned char [1]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA1_h",
   "size" : 1,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA3_A3_i",
   "name" : "int [3][3]",
   "referenced_type" : "_ZTIA3_i",
   "self_type" : "_ZTIA3_A3_i",
   "size" : 36,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA3_N7android10MediaImage9PlaneInfoE",
   "name" : "android::MediaImage::PlaneInfo [3]",
   "referenced_type" : "_ZTIN7android10MediaImage9PlaneInfoE",
   "self_type" : "_ZTIA3_N7android10MediaImage9PlaneInfoE",
   "size" : 60,
   "source_file" : "frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA3_i",
   "name" : "int [3]",

   "name" : "const android::hardware::media::omx::V1_0::CodecBuffer",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_011CodecBufferE",
   "self_type" : "_ZTIKN7android8hardware5media3omx4V1_011CodecBufferE",
   "size" : 104,
   "source_file" : "frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/1.0/Conversion.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android8hardware5media3omx4V1_012ColorAspectsE",
   "name" : "const android::hardware::media::omx::V1_0::ColorAspects",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_012ColorAspectsE",
   "self_type" : "_ZTIKN7android8hardware5media3omx4V1_012ColorAspectsE",
   "size" : 16,
   "source_file" : "frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/1.0/Conversion.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android8hardware5media3omx4V1_04IOmx13ComponentInfoE",
   "name" : "const android::hardware::media::omx::V1_0::IOmx::ComponentInfo",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_04IOmx13ComponentInfoE",
   "self_type" : "_ZTIKN7android8hardware5media3omx4V1_04IOmx13ComponentInfoE",
   "size" : 32,
   "source_file" : "frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/1.0/Conversion.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android8hardware5media3omx4V1_07MessageE",
   "name" : "const android::hardware::media::omx::V1_0::Message",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_07MessageE",
   "self_type" : "_ZTIKN7android8hardware5media3omx4V1_07MessageE",
   "size" : 48,
   "source_file" : "frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/1.0/Conversion.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android9OMXBufferE",
   "name" : "const android::OMXBuffer",
   "referenced_type" : "_ZTIN7android9OMXBufferE",
   "self_type" : "_ZTIKN7android9OMXBufferE",
   "size" : 64,
   "source_file" : "frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/1.0/Conversion.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String8.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hMarkTargetComponent",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12OMX_MARKTYPE",
   "name" : "OMX_MARKTYPE",
   "referenced_type" : "_ZTI12OMX_MARKTYPE",
   "self_type" : "_ZTI12OMX_MARKTYPE",
   "size" : 8,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "_ZTI13android_ycbcr",
   "self_type" : "_ZTI13android_ycbcr",
   "size" : 56,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "system/core/libcutils/include_outside_system/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIN15OMX_VERSIONTYPEUt_E"
    },
    {
     "field_name" : "nVersion",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15OMX_VERSIONTYPE",
   "name" : "OMX_VERSIONTYPE",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15OMX_VERSIONTYPE",
   "self_type" : "_ZTI15OMX_VERSIONTYPE",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "EventHandler",
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_13OMX_EVENTTYPEjjS0_E"
    },
    {
     "field_name" : "EmptyBufferDone",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_P20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "FillBufferDone",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_P20OMX_BUFFERHEADERTYPEE"
    }
   ],
   "linker_set_key" : "_ZTI16OMX_CALLBACKTYPE",
   "name" : "OMX_CALLBACKTYPE",
   "referenced_type" : "_ZTI16OMX_CALLBACKTYPE",
   "self_type" : "_ZTI16OMX_CALLBACKTYPE",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "_ZTI16android_xy_color",
   "self_type" : "_ZTI16android_xy_color",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17OMX_FRAMESIZETYPE",
   "name" : "OMX_FRAMESIZETYPE",
   "referenced_type" : "_ZTI17OMX_FRAMESIZETYPE",
   "self_type" : "_ZTI17OMX_FRAMESIZETYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22android_flex_component"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "_ZTI18android_flex_plane",
   "self_type" : "_ZTI18android_flex_plane",
   "size" : 32,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nLeft",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nTop",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "name" : "OMX_CONFIG_RECTTYPE",
   "referenced_type" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "self_type" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPorts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStartPortNumber",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "name" : "OMX_PORT_PARAM_TYPE",
   "referenced_type" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "self_type" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTunnelFlags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eSupplier",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22OMX_BUFFERSUPPLIERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "name" : "OMX_TUNNELSETUPTYPE",
   "referenced_type" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "self_type" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "size" : 8,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19android_flex_format"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP18android_flex_plane"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "_ZTI19android_flex_layout",
   "self_type" : "_ZTI19android_flex_layout",
   "size" : 12,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "pBuffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "nAllocLen",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFilledLen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAppPrivate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pPlatformPrivate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pInputPortPrivate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pOutputPortPrivate",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "hMarkTargetComponent",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nTickCount",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeStamp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nFlags",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nOutputPortIndex",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nInputPortIndex",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "name" : "OMX_BUFFERHEADERTYPE",
   "referenced_type" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "self_type" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "size" : 80,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGamma",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "name" : "OMX_CONFIG_GAMMATYPE",
   "referenced_type" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "self_type" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nX",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nY",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "name" : "OMX_CONFIG_POINTTYPE",
   "referenced_type" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "self_type" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nGroupPriority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGroupID",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "name" : "OMX_PRIORITYMGMTTYPE",
   "referenced_type" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "self_type" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "_ZTI20android_depth_points",
   "self_type" : "_ZTI20android_depth_points",
   "size" : 36,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eDither",
     "field_offset" : 96,
     "referenced_type" : "_ZTI14OMX_DITHERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "name" : "OMX_CONFIG_DITHERTYPE",
   "referenced_type" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "self_type" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eMirror",
     "field_offset" : 96,
     "referenced_type" : "_ZTI14OMX_MIRRORTYPE"
    }
   ],
   "linker_set_key" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "name" : "OMX_CONFIG_MIRRORTYPE",
   "referenced_type" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "self_type" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eUnitType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI16OMX_DATAUNITTYPE"
    },
    {
     "field_name" : "eEncapsulationType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI29OMX_DATAUNITENCAPSULATIONTYPE"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "name" : "OMX_PARAM_DATAUNITTYPE",
   "referenced_type" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "self_type" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "_ZTI22OMX_VIDEO_RVFORMATTYPE"
    },
    {
     "field_name" : "nBitsPerPixel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nPaddedWidth",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nPaddedHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitstreamFlags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitstreamVersion",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxEncodeFrameSize",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnablePostFilter",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableTemporalInterpolation",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableLatencyMode",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "name" : "OMX_VIDEO_PARAM_RVTYPE",
   "referenced_type" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "self_type" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "size" : 52,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nARGBColor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nARGBMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "name" : "OMX_CONFIG_COLORKEYTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nContrast",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "name" : "OMX_CONFIG_CONTRASTTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRotation",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "name" : "OMX_CONFIG_ROTATIONTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eNaluFormat",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_NALUFORMATSTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_NALSTREAMFORMATTYPE",
   "name" : "OMX_NALSTREAMFORMATTYPE",
   "referenced_type" : "_ZTI23OMX_NALSTREAMFORMATTYPE",
   "self_type" : "_ZTI23OMX_NALSTREAMFORMATTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI17OMX_EXTRADATATYPE"
    },
    {
     "field_name" : "nDataSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "name" : "OMX_OTHER_EXTRADATATYPE",
   "referenced_type" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "self_type" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bUseHadamard",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nRefFrames",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRefIdx10ActiveMinus1",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRefIdx11ActiveMinus1",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableUEP",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableFMO",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableASO",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableRS",
     "field_offset" : 416,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 448,
     "referenced_type" : "_ZTI24OMX_VIDEO_AVCPROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 480,
     "referenced_type" : "_ZTI22OMX_VIDEO_AVCLEVELTYPE"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFrameMBsOnly",
     "field_offset" : 544,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bMBAFF",
     "field_offset" : 576,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEntropyCodingCABAC",
     "field_offset" : 608,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bWeightedPPrediction",
     "field_offset" : 640,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nWeightedBipredicitonMode",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bconstIpred",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bDirect8x8Inference",
     "field_offset" : 736,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bDirectSpatialTemporal",
     "field_offset" : 768,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nCabacInitIdc",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eLoopFilterMode",
     "field_offset" : 832,
     "referenced_type" : "_ZTI27OMX_VIDEO_AVCLOOPFILTERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "name" : "OMX_VIDEO_PARAM_AVCTYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "size" : 108,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTI24OMX_VIDEO_VP8PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_VIDEO_VP8LEVELTYPE"
    },
    {
     "field_name" : "nDCTPartitions",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_VP8TYPE",
   "name" : "OMX_VIDEO_PARAM_VP8TYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_VP8TYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_VP8TYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTI24OMX_VIDEO_VP9PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_VIDEO_VP9LEVELTYPE"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nTileRows",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTileColumns",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableFrameParallelDecoding",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_VP9TYPE",
   "name" : "OMX_VIDEO_PARAM_VP9TYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_VP9TYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_VP9TYPE",
   "size" : 36,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_VIDEO_WMVFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "name" : "OMX_VIDEO_PARAM_WMVTYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBacklight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeout",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "name" : "OMX_CONFIG_BACKLIGHTTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xEncodeFramerate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "name" : "OMX_CONFIG_FRAMERATETYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "self_type" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bStab",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "name" : "OMX_CONFIG_FRAMESTABTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nLightness",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "name" : "OMX_CONFIG_LIGHTNESSTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDeblocking",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "name" : "OMX_PARAM_DEBLOCKINGTYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "self_type" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nInterleavePortIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "name" : "OMX_PARAM_INTERLEAVETYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "self_type" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bOneShot",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sFrameSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTI17OMX_FRAMESIZETYPE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "name" : "OMX_PARAM_SENSORMODETYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "self_type" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "size" : 40,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNaluBytes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "name" : "OMX_VIDEO_CONFIG_NALSIZE",
   "referenced_type" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "self_type" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "_ZTI25OMX_VIDEO_H263PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "_ZTI23OMX_VIDEO_H263LEVELTYPE"
    },
    {
     "field_name" : "bPLUSPTYPEAllowed",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bForceRoundingTypeToZero",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nPictureHeaderRepetition",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGOBHeaderInterval",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "name" : "OMX_VIDEO_PARAM_H263TYPE",
   "referenced_type" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "self_type" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTI25OMX_VIDEO_HEVCPROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTI23OMX_VIDEO_HEVCLEVELTYPE"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_VIDEO_PARAM_HEVCTYPE",
   "name" : "OMX_VIDEO_PARAM_HEVCTYPE",
   "referenced_type" : "_ZTI24OMX_VIDEO_PARAM_HEVCTYPE",
   "self_type" : "_ZTI24OMX_VIDEO_PARAM_HEVCTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pName",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "pInitialize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "name" : "OMX_COMPONENTREGISTERTYPE",
   "referenced_type" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "self_type" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "size" : 8,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBrightness",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "name" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRGBAlphaConstant",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eColorBlend",
     "field_offset" : 128,
     "referenced_type" : "_ZTI18OMX_COLORBLENDTYPE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "name" : "OMX_CONFIG_COLORBLENDTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDepth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAlpha",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "name" : "OMX_CONFIG_PLANEBLENDTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSaturation",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "name" : "OMX_CONFIG_SATURATIONTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFocusStatus",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_FOCUSSTATUSTYPE"
    },
    {
     "field_name" : "bCenterStatus",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bLeftStatus",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bRightStatus",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopStatus",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomStatus",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopLeftStatus",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopRightStatus",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomLeftStatus",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomRightStatus",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "name" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "referenced_type" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "self_type" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "size" : 52,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMacroblocks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "name" : "OMX_PARAM_MACROBLOCKSTYPE",
   "referenced_type" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "self_type" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "_ZTI26OMX_VIDEO_MPEG2PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "_ZTI24OMX_VIDEO_MPEG2LEVELTYPE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bSVH",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bGov",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIDCVLCThreshold",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bACPred",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nMaxPacketSize",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeIncRes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 384,
     "referenced_type" : "_ZTI26OMX_VIDEO_MPEG4PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 416,
     "referenced_type" : "_ZTI24OMX_VIDEO_MPEG4LEVELTYPE"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeaderExtension",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bReversibleVLC",
     "field_offset" : 512,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "size" : 68,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "b16x16",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b16x8",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x16",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x8",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x4",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b4x8",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b4x4",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "name" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "size" : 40,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nMediaTimeUs",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nSystemTimeNs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_RENDEREVENTTYPE",
   "name" : "OMX_VIDEO_RENDEREVENTTYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_RENDEREVENTTYPE",
   "self_type" : "_ZTI25OMX_VIDEO_RENDEREVENTTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "_ZTI25android_cta861_3_metadata",
   "self_type" : "_ZTI25android_cta861_3_metadata",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bContinuous",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bFrameLimited",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nFrameLimit",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "name" : "OMX_CONFIG_CAPTUREMODETYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "self_type" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bCenter",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bLeft",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bRight",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTop",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottom",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopLeft",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopRight",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomLeft",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomRight",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "name" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eImageFilter",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_IMAGEFILTERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "name" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xWidth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xHeight",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "name" : "OMX_CONFIG_SCALEFACTORTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "_ZTI26android_smpte2086_metadata",
   "self_type" : "_ZTI26android_smpte2086_metadata",
   "size" : 40,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "cRole",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA128_h"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "name" : "OMX_PARAM_COMPONENTROLETYPE",
   "referenced_type" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "self_type" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "size" : 136,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumSliceGroups",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nSliceGroupMapType",
     "field_offset" : 104,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "eSliceMode",
     "field_offset" : 128,
     "referenced_type" : "_ZTI26OMX_VIDEO_AVCSLICEMODETYPE"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "name" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "referenced_type" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "self_type" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eControlRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTI25OMX_VIDEO_CONTROLRATETYPE"
    },
    {
     "field_offset" : 128,
     "referenced_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "referenced_type" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "self_type" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDepedentSegments",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableLoopFilterAcrossSlices",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_VIDEO_SLICESEGMENTSTYPE",
   "name" : "OMX_VIDEO_SLICESEGMENTSTYPE",
   "referenced_type" : "_ZTI27OMX_VIDEO_SLICESEGMENTSTYPE",
   "self_type" : "_ZTI27OMX_VIDEO_SLICESEGMENTSTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eMetering",
     "field_offset" : 96,
     "referenced_type" : "_ZTI16OMX_METERINGTYPE"
    },
    {
     "field_name" : "xEVCompensation",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nApertureFNumber",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoAperture",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nShutterSpeedMsec",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoShutterSpeed",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nSensitivity",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoSensitivity",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "name" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "referenced_type" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "self_type" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "size" : 44,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eBufferSupplier",
     "field_offset" : 96,
     "referenced_type" : "_ZTI22OMX_BUFFERSUPPLIERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "name" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "referenced_type" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "self_type" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nEncodeBitrate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "name" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "referenced_type" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "self_type" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitrate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 288,
     "referenced_type" : "_ZTI20OMX_VIDEO_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 320,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "name" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "size" : 48,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xColorMatrix",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA3_A3_i"
    },
    {
     "field_name" : "xColorOffset",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA4_i"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "name" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "size" : 64,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eExposureControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_EXPOSURECONTROLTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "name" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "IntraRefreshVOP",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "name" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eWhiteBalControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_WHITEBALCONTROLTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "name" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20OMX_VIDEO_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "self_type" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bColorEnhancement",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nCustomizedU",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nCustomizedV",
     "field_offset" : 136,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "name" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "name" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eEffect",
     "field_offset" : 96,
     "referenced_type" : "_ZTI24OMX_TRANSITIONEFFECTTYPE"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "name" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIDRPeriod",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "name" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "referenced_type" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "self_type" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bPreviousFrameRefresh",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bGoldenFrameRefresh",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bAlternateFrameRefresh",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bUsePreviousFrame",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bUseGoldenFrame",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bUseAlternateFrame",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "referenced_type" : "_ZTI31OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "self_type" : "_ZTI31OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "size" : 36,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eRefreshMode",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_VIDEO_INTRAREFRESHTYPE"
    },
    {
     "field_name" : "nAirMBs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAirRef",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nCirMBs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eAccuracy",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_VIDEO_MOTIONVECTORTYPE"
    },
    {
     "field_name" : "bUnrestrictedMVs",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bFourMV",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sXSearchRange",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sYSearchRange",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "name" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nProfileIndex",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "name" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpI",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpP",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpB",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "name" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nErrMapSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ErrMap",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "name" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "referenced_type" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "self_type" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableHEC",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableResync",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nResynchMarkerSpacing",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableDataPartitioning",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableRVLC",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "name" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "referenced_type" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "self_type" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableVFU",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nFirstGOB",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFirstMB",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumMBs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "name" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "referenced_type" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "self_type" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "size" : 28,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bIsIntraFrame",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bIsGoldenOrAlternateFrame",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "referenced_type" : "_ZTI35OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "self_type" : "_ZTI35OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nTileWidth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTileHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGridRows",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGridCols",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI37OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "referenced_type" : "_ZTI37OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "self_type" : "_ZTI37OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "size" : 32,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eTemporalPattern",
     "field_offset" : 128,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_VPXTEMPORALLAYERPATTERNTYPE"
    },
    {
     "field_name" : "nTemporalLayerCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTemporalLayerBitrateRatio",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA3_j"
    },
    {
     "field_name" : "nMinQuantizer",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxQuantizer",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI38OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "referenced_type" : "_ZTI38OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "self_type" : "_ZTI38OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "size" : 44,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRefreshPeriod",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI41OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "referenced_type" : "_ZTI41OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "self_type" : "_ZTI41OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eSupportedPatterns",
     "field_offset" : 96,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_TEMPORALLAYERINGPATTERNTYPE"
    },
    {
     "field_name" : "nLayerCountMax",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBLayerCountMax",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 192,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_TEMPORALLAYERINGPATTERNTYPE"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI44OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "_ZTI44OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "self_type" : "_ZTI44OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "size" : 72,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 96,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_TEMPORALLAYERINGPATTERNTYPE"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI45OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "_ZTI45OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "self_type" : "_ZTI45OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "size" : 60,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8OMX_BS32",
   "name" : "OMX_BS32",
   "referenced_type" : "_ZTI8OMX_BS32",
   "self_type" : "_ZTI8OMX_BS32",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8OMX_BU32",
   "name" : "OMX_BU32",
   "referenced_type" : "_ZTI8OMX_BU32",
   "self_type" : "_ZTI8OMX_BU32",
   "size" : 12,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include_vndk/log/log_time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nVersionMajor",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nVersionMinor",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nRevision",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nStep",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "name" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5)",
   "referenced_type" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "self_type" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTargetBitrate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQualityFactor",
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:270:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "self_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10MediaImage9PlaneInfoE",
   "name" : "android::MediaImage::PlaneInfo",
   "referenced_type" : "_ZTIN7android10MediaImage9PlaneInfoE",
   "self_type" : "_ZTIN7android10MediaImage9PlaneInfoE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "_ZTIN7android10MediaImage4TypeE"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA3_N7android10MediaImage9PlaneInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10MediaImageE",
   "name" : "android::MediaImage",
   "referenced_type" : "_ZTIN7android10MediaImageE",
   "self_type" : "_ZTIN7android10MediaImageE",
   "size" : 80,
   "source_file" : "frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10VectorImplE",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10VectorImplE",
   "self_type" : "_ZTIN7android10VectorImplE",
   "size" : 20,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_13GraphicBufferEEE",
   "name" : "android::Flattenable<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11FlattenableINS_13GraphicBufferEEE",
   "self_type" : "_ZTIN7android11FlattenableINS_13GraphicBufferEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android13GraphicBufferE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_5FenceEEE",
   "name" : "android::Flattenable<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11FlattenableINS_5FenceEEE",
   "self_type" : "_ZTIN7android11FlattenableINS_5FenceEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android5FenceE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_9FenceTime8SnapshotEEE",
   "name" : "android::Flattenable<android::FenceTime::Snapshot>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11FlattenableINS_9FenceTime8SnapshotEEE",
   "self_type" : "_ZTIN7android11FlattenableINS_9FenceTime8SnapshotEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android9FenceTime8SnapshotE" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android11MediaImage29PlaneInfoE",
   "name" : "android::MediaImage2::PlaneInfo",
   "referenced_type" : "_ZTIN7android11MediaImage29PlaneInfoE",
   "self_type" : "_ZTIN7android11MediaImage29PlaneInfoE",
   "size" : 20,
   "source_file" : "frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "_ZTIN7android11MediaImage24TypeE"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mBitDepthAllocated",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA4_N7android11MediaImage29PlaneInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11MediaImage2E",
   "name" : "android::MediaImage2",
   "referenced_type" : "_ZTIN7android11MediaImage2E",
   "self_type" : "_ZTIN7android11MediaImage2E",
   "size" : 104,
   "source_file" : "frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mRange",
     "referenced_type" : "_ZTIN7android12ColorAspects5RangeE"
    },
    {
     "field_name" : "mPrimaries",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android12ColorAspects9PrimariesE"
    },
    {
     "field_name" : "mTransfer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android12ColorAspects8TransferE"
    },
    {
     "field_name" : "mMatrixCoeffs",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android12ColorAspects12MatrixCoeffsE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12ColorAspectsE",
   "name" : "android::ColorAspects",
   "referenced_type" : "_ZTIN7android12ColorAspectsE",
   "self_type" : "_ZTIN7android12ColorAspectsE",
   "size" : 16,
   "source_file" : "frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android12NativeHandleE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android19VirtualLightRefBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_5FenceEEE",
   "name" : "android::LightRefBase<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_5FenceEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_5FenceEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android5FenceE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12NativeHandleE",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12NativeHandleE",
   "self_type" : "_ZTIN7android12NativeHandleE",
   "size" : 12,
   "source_file" : "system/core/libutils/include/utils/NativeHandle.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "y",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android13HDRStaticInfo10Primaries1E",
   "name" : "android::HDRStaticInfo::Primaries1",
   "referenced_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E",
   "self_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E",
   "size" : 4,
   "source_file" : "frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mR",
     "referenced_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E"
    },
    {
     "field_name" : "mG",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E"
    },
    {
     "field_name" : "mB",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E"
    },
    {
     "field_name" : "mW",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E"
    },
    {
     "field_name" : "mMaxDisplayLuminance",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "mMinDisplayLuminance",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "mMaxContentLightLevel",
     "field_offset" : 160,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "mMaxFrameAverageLightLevel",
     "field_offset" : 176,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android13HDRStaticInfo5Type1E",
   "name" : "android::HDRStaticInfo::Type1",
   "referenced_type" : "_ZTIN7android13HDRStaticInfo5Type1E",
   "self_type" : "_ZTIN7android13HDRStaticInfo5Type1E",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mID",
     "referenced_type" : "_ZTIN7android13HDRStaticInfo2IDE"
    },
    {
     "field_offset" : 8,
     "referenced_type" : "_ZTIN7android13HDRStaticInfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android13HDRStaticInfoE",
   "name" : "android::HDRStaticInfo",
   "referenced_type" : "_ZTIN7android13HDRStaticInfoE",
   "self_type" : "_ZTIN7android13HDRStaticInfoE",
   "size" : 25,
   "source_file" : "frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "sType1",
     "referenced_type" : "_ZTIN7android13HDRStaticInfo5Type1E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android13HDRStaticInfoUt_E",
   "name" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android13HDRStaticInfoUt_E",
   "self_type" : "_ZTIN7android13HDRStaticInfoUt_E",
   "size" : 24,
   "source_file" : "frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14ReferenceMoverE",
   "self_type" : "_ZTIN7android14ReferenceMoverE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16FlattenableUtilsE",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16FlattenableUtilsE",
   "self_type" : "_ZTIN7android16FlattenableUtilsE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16LightFlattenableINS_4RectEEE",
   "name" : "android::LightFlattenable<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16LightFlattenableINS_4RectEEE",
   "self_type" : "_ZTIN7android16LightFlattenableINS_4RectEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16LightFlattenableINS_5PointEEE",
   "name" : "android::LightFlattenable<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16LightFlattenableINS_5PointEEE",
   "self_type" : "_ZTIN7android16LightFlattenableINS_5PointEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android5PointE" ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16ReferenceRenamerE",
   "self_type" : "_ZTIN7android16ReferenceRenamerE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16SortedVectorImplE",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16SortedVectorImplE",
   "self_type" : "_ZTIN7android16SortedVectorImplE",
   "size" : 20,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String8.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String16.h",
   "template_args" : [ "_ZTIN7android8String16E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android16LightFlattenableINS_4RectEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19LightFlattenablePodINS_4RectEEE",
   "name" : "android::LightFlattenablePod<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19LightFlattenablePodINS_4RectEEE",
   "self_type" : "_ZTIN7android19LightFlattenablePodINS_4RectEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android4RectE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android16LightFlattenableINS_5PointEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19LightFlattenablePodINS_5PointEEE",
   "name" : "android::LightFlattenablePod<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19LightFlattenablePodINS_5PointEEE",
   "self_type" : "_ZTIN7android19LightFlattenablePodINS_5PointEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android5PointE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "self_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "name" : "android::sp<android::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "self_type" : "_ZTIN7android2spINS_10IInterfaceEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android10IInterfaceE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android10RpcSessionE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "name" : "android::sp<android::RpcSession>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "self_type" : "_ZTIN7android2spINS_10RpcSessionEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android10RpcSessionE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android12NativeHandleE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_12NativeHandleEEE",
   "name" : "android::sp<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_12NativeHandleEEE",
   "self_type" : "_ZTIN7android2spINS_12NativeHandleEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android12NativeHandleE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android13GraphicBufferE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_13GraphicBufferEEE",
   "name" : "android::sp<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_13GraphicBufferEEE",
   "self_type" : "_ZTIN7android2spINS_13GraphicBufferEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android13GraphicBufferE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android16IOMXBufferSourceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_16IOMXBufferSourceEEE",
   "name" : "android::sp<android::IOMXBufferSource>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_16IOMXBufferSourceEEE",
   "self_type" : "_ZTIN7android2spINS_16IOMXBufferSourceEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android16IOMXBufferSourceE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android16MediaCodecBufferE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_16MediaCodecBufferEEE",
   "name" : "android::sp<android::MediaCodecBuffer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_16MediaCodecBufferEEE",
   "self_type" : "_ZTIN7android2spINS_16MediaCodecBufferEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android16MediaCodecBufferE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl4base4V1_05IBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl6memory4V1_07IMemoryE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "name" : "android::sp<android::hidl::memory::V1_0::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl6memory4V1_07IMemoryE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl7manager4V1_020IServiceNotificationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android5FenceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_5FenceEEE",
   "name" : "android::sp<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_5FenceEEE",
   "self_type" : "_ZTIN7android2spINS_5FenceEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android5FenceE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IBinder14DeathRecipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7IBinder14DeathRecipientEEE",
   "name" : "android::sp<android::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7IBinder14DeathRecipientEEE",
   "self_type" : "_ZTIN7android2spINS_7IBinder14DeathRecipientEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7IBinder14DeathRecipientE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7IBinderEEE",
   "name" : "android::sp<android::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7IBinderEEE",
   "self_type" : "_ZTIN7android2spINS_7IBinderEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7IBinderE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IMemoryE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_7IMemoryEEE",
   "name" : "android::sp<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_7IMemoryEEE",
   "self_type" : "_ZTIN7android2spINS_7IMemoryEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android7IMemoryE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware20hidl_death_recipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware20hidl_death_recipientE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media3omx4V1_012IOmxObserverE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media3omx4V1_012IOmxObserverEEE",
   "name" : "android::sp<android::hardware::media::omx::V1_0::IOmxObserver>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_012IOmxObserverEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_012IOmxObserverEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media3omx4V1_012IOmxObserverE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media3omx4V1_016IOmxBufferSourceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media3omx4V1_016IOmxBufferSourceEEE",
   "name" : "android::sp<android::hardware::media::omx::V1_0::IOmxBufferSource>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_016IOmxBufferSourceEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_016IOmxBufferSourceEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media3omx4V1_016IOmxBufferSourceE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media3omx4V1_020IGraphicBufferSourceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media3omx4V1_020IGraphicBufferSourceEEE",
   "name" : "android::sp<android::hardware::media::omx::V1_0::IGraphicBufferSource>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_020IGraphicBufferSourceEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_020IGraphicBufferSourceEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media3omx4V1_020IGraphicBufferSourceE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media3omx4V1_04IOmxE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media3omx4V1_04IOmxEEE",
   "name" : "android::sp<android::hardware::media::omx::V1_0::IOmx>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_04IOmxEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_04IOmxEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media3omx4V1_04IOmxE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware5media3omx4V1_08IOmxNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware5media3omx4V1_08IOmxNodeEEE",
   "name" : "android::sp<android::hardware::media::omx::V1_0::IOmxNode>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_08IOmxNodeEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_08IOmxNodeEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware5media3omx4V1_08IOmxNodeE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware8graphics11bufferqueue4V1_017IProducerListenerEEE",
   "name" : "android::sp<android::hardware::graphics::bufferqueue::V1_0::IProducerListener>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware8graphics11bufferqueue4V1_017IProducerListenerEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware8graphics11bufferqueue4V1_017IProducerListenerEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerEEE",
   "name" : "android::sp<android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IBinder14DeathRecipientE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_7IBinder14DeathRecipientEEE",
   "name" : "android::wp<android::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_7IBinder14DeathRecipientEEE",
   "self_type" : "_ZTIN7android2wpINS_7IBinder14DeathRecipientEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android7IBinder14DeathRecipientE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android7IBinderE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_7IBinderEEE",
   "name" : "android::wp<android::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_7IBinderEEE",
   "self_type" : "_ZTIN7android2wpINS_7IBinderEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android7IBinderE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "_ZTIPKN7android4ListINS_7String8EE5_NodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4ListINS_7String8EE13_ListIteratorIS1_NS2_14CONST_ITERATOREEE",
   "name" : "android::List<String8>::_ListIterator<android::String8, android::List<String8>::CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4ListINS_7String8EE13_ListIteratorIS1_NS2_14CONST_ITERATOREEE",
   "self_type" : "_ZTIN7android4ListINS_7String8EE13_ListIteratorIS1_NS2_14CONST_ITERATOREEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/List.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "_ZTIPN7android4ListINS_7String8EE5_NodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4ListINS_7String8EE13_ListIteratorIS1_NS2_18NON_CONST_ITERATOREEE",
   "name" : "android::List<String8>::_ListIterator<android::String8, android::List<String8>::NON_CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4ListINS_7String8EE13_ListIteratorIS1_NS2_18NON_CONST_ITERATOREEE",
   "self_type" : "_ZTIN7android4ListINS_7String8EE13_ListIteratorIS1_NS2_18NON_CONST_ITERATOREEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/List.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4ListINS_7String8EE14CONST_ITERATORIS1_EE",
   "name" : "android::List<String8>::CONST_ITERATOR<android::String8>",
   "referenced_type" : "_ZTIN7android4ListINS_7String8EE14CONST_ITERATORIS1_EE",
   "self_type" : "_ZTIN7android4ListINS_7String8EE14CONST_ITERATORIS1_EE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/List.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4ListINS_7String8EE18NON_CONST_ITERATORIS1_EE",
   "name" : "android::List<String8>::NON_CONST_ITERATOR<android::String8>",
   "referenced_type" : "_ZTIN7android4ListINS_7String8EE18NON_CONST_ITERATORIS1_EE",
   "self_type" : "_ZTIN7android4ListINS_7String8EE18NON_CONST_ITERATORIS1_EE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/List.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "referenced_type" : "_ZTIN7android7String8E"
    },
    {
     "access" : "private",
     "field_name" : "mpPrev",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android4ListINS_7String8EE5_NodeE"
    },
    {
     "access" : "private",
     "field_name" : "mpNext",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android4ListINS_7String8EE5_NodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4ListINS_7String8EE5_NodeE",
   "name" : "android::List<String8>::_Node",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4ListINS_7String8EE5_NodeE",
   "self_type" : "_ZTIN7android4ListINS_7String8EE5_NodeE",
   "size" : 12,
   "source_file" : "system/core/libutils/include/utils/List.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android4ListINS_7String8EE5_NodeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4ListINS_7String8EEE",
   "name" : "android::List<android::String8>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4ListINS_7String8EEE",
   "self_type" : "_ZTIN7android4ListINS_7String8EEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/List.h",
   "template_args" : [ "_ZTIN7android7String8E" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_7String8EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7String8EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7String8EED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android5MutexE"
    }
   ],
   "linker_set_key" : "_ZTIN7android5Mutex8AutolockE",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5Mutex8AutolockE",
   "self_type" : "_ZTIN7android5Mutex8AutolockE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTI15pthread_mutex_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android5MutexE",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5MutexE",
   "self_type" : "_ZTIN7android5MutexE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIN7android7RefBaseE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN7android7String8E",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7String8E",
   "self_type" : "_ZTIN7android7String8E",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/String8.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKDs"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String16E",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8String16E",
   "self_type" : "_ZTIN7android8String16E",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android17BnOMXBufferSourceE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mBase",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android2spINS_8hardware5media3omx4V1_016IOmxBufferSourceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceE",
   "name" : "android::hardware::media::omx::V1_0::implementation::LWOmxBufferSource",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceE",
   "self_type" : "_ZTIN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceE",
   "size" : 28,
   "source_file" : "frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/1.0/WOmxBufferSource.h",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16IOMXBufferSourceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_16IOMXBufferSourceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSource14onOmxExecutingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSource9onOmxIdleEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSource11onOmxLoadedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSource18onInputBufferAddedEi"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSource20onInputBufferEmptiedEiRKNS_18OMXFenceParcelableE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16IOMXBufferSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android17BnOMXBufferSource10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_16IOMXBufferSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_16IOMXBufferSourceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android17BnOMXBufferSource10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media3omx4V1_014implementation17LWOmxBufferSourceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_016IOmxBufferSourceE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mBase",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android2spINS_16IOMXBufferSourceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware5media3omx4V1_014implementation17TWOmxBufferSourceE",
   "name" : "android::hardware::media::omx::V1_0::implementation::TWOmxBufferSource",
   "referenced_type" : "_ZTIN7android8hardware5media3omx4V1_014implementation17TWOmxBufferSourceE",
   "self_type" : "_ZTIN7android8hardware5media3omx4V1_014implementation17TWOmxBufferSourceE",
   "size" : 16,
   "source_file" : "frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/1.0/WOmxBufferSource.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_014implementation17TWOmxBufferSourceE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media3omx4V1_016IOmxBufferSource8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17TWOmxBufferSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17TWOmxBufferSourceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17TWOmxBufferSource14onOmxExecutingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17TWOmxBufferSource9onOmxIdleEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17TWOmxBufferSource11onOmxLoadedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17TWOmxBufferSource18onInputBufferAddedEj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_014implementation17TWOmxBufferSource20onInputBufferEmptiedEjRKNS0_11hidl_handleE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
