#ifndef HIDL_GENERATED_ANDROID_HARDWARE_WIFI_SUPPLICANT_V1_0_ISUPPLICANTSTAIFACECALLBACK_H
#define HIDL_GENERATED_ANDROID_HARDWARE_WIFI_SUPPLICANT_V1_0_ISUPPLICANTSTAIFACECALLBACK_H

#include <android/hardware/wifi/supplicant/1.0/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace wifi {
namespace supplicant {
namespace V1_0 {

/**
 * Callback Interface exposed by the supplicant service
 * for each station mode interface (ISupplicantStaIface).
 *
 * Clients need to host an instance of this HIDL interface object and
 * pass a reference of the object to the supplicant via the
 * corresponding |ISupplicantStaIface.registerCallback| method.
 */
struct ISupplicantStaIfaceCallback : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef ::android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.wifi.supplicant@1.0::ISupplicantStaIfaceCallback"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    enum class State : uint32_t;
    enum class OsuMethod : uint8_t;
    struct AnqpData;
    struct Hs20AnqpData;
    enum class WpsConfigError : uint16_t;
    enum class WpsErrorIndication : uint16_t;
    enum class StatusCode : uint32_t;
    enum class ReasonCode : uint32_t;
    enum class BssidChangeReason : uint8_t;

    /**
     * Various states of the interface reported by |onStateChanged|.
     */
    enum class State : uint32_t {
        /**
         * This state indicates that client is not associated, but is likely to
         * start looking for an access point. This state is entered when a
         * connection is lost.
         */
        DISCONNECTED = 0u,
        /**
         * This state is entered if the network interface is disabled, e.g.,
         * due to rfkill. the supplicant refuses any new operations that would
         * use the radio until the interface has been enabled.
         */
        IFACE_DISABLED = 1u,
        /**
         * This state is entered if there are no enabled networks in the
         * configuration. the supplicant is not trying to associate with a new
         * network and external interaction (e.g., ctrl_iface call to add or
         * enable a network) is needed to start association.
         */
        INACTIVE = 2u,
        /**
         * This state is entered when the supplicant starts scanning for a
         * network.
         */
        SCANNING = 3u,
        /**
         * This state is entered when the supplicant has found a suitable BSS
         * to authenticate with and the driver is configured to try to
         * authenticate with this BSS. This state is used only with drivers
         * that use the supplicant as the SME.
         */
        AUTHENTICATING = 4u,
        /**
         * This state is entered when the supplicant has found a suitable BSS
         * to associate with and the driver is configured to try to associate
         * with this BSS in ap_scan=1 mode. When using ap_scan=2 mode, this
         * state is entered when the driver is configured to try to associate
         * with a network using the configured SSID and security policy.
         */
        ASSOCIATING = 5u,
        /**
         * This state is entered when the driver reports that association has
         * been successfully completed with an AP. If IEEE 802.1X is used
         * (with or without WPA/WPA2), the supplicant remains in this state
         * until the IEEE 802.1X/EAPOL authentication has been completed.
         */
        ASSOCIATED = 6u,
        /**
         * This state is entered when WPA/WPA2 4-Way Handshake is started. In
         * case of WPA-PSK, this happens when receiving the first EAPOL-Key
         * frame after association. In case of WPA-EAP, this state is entered
         * when the IEEE 802.1X/EAPOL authentication has been completed.
         */
        FOURWAY_HANDSHAKE = 7u,
        /**
         * This state is entered when 4-Way Key Handshake has been completed
         * (i.e., when the supplicant sends out message 4/4) and when Group
         * Key rekeying is started by the AP (i.e., when supplicant receives
         * message 1/2).
         */
        GROUP_HANDSHAKE = 8u,
        /**
         * This state is entered when the full authentication process is
         * completed. In case of WPA2, this happens when the 4-Way Handshake is
         * successfully completed. With WPA, this state is entered after the
         * Group Key Handshake; with IEEE 802.1X (non-WPA) connection is
         * completed after dynamic keys are received (or if not used, after
         * the EAP authentication has been completed). With static WEP keys and
         * plaintext connections, this state is entered when an association
         * has been completed.
         *
         * This state indicates that the supplicant has completed its
         * processing for the association phase and that data connection is
         * fully configured.
         */
        COMPLETED = 9u,
    };

    /**
     * OSU Method. Refer to section 4.8.1.3 of the Hotspot 2.0 spec.
     */
    enum class OsuMethod : uint8_t {
        OMA_DM = 0,
        SOAP_XML_SPP = 1,
    };

    /**
     * ANQP data for IEEE Std 802.11u-2011.
     * The format of the data within these elements follows the IEEE
     * Std 802.11u-2011 standard.
     */
    struct AnqpData final {
        ::android::hardware::hidl_vec<uint8_t> venueName __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<uint8_t> roamingConsortium __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<uint8_t> ipAddrTypeAvailability __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<uint8_t> naiRealm __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<uint8_t> anqp3gppCellularNetwork __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<uint8_t> domainName __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::AnqpData, venueName) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::AnqpData, roamingConsortium) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::AnqpData, ipAddrTypeAvailability) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::AnqpData, naiRealm) == 48, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::AnqpData, anqp3gppCellularNetwork) == 64, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::AnqpData, domainName) == 80, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::AnqpData) == 96, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::AnqpData) == 8, "wrong alignment");

    /**
     * ANQP data for Hotspot 2.0.
     * The format of the data within these elements follows the Hotspot 2.0
     * standard.
     */
    struct Hs20AnqpData final {
        ::android::hardware::hidl_vec<uint8_t> operatorFriendlyName __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<uint8_t> wanMetrics __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<uint8_t> connectionCapability __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<uint8_t> osuProvidersList __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::Hs20AnqpData, operatorFriendlyName) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::Hs20AnqpData, wanMetrics) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::Hs20AnqpData, connectionCapability) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::Hs20AnqpData, osuProvidersList) == 48, "wrong offset");
    static_assert(sizeof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::Hs20AnqpData) == 64, "wrong size");
    static_assert(__alignof(::android::hardware::wifi::supplicant::V1_0::ISupplicantStaIfaceCallback::Hs20AnqpData) == 8, "wrong alignment");

    /**
     * WPS Configuration Error.
     */
    enum class WpsConfigError : uint16_t {
        NO_ERROR = 0,
        OOB_IFACE_READ_ERROR = 1,
        DECRYPTION_CRC_FAILURE = 2,
        CHAN_24_NOT_SUPPORTED = 3,
        CHAN_50_NOT_SUPPORTED = 4,
        SIGNAL_TOO_WEAK = 5,
        NETWORK_AUTH_FAILURE = 6,
        NETWORK_ASSOC_FAILURE = 7,
        NO_DHCP_RESPONSE = 8,
        FAILED_DHCP_CONFIG = 9,
        IP_ADDR_CONFLICT = 10,
        NO_CONN_TO_REGISTRAR = 11,
        MULTIPLE_PBC_DETECTED = 12,
        ROGUE_SUSPECTED = 13,
        DEVICE_BUSY = 14,
        SETUP_LOCKED = 15,
        MSG_TIMEOUT = 16,
        REG_SESS_TIMEOUT = 17,
        DEV_PASSWORD_AUTH_FAILURE = 18,
        CHAN_60G_NOT_SUPPORTED = 19,
        PUBLIC_KEY_HASH_MISMATCH = 20,
    };

    /**
     * Vendor specific Error Indication for WPS event messages.
     */
