<abi-corpus version='2.0' path='data/test-read-dwarf/PR25007-sdhci.ko'>
  <elf-function-symbols>
    <elf-symbol name='__sdhci_add_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x74ae518'/>
    <elf-symbol name='__sdhci_read_caps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x711f65c'/>
    <elf-symbol name='sdhci_add_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x7bfb1b1a'/>
    <elf-symbol name='sdhci_adma_write_desc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x61fdb22'/>
    <elf-symbol name='sdhci_alloc_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xfeefe08b'/>
    <elf-symbol name='sdhci_calc_clk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xbfcabe7e'/>
    <elf-symbol name='sdhci_cleanup_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x380506bd'/>
    <elf-symbol name='sdhci_cqe_disable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x69b1936e'/>
    <elf-symbol name='sdhci_cqe_enable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x5ebbc838'/>

    <elf-symbol name='sdhci_free_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4626d735'/>
    <elf-symbol name='sdhci_remove_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x6be911b2'/>
    <elf-symbol name='sdhci_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x762121fa'/>
    <elf-symbol name='sdhci_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1a38d936'/>
    <elf-symbol name='sdhci_reset_tuning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd0ca49ae'/>
    <elf-symbol name='sdhci_resume_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x2e5157bf'/>
    <elf-symbol name='sdhci_runtime_resume_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x62e5c15d'/>
    <elf-symbol name='sdhci_runtime_suspend_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4526a0d1'/>
    <elf-symbol name='sdhci_send_command' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1512952'/>
    <elf-symbol name='sdhci_send_tuning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x213a51d7'/>
    <elf-symbol name='sdhci_set_bus_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x67f74689'/>
    <elf-symbol name='sdhci_set_clock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x5825825c'/>
    <elf-symbol name='sdhci_set_ios' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xddc78000'/>
    <elf-symbol name='sdhci_set_power' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xc9e167b5'/>
    <elf-symbol name='sdhci_set_power_noreg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x60affb80'/>
    <elf-symbol name='sdhci_set_uhs_signaling' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4015e747'/>
    <elf-symbol name='sdhci_setup_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xc5d73caf'/>
    <elf-symbol name='sdhci_start_signal_voltage_switch' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xcb9c7748'/>
    <elf-symbol name='sdhci_start_tuning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x39f40b95'/>
    <elf-symbol name='sdhci_suspend_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa6de7a42'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.c' comp-dir-path='/ws/android/kernel/aosp/common-mainline/out/android-mainline/common' language='LANG_C89'>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-1'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='64' id='type-id-3'>
      <subrange length='2' type-id='type-id-1' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='96' id='type-id-5'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='128' id='type-id-8'>
      <subrange length='2' type-id='type-id-1' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='128' id='type-id-10'>
      <subrange length='16' type-id='type-id-1' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='72' id='type-id-12'>
      <subrange length='9' type-id='type-id-1' id='type-id-13'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='4096' id='type-id-15'>
      <subrange length='32' type-id='type-id-1' id='type-id-16'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-17' size-in-bits='256' id='type-id-18'>
      <subrange length='4' type-id='type-id-1' id='type-id-19'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='type-id-20'/>
    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='256' id='type-id-22'>
      <subrange length='4' type-id='type-id-1' id='type-id-19'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' id='type-id-23'/>
    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='2048' id='type-id-25'>
      <subrange length='32' type-id='type-id-1' id='type-id-16'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='192' id='type-id-26'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='1024' id='type-id-27'>
      <subrange length='128' type-id='type-id-1' id='type-id-28'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='128' id='type-id-29'>
      <subrange length='16' type-id='type-id-1' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='16384' id='type-id-30'>
      <subrange length='2048' type-id='type-id-1' id='type-id-31'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='160' id='type-id-32'>
      <subrange length='20' type-id='type-id-1' id='type-id-33'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='256' id='type-id-34'>
      <subrange length='32' type-id='type-id-1' id='type-id-16'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='448' id='type-id-35'>
      <subrange length='56' type-id='type-id-1' id='type-id-36'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='48' id='type-id-37'>
      <subrange length='6' type-id='type-id-1' id='type-id-38'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='64' id='type-id-39'>
      <subrange length='8' type-id='type-id-1' id='type-id-40'/>
    </array-type-def>
    <class-decl name='anon_vma' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-41'/>
    <class-decl name='assoc_array_ptr' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-42'/>
    <class-decl name='audit_context' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-43'/>
    <class-decl name='autogroup' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-44'/>
    <class-decl name='backing_dev_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-45'/>
    <class-decl name='bdi_writeback' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-46'/>
    <class-decl name='bio_list' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-47'/>
    <class-decl name='blk_plug' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-48'/>
    <class-decl name='capture_control' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-49'/>
    <class-decl name='cdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-50'/>
    <class-decl name='cfs_rq' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-51'/>
    <class-decl name='cgroup_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-52'/>
    <class-decl name='cma' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-53'/>
    <class-decl name='compat_robust_list_head' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-54'/>
    <class-decl name='css_set' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-55'/>
    <class-decl name='dev_pin_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-56'/>
    <class-decl name='dev_pm_qos' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-57'/>
    <class-decl name='device_private' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-58'/>
    <class-decl name='dma_coherent_mem' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-59'/>
    <class-decl name='driver_private' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-60'/>
    <class-decl name='export_operations' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-61'/>
    <class-decl name='files_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-62'/>
    <class-decl name='fs_context' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-63'/>
    <class-decl name='fs_parameter_description' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-64'/>
    <class-decl name='fs_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-65'/>
    <class-decl name='fscrypt_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-66'/>
    <class-decl name='fscrypt_operations' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-67'/>
    <class-decl name='fsnotify_mark_connector' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-68'/>
    <class-decl name='ftrace_ret_stack' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-69'/>
    <class-decl name='futex_pi_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-70'/>
    <class-decl name='gendisk' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-71'/>
    <class-decl name='hd_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-72'/>
    <class-decl name='iommu_fwspec' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-73'/>
    <class-decl name='iommu_group' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-74'/>
    <class-decl name='iommu_ops' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-75'/>
    <class-decl name='iommu_param' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-76'/>
    <class-decl name='iov_iter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-77'/>
    <class-decl name='ipc_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-78'/>
    <class-decl name='irq_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-79'/>
    <class-decl name='kernfs_iattrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-80'/>
    <class-decl name='kernfs_open_node' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-81'/>
    <class-decl name='key_type' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-82'/>
    <class-decl name='key_user' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-83'/>
    <class-decl name='kioctx_table' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-84'/>
    <class-decl name='kmem_cache' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-85'/>
    <class-decl name='kstatfs' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-86'/>
    <class-decl name='linux_binfmt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-87'/>
    <class-decl name='mem_cgroup' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-88'/>
    <class-decl name='mmc_bus_ops' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-89'/>
    <class-decl name='mmc_pwrseq' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-90'/>
    <class-decl name='mnt_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-91'/>
    <class-decl name='module_notes_attrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-92'/>
    <class-decl name='module_param_attrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-93'/>
    <class-decl name='module_sect_attrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-94'/>
    <class-decl name='mtd_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-95'/>
    <class-decl name='nameidata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-96'/>
    <class-decl name='net' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-97'/>
    <class-decl name='nfs4_lock_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-98'/>
    <class-decl name='nlm_lockowner' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-99'/>
    <class-decl name='perf_event' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-100'/>
    <class-decl name='perf_event_context' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-101'/>
    <class-decl name='pipe_inode_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-102'/>
    <class-decl name='poll_table_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-103'/>
    <class-decl name='pollfd' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-104'/>
    <class-decl name='posix_acl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-105'/>
    <class-decl name='proc_ns_operations' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-106'/>
    <class-decl name='rcu_node' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-107'/>
    <class-decl name='reclaim_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-108'/>
    <class-decl name='regulator' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-109'/>
    <class-decl name='request_queue' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-110'/>
    <class-decl name='robust_list_head' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-111'/>
    <class-decl name='rt_mutex_waiter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-112'/>
    <class-decl name='rt_rq' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-113'/>
    <class-decl name='sched_class' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-114'/>
    <class-decl name='sdio_func' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-115'/>
    <class-decl name='sdio_func_tuple' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-116'/>
    <class-decl name='seccomp_filter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-117'/>
    <class-decl name='seq_file' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-118'/>
    <class-decl name='sock' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-119'/>
    <class-decl name='subsys_private' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    <class-decl name='swap_info_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-121'/>
    <class-decl name='task_group' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-122'/>
    <class-decl name='taskstats' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-123'/>
    <class-decl name='trace_eval_map' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-124'/>
    <class-decl name='trace_event_call' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-125'/>
    <class-decl name='tty_audit_buf' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-126'/>
    <class-decl name='tty_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-127'/>
    <class-decl name='ucounts' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-128'/>
    <class-decl name='uprobe' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
    <class-decl name='user_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-130'/>
    <class-decl name='uts_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-131'/>
    <class-decl name='vfsmount' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-132'/>
    <class-decl name='wake_irq' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-133'/>
    <class-decl name='workqueue_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-134'/>
    <class-decl name='writeback_control' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-135'/>
    <class-decl name='xattr_handler' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-136'/>
    <class-decl name='xol_area' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-137'/>
    <array-type-def dimensions='1' type-id='type-id-138' size-in-bits='192' id='type-id-139'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-140' size-in-bits='256' id='type-id-141'>
      <subrange length='2' type-id='type-id-1' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-142' size-in-bits='256' id='type-id-143'>
      <subrange length='4' type-id='type-id-1' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-144' size-in-bits='512' id='type-id-145'>
      <subrange length='4' type-id='type-id-1' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-146' size-in-bits='4096' id='type-id-147'>
      <subrange length='8' type-id='type-id-1' id='type-id-40'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-148' size-in-bits='192' id='type-id-149'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-150'/>
    <array-type-def dimensions='1' type-id='type-id-150' size-in-bits='128' id='type-id-151'>
      <subrange length='4' type-id='type-id-1' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-152' size-in-bits='16384' id='type-id-153'>
      <subrange length='64' type-id='type-id-1' id='type-id-154'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-155' size-in-bits='infinite' id='type-id-156'>
      <subrange length='infinite' type-id='type-id-1' id='type-id-157'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-158' size-in-bits='384' id='type-id-159'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-160' size-in-bits='infinite' id='type-id-161'>
      <subrange length='infinite' type-id='type-id-1' id='type-id-157'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-162' id='type-id-163'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-164'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-165'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-166'/>
    <array-type-def dimensions='1' type-id='type-id-167' size-in-bits='1728' id='type-id-168'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-169' size-in-bits='2016' id='type-id-170'>
      <subrange length='7' type-id='type-id-1' id='type-id-171'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-172' size-in-bits='128' id='type-id-173'>
      <subrange length='2' type-id='type-id-1' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-174' size-in-bits='2688' id='type-id-175'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-176' size-in-bits='1024' id='type-id-177'>
      <subrange length='16' type-id='type-id-1' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-178' size-in-bits='128' id='type-id-179'>
      <subrange length='2' type-id='type-id-1' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-180' size-in-bits='256' id='type-id-181'>
      <subrange length='4' type-id='type-id-1' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-182' size-in-bits='1344' id='type-id-183'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-184' size-in-bits='384' id='type-id-185'>
      <subrange length='2' type-id='type-id-1' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-186' size-in-bits='2048' id='type-id-187'>
      <subrange length='16' type-id='type-id-1' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-188' size-in-bits='448' id='type-id-189'>
      <subrange length='7' type-id='type-id-1' id='type-id-171'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='type-id-190'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-191'/>
    <array-type-def dimensions='1' type-id='type-id-192' size-in-bits='192' id='type-id-193'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-194' size-in-bits='2304' id='type-id-195'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <typedef-decl name='__uint128_t' type-id='type-id-196' id='type-id-14'/>
    <array-type-def dimensions='1' type-id='type-id-197' size-in-bits='512' id='type-id-198'>
      <subrange length='16' type-id='type-id-1' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-197' size-in-bits='64' id='type-id-199'>
      <subrange length='2' type-id='type-id-1' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-197' size-in-bits='128' id='type-id-200'>
      <subrange length='4' type-id='type-id-1' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-201' size-in-bits='512' id='type-id-202'>
      <subrange length='8' type-id='type-id-1' id='type-id-40'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-203' size-in-bits='24' id='type-id-204'>
      <subrange length='3' type-id='type-id-1' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-203' size-in-bits='32' id='type-id-205'>
      <subrange length='4' type-id='type-id-1' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-203' size-in-bits='64' id='type-id-206'>
      <subrange length='8' type-id='type-id-1' id='type-id-40'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-207'/>
    <type-decl name='unsigned __int128' size-in-bits='128' id='type-id-196'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-208'/>
    <array-type-def dimensions='1' type-id='type-id-208' size-in-bits='256' id='type-id-209'>
      <subrange length='32' type-id='type-id-1' id='type-id-16'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-210'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-211'/>
    <array-type-def dimensions='1' type-id='type-id-211' size-in-bits='64' id='type-id-212'>
      <subrange length='1' type-id='type-id-1' id='type-id-213'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-211' size-in-bits='128' id='type-id-214'>
      <subrange length='2' type-id='type-id-1' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-211' size-in-bits='2944' id='type-id-215'>
      <subrange length='46' type-id='type-id-1' id='type-id-216'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-211' size-in-bits='256' id='type-id-217'>
      <subrange length='4' type-id='type-id-1' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-211' size-in-bits='infinite' id='type-id-218'>
      <subrange length='infinite' type-id='type-id-1' id='type-id-157'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-219'/>
    <array-type-def dimensions='1' type-id='type-id-220' size-in-bits='128' id='type-id-221'>
      <subrange length='1' type-id='type-id-1' id='type-id-213'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-222' size-in-bits='256' id='type-id-223'>
      <subrange length='4' type-id='type-id-1' id='type-id-19'/>
    </array-type-def>
    <type-decl name='void' id='type-id-224'/>
    <array-type-def dimensions='1' type-id='type-id-225' size-in-bits='256' id='type-id-226'>
      <subrange length='4' type-id='type-id-1' id='type-id-19'/>
    </array-type-def>
    <class-decl name='sdhci_host' size-in-bits='8704' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='371' column='1' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hw_name' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='quirks' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='quirks2' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='irq' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ioaddr' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bounce_buffer' type-id='type-id-24' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bounce_addr' type-id='type-id-229' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bounce_buffer_size' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ops' type-id='type-id-230' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mmc' type-id='type-id-231' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='mmc_host_ops' type-id='type-id-232' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='dma_mask' type-id='type-id-201' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='led' type-id='type-id-233' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='led_name' type-id='type-id-34' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5024'>
        <var-decl name='flags' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='version' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5088'>
        <var-decl name='max_clk' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='timeout_clk' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5152'>
        <var-decl name='clk_mul' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='clock' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='pwr' type-id='type-id-203' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5224'>
        <var-decl name='runtime_suspended' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5232'>
        <var-decl name='bus_on' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5240'>
        <var-decl name='preset_enabled' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='pending_reset' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5256'>
        <var-decl name='irq_wake_enabled' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5264'>
        <var-decl name='v4_mode' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='mrqs_done' type-id='type-id-173' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='cmd' type-id='type-id-236' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='data_cmd' type-id='type-id-236' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='data' type-id='type-id-237' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_early' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='sg_miter' type-id='type-id-238' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='blocks' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6304'>
        <var-decl name='sg_count' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='adma_table' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='548' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='align_buffer' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='adma_table_sz' type-id='type-id-239' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='align_buffer_sz' type-id='type-id-239' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='adma_addr' type-id='type-id-229' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='align_addr' type-id='type-id-229' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='desc_sz' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='complete_wq' type-id='type-id-240' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='complete_work' type-id='type-id-241' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='timer' type-id='type-id-242' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='data_timer' type-id='type-id-242' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='caps' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7776'>
        <var-decl name='caps1' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7808'>
        <var-decl name='read_caps' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7840'>
        <var-decl name='ocr_avail_sdio' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7872'>
        <var-decl name='ocr_avail_sd' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7904'>
        <var-decl name='ocr_avail_mmc' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='ocr_mask' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7968'>
        <var-decl name='timing' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='thread_isr' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8032'>
        <var-decl name='ier' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='579' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8064'>
        <var-decl name='cqe_on' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8096'>
        <var-decl name='cqe_ier' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8128'>
        <var-decl name='cqe_err_ier' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='buf_ready_int' type-id='type-id-243' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='tuning_done' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='586' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8416'>
        <var-decl name='tuning_count' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='tuning_mode' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='589' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8480'>
        <var-decl name='tuning_err' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='tuning_delay' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8544'>
        <var-decl name='tuning_loop_count' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='sdma_boundary' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8608'>
        <var-decl name='adma_table_cnt' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='data_timeout' type-id='type-id-201' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='private' type-id='type-id-218' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='606' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dma_addr_t' type-id='type-id-201' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='148' column='1' id='type-id-229'/>
    <typedef-decl name='u64' type-id='type-id-7' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='23' column='1' id='type-id-201'/>
    <typedef-decl name='__u64' type-id='type-id-166' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/int-ll64.h' line='31' column='1' id='type-id-7'/>
    <class-decl name='sdhci_ops' size-in-bits='1280' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='609' column='1' id='type-id-244'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='set_clock' type-id='type-id-245' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='set_power' type-id='type-id-246' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='irq' type-id='type-id-247' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='enable_dma' type-id='type-id-248' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_max_clock' type-id='type-id-249' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='get_min_clock' type-id='type-id-249' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_timeout_clock' type-id='type-id-249' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_max_timeout_count' type-id='type-id-249' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='set_timeout' type-id='type-id-250' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='set_bus_width' type-id='type-id-251' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='platform_send_init_74_clocks' type-id='type-id-252' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='get_ro' type-id='type-id-249' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='636' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reset' type-id='type-id-252' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='platform_execute_tuning' type-id='type-id-253' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='set_uhs_signaling' type-id='type-id-245' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='639' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='hw_reset' type-id='type-id-254' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='adma_workaround' type-id='type-id-255' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='card_event' type-id='type-id-254' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='voltage_switch' type-id='type-id-254' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='adma_write_desc' type-id='type-id-256' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='644' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='u32' type-id='type-id-2' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='21' column='1' id='type-id-197'/>
    <typedef-decl name='__u32' type-id='type-id-210' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/int-ll64.h' line='27' column='1' id='type-id-2'/>
    <class-decl name='mmc_command' size-in-bits='512' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='26' column='1' id='type-id-257'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='arg' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resp' type-id='type-id-200' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='retries' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='error' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='busy_timeout' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sanitize_busy' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='data' type-id='type-id-237' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mrq' type-id='type-id-172' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bool' type-id='type-id-20' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='30' column='1' id='type-id-235'/>
    <class-decl name='mmc_data' size-in-bits='576' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='117' column='1' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='timeout_ns' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='timeout_clks' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blksz' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blocks' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='blk_addr' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='error' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='bytes_xfered' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='stop' type-id='type-id-236' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mrq' type-id='type-id-172' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='sg_len' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='sg_count' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sg' type-id='type-id-259' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='host_cookie' type-id='type-id-260' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='143' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mmc_request' size-in-bits='1024' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='147' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sbc' type-id='type-id-236' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cmd' type-id='type-id-236' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-237' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stop' type-id='type-id-236' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='completion' type-id='type-id-262' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cmd_completion' type-id='type-id-262' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='done' type-id='type-id-263' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='recovery_notifier' type-id='type-id-263' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='host' type-id='type-id-231' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='cap_cmd_during_tfr' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='tag' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/core.h' line='167' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='completion' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/completion.h' line='26' column='1' id='type-id-262'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='done' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/completion.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait' type-id='type-id-243' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/completion.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wait_queue_head_t' type-id='type-id-264' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/wait.h' line='38' column='1' id='type-id-243'/>
    <class-decl name='wait_queue_head' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/wait.h' line='34' column='1' id='type-id-264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/wait.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/wait.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spinlock_t' type-id='type-id-265' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/spinlock_types.h' line='73' column='1' id='type-id-234'/>
    <class-decl name='spinlock' size-in-bits='32' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/spinlock_types.h' line='61' column='1' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-266' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/spinlock_types.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/spinlock_types.h' line='62' column='1' id='type-id-266'>
      <data-member access='public'>
        <var-decl name='rlock' type-id='type-id-267' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/spinlock_types.h' line='63' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='raw_spinlock' size-in-bits='32' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/spinlock_types.h' line='20' column='1' id='type-id-267'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='raw_lock' type-id='type-id-268' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/spinlock_types.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='arch_spinlock_t' type-id='type-id-269' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='52' column='1' id='type-id-268'/>
    <class-decl name='qspinlock' size-in-bits='32' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='22' column='1' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-270' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='23' column='1' id='type-id-270'>
      <data-member access='public'>
        <var-decl name='val' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='24' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-272' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='32' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-273' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='36' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='atomic_t' type-id='type-id-274' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='173' column='1' id='type-id-271'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='171' column='1' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='counter' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='172' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='32' column='1' id='type-id-272'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locked' type-id='type-id-203' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='pending' type-id='type-id-203' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='u8' type-id='type-id-9' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='17' column='1' id='type-id-203'/>
    <typedef-decl name='__u8' type-id='type-id-208' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/int-ll64.h' line='21' column='1' id='type-id-9'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='36' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locked_pending' type-id='type-id-275' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tail' type-id='type-id-275' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='u16' type-id='type-id-276' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='19' column='1' id='type-id-275'/>
    <typedef-decl name='__u16' type-id='type-id-219' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/int-ll64.h' line='24' column='1' id='type-id-276'/>
    <class-decl name='list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='181' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-277' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-277' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='182' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mmc_host' size-in-bits='11264' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='270' column='1' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='type-id-279' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='class_dev' type-id='type-id-280' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='index' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='ops' type-id='type-id-281' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='pwrseq' type-id='type-id-282' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='f_min' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6176'>
        <var-decl name='f_max' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='f_init' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='ocr_avail' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='ocr_avail_sdio' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6304'>
        <var-decl name='ocr_avail_sd' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='ocr_avail_mmc' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='pm_notify' type-id='type-id-283' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='max_current_330' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6624'>
        <var-decl name='max_current_300' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='max_current_180' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='caps' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='caps2' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6752'>
        <var-decl name='fixed_drv_type' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='pm_caps' type-id='type-id-284' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='max_seg_size' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='max_segs' type-id='type-id-219' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6864'>
        <var-decl name='unused' type-id='type-id-219' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6880'>
        <var-decl name='max_req_size' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='max_blk_size' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6944'>
        <var-decl name='max_blk_count' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='max_busy_timeout' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7008'>
        <var-decl name='lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='ios' type-id='type-id-285' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='use_spi_crc' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='claimed' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='bus_dead' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='can_retune' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='doing_retune' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='retune_now' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='retune_paused' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='use_blk_mq' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='retune_crc_disable' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='rescan_disable' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7264'>
        <var-decl name='rescan_entered' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='need_retune' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7328'>
        <var-decl name='hold_retune' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='retune_period' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='retune_timer' type-id='type-id-242' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='trigger_card_event' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7808'>
        <var-decl name='card' type-id='type-id-286' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7872'>
        <var-decl name='wq' type-id='type-id-243' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8064'>
        <var-decl name='claimer' type-id='type-id-287' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8128'>
        <var-decl name='claim_cnt' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='default_ctx' type-id='type-id-288' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='detect' type-id='type-id-289' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8960'>
        <var-decl name='detect_change' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9024'>
        <var-decl name='slot' type-id='type-id-290' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9152'>
        <var-decl name='bus_ops' type-id='type-id-291' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9216'>
        <var-decl name='bus_refs' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9248'>
        <var-decl name='sdio_irqs' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9280'>
        <var-decl name='sdio_irq_thread' type-id='type-id-292' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='sdio_irq_work' type-id='type-id-289' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10048'>
        <var-decl name='sdio_irq_pending' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10080'>
        <var-decl name='sdio_irq_thread_abort' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='pm_flags' type-id='type-id-284' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10176'>
        <var-decl name='led' type-id='type-id-293' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10240'>
        <var-decl name='regulator_enabled' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10304'>
        <var-decl name='supply' type-id='type-id-294' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10432'>
        <var-decl name='debugfs_root' type-id='type-id-295' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10496'>
        <var-decl name='ongoing_mrq' type-id='type-id-172' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10560'>
        <var-decl name='actual_clock' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10592'>
        <var-decl name='slotno' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10624'>
        <var-decl name='dsr_req' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10656'>
        <var-decl name='dsr' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10688'>
        <var-decl name='cqe_ops' type-id='type-id-296' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10752'>
        <var-decl name='cqe_private' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='cqe_qdepth' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='458' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10848'>
        <var-decl name='cqe_enabled' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10856'>
        <var-decl name='cqe_on' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11264'>
        <var-decl name='private' type-id='type-id-218' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmc/host.h' line='462' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='device' size-in-bits='5888' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='987' column='1' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kobj' type-id='type-id-297' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='988' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parent' type-id='type-id-279' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='p' type-id='type-id-298' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='991' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='init_name' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='993' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='type' type-id='type-id-299' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bus' type-id='type-id-300' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='driver' type-id='type-id-301' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='platform_data' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='999' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='driver_data' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1001' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='mutex' type-id='type-id-302' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1006' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='links' type-id='type-id-303' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1010' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='power' type-id='type-id-304' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='pm_domain' type-id='type-id-305' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1012' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='msi_domain' type-id='type-id-306' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1015' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='pins' type-id='type-id-307' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1018' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='msi_list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1021' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='dma_ops' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='dma_mask' type-id='type-id-309' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1025' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='coherent_dma_mask' type-id='type-id-201' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1026' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='bus_dma_mask' type-id='type-id-201' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1031' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='dma_pfn_offset' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1032' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='dma_parms' type-id='type-id-310' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1034' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='dma_pools' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1036' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='dma_mem' type-id='type-id-311' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1039' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='cma_area' type-id='type-id-312' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1043' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='archdata' type-id='type-id-313' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1047' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='of_node' type-id='type-id-314' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1049' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='fwnode' type-id='type-id-315' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1050' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='devt' type-id='type-id-316' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1055' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='id' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1056' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='devres_lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1058' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='devres_head' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1059' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='class' type-id='type-id-317' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='groups' type-id='type-id-318' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1062' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='release' type-id='type-id-319' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1064' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='iommu_group' type-id='type-id-320' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1065' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='iommu_fwspec' type-id='type-id-321' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1066' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='iommu_param' type-id='type-id-322' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1067' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offline_disabled' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1069' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='offline' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1070' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='of_node_reused' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1071' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='dma_coherent' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1075' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kobject' size-in-bits='512' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='65' column='1' id='type-id-297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entry' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='parent' type-id='type-id-323' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='kset' type-id='type-id-324' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ktype' type-id='type-id-325' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='sd' type-id='type-id-326' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='kref' type-id='type-id-327' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state_initialized' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='state_in_sysfs' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='state_add_uevent_sent' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='state_remove_uevent_sent' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='uevent_suppress' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kset' size-in-bits='768' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='193' column='1' id='type-id-328'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='kobj' type-id='type-id-297' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='uevent_ops' type-id='type-id-329' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='197' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kset_uevent_ops' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='157' column='1' id='type-id-330'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filter' type-id='type-id-331' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-332' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uevent' type-id='type-id-333' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='160' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kobj_uevent_env' size-in-bits='18688' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='149' column='1' id='type-id-334'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='argv' type-id='type-id-26' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='envp' type-id='type-id-25' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='envp_idx' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='buf' type-id='type-id-30' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18656'>
        <var-decl name='buflen' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='154' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kobj_type' size-in-bits='448' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='139' column='1' id='type-id-335'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='release' type-id='type-id-336' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sysfs_ops' type-id='type-id-337' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='default_attrs' type-id='type-id-338' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='default_groups' type-id='type-id-318' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='child_ns_type' type-id='type-id-339' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='namespace' type-id='type-id-340' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_ownership' type-id='type-id-341' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sysfs_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='214' column='1' id='type-id-342'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='show' type-id='type-id-343' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='store' type-id='type-id-344' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ssize_t' type-id='type-id-345' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='60' column='1' id='type-id-346'/>
    <typedef-decl name='__kernel_ssize_t' type-id='type-id-347' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/posix_types.h' line='73' column='1' id='type-id-345'/>
    <typedef-decl name='__kernel_long_t' type-id='type-id-164' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/posix_types.h' line='15' column='1' id='type-id-347'/>
    <class-decl name='attribute' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='30' column='1' id='type-id-348'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mode' type-id='type-id-349' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='umode_t' type-id='type-id-219' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='19' column='1' id='type-id-349'/>
    <typedef-decl name='size_t' type-id='type-id-350' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='55' column='1' id='type-id-239'/>
    <typedef-decl name='__kernel_size_t' type-id='type-id-351' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/posix_types.h' line='72' column='1' id='type-id-350'/>
    <typedef-decl name='__kernel_ulong_t' type-id='type-id-211' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/posix_types.h' line='16' column='1' id='type-id-351'/>
    <class-decl name='attribute_group' size-in-bits='320' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='84' column='1' id='type-id-352'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='is_visible' type-id='type-id-353' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_bin_visible' type-id='type-id-354' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='attrs' type-id='type-id-338' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bin_attrs' type-id='type-id-355' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bin_attribute' size-in-bits='448' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='161' column='1' id='type-id-356'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attr' type-id='type-id-348' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-239' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='private' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='read' type-id='type-id-357' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write' type-id='type-id-357' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mmap' type-id='type-id-358' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file' size-in-bits='2048' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='922' column='1' id='type-id-359'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_u' type-id='type-id-360' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='926' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_path' type-id='type-id-361' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='927' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_inode' type-id='type-id-148' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_op' type-id='type-id-362' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='929' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='f_write_hint' type-id='type-id-363' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_count' type-id='type-id-17' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_flags' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='f_mode' type-id='type-id-364' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_pos_lock' type-id='type-id-302' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='f_pos' type-id='type-id-365' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='941' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='f_owner' type-id='type-id-366' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='f_cred' type-id='type-id-367' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='f_ra' type-id='type-id-368' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='f_version' type-id='type-id-201' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='f_security' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='private_data' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='951' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='f_ep_links' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='955' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='f_tfile_llink' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='956' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='f_mapping' type-id='type-id-369' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='958' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='f_wb_err' type-id='type-id-370' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='959' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='923' column='1' id='type-id-360'>
      <data-member access='public'>
        <var-decl name='fu_llist' type-id='type-id-371' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='924' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fu_rcuhead' type-id='type-id-372' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='925' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='llist_node' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/llist.h' line='58' column='1' id='type-id-371'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-373' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/llist.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='callback_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='219' column='1' id='type-id-372'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-374' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='func' type-id='type-id-375' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='221' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='path' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/path.h' line='8' column='1' id='type-id-361'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt' type-id='type-id-376' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/path.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dentry' type-id='type-id-295' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/path.h' line='10' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dentry' size-in-bits='1536' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='89' column='1' id='type-id-377'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_flags' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='d_seq' type-id='type-id-378' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_hash' type-id='type-id-379' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d_parent' type-id='type-id-295' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='d_name' type-id='type-id-380' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='d_inode' type-id='type-id-148' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='d_iname' type-id='type-id-209' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='d_lockref' type-id='type-id-381' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='d_op' type-id='type-id-382' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='d_sb' type-id='type-id-383' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='d_time' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='d_fsdata' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='' type-id='type-id-384' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='d_child' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='d_subdirs' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='d_u' type-id='type-id-385' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='seqcount_t' type-id='type-id-386' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/seqlock.h' line='53' column='1' id='type-id-378'/>
    <class-decl name='seqcount' size-in-bits='32' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/seqlock.h' line='48' column='1' id='type-id-386'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sequence' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/seqlock.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hlist_bl_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/list_bl.h' line='38' column='1' id='type-id-379'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-387' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/list_bl.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pprev' type-id='type-id-388' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/list_bl.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='qstr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='47' column='1' id='type-id-380'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-389' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-390' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='48' column='1' id='type-id-389'>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-391' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='49' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='hash_len' type-id='type-id-201' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='52' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='49' column='1' id='type-id-391'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='len' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='inode' size-in-bits='4672' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='621' column='1' id='type-id-392'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='i_mode' type-id='type-id-349' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='i_opflags' type-id='type-id-219' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='i_uid' type-id='type-id-393' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='i_gid' type-id='type-id-155' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='i_flags' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='i_acl' type-id='type-id-394' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='i_default_acl' type-id='type-id-394' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='i_op' type-id='type-id-395' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='i_sb' type-id='type-id-383' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='i_mapping' type-id='type-id-369' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='i_security' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='i_ino' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='' type-id='type-id-396' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='650' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='i_rdev' type-id='type-id-316' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_size' type-id='type-id-365' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='i_atime' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='i_mtime' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='i_ctime' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='i_lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='i_bytes' type-id='type-id-219' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1136'>
        <var-decl name='i_blkbits' type-id='type-id-203' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1144'>
        <var-decl name='i_write_hint' type-id='type-id-203' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='i_blocks' type-id='type-id-398' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='i_state' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='i_rwsem' type-id='type-id-399' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='dirtied_when' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='dirtied_time_when' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='i_hash' type-id='type-id-144' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='i_io_list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='i_wb' type-id='type-id-400' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='i_wb_frn_winner' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='i_wb_frn_avg_time' type-id='type-id-275' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2096'>
        <var-decl name='i_wb_frn_history' type-id='type-id-275' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='i_lru' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='i_sb_list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='i_wb_list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='' type-id='type-id-401' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='i_version' type-id='type-id-402' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='i_count' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='i_dio_count' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='i_writecount' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='i_readcount' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='' type-id='type-id-403' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='i_flctx' type-id='type-id-404' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='i_data' type-id='type-id-405' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='i_devices' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='' type-id='type-id-406' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='i_generation' type-id='type-id-2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='i_fsnotify_mask' type-id='type-id-2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='i_fsnotify_marks' type-id='type-id-407' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='i_crypt_info' type-id='type-id-408' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='i_private' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='726' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='kuid_t' type-id='type-id-409' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/uidgid.h' line='23' column='1' id='type-id-393'/>
    <class-decl name='__anonymous_struct__4' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-393' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/uidgid.h' line='21' column='1' id='type-id-409'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='type-id-410' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/uidgid.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uid_t' type-id='type-id-411' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='32' column='1' id='type-id-410'/>
    <typedef-decl name='__kernel_uid32_t' type-id='type-id-210' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/posix_types.h' line='49' column='1' id='type-id-411'/>
    <typedef-decl name='kgid_t' type-id='type-id-412' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/uidgid.h' line='28' column='1' id='type-id-155'/>
    <class-decl name='__anonymous_struct__5' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-155' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/uidgid.h' line='26' column='1' id='type-id-412'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='type-id-413' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/uidgid.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gid_t' type-id='type-id-414' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='33' column='1' id='type-id-413'/>
    <typedef-decl name='__kernel_gid32_t' type-id='type-id-210' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/posix_types.h' line='50' column='1' id='type-id-414'/>
    <class-decl name='inode_operations' size-in-bits='1536' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1842' column='1' id='type-id-415'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lookup' type-id='type-id-416' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get_link' type-id='type-id-417' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1844' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='permission' type-id='type-id-418' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1845' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='permission2' type-id='type-id-419' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_acl' type-id='type-id-420' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1847' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='readlink' type-id='type-id-421' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='create' type-id='type-id-422' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='link' type-id='type-id-423' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unlink' type-id='type-id-424' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1853' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='symlink' type-id='type-id-425' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1854' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mkdir' type-id='type-id-426' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rmdir' type-id='type-id-424' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='mknod' type-id='type-id-427' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='rename' type-id='type-id-428' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='setattr' type-id='type-id-429' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1860' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='setattr2' type-id='type-id-430' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1861' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='getattr' type-id='type-id-431' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1862' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='listxattr' type-id='type-id-432' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='fiemap' type-id='type-id-433' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='update_time' type-id='type-id-434' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1866' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='atomic_open' type-id='type-id-435' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tmpfile' type-id='type-id-426' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='set_acl' type-id='type-id-436' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1871' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='delayed_call' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/delayed_call.h' line='10' column='1' id='type-id-437'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fn' type-id='type-id-438' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/delayed_call.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/delayed_call.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dev_t' type-id='type-id-439' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='16' column='1' id='type-id-316'/>
    <typedef-decl name='__kernel_dev_t' type-id='type-id-197' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='13' column='1' id='type-id-439'/>
    <class-decl name='iattr' size-in-bits='640' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='222' column='1' id='type-id-440'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ia_valid' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ia_mode' type-id='type-id-349' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ia_uid' type-id='type-id-393' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ia_gid' type-id='type-id-155' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ia_size' type-id='type-id-365' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ia_atime' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ia_mtime' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ia_ctime' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ia_file' type-id='type-id-441' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='237' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='loff_t' type-id='type-id-442' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='46' column='1' id='type-id-365'/>
    <typedef-decl name='__kernel_loff_t' type-id='type-id-165' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/posix_types.h' line='88' column='1' id='type-id-442'/>
    <class-decl name='timespec64' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/time64.h' line='12' column='1' id='type-id-397'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-443' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/time64.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-164' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/time64.h' line='14' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time64_t' type-id='type-id-444' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/time64.h' line='7' column='1' id='type-id-443'/>
    <typedef-decl name='__s64' type-id='type-id-165' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/int-ll64.h' line='30' column='1' id='type-id-444'/>
    <class-decl name='kstat' size-in-bits='1088' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='24' column='1' id='type-id-445'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='result_mask' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mode' type-id='type-id-349' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nlink' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blksize' type-id='type-id-446' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='attributes' type-id='type-id-201' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='attributes_mask' type-id='type-id-201' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ino' type-id='type-id-201' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev' type-id='type-id-316' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='rdev' type-id='type-id-316' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='uid' type-id='type-id-393' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='gid' type-id='type-id-155' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='size' type-id='type-id-365' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='atime' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mtime' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctime' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='btime' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='blocks' type-id='type-id-201' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint32_t' type-id='type-id-197' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='109' column='1' id='type-id-446'/>
    <class-decl name='fiemap_extent_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1725' column='1' id='type-id-447'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fi_flags' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fi_extents_mapped' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fi_extents_max' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fi_extents_start' type-id='type-id-448' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1729' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fiemap_extent' size-in-bits='448' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='17' column='1' id='type-id-449'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fe_logical' type-id='type-id-7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fe_physical' type-id='type-id-7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fe_length' type-id='type-id-7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fe_reserved64' type-id='type-id-8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fe_flags' type-id='type-id-2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='fe_reserved' type-id='type-id-5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='super_block' size-in-bits='11264' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1406' column='1' id='type-id-450'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='s_dev' type-id='type-id-316' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='s_blocksize_bits' type-id='type-id-208' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='s_blocksize' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='s_maxbytes' type-id='type-id-365' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='s_type' type-id='type-id-451' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='s_op' type-id='type-id-452' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dq_op' type-id='type-id-453' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='s_qcop' type-id='type-id-454' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='s_export_op' type-id='type-id-455' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_flags' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='s_iflags' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='s_magic' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='s_root' type-id='type-id-295' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='s_umount' type-id='type-id-399' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='s_count' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='s_active' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='s_security' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='s_xattr' type-id='type-id-456' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='s_cop' type-id='type-id-457' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='s_roots' type-id='type-id-458' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='s_mounts' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='s_bdev' type-id='type-id-459' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='s_bdi' type-id='type-id-460' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='s_mtd' type-id='type-id-461' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='s_instances' type-id='type-id-144' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='s_quota_types' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='s_dquot' type-id='type-id-462' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='s_writers' type-id='type-id-463' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7488'>
        <var-decl name='s_fs_info' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7552'>
        <var-decl name='s_time_gran' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7584'>
        <var-decl name='s_fsnotify_mask' type-id='type-id-2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7616'>
        <var-decl name='s_fsnotify_marks' type-id='type-id-407' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='s_id' type-id='type-id-34' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='s_uuid' type-id='type-id-464' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8064'>
        <var-decl name='s_max_links' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8096'>
        <var-decl name='s_mode' type-id='type-id-364' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8128'>
        <var-decl name='s_vfs_rename_mutex' type-id='type-id-302' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='s_subtype' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='s_d_op' type-id='type-id-382' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='cleancache_poolid' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='s_shrink' type-id='type-id-465' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='s_remove_count' type-id='type-id-17' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9152'>
        <var-decl name='s_fsnotify_inode_refs' type-id='type-id-17' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9216'>
        <var-decl name='s_readonly_remount' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9280'>
        <var-decl name='s_dio_done_wq' type-id='type-id-240' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='s_pins' type-id='type-id-142' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='s_user_ns' type-id='type-id-466' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9472'>
        <var-decl name='s_dentry_lru' type-id='type-id-467' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='s_inode_lru' type-id='type-id-467' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9984'>
        <var-decl name='rcu' type-id='type-id-372' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='destroy_work' type-id='type-id-241' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10368'>
        <var-decl name='s_sync_lock' type-id='type-id-302' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10624'>
        <var-decl name='s_stack_depth' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10752'>
        <var-decl name='s_inode_list_lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='s_inodes' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='s_inode_wblist_lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11008'>
        <var-decl name='s_inodes_wb' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1525' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_system_type' size-in-bits='640' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2200' column='1' id='type-id-468'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fs_flags' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='init_fs_context' type-id='type-id-469' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='parameters' type-id='type-id-470' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mount' type-id='type-id-471' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='alloc_mnt_data' type-id='type-id-472' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='kill_sb' type-id='type-id-473' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='owner' type-id='type-id-474' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='next' type-id='type-id-451' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='fs_supers' type-id='type-id-142' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_lock_key' type-id='type-id-162' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_umount_key' type-id='type-id-162' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_vfs_rename_key' type-id='type-id-162' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_writers_key' type-id='type-id-163' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_lock_key' type-id='type-id-162' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_mutex_key' type-id='type-id-162' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_mutex_dir_key' type-id='type-id-162' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2226' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='module' size-in-bits='7168' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='348' column='1' id='type-id-475'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-476' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-35' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mkobj' type-id='type-id-477' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='modinfo_attrs' type-id='type-id-478' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='version' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='srcversion' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='holders_dir' type-id='type-id-323' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='syms' type-id='type-id-479' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='crcs' type-id='type-id-480' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='num_syms' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='param_lock' type-id='type-id-302' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='kp' type-id='type-id-481' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='num_kp' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='num_gpl_syms' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='gpl_syms' type-id='type-id-479' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='gpl_crcs' type-id='type-id-480' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='async_probe_requested' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='gpl_future_syms' type-id='type-id-479' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='gpl_future_crcs' type-id='type-id-480' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='num_gpl_future_syms' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='num_exentries' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='extable' type-id='type-id-482' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='init' type-id='type-id-483' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='core_layout' type-id='type-id-484' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='init_layout' type-id='type-id-484' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='arch' type-id='type-id-485' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='taints' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='num_bugs' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='bug_list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='bug_table' type-id='type-id-486' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='kallsyms' type-id='type-id-487' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='core_kallsyms' type-id='type-id-488' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='sect_attrs' type-id='type-id-489' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='notes_attrs' type-id='type-id-490' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='args' type-id='type-id-24' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='percpu' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='percpu_size' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5536'>
        <var-decl name='num_tracepoints' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='tracepoints_ptrs' type-id='type-id-491' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='num_srcu_structs' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='srcu_struct_ptrs' type-id='type-id-492' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='num_bpf_raw_events' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='bpf_raw_events' type-id='type-id-493' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='num_trace_bprintk_fmt' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='trace_bprintk_fmt_start' type-id='type-id-494' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='trace_events' type-id='type-id-495' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='num_trace_events' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='trace_evals' type-id='type-id-496' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='num_trace_evals' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='num_ftrace_callsites' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='ftrace_callsites' type-id='type-id-497' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='source_list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='target_list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='exit' type-id='type-id-498' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='refcnt' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='498' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='module_state' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='296' column='1' id='type-id-476'>
      <underlying-type type-id='type-id-207'/>
      <enumerator name='MODULE_STATE_LIVE' value='0'/>
      <enumerator name='MODULE_STATE_COMING' value='1'/>
      <enumerator name='MODULE_STATE_GOING' value='2'/>
      <enumerator name='MODULE_STATE_UNFORMED' value='3'/>
    </enum-decl>
    <class-decl name='module_kobject' size-in-bits='768' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='45' column='1' id='type-id-477'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kobj' type-id='type-id-297' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mod' type-id='type-id-474' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='drivers_dir' type-id='type-id-323' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mp' type-id='type-id-499' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='kobj_completion' type-id='type-id-500' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='module_attribute' size-in-bits='448' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='53' column='1' id='type-id-501'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attr' type-id='type-id-348' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='show' type-id='type-id-502' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='store' type-id='type-id-503' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='setup' type-id='type-id-504' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='test' type-id='type-id-505' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='free' type-id='type-id-506' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernel_symbol' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/export.h' line='61' column='1' id='type-id-507'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value_offset' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/export.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name_offset' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/export.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='s32' type-id='type-id-508' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='20' column='1' id='type-id-260'/>
    <typedef-decl name='__s32' type-id='type-id-150' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/int-ll64.h' line='26' column='1' id='type-id-508'/>
    <class-decl name='mutex' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mutex.h' line='53' column='1' id='type-id-302'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='owner' type-id='type-id-17' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mutex.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait_lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mutex.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='osq' type-id='type-id-509' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mutex.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='wait_list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mutex.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='atomic_long_t' type-id='type-id-402' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/atomic-long.h' line='12' column='1' id='type-id-17'/>
    <typedef-decl name='atomic64_t' type-id='type-id-510' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='178' column='1' id='type-id-402'/>
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-402' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='176' column='1' id='type-id-510'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='counter' type-id='type-id-511' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='177' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='s64' type-id='type-id-444' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='22' column='1' id='type-id-511'/>
    <class-decl name='optimistic_spin_queue' size-in-bits='32' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/osq_lock.h' line='15' column='1' id='type-id-509'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tail' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/osq_lock.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernel_param' size-in-bits='320' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='69' column='1' id='type-id-512'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mod' type-id='type-id-474' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ops' type-id='type-id-513' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='perm' type-id='type-id-514' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='level' type-id='type-id-515' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='flags' type-id='type-id-203' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-516' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernel_param_ops' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='47' column='1' id='type-id-517'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='set' type-id='type-id-518' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get' type-id='type-id-519' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='free' type-id='type-id-438' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='s8' type-id='type-id-520' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='16' column='1' id='type-id-515'/>
    <typedef-decl name='__s8' type-id='type-id-191' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/asm-generic/int-ll64.h' line='20' column='1' id='type-id-520'/>
    <union-decl name='__anonymous_union__4' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='76' column='1' id='type-id-516'>
      <data-member access='public'>
        <var-decl name='arg' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='77' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='str' type-id='type-id-521' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='78' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='arr' type-id='type-id-522' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='kparam_string' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='86' column='1' id='type-id-523'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='maxlen' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='string' type-id='type-id-24' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kparam_array' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='92' column='1' id='type-id-524'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='elemsize' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num' type-id='type-id-525' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ops' type-id='type-id-513' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='elem' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='exception_table_entry' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/extable.h' line='18' column='1' id='type-id-526'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='insn' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/extable.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fixup' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/extable.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='module_layout' size-in-bits='640' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='308' column='1' id='type-id-484'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='text_size' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ro_size' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ro_after_init_size' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mtn' type-id='type-id-527' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='321' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mod_tree_node' size-in-bits='448' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='303' column='1' id='type-id-527'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mod' type-id='type-id-474' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='node' type-id='type-id-528' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='305' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='latch_tree_node' size-in-bits='384' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree_latch.h' line='40' column='1' id='type-id-528'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='node' type-id='type-id-185' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree_latch.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rb_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree.h' line='24' column='1' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__rb_parent_color' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rb_right' type-id='type-id-529' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rb_left' type-id='type-id-529' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mod_arch_specific' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='19' column='1' id='type-id-485'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='core' type-id='type-id-530' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='init' type-id='type-id-530' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ftrace_trampoline' type-id='type-id-531' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mod_plt_sec' size-in-bits='96' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='13' column='1' id='type-id-530'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='plt_shndx' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='plt_num_entries' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='plt_max_entries' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='plt_entry' size-in-bits='96' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='41' column='1' id='type-id-532'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='adrp' type-id='type-id-533' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='add' type-id='type-id-533' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='br' type-id='type-id-533' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__le32' type-id='type-id-2' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/types.h' line='31' column='1' id='type-id-533'/>
    <class-decl name='bug_entry' size-in-bits='96' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='23' column='1' id='type-id-534'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bug_addr_disp' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='file_disp' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-219' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='flags' type-id='type-id-219' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mod_kallsyms' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='332' column='1' id='type-id-488'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='symtab' type-id='type-id-535' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_symtab' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='strtab' type-id='type-id-24' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='typetab' type-id='type-id-24' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Elf64_Sym' type-id='type-id-536' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='199' column='1' id='type-id-537'/>
    <class-decl name='elf64_sym' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='192' column='1' id='type-id-536'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_name' type-id='type-id-538' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='st_info' type-id='type-id-208' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='st_other' type-id='type-id-208' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='st_shndx' type-id='type-id-539' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_value' type-id='type-id-540' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_size' type-id='type-id-541' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='198' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Elf64_Word' type-id='type-id-2' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='21' column='1' id='type-id-538'/>
    <typedef-decl name='Elf64_Half' type-id='type-id-276' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='17' column='1' id='type-id-539'/>
    <typedef-decl name='Elf64_Addr' type-id='type-id-7' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='16' column='1' id='type-id-540'/>
    <typedef-decl name='Elf64_Xword' type-id='type-id-7' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='22' column='1' id='type-id-541'/>
    <typedef-decl name='tracepoint_ptr_t' type-id='type-id-542' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='39' column='1' id='type-id-543'/>
    <class-decl name='srcu_struct' size-in-bits='4800' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='64' column='1' id='type-id-544'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='node' type-id='type-id-195' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='level' type-id='type-id-193' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='srcu_cb_mutex' type-id='type-id-302' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='srcu_gp_mutex' type-id='type-id-302' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='srcu_idx' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='srcu_gp_seq' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='srcu_gp_seq_needed' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='srcu_gp_seq_needed_exp' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='srcu_last_gp_end' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='sda' type-id='type-id-545' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='srcu_barrier_seq' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='srcu_barrier_mutex' type-id='type-id-302' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='srcu_barrier_completion' type-id='type-id-262' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='srcu_barrier_cpu_cnt' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='work' type-id='type-id-289' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='84' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='srcu_node' size-in-bits='768' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='48' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srcu_have_cbs' type-id='type-id-217' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='srcu_data_have_cbs' type-id='type-id-217' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='srcu_gp_seq_needed_exp' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='srcu_parent' type-id='type-id-192' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='grplo' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='grphi' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='srcu_data' size-in-bits='2560' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='24' column='1' id='type-id-546'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='srcu_lock_count' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='srcu_unlock_count' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='srcu_cblist' type-id='type-id-547' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='srcu_gp_seq_needed' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='srcu_gp_seq_needed_exp' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='srcu_cblist_invoking' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='delay_work' type-id='type-id-242' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='work' type-id='type-id-241' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='srcu_barrier_head' type-id='type-id-372' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='mynode' type-id='type-id-192' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='grpmask' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='cpu' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='ssp' type-id='type-id-548' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/srcutree.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rcu_segcblist' size-in-bits='704' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rcu_segcblist.h' line='64' column='1' id='type-id-547'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-374' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rcu_segcblist.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tails' type-id='type-id-22' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rcu_segcblist.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='gp_seq' type-id='type-id-217' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rcu_segcblist.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='len' type-id='type-id-164' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rcu_segcblist.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='len_lazy' type-id='type-id-164' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rcu_segcblist.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timer_list' size-in-bits='320' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/timer.h' line='11' column='1' id='type-id-242'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-144' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/timer.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='expires' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/timer.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='function' type-id='type-id-549' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/timer.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/timer.h' line='19' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hlist_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='189' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-550' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pprev' type-id='type-id-551' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='190' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='work_struct' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='102' column='1' id='type-id-241'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-17' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entry' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='func' type-id='type-id-552' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='work_func_t' type-id='type-id-553' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='21' column='1' id='type-id-552'/>
    <class-decl name='delayed_work' size-in-bits='704' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='115' column='1' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='work' type-id='type-id-241' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timer' type-id='type-id-242' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='wq' type-id='type-id-240' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='cpu' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bpf_raw_event_map' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='44' column='1' id='type-id-554'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp' type-id='type-id-555' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bpf_func' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='num_args' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='writable_size' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tracepoint' size-in-bits='320' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='30' column='1' id='type-id-556'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-557' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='regfunc' type-id='type-id-483' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='unregfunc' type-id='type-id-498' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='funcs' type-id='type-id-558' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='static_key' size-in-bits='32' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/jump_label.h' line='110' column='1' id='type-id-557'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='enabled' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/jump_label.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tracepoint_func' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='24' column='1' id='type-id-559'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prio' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hlist_head' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='185' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-550' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lock_class_key' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/lockdep.h' line='462' column='1' id='type-id-162'/>
    <class-decl name='super_operations' size-in-bits='1920' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1923' column='1' id='type-id-560'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='alloc_inode' type-id='type-id-561' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1924' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='destroy_inode' type-id='type-id-562' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1925' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='free_inode' type-id='type-id-562' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1926' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dirty_inode' type-id='type-id-563' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write_inode' type-id='type-id-564' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1929' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drop_inode' type-id='type-id-565' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1930' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='evict_inode' type-id='type-id-562' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1931' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='put_super' type-id='type-id-473' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sync_fs' type-id='type-id-566' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='freeze_super' type-id='type-id-567' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='freeze_fs' type-id='type-id-567' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='thaw_super' type-id='type-id-567' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='unfreeze_fs' type-id='type-id-567' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='statfs' type-id='type-id-568' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='remount_fs' type-id='type-id-569' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='clone_mnt_data' type-id='type-id-570' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='copy_mnt_data' type-id='type-id-571' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1941' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='update_mnt_data' type-id='type-id-572' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='umount_begin' type-id='type-id-473' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='show_options' type-id='type-id-573' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='show_options2' type-id='type-id-574' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='show_devname' type-id='type-id-573' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='show_path' type-id='type-id-573' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='show_stats' type-id='type-id-573' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1949' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='quota_read' type-id='type-id-575' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1951' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='quota_write' type-id='type-id-576' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1952' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='get_dquots' type-id='type-id-577' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1953' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='bdev_try_to_free_page' type-id='type-id-578' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1955' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nr_cached_objects' type-id='type-id-579' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1956' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='free_cached_objects' type-id='type-id-579' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1958' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dquot' size-in-bits='1664' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='294' column='1' id='type-id-580'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dq_hash' type-id='type-id-144' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dq_inuse' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dq_free' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dq_dirty' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dq_lock' type-id='type-id-302' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dq_dqb_lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='dq_count' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dq_sb' type-id='type-id-383' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dq_id' type-id='type-id-581' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dq_off' type-id='type-id-365' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='dq_flags' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='dq_dqb' type-id='type-id-582' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='306' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kqid' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='68' column='1' id='type-id-581'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-583' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='type' type-id='type-id-584' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='69' column='1' id='type-id-583'>
      <data-member access='public'>
        <var-decl name='uid' type-id='type-id-393' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='gid' type-id='type-id-155' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='71' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='projid' type-id='type-id-585' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='72' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='kprojid_t' type-id='type-id-586' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/projid.h' line='24' column='1' id='type-id-585'/>
    <class-decl name='__anonymous_struct__7' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-585' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/projid.h' line='22' column='1' id='type-id-586'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='type-id-587' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/projid.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='projid_t' type-id='type-id-411' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/projid.h' line='20' column='1' id='type-id-587'/>
    <enum-decl name='quota_type' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='54' column='1' id='type-id-584'>
      <underlying-type type-id='type-id-207'/>
      <enumerator name='USRQUOTA' value='0'/>
      <enumerator name='GRPQUOTA' value='1'/>
      <enumerator name='PRJQUOTA' value='2'/>
    </enum-decl>
    <class-decl name='mem_dqblk' size-in-bits='576' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='205' column='1' id='type-id-582'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dqb_bhardlimit' type-id='type-id-588' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dqb_bsoftlimit' type-id='type-id-588' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dqb_curspace' type-id='type-id-588' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dqb_rsvspace' type-id='type-id-588' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dqb_ihardlimit' type-id='type-id-588' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dqb_isoftlimit' type-id='type-id-588' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dqb_curinodes' type-id='type-id-588' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dqb_btime' type-id='type-id-443' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dqb_itime' type-id='type-id-443' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='214' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='qsize_t' type-id='type-id-165' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='66' column='1' id='type-id-588'/>
    <class-decl name='page' size-in-bits='512' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='69' column='1' id='type-id-589'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-590' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='type-id-591' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='_refcount' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mem_cgroup' type-id='type-id-592' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='201' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__6' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='78' column='1' id='type-id-590'>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-593' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='79' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-594' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='97' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-595' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='104' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-596' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='131' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-597' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='139' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-598' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='144' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-599' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='158' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='callback_head' type-id='type-id-372' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='175' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='79' column='1' id='type-id-593'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lru' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mapping' type-id='type-id-369' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='index' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='private' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='address_space' size-in-bits='1280' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='442' column='1' id='type-id-405'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='host' type-id='type-id-148' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='i_pages' type-id='type-id-600' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gfp_mask' type-id='type-id-601' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='i_mmap_writable' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='i_mmap' type-id='type-id-602' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='i_mmap_rwsem' type-id='type-id-399' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nrpages' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nrexceptional' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='writeback_index' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='a_ops' type-id='type-id-603' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='flags' type-id='type-id-211' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='wb_err' type-id='type-id-370' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='private_lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='private_list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='private_data' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='457' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xarray' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/xarray.h' line='292' column='1' id='type-id-600'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='xa_lock' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/xarray.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='xa_flags' type-id='type-id-601' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/xarray.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='xa_head' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/xarray.h' line='296' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gfp_t' type-id='type-id-210' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='153' column='1' id='type-id-601'/>
    <class-decl name='rb_root_cached' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree.h' line='125' column='1' id='type-id-602'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rb_root' type-id='type-id-604' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rb_leftmost' type-id='type-id-529' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rb_root' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree.h' line='31' column='1' id='type-id-604'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rb_node' type-id='type-id-529' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rw_semaphore' size-in-bits='320' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rwsem.h' line='35' column='1' id='type-id-399'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-17' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rwsem.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='owner' type-id='type-id-17' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rwsem.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='osq' type-id='type-id-509' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rwsem.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='wait_lock' type-id='type-id-605' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rwsem.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wait_list' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rwsem.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='raw_spinlock_t' type-id='type-id-267' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/spinlock_types.h' line='29' column='1' id='type-id-605'/>
    <class-decl name='address_space_operations' size-in-bits='1344' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='360' column='1' id='type-id-606'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='writepage' type-id='type-id-607' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='readpage' type-id='type-id-608' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='writepages' type-id='type-id-609' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_page_dirty' type-id='type-id-610' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readpages' type-id='type-id-611' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_begin' type-id='type-id-612' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='write_end' type-id='type-id-613' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bmap' type-id='type-id-614' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='invalidatepage' type-id='type-id-615' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='releasepage' type-id='type-id-616' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='freepage' type-id='type-id-617' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='direct_IO' type-id='type-id-618' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='migratepage' type-id='type-id-619' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='isolate_page' type-id='type-id-620' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='putback_page' type-id='type-id-617' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='launder_page' type-id='type-id-610' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='is_partially_uptodate' type-id='type-id-621' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='is_dirty_writeback' type-id='type-id-622' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='error_remove_page' type-id='type-id-623' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='swap_activate' type-id='type-id-624' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='swap_deactivate' type-id='type-id-625' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='407' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sector_t' type-id='type-id-201' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='130' column='1' id='type-id-626'/>
    <class-decl name='kiocb' size-in-bits='384' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='316' column='1' id='type-id-627'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ki_filp' type-id='type-id-441' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ki_pos' type-id='type-id-365' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ki_complete' type-id='type-id-628' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='private' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ki_flags' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ki_hint' type-id='type-id-275' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='ki_ioprio' type-id='type-id-275' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ki_cookie' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='328' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='migrate_mode' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/migrate_mode.h' line='15' column='1' id='type-id-629'>
      <underlying-type type-id='type-id-207'/>
      <enumerator name='MIGRATE_ASYNC' value='0'/>
      <enumerator name='MIGRATE_SYNC_LIGHT' value='1'/>
      <enumerator name='MIGRATE_SYNC' value='2'/>
      <enumerator name='MIGRATE_SYNC_NO_COPY' value='3'/>
    </enum-decl>
    <typedef-decl name='isolate_mode_t' type-id='type-id-210' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mmzone.h' line='317' column='1' id='type-id-630'/>
    <typedef-decl name='errseq_t' type-id='type-id-197' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/errseq.h' line='8' column='1' id='type-id-370'/>
